ETK\Admin

      127[170721333]   Процедура • Отчёты уценка (заявка 74055 + 998362 ) ≡ БАЗОВЫЙ ОТЧЕТ С ВЫГРУЗКОЙ CSV ∙ 127[655295523] ←
 32505862[172752927]     Значения формальных параметров при вызове ←
 32505860[172752929]       Значение параметра при вызове процедуры/функции ≡ Использовать HOME директорий ∙ 65545[165483899] ←
   327700[172752929]         Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[172752926]           Выполнить действия ←
 39780366[172752916]             RETURN ←
      404[172753071]               Результат ⁼ 1 ←
 32505863[170721301]     Локальные переменные ←
    65545[170721742]       Локальная переменная • ы ≡ Целое ∙ 107[2] ←
      355[170721389]         Начальное значение ⁼ 0 ←
    65545[170721743]       Локальная переменная • Списано бонусов ≡ Сумма ∙ 107[12] ←
 30867495[170721304]       Группа локальных переменных • ККЛ ←
    65545[170721744]         Локальная переменная • Продано ≡ Количество ∙ 107[15] ←
    65545[170721745]         Локальная переменная • Выставлено ≡ Количество ∙ 107[15] ←
    65545[170721746]         Локальная переменная • Цена (розн.) ≡ Цена ∙ 107[16] ←
    65545[170721747]         Локальная переменная • Сумма (розн.) ≡ Сумма ∙ 107[12] ←
    65545[170721748]         Локальная переменная • Цена (факт.) ≡ Цена ∙ 107[16] ←
    65545[170721749]         Локальная переменная • Скидка ≡ Целое без знака ∙ 107[262146] ←
    65545[170721750]         Локальная переменная • Сумма (факт.) ≡ Сумма ∙ 107[12] ←
    65545[170721751]         Локальная переменная • Итого убытков ≡ Сумма ∙ 107[12] ←
    65545[170721752]         Локальная переменная • Итого по ТТ ≡ Сумма ∙ 107[12] ←
 30867495[170721305]       Группа локальных переменных • ЛТ ←
 30867495[170721306]         Группа локальных переменных • Приказы ←
    65545[170721753]           Локальная переменная • Приказы : ЦО ≡ Партнер ∙ 107[5] ←
    65545[170721754]           Локальная переменная • Приказы : Продукт (приказы) ≡ Продукт ∙ 107[7] ←
    65545[170721755]           Локальная переменная • Приказы : Строка приказа ≡ Строка (объект БД) ∙ 107[10] ←
    65545[170721756]           Локальная переменная • Приказы : Скидка ≡ Число, точность 6 знаков ∙ 107[42401800] ←
    65545[170721757]           Локальная переменная • Приказы : ТТ ≡ Партнер ∙ 107[5] ←
    65545[170721758]           Локальная переменная • Приказы : Код ≡ Наименование объекта (80) ∙ 107[262147] ←
 30867495[170721307]         Группа локальных переменных • Продажи ←
    65545[170721759]           Локальная переменная • Адрес ДД ≡ Длинная строка (1000) ∙ 107[48431111] ←
    65545[170721760]           Локальная переменная • Адрес КД ≡ Длинная строка (1000) ∙ 107[48431111] ←
    65545[170721761]           Локальная переменная • ТТ ≡ Партнер ∙ 107[5] ←
    65545[170721762]           Локальная переменная • Продукт из чека ≡ Продукт ∙ 107[7] ←
    65545[170721763]           Локальная переменная • ЛТ Продано ≡ Количество ∙ 107[15] ←
    65545[170721764]           Локальная переменная • ЛТ Выставлено ≡ Количество ∙ 107[15] ←
    65545[170721765]           Локальная переменная • ЛТ Цена (розн.) ≡ Цена ∙ 107[16] ←
    65545[170721766]           Локальная переменная • ЛТ Сумма (розн.) ≡ Сумма ∙ 107[12] ←
    65545[170721767]           Локальная переменная • ЛТ Цена (факт.) ≡ Цена ∙ 107[16] ←
    65545[170721768]           Локальная переменная • ЛТ Сумма (факт.) ≡ Сумма ∙ 107[12] ←
    65545[170721769]           Локальная переменная • ЛТ Убыток ≡ Сумма ∙ 107[12] ←
    65545[170721770]           Локальная переменная • Счётчик операций ≡ Целое без знака ∙ 107[262146] ←
    65545[170721771]         Локальная переменная • Приказ ≡ Документ ∙ 107[8] ←
    65545[170721772]       Локальная переменная • Подразделения ≡ Список партнеров ∙ 107[1507332] ←
    65545[170721773]       Локальная переменная • tmp ≡ Целое ∙ 107[2] ←
    65545[170721774]       Локальная переменная • tmpstr ≡ Короткая строка (12 символов) ∙ 107[2293761] ←
    65545[170721775]       Локальная переменная • Список касс ≡ Список партнеров ∙ 107[1507332] ←
    65545[170721776]       Локальная переменная • Не выбирать подразделение ≡ bool ∙ 107[1507344] ←
    65545[170721777]       Локальная переменная • КЯ или Д ≡ bool ∙ 107[1507344] ←
    65545[170721778]       Локальная переменная • Строка ККЛ ≡ Строка (объект БД) ∙ 107[10] ←
    65545[170721779]       Локальная переменная • Дата1 ≡ Дата ∙ 107[3] ←
    65545[170721780]       Локальная переменная • Дата2 ≡ Дата ∙ 107[3] ←
    65545[170721781]       Локальная переменная • Дата продажи ≡ Дата+Время ∙ 107[2621441] ←
    65545[170721782]       Локальная переменная • Список приказов ценовых схем ≡ Список документов ∙ 107[1507335] ←
    65545[170721783]       Локальная переменная • Список приказов ЦС (строка) ≡ Длинная строка (250) ∙ 107[28835851] ←
    65545[170721784]       Локальная переменная • Ценовая схема ≡ Короткая строка (12 символов) ∙ 107[2293761] ←
    65545[170721785]       Локальная переменная • лп Точный приказ ≡ Документ ∙ 107[8] ←
    65545[170721786]       Локальная переменная • лп Строка приказа на ценовую схему ≡ Строка (объект БД) ∙ 107[10] ←
    65545[170721787]       Локальная переменная • Список скидок ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[170721788]       Локальная переменная • Список поставщиков ≡ Строка для примечания (4000 знаков) ∙ 107[30867457] ←
    65545[170721789]       Локальная переменная • Поставщик ≡ Партнер ∙ 107[5] ←
    65545[170721790]       Локальная переменная • Список возвратный/невозвратный поставщик ≡ Строка для примечания (4000 знаков) ∙ 107[30867457] ←
    65545[170721791]       Локальная переменная • Адрес УД(ТД) ≡ Длинная строка (1000) ∙ 107[48431111] ←
      249[170721286]       Функция • avg ≡ { ... скрипт ... } ∙ 249[39780357] ←
      262[170721295]         Наследуемые атрибуты ≡ Значения формальных параметров при вызове ∙ 1[32505862] ←
 32505861[170721298]         Формальные параметры ←
    65545[170721792]           Локальная переменная • Кол-во ≡ Целое без знака ∙ 107[262146] ←
    65545[170721793]           Локальная переменная • Число ≡ Число, точность 4 знака ∙ 107[1507341] ←
 32505863[170721303]         Локальные переменные ←
    65545[170721794]           Локальная переменная • Частное ≡ Сумма ∙ 107[12] ←
 30867463[170721301]         Выполнить действия ←
 11010080[170722257]           = ≡ Частное ∙ 65545[170721794] ←
      116[170721597]             Выражение ←
      404[170724553]               Результат ≡ Число ∙ 65545[170721793] ←
      402[170721291]               Делить ←
      404[170724554]               Результат ≡ Кол-во ∙ 65545[170721792] ←
 39780366[170721306]           RETURN ←
      404[170724555]             Результат ≡ Округление ∙ 249[30867464] ←
 32505862[170721679]               Значения формальных параметров при вызове ←
 32505860[170722057]                 Значение параметра при вызове процедуры/функции ≡ Округляемое значение ∙ 65545[30867479] ←
   327700[170722138]                   Выражение ≡ Частное ∙ 65545[170721794] ←
 32505860[170722058]                 Значение параметра при вызове процедуры/функции ≡ Вид округления ∙ 65545[30867505] ←
   327700[170722139]                   Выражение ≡ До 0.01 ∙ 1638433[1638401] ←
 32505861[170721299]     Формальные параметры ←
    65545[170721795]       Локальная переменная • автодлябатонов ≡ Целое ∙ 107[2] ←
      355[170721390]         Начальное значение ≡ NULL ∙ 117[30670850] ←
 30867483[170721283]     Локальные таблицы ←
 30867458[170721284]       Локальная таблица • Продажи ←
 11010103[170721283]         Исключать дублирующиеся записи ←
 11010090[170721284]         Структура (Поля, сортировка, генерируемые события) ←
 30867481[170721281]           Блок (при отборе данных будет генерироваться это событие) • ДД ←
 30867475[170721299]             Параметр ≡ Адрес ДД ∙ 65545[170721759] ←
 30867476[170721287]               Сортировать по возрастанию ←
 30867481[170721282]           Блок (при отборе данных будет генерироваться это событие) • КД ←
 30867475[170721300]             Параметр ≡ Адрес КД ∙ 65545[170721760] ←
 30867476[170721288]               Сортировать по возрастанию ←
 30867481[170721283]           Блок (при отборе данных будет генерироваться это событие) • ТТ ←
 30867475[170721301]             Параметр ≡ ТТ ∙ 65545[170721761] ←
 30867476[170721289]               Сортировать по возрастанию ←
 30867475[170721302]           Параметр ≡ Продукт из чека ∙ 65545[170721762] ←
 30867476[170721290]             Сортировать по возрастанию ←
 30867475[170721303]           Параметр ≡ ЛТ Продано ∙ 65545[170721763] ←
 30867475[170721304]           Параметр ≡ ЛТ Выставлено ∙ 65545[170721764] ←
 30867475[170721305]           Параметр ≡ ЛТ Цена (розн.) ∙ 65545[170721765] ←
 30867475[170721306]           Параметр ≡ ЛТ Сумма (розн.) ∙ 65545[170721766] ←
 30867475[170721307]           Параметр ≡ ЛТ Цена (факт.) ∙ 65545[170721767] ←
 30867475[170721308]           Параметр ≡ ЛТ Сумма (факт.) ∙ 65545[170721768] ←
 30867475[170721309]           Параметр ≡ Списано бонусов ∙ 65545[170721743] ←
 30867475[170721310]           Параметр ≡ ЛТ Убыток ∙ 65545[170721769] ←
 30867475[170721311]           Параметр ≡ Счётчик операций ∙ 65545[170721770] ←
 30867458[170721285]       Локальная таблица • Приказы ←
 11010103[170721284]         Исключать дублирующиеся записи ←
 11010090[170721285]         Структура (Поля, сортировка, генерируемые события) ←
 30867475[170721312]           Параметр ≡ Приказы : ЦО ∙ 65545[170721753] ←
 30867476[170721291]             Сортировать по возрастанию ←
 30867475[170721313]           Параметр ≡ Приказы : Продукт (приказы) ∙ 65545[170721754] ←
 30867476[170721292]             Сортировать по возрастанию ←
 30867475[170721314]           Параметр ≡ Приказы : Строка приказа ∙ 65545[170721755] ←
 30867476[170721293]             Сортировать по возрастанию ←
 30867475[170721315]           Параметр ≡ Приказы : Скидка ∙ 65545[170721756] ←
 30867476[170721294]             Сортировать по возрастанию ←
 30867475[170721316]           Параметр ≡ Приказы : ТТ ∙ 65545[170721757] ←
 30867476[170721295]             Сортировать по возрастанию ←
 30867475[170721317]           Параметр ≡ Приказы : Код ∙ 65545[170721758] ←
 30867476[170721296]             Сортировать по возрастанию ←
 12124203[170721285]     Запросы ←
 12124205[170721317]       Запрос • Партии с остатком ←
 12124213[170721354]         Параметры ←
  1507335[170721473]           Параметр • Партия ∙ 12124204[170721357] ←
  1507494[170721756]             Уточняющий параметр ≡ Аналитика (3) ∙ 393[5] ←
  1507335[170721474]           Параметр • Остаток ≡ Остаток по партии ∙ 1507449[170721357] ←
  1507335[170721475]           Параметр • Дата партии ≡ Партия ∙ 12124204[170721359] ←
  1507494[170721757]             Уточняющий параметр ≡ Дата ∙ 305[9] ←
  1507447[170721308]         Выражения ←
  1507449[170721357]           Выражение • Остаток по партии ≡ Число ∙ 107[4] ←
  1507376[170721511]             Выражение ←
  1507455[170721563]               Результат ∙ 12124204[170721357] ←
  1507494[170721758]                 Уточняющий параметр ≡ Сумма дебет ∙ 393[9] ←
      406[170721320]               Вычесть ←
  1507455[170721565]               Результат ∙ 12124204[170721357] ←
  1507494[170721759]                 Уточняющий параметр ≡ Сумма кредит ∙ 393[10] ←
 12124200[170721341]         From         (Таблицы) ←
 12124204[170721357]           Таблица ≡ Сальдо ∙ 108[10] ←
 12124204[170721359]           Таблица • Партия ≡ Продукт ∙ 108[3] ←
 12124215[170721361]         Where      (Ограничения на отбор данных) ←
  1507376[170721513]           Выражение ←
  1507455[170721566]             Результат ∙ 12124204[170721357] ←
  1507494[170721760]               Уточняющий параметр ≡ ЦФО ∙ 393[1] ←
  1638473[170721506]             Равно ←
  1507452[170721400]             Константа ≡ Центр финанс. ответственности для ТОВАРНЫХ ПЛАНОВ ∙ 117[45613057] ←
      413[170721456]           И ←
  1507376[170721514]           Выражение ←
  1507455[170721567]             Результат ∙ 12124204[170721357] ←
  1507494[170721761]               Уточняющий параметр ≡ Счет ∙ 393[2] ←
  1638473[170721507]             Равно ←
  1507452[170721423]             Константа ≡ Количество по партиям (товарный запас) ∙ 131[14417935] ←
      413[170721457]           И ←
  1507376[170721515]           Выражение ←
  1507455[170721568]             Результат ∙ 12124204[170721357] ←
  1507494[170721762]               Уточняющий параметр ≡ Аналитика (1) ∙ 393[3] ←
  1638473[170721508]             Равно ←
  1507452[170721424]             Константа ≡ Первый ТЗ/ПЦ для ЦО/ТТ/Узла (действ. магазины) ∙ 249[655294491] ←
 32505862[170721680]               Значения формальных параметров при вызове ←
 32505860[170722059]                 Значение параметра при вызове процедуры/функции ≡ ~ТТ ∙ 65545[58392606] ←
   327700[170722140]                   Выражение ≡ ТТ ∙ 65545[170721761] ←
      413[170721458]           И ←
  1507376[170721516]           Выражение ←
  1507455[170721569]             Результат ∙ 12124204[170721357] ←
  1507494[170721763]               Уточняющий параметр ≡ Валюта ∙ 393[8] ←
  1638473[170721509]             Равно ←
  1507452[170721425]             Константа ≡ Штука ∙ 131108[28049409] ←
      413[170721459]           И ←
  1507376[170721517]           Выражение ←
  1507455[170721570]             Результат ∙ 12124204[170721357] ←
  1507494[170721764]               Уточняющий параметр ≡ Аналитика (2) ∙ 393[4] ←
  1638473[170721510]             Равно ←
  1507452[170721426]             Константа ≡ Продукт из чека ∙ 65545[170721762] ←
      413[170721460]           И ←
  1507376[170721518]           Выражение ←
  1507455[170721571]             Результат ∙ 12124204[170721357] ←
  1507494[170721765]               Уточняющий параметр ≡ Аналитика (3) ∙ 393[5] ←
  1638473[170721511]             Равно ←
  1507455[170721572]             Результат ≡ Партия ∙ 12124204[170721359] ←
  1507494[170721766]               Уточняющий параметр ≡ Продукт ∙ 305[1] ←
 12124222[170721295]         Order By   (Сортировка) ←
  1507532[170721292]           Сортировать по убыванию ≡ Дата партии ∙ 1507335[170721475] ←
 12124205[170721318]       Запрос • Партии с остатком (VPSTOCK) ←
  1507447[170721309]         Выражения ←
  1507449[170721358]           Выражение • Остаток по партии ≡ Число ∙ 107[4] ←
  1507455[170721573]             Результат ∙ 12124204[170721360] ←
  1507494[170721767]               Уточняющий параметр ≡ Остаток ∙ 1507443[48431233] ←
 12124213[170721355]         Параметры ←
  1507335[170721476]           Параметр • Партия ∙ 12124204[170721360] ←
  1507494[170721768]             Уточняющий параметр ≡ Партия ∙ 1507443[48431234] ←
  1507335[170721477]           Параметр • Остаток ≡ Остаток по партии ∙ 1507449[170721358] ←
  1507335[170721478]           Параметр • Дата партии ≡ Партия ∙ 12124204[170721361] ←
  1507494[170721769]             Уточняющий параметр ≡ Дата ∙ 305[9] ←
 12124200[170721342]         From         (Таблицы) ←
 12124204[170721360]           Таблица ≡ ОСТАТКИ ПАРТИОННЫХ ТОВАРОВ ∙ 1507696[48431116] ←
 12124204[170721361]           Таблица • Партия ≡ Продукт ∙ 108[3] ←
 12124215[170721362]         Where      (Ограничения на отбор данных) ←
  1507376[170721519]           Выражение ←
  1507455[170721574]             Результат ∙ 12124204[170721360] ←
  1507494[170721770]               Уточняющий параметр ≡ Подразделение ∙ 1507443[48431231] ←
  1638473[170721512]             Равно ←
  1507452[170721427]             Константа ≡ Первый ТЗ/ПЦ для ЦО/ТТ/Узла (действ. магазины) ∙ 249[655294491] ←
 32505862[170721681]               Значения формальных параметров при вызове ←
 32505860[170722060]                 Значение параметра при вызове процедуры/функции ≡ ~ТТ ∙ 65545[58392606] ←
   327700[170722141]                   Выражение ≡ ТТ ∙ 65545[170721761] ←
  1507376[170721520]           Выражение ←
  1507455[170721575]             Результат ∙ 12124204[170721360] ←
  1507494[170721771]               Уточняющий параметр ≡ Базовый продукт ∙ 1507443[48431232] ←
  1638473[170721513]             Равно ←
  1507452[170721428]             Константа ≡ Продукт из чека ∙ 65545[170721762] ←
  1507376[170721521]           Выражение ←
  1507455[170721576]             Результат ∙ 12124204[170721360] ←
  1507494[170721772]               Уточняющий параметр ≡ Партия ∙ 1507443[48431234] ←
  1638473[170721514]             Равно ←
  1507455[170721577]             Результат ≡ Партия ∙ 12124204[170721361] ←
  1507494[170721773]               Уточняющий параметр ≡ Продукт ∙ 305[1] ←
 12124222[170721296]         Order By   (Сортировка) ←
  1507532[170721293]           Сортировать по убыванию ≡ Дата партии ∙ 1507335[170721478] ←
  1507531[170721283]     Подстановки виртуальных блоков ←
 11010093[170721335]       Комментарий • Добавлен столбец Возврат 10.09.2018 Зарубина (241001) ←
 30867469[170721423]       БЛОК ≡ Инициализация ∙ 30867469[655295590] ←
 30867470[170721486]         IF ←
  1638463[170721532]           Условие ←
      404[170724556]             Результат ≡ Текущий узел является консолидированной базой ∙ 249[1507768] ←
 30867472[170721485]           THEN • общая база, ставим флаги на показ списка КЯ ←
  1507728[170721361]             Начало многострочного комментария ←
 11010088[170721553]             ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
 11010095[170721375]               Выражение ←
      404[170724557]                 Результат ⁼ Вы не в базе магазина. Сбор данных невозможен. Выходим. ←
 11010101[170721283]             EXIT ←
  1507729[170721361]             Конец многострочного комментария ←
 11010093[170721336]             Комментарий • флаг неблокировки поля выбора магазина ←
 11010080[170722258]             = ≡ Не выбирать подразделение ∙ 65545[170721776] ←
      404[170724558]               Результат ≡ false ∙ 117[30867469] ←
 11010093[170721337]             Комментарий • флаг выбора только КЯ ←
 11010080[170722259]             = ≡ КЯ или Д ∙ 65545[170721777] ←
      404[170724559]               Результат ≡ false ∙ 117[30867469] ←
 30867473[170721366]           ELSE ←
 11010080[170722260]             = ≡ Приказы : ЦО ∙ 65545[170721753] ←
      404[170724560]               Результат ≡ Первое ЦО для данного Узла сети ∙ 249[655294496] ←
 30867470[170721487]             IF ←
  1638463[170721533]               Условие ←
      404[170724561]                 Результат ≡ Приказы : ЦО ∙ 65545[170721753] ←
      411[170721543]                   Уточняющий параметр ≡ Ранг партнера ∙ 283[28835905] ←
  1638473[170721515]                 Равно ←
      404[170724562]                 Результат ≡ Дискаунтер ∙ 164364327[164364290] ←
 30867472[170721486]               THEN ←
 11010080[170722261]                 = ≡ Не выбирать подразделение ∙ 65545[170721776] ←
      404[170724563]                   Результат ≡ false ∙ 117[30867469] ←
 11010080[170722262]                 = ≡ КЯ или Д ∙ 65545[170721777] ←
      404[170724564]                   Результат ≡ true ∙ 117[30867468] ←
 30867473[170721367]               ELSE ←
 11010080[170722263]                 = ≡ Не выбирать подразделение ∙ 65545[170721776] ←
      404[170724565]                   Результат ≡ true ∙ 117[30867468] ←
 11010080[170722264]                 = ≡ Подразделения ∙ 65545[170721772] ←
      404[170724566]                   Результат ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[170721682]                     Значения формальных параметров при вызове ←
 32505860[170722061]                       Значение параметра при вызове процедуры/функции ≡ ~Узел сети ∙ 65545[655298657] ←
   327700[170722142]                         Выражение ≡ Текущий узел распределенной сети ∙ 381[1507340] ←
 30867470[170721491]                 IF ←
  1638463[170721534]                   Условие ←
      404[170724567]                     Результат ≡ Текущий узел - Ромашка ∙ 249[165347345] ←
 30867472[170721490]                   THEN ←
 11010080[170722265]                     = ≡ Подразделения ∙ 65545[170721772] ←
      404[170724568]                       Результат ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[170721683]                         Значения формальных параметров при вызове ←
 32505860[170722062]                           Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
   327700[170722143]                             Выражение ≡ ЦО для текущего узла (для дискаунтера и экспресса по ip адресу) ∙ 249[164298878] ←
 11010080[170722266]         = ≡ Имя ∙ 65545[655299190] ←
      404[170724569]           Результат ⁼ 'ucenka-' ←
      404[170724570]           Результат ≡ Случайное число (7 знаков) ∙ 117[1507630] ←
 30867469[170721424]       БЛОК ≡ Выбор данных ∙ 30867469[655295597] ←
 11010093[170721338]         Комментарий • Форма ввода ←
 30867470[170721492]         IF ←
  1638463[170721535]           Условие ←
      116[170721598]             Выражение ←
      404[170724571]               Результат ≡ Автоматически ∙ 65545[58393339] ←
      412[170721343]               ИЛИ ←
      404[170724572]               Результат ≡ автодлябатонов ∙ 65545[170721795] ←
 30867472[170721491]           THEN ←
 11010080[170722267]             = ≡ Дата начальная ∙ 381[131078] ←
      404[170724573]               Результат ≡ Вчера, начало дня ∙ 249[656080945] ←
 11010080[170722268]             = ≡ Дата конечная ∙ 381[131079] ←
      404[170724574]               Результат ≡ Вчера, конец дня ∙ 249[164823112] ←
 30867470[170721493]             IF ←
  1638463[170721536]               Условие ←
      404[170724575]                 Результат ≡ автодлябатонов ∙ 65545[170721795] ←
 30867472[170721492]               THEN ←
  1507360[170721357]                 Отбор данных (по запросу) • выберем все действующие ТТ батоны ←
 12124213[170721356]                   Параметры ←
  1507335[170721479]                     Параметр • селект.партнер.ид ∙ 12124204[170721362] ←
  1507494[170721774]                       Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1507673[170721292]                   Ключи оптимизации ←
  1507675[170721294]                     Использовать индекс ∙ 12124204[170721362] ←
  1507676[170721294]                       Уточняющий параметр ≡ Класс -- Тип ∙ 1507445[60424329] ←
 12124200[170721343]                   From         (Таблицы) ←
 12124204[170721362]                     Таблица ≡ Партнер ∙ 108[4] ←
 12124215[170721363]                   Where      (Ограничения на отбор данных) ←
  1507376[170721522]                     Выражение ←
  1507455[170721578]                       Результат ∙ 12124204[170721362] ←
  1507494[170721775]                         Уточняющий параметр ≡ Класс ∙ 283[3] ←
  1638473[170721516]                       Равно ←
  1507488[170721327]                       Константа (Ограничение по классу, типу, плану счетов) ≡ ПОДРАЗДЕЛЕНИЕ ∙ 539[2] ←
      413[170721461]                     И ←
  1507376[170721523]                     Выражение ←
  1507455[170721579]                       Результат ∙ 12124204[170721362] ←
  1507494[170721776]                         Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[170721517]                       Равно ←
  1507488[170721328]                       Константа (Ограничение по классу, типу, плану счетов) ≡ Торговая точка (Магазин) ∙ 284[40566786] ←
      413[170721462]                     И ←
  1507376[170721524]                     Выражение ←
  1507455[170721580]                       Результат ∙ 12124204[170721362] ←
  1507494[170721777]                         Уточняющий параметр ≡ Не рассчитывать скорость продаж ∙ 283[43122692] ←
  1638473[170721518]                       Равно ←
  1507452[170721429]                       Константа ≡ Да ∙ 131203075[131203074] ←
      413[170721463]                     И ←
  1507376[170721525]                     Выражение ←
  1507455[170721581]                       Результат ∙ 12124204[170721362] ←
  1507494[170721778]                         Уточняющий параметр ≡ Узел распределенной сети ∙ 283[42401811] ←
  1638473[170721519]                       Равно ←
  1507452[170721430]                       Константа ⁼ 5:0:0:36910976 ←
      413[170721464]                     И ←
  1507376[170721526]                     Выражение ←
  1507455[170721582]                       Результат ∙ 12124204[170721362] ←
  1507494[170721779]                         Уточняющий параметр ≡ Дата первого заказа ∙ 283[2818053] ←
  1638475[170721303]                       Меньше или равно ←
  1507452[170721431]                       Константа ≡ Текущие дата-время ∙ 249[42467332] ←
 30867466[170721360]                   Выполнить после получения записи ←
 11010080[170722269]                     = ≡ Подразделения ∙ 65545[170721772] ←
      404[170724576]                       Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[170721282]                         Список элементов ←
   327700[170722144]                           Выражение ≡ селект.партнер.ид ∙ 1507335[170721479] ←
   327700[170722145]                           Выражение ≡ Подразделения ∙ 65545[170721772] ←
 30867473[170721368]           ELSE ←
 12124190[170721285]             Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[170721287]               Список полей формы ←
      598[170721303]                 Поле (колонка) для ввода данных ≡ Дата начальная ∙ 381[131078] ←
      598[170721304]                 Поле (колонка) для ввода данных ≡ Дата конечная ∙ 381[131079] ←
      598[170721305]                 Поле (колонка) для ввода данных • Подразделения ≡ Подразделения ∙ 65545[170721772] ←
 29163536[170721290]                   Отображаемый текст для объектов БД ≡ Родитель ∙ 283[2] ←
      411[170721544]                     Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
  2621482[170721282]                   Только для просмотра (недопустимо для изменения), если: ≡ Не выбирать подразделение ∙ 65545[170721776] ←
  2621481[170721283]                   Доступно (видимо), если: ≡ Текущий узел не Ромашка ∙ 249[165347346] ←
      209[170721289]                   Выбор из списка ≡ ЦО (КЯ xor Д) ∙ 371[165019659] ←
   262165[170721284]                     Выбор нескольких объектов из списка ≡ Да ∙ 534[40566785] ←
 32505862[170721684]                     Значения формальных параметров при вызове ←
 32505860[170722063]                       Значение параметра при вызове процедуры/функции ≡ КЯ или Д? (false-true соответственно) ∙ 65545[165020575] ←
   327700[170722146]                         Выражение ≡ КЯ или Д ∙ 65545[170721777] ←
      598[170721307]                 Поле (колонка) для ввода данных • Подразделения ≡ Подразделения ∙ 65545[170721772] ←
 29163536[170721291]                   Отображаемый текст для объектов БД ≡ Родитель ∙ 283[2] ←
      411[170721545]                     Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
  2621481[170721284]                   Доступно (видимо), если: ≡ Текущий узел - Ромашка ∙ 249[165347345] ←
      209[170721290]                   Выбор из списка ≡ Торговые точки (Магазины) + РЦ + ПЦ ∙ 371[144310390] ←
  1638486[170721282]                     Ограничение на отбор данных ←
 41746472[170721283]                       Where ≡ Узел распределенной сети ∙ 283[42401811] ←
 41746478[170721283]                         Равно ⁼ 5:0:0:85778448 ←
 30867470[170721494]         IF ←
  1638463[170721537]           Условие ←
      404[170724577]             Результат ≡ Подразделения ∙ 65545[170721772] ←
 30867472[170721493]           THEN ←
 11010080[170722270]             = ≡ Дата конечная ∙ 381[131079] ←
      404[170724578]               Результат ≡ Дата, конец дня ∙ 249[30867475] ←
 32505862[170721685]                 Значения формальных параметров при вызове ←
 32505860[170722064]                   Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
   327700[170722147]                     Выражение ≡ Дата конечная ∙ 381[131079] ←
 11010080[170722271]             = ≡ Дата1 ∙ 65545[170721779] ←
      404[170724579]               Результат ≡ Дата начальная ∙ 381[131078] ←
      406[170721321]               Вычесть ←
      116[170721599]               Выражение ←
      404[170724580]                 Результат ≡ Сутки ∙ 117[16843851] ←
      403[170721320]                 Умножить ←
      404[170724581]                 Результат ⁼ 100 ←
 11010080[170722272]             = ≡ Дата2 ∙ 65545[170721780] ←
      404[170724582]               Результат ≡ Дата, конец дня ∙ 249[30867475] ←
 32505862[170721686]                 Значения формальных параметров при вызове ←
 32505860[170722065]                   Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
   327700[170722148]                     Выражение ≡ Дата конечная ∙ 381[131079] ←
  1507360[170721359]             Отбор данных (по запросу) • Документ+строки ←
  1507703[170721287]               Показать текст запроса ←
 12124213[170721357]               Параметры ←
  1507335[170721480]                 Параметр • Селект строка ∙ 12124204[170721363] ←
  1507494[170721780]                   Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507335[170721481]                 Параметр • Селект строка цена розн ∙ 12124204[170721363] ←
  1507494[170721781]                   Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
  1507335[170721482]                 Параметр • Селект строка цена фактическая ∙ 12124204[170721363] ←
  1507494[170721782]                   Уточняющий параметр ≡ Цена продажная (фактическая) ∙ 359[15007748] ←
  1507335[170721483]                 Параметр • Селект строка списано бонусов ∙ 12124204[170721363] ←
  1507494[170721783]                   Уточняющий параметр ≡ Пробег ∙ 359[14483468] ←
  1507335[170721484]                 Параметр • Селект строка дата продажи ∙ 12124204[170721363] ←
  1507494[170721784]                   Уточняющий параметр ≡ Дата окончания гарантии ∙ 359[14286866] ←
  1507335[170721485]                 Параметр • Селект строка продукт ∙ 12124204[170721363] ←
  1507494[170721785]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1507335[170721486]                 Параметр • Селект строка колво ∙ 12124204[170721363] ←
  1507494[170721786]                   Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  1507335[170721487]                 Параметр • Селект документ ≡ Документ+Касса ∙ 12124205[170721319] ←
  1507494[170721787]                   Уточняющий параметр ≡ селект документ ∙ 1507335[170721490] ←
  1507335[170721488]                 Параметр • Селект документ.подразделение ≡ Документ+Касса ∙ 12124205[170721319] ←
  1507494[170721788]                   Уточняющий параметр ≡ селект документ.подразделение ∙ 1507335[170721491] ←
  1507335[170721489]                 Параметр • з.Строка.СерверSMTP ∙ 12124204[170721363] ←
  1507494[170721789]                   Уточняющий параметр ≡ Сервер SMTP ∙ 359[48431122] ←
 12124200[170721344]               From         (Таблицы) ←
 12124204[170721363]                 Таблица ≡ Строка (объект БД) ∙ 108[6] ←
 12124205[170721319]                 Запрос • Документ+Касса ←
 12124213[170721358]                   Параметры ←
  1507335[170721490]                     Параметр • селект документ ∙ 12124204[170721364] ←
  1507494[170721790]                       Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1507335[170721491]                     Параметр • селект документ.подразделение ∙ 12124204[170721364] ←
  1507494[170721791]                       Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
 12124200[170721345]                   From         (Таблицы) ←
 12124204[170721364]                     Таблица ≡ Документ ∙ 108[5] ←
 12124204[170721365]                     Таблица • Кассовые аппараты ≡ Партнер ∙ 108[4] ←
 12124215[170721364]                   Where      (Ограничения на отбор данных) ←
  1507376[170721527]                     Выражение ←
  1507455[170721583]                       Результат ∙ 12124204[170721364] ←
  1507494[170721792]                         Уточняющий параметр ≡ Класс ∙ 331[3] ←
  1638473[170721520]                       Равно ←
  1507488[170721329]                       Константа (Ограничение по классу, типу, плану счетов) ≡ КОНТРОЛЬНАЯ ЛЕНТА ∙ 541[40304641] ←
  1507376[170721528]                     Выражение ←
  1507455[170721584]                       Результат ∙ 12124204[170721364] ←
  1507494[170721793]                         Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[170721521]                       Равно ←
  1507488[170721330]                       Константа (Ограничение по классу, типу, плану счетов) ≡ Контрольная лента ∙ 332[40304641] ←
  1507376[170721529]                     Выражение ←
  1507455[170721585]                       Результат ∙ 12124204[170721364] ←
  1507494[170721794]                         Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638477[170721297]                       Больше или равно ←
  1507452[170721432]                       Константа ≡ Дата начальная ∙ 381[131078] ←
  1507376[170721530]                     Выражение ←
  1507455[170721586]                       Результат ∙ 12124204[170721364] ←
  1507494[170721795]                         Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638475[170721304]                       Меньше или равно ←
  1507452[170721433]                       Константа ≡ Дата конечная ∙ 381[131079] ←
  1507376[170721531]                     Выражение ←
  1507455[170721587]                       Результат ∙ 12124204[170721364] ←
  1507494[170721796]                         Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1638473[170721522]                       Равно ←
  1507455[170721588]                       Результат ≡ Кассовые аппараты ∙ 12124204[170721365] ←
  1507494[170721797]                         Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1507376[170721532]                     Выражение ←
  1507455[170721589]                       Результат ≡ Кассовые аппараты ∙ 12124204[170721365] ←
  1507494[170721798]                         Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[170721523]                       Равно ←
  1507452[170721434]                       Константа ≡ Подразделения ∙ 65545[170721772] ←
  1507376[170721533]                     Выражение ←
  1507455[170721590]                       Результат ≡ Кассовые аппараты ∙ 12124204[170721365] ←
  1507494[170721799]                         Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[170721524]                       Равно ←
  1507488[170721331]                       Константа (Ограничение по классу, типу, плану счетов) ≡ Кассовый аппарат (внешняя касса) ∙ 284[14745620] ←
 12124215[170721365]               Where      (Ограничения на отбор данных) ←
  1507376[170721534]                 Выражение ←
  1507455[170721591]                   Результат ∙ 12124204[170721363] ←
  1507494[170721800]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638473[170721525]                   Равно ←
  1507455[170721592]                   Результат ≡ Документ+Касса ∙ 12124205[170721319] ←
  1507494[170721801]                     Уточняющий параметр ≡ селект документ ∙ 1507335[170721490] ←
  1507376[170721535]                 Выражение ←
  1507455[170721593]                   Результат ∙ 12124204[170721363] ←
  1507494[170721802]                     Уточняющий параметр ≡ Тип ∙ 359[4] ←
  1638473[170721526]                   Равно ←
  1507488[170721332]                   Константа (Ограничение по классу, типу, плану счетов) ≡ Товарная строка чека ∙ 360[40304641] ←
  1507376[170721536]                 Выражение ←
  1507455[170721594]                   Результат ∙ 12124204[170721363] ←
  1507494[170721803]                     Уточняющий параметр ≡ Сервер SMTP ∙ 359[48431122] ←
  1638478[170721320]                   Больше ←
  1507452[170721435]                   Константа ⁼ 100 ←
  1507376[170721537]                 Выражение ←
  1507376[170721538]                   Выражение ←
  1507455[170721595]                     Результат ∙ 12124204[170721363] ←
  1507494[170721804]                       Уточняющий параметр ≡ Сервер FTP ∙ 359[48431123] ←
  1638473[170721527]                     Равно ←
  1507452[170721436]                     Константа ⁼ 'N' ←
      412[170721347]                   ИЛИ ←
  1507376[170721539]                   Выражение ←
  1507455[170721596]                     Результат ∙ 12124204[170721363] ←
  1507494[170721805]                       Уточняющий параметр ≡ Сервер FTP ∙ 359[48431123] ←
  1638473[170721528]                     Равно ←
  1507452[170721437]                     Константа ⁼ 'C' ←
 30867466[170721362]               Выполнить после получения записи ←
 11010105[170721301]                 Индикатор ←
      116[170721600]                   Выражение ←
      404[170724583]                     Результат ⁼ 'Поиск документов ККЛ ' ←
      404[170724584]                     Результат ≡ Селект документ ∙ 1507335[170721487] ←
      404[170724585]                     Результат ⁼ ' - ' ←
      404[170724586]                     Результат ≡ Селект строка ∙ 1507335[170721480] ←
 11010080[170722273]                 = ≡ ТТ ∙ 65545[170721761] ←
      404[170724587]                   Результат ≡ Селект документ.подразделение ∙ 1507335[170721488] ←
      411[170721546]                     Уточняющий параметр ≡ Родитель ∙ 283[2] ←
 11010080[170722274]                 = ≡ Приказы : ЦО ∙ 65545[170721753] ←
      404[170724588]                   Результат ≡ ТТ ∙ 65545[170721761] ←
      411[170721547]                     Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
 11010080[170722275]                 = ≡ Адрес УД(ТД) ∙ 65545[170721791] ←
      404[170724589]                   Результат ≡ Приказы : ЦО ∙ 65545[170721753] ←
      411[170721548]                     Уточняющий параметр ≡ Электронный адрес ∙ 283[14745623] ←
 11010080[170722276]                 = ≡ Адрес КД ∙ 65545[170721760] ←
      404[170724590]                   Результат ≡ Приказы : ЦО ∙ 65545[170721753] ←
      411[170721549]                     Уточняющий параметр ≡ Пластиковая карта ∙ 283[42401872] ←
      411[170721550]                       Уточняющий параметр ≡ Управляющий ∙ 283[28835886] ←
      411[170721551]                         Уточняющий параметр ≡ Электронный адрес ∙ 283[14745623] ←
 11010080[170722277]                 = ≡ Адрес ДД ∙ 65545[170721759] ←
      404[170724591]                   Результат ≡ Приказы : ЦО ∙ 65545[170721753] ←
      411[170721552]                     Уточняющий параметр ≡ Пластиковая карта ∙ 283[42401872] ←
      411[170721553]                       Уточняющий параметр ≡ Родитель ∙ 283[2] ←
      411[170721554]                         Уточняющий параметр ≡ Управляющий ∙ 283[28835886] ←
      411[170721555]                           Уточняющий параметр ≡ Электронный адрес ∙ 283[14745623] ←
 11010080[170722278]                 = ≡ Строка ККЛ ∙ 65545[170721778] ←
      404[170724592]                   Результат ≡ Селект строка ∙ 1507335[170721480] ←
 11010080[170722279]                 = ≡ Дата продажи ∙ 65545[170721781] ←
      404[170724593]                   Результат ≡ Селект строка дата продажи ∙ 1507335[170721484] ←
 11010080[170722280]                 = ≡ Продукт из чека ∙ 65545[170721762] ←
      404[170724594]                   Результат ≡ Селект строка продукт ∙ 1507335[170721485] ←
 11010080[170722281]                 = ≡ Приказы : Продукт (приказы) ∙ 65545[170721754] ←
      404[170724595]                   Результат ≡ Селект строка продукт ∙ 1507335[170721485] ←
 11010091[170721282]                 Получить из локальной таблицы • Поиск по товару ≡ Продажи ∙ 30867458[170721284] ←
 11010080[170722282]                 = ≡ Продано ∙ 65545[170721744] ←
  1638464[170721301]                   Ноль (0.0), если NULL ≡ Селект строка колво ∙ 1507335[170721486] ←
 11010080[170722283]                 = ≡ Цена (розн.) ∙ 65545[170721746] ←
  1638464[170721302]                   Ноль (0.0), если NULL ≡ Селект строка цена розн ∙ 1507335[170721481] ←
 11010080[170722284]                 = ≡ Цена (факт.) ∙ 65545[170721748] ←
  1638464[170721303]                   Ноль (0.0), если NULL ≡ Селект строка цена фактическая ∙ 1507335[170721482] ←
 11010080[170722285]                 = ≡ Сумма (факт.) ∙ 65545[170721750] ←
  1638464[170721304]                   Ноль (0.0), если NULL ≡ Строка ККЛ ∙ 65545[170721778] ←
      411[170721556]                     Уточняющий параметр ≡ Сумма фактическая (точность 6 знаков) ∙ 117[21433337] ←
 11010080[170722286]                 = ≡ Списано бонусов ∙ 65545[170721743] ←
  1638464[170721305]                   Ноль (0.0), если NULL ≡ Селект строка списано бонусов ∙ 1507335[170721483] ←
 11010088[170721560]                 ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170721384]                   Выражение ←
      404[170724596]                     Результат ≡ Приказы : Продукт (приказы) ∙ 65545[170721754] ←
      411[170721557]                       Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
 30867470[170721495]                 IF ←
  1638463[170721538]                   Условие ←
      404[170724597]                     Результат ≡ з.Строка.СерверSMTP ∙ 1507335[170721489] ←
  1638479[170721399]                     Не равно ←
      404[170724598]                     Результат ⁼ 1001 ←
 30867472[170721494]                   THEN •    ищем ценовую схему ←
 11010080[170722287]                     = ≡ Список приказов ценовых схем ∙ 65545[170721782] ←
  1638402[170721433]                       NULL ←
 11010080[170722288]                     = ≡ Список скидок ∙ 65545[170721787] ←
      404[170724599]                       Результат ⁼ '' ←
 11010080[170722289]                     = ≡ Ценовая схема ∙ 65545[170721784] ←
      404[170724600]                       Результат ≡ з.Строка.СерверSMTP ∙ 1507335[170721489] ←
  1507360[170721360]                     Отбор данных (по запросу) • Поиск приказов на цен.схемы ←
  1507447[170721310]                       Выражения ←
  1507449[170721359]                         Выражение • Цена закупочная ≡ Число, точность 6 знаков ∙ 107[42401800] ←
  1507608[170721282]                           Результат (Ноль (0.0), если NULL) ≡ Строки ∙ 12124204[170721371] ←
  1507494[170721806]                             Уточняющий параметр ≡ Цена закупочная ∙ 359[15007745] ←
  1507449[170721360]                         Выражение • Номер сопутствующего документа ≡ Наименование объекта (80) ∙ 107[262147] ←
 12124205[170721320]                           Запрос ←
 12124213[170721359]                             Параметры ←
  1507335[170721492]                               Параметр • Номер сопутствующего документа ≡ Документы ∙ 12124204[170721366] ←
  1507494[170721807]                                 Уточняющий параметр ≡ Номер сопутствующего документа ∙ 331[9] ←
 12124200[170721346]                             From         (Таблицы) ←
 12124204[170721366]                               Таблица • Документы ≡ Документ ∙ 108[5] ←
 12124215[170721366]                             Where      (Ограничения на отбор данных) ←
  1507376[170721540]                               Выражение ←
  1507455[170721597]                                 Результат ≡ Документы ∙ 12124204[170721366] ←
  1507494[170721808]                                   Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638473[170721529]                                 Равно ←
  1507455[170721598]                                 Результат ≡ Строки ∙ 12124204[170721371] ←
  1507494[170721809]                                   Уточняющий параметр ≡ Реальная приходная накладная ∙ 359[15925249] ←
  1507449[170721361]                         Выражение • Подразделение документа ≡ Партнер ∙ 107[5] ←
 12124205[170721321]                           Запрос ←
 12124213[170721360]                             Параметры ←
  1507335[170721493]                               Параметр • Подразделение ≡ Документы ∙ 12124204[170721367] ←
  1507494[170721810]                                 Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
 12124200[170721347]                             From         (Таблицы) ←
 12124204[170721367]                               Таблица • Документы ≡ Документ ∙ 108[5] ←
 12124215[170721367]                             Where      (Ограничения на отбор данных) ←
  1507376[170721541]                               Выражение ←
  1507455[170721599]                                 Результат ≡ Документы ∙ 12124204[170721367] ←
  1507494[170721811]                                   Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638473[170721530]                                 Равно ←
  1507455[170721600]                                 Результат ≡ Строки ∙ 12124204[170721371] ←
  1507494[170721812]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1507449[170721362]                         Выражение • Подразделение документа.Родитель ≡ Партнер ∙ 107[5] ←
 12124205[170721322]                           Запрос ←
 12124213[170721361]                             Параметры ←
  1507335[170721494]                               Параметр • Родитель ≡ Подразделения ∙ 12124204[170721368] ←
  1507494[170721813]                                 Уточняющий параметр ≡ Родитель ∙ 283[2] ←
 12124200[170721348]                             From         (Таблицы) ←
 12124204[170721368]                               Таблица • Подразделения ≡ Партнер ∙ 108[4] ←
 12124215[170721368]                             Where      (Ограничения на отбор данных) ←
  1507376[170721542]                               Выражение ←
  1507455[170721601]                                 Результат ≡ Подразделения ∙ 12124204[170721368] ←
  1507494[170721814]                                   Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1638473[170721531]                                 Равно ←
  1507455[170721602]                                 Результат ≡ Подразделение документа ∙ 1507449[170721361] ←
  1507449[170721363]                         Выражение • Код документа ≡ Наименование объекта (80) ∙ 107[262147] ←
 12124205[170721323]                           Запрос ←
 12124213[170721362]                             Параметры ←
  1507335[170721495]                               Параметр • Код ≡ Документы ∙ 12124204[170721369] ←
  1507494[170721815]                                 Уточняющий параметр ≡ Код ∙ 331[6] ←
 12124200[170721349]                             From         (Таблицы) ←
 12124204[170721369]                               Таблица • Документы ≡ Документ ∙ 108[5] ←
 12124215[170721369]                             Where      (Ограничения на отбор данных) ←
  1507376[170721543]                               Выражение ←
  1507455[170721603]                                 Результат ≡ Документы ∙ 12124204[170721369] ←
  1507494[170721816]                                   Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638473[170721532]                                 Равно ←
  1507455[170721604]                                 Результат ≡ Строки ∙ 12124204[170721371] ←
  1507494[170721817]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
 12124213[170721363]                       Параметры ←
  1507335[170721496]                         Параметр • Приказ ≡ Документы ∙ 12124204[170721370] ←
  1507494[170721818]                           Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1507335[170721497]                         Параметр • Строчка ≡ Строки ∙ 12124204[170721371] ←
  1507494[170721819]                           Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507335[170721498]                         Параметр • Цена закупочная ≡ Цена закупочная ∙ 1507449[170721359] ←
  1507335[170721499]                         Параметр • Количество ≡ Строки ∙ 12124204[170721371] ←
  1507494[170721820]                           Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  1507335[170721500]                         Параметр • Номер сопутствующего документа ≡ Номер сопутствующего документа ∙ 1507449[170721360] ←
  1507335[170721501]                         Параметр • Реальная приходная накладная ≡ Строки ∙ 12124204[170721371] ←
  1507494[170721821]                           Уточняющий параметр ≡ Реальная приходная накладная ∙ 359[15925249] ←
  1507335[170721502]                         Параметр • Код документа ≡ Код документа ∙ 1507449[170721363] ←
  1507335[170721503]                         Параметр • Подразделение документа.Родитель ≡ Подразделение документа.Родитель ∙ 1507449[170721362] ←
  1507673[170721293]                       Ключи оптимизации ←
  1507675[170721295]                         Использовать индекс ≡ Документы ∙ 12124204[170721370] ←
  1507676[170721295]                           Уточняющий параметр ≡ Подразделение --> Класс --> Тип --> Дата --> ID ∙ 1507445[1507400] ←
  1507675[170721296]                         Использовать индекс ≡ Строки ∙ 12124204[170721371] ←
  1507676[170721296]                           Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
 12124200[170721350]                       From         (Таблицы) ←
 12124204[170721370]                         Таблица • Документы ≡ Документ ∙ 108[5] ←
 12124204[170721371]                         Таблица • Строки ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[170721370]                       Where      (Ограничения на отбор данных) ←
  1507376[170721544]                         Выражение ←
  1507455[170721605]                           Результат ≡ Документы ∙ 12124204[170721370] ←
  1507494[170721822]                             Уточняющий параметр ≡ Класс ∙ 331[3] ←
  1638473[170721533]                           Равно ←
  1507488[170721333]                           Константа (Ограничение по классу, типу, плану счетов) ≡ ПРИКАЗ ∙ 541[14417922] ←
  1507376[170721545]                         Выражение ←
  1507455[170721606]                           Результат ≡ Документы ∙ 12124204[170721370] ←
  1507494[170721823]                             Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[170721534]                           Равно ←
  1507488[170721334]                           Константа (Ограничение по классу, типу, плану счетов) ≡ Приказ на назначение ценовой схемы на товары ∙ 332[3342368] ←
  1507376[170721546]                         Выражение ←
  1507455[170721607]                           Результат ≡ Документы ∙ 12124204[170721370] ←
  1507494[170721824]                             Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1638473[170721535]                           Равно ←
  1507452[170721438]                           Константа ≡ ТТ ∙ 65545[170721761] ←
      411[170721558]                             Уточняющий параметр ≡ Подразделение для назначения цен ∙ 283[42401850] ←
  1507376[170721547]                         Выражение ←
  1507455[170721608]                           Результат ≡ Документы ∙ 12124204[170721370] ←
  1507494[170721825]                             Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638476[170721300]                           Меньше ←
  1507452[170721439]                           Константа ≡ Дата продажи ∙ 65545[170721781] ←
  1507376[170721548]                         Выражение ←
  1507455[170721609]                           Результат ≡ Документы ∙ 12124204[170721370] ←
  1507494[170721826]                             Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638477[170721299]                           Больше или равно ←
  1507452[170721440]                           Константа ≡ Дата1 ∙ 65545[170721779] ←
  1507376[170721549]                         Выражение ←
  1507455[170721610]                           Результат ≡ Документы ∙ 12124204[170721370] ←
  1507494[170721827]                             Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[170721305]                           Меньше или равно ←
  1507452[170721441]                           Константа ≡ Дата продажи ∙ 65545[170721781] ←
  1507376[170721550]                         Выражение ←
  1507455[170721611]                           Результат ≡ Документы ∙ 12124204[170721370] ←
  1507494[170721828]                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638477[170721300]                           Больше или равно ←
  1507452[170721442]                           Константа ≡ Дата, начало дня ∙ 249[30867471] ←
 32505862[170721687]                             Значения формальных параметров при вызове ←
 32505860[170722066]                               Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867497] ←
   327700[170722149]                                 Выражение ≡ Дата продажи ∙ 65545[170721781] ←
  1507376[170721551]                         Выражение ←
  1507455[170721612]                           Результат ≡ Документы ∙ 12124204[170721370] ←
  1507494[170721829]                             Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638473[170721536]                           Равно ←
  1507455[170721613]                           Результат ≡ Строки ∙ 12124204[170721371] ←
  1507494[170721830]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1507376[170721552]                         Выражение ←
  1507455[170721614]                           Результат ≡ Строки ∙ 12124204[170721371] ←
  1507494[170721831]                             Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[170721537]                           Равно ←
  1507452[170721443]                           Константа ≡ Приказы : Продукт (приказы) ∙ 65545[170721754] ←
 30867465[170721294]                       Выполнить при старте ←
 11010080[170722290]                         = ≡ Выставлено ∙ 65545[170721745] ←
      404[170724601]                           Результат ⁼ 0 ←
 11010080[170722291]                         = ≡ лп Точный приказ ∙ 65545[170721785] ←
  1638402[170721434]                           NULL ←
 11010080[170722292]                         = ≡ Скидка ∙ 65545[170721749] ←
      404[170724602]                           Результат ⁼ 0 ←
 30867466[170721363]                       Выполнить после получения записи ←
 11010080[170722293]                         = ≡ Список приказов ценовых схем ∙ 65545[170721782] ←
      404[170724603]                           Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[170721286]                             Список элементов ←
   327700[170722150]                               Выражение ≡ Список приказов ценовых схем ∙ 65545[170721782] ←
   327700[170722151]                               Выражение ≡ Приказ ∙ 1507335[170721496] ←
 11010080[170722294]                         = ≡ Приказ ∙ 65545[170721771] ←
      404[170724604]                           Результат ≡ Приказ ∙ 1507335[170721496] ←
 11010080[170722295]                         = ≡ Приказы : Строка приказа ∙ 65545[170721755] ←
      404[170724605]                           Результат ≡ Строчка ∙ 1507335[170721497] ←
 11010080[170722296]                         = ≡ Скидка ∙ 65545[170721749] ←
  1638464[170721306]                           Ноль (0.0), если NULL ≡ Цена закупочная ∙ 1507335[170721498] ←
 11010080[170722297]                         = ≡ лп Строка приказа на ценовую схему ∙ 65545[170721786] ←
      404[170724606]                           Результат ≡ Строчка ∙ 1507335[170721497] ←
 30867470[170721496]                         IF ←
  1638463[170721539]                           Условие ←
      404[170724607]                             Результат ≡ Номер сопутствующего документа ∙ 1507335[170721500] ←
  1638473[170721538]                             Равно ←
      404[170724608]                             Результат ≡ Ценовая схема ∙ 65545[170721784] ←
 30867472[170721495]                           THEN •   точно нашли верный приказ, возьмём значение скидки ←
 11010080[170722298]                             = ≡ Скидка ∙ 65545[170721749] ←
      404[170724609]                               Результат ≡ Цена закупочная ∙ 1507335[170721498] ←
 11010080[170722299]                             = ≡ лп Точный приказ ∙ 65545[170721785] ←
      404[170724610]                               Результат ≡ Реальная приходная накладная ∙ 1507335[170721501] ←
 11010080[170722300]                             = ≡ лп Строка приказа на ценовую схему ∙ 65545[170721786] ←
      404[170724611]                               Результат ≡ Строчка ∙ 1507335[170721497] ←
 11010080[170722301]                             = ≡ Приказ ∙ 65545[170721771] ←
      404[170724612]                               Результат ≡ лп Точный приказ ∙ 65545[170721785] ←
 11010088[170721581]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170721407]                               Выражение ←
      404[170725152]                                 Результат ⁼ Точный приказ:  ←
      404[170725151]                                 Результат ≡ лп Точный приказ ∙ 65545[170721785] ←
      404[170725153]                                 Результат ⁼      Строка приказа:  ←
      404[170725154]                                 Результат ≡ лп Строка приказа на ценовую схему ∙ 65545[170721786] ←
      404[170725157]                                 Результат ⁼    Номер соп. док-та:   ←
      404[170725155]                                 Результат ≡ Номер сопутствующего документа ∙ 1507335[170721500] ←
      404[170725158]                                 Результат ⁼    Схема:   ←
      404[170725156]                                 Результат ≡ Ценовая схема ∙ 65545[170721784] ←
 11010080[170722302]                         = ≡ Список скидок ∙ 65545[170721787] ←
      404[170724613]                           Результат ≡ Список скидок ∙ 65545[170721787] ←
      404[170724614]                           Результат ⁼ , ←
      404[170724615]                           Результат ≡ Скидка ∙ 65545[170721749] ←
 48431132[170721304]                         += ≡ Выставлено ∙ 65545[170721745] ←
      404[170724616]                           Результат ≡ Количество ∙ 1507335[170721499] ←
 11010080[170722303]                         = ≡ Приказы : Скидка ∙ 65545[170721756] ←
  1638464[170721307]                           Ноль (0.0), если NULL ≡ Цена закупочная ∙ 1507335[170721498] ←
 11010080[170722304]                         = ≡ Приказы : ТТ ∙ 65545[170721757] ←
      404[170724617]                           Результат ≡ Подразделение документа.Родитель ∙ 1507335[170721503] ←
 11010080[170722305]                         = ≡ Приказы : Код ∙ 65545[170721758] ←
      404[170724618]                           Результат ≡ Код документа ∙ 1507335[170721502] ←
 11010092[170721288]                         Добавить в локальную таблицу ≡ Приказы ∙ 30867458[170721285] ←
 39780361[170721309]                         ЗАВЕРШИТЬ БЛОК ≡ лп Точный приказ ∙ 65545[170721785] ←
  1507360[170721361]                     Отбор данных (по запросу) • Поиск суммарного кол-ва по приказам на цен.схемы ←
 12124213[170721364]                       Параметры ←
  1507335[170721504]                         Параметр ≡ SUM(Количество) ∙ 1507449[170721364] ←
  1507447[170721311]                       Выражения ←
  1507449[170721364]                         Выражение • SUM(Количество) ≡ Число ∙ 107[4] ←
  1507455[170721615]                           Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[170721294]                             Значения параметров ←
  1507477[170721295]                               Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[170721295]                                 Выражение ≡ Строки доков ∙ 12124204[170721373] ←
  1507494[170721832]                                   Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  1507673[170721294]                       Ключи оптимизации ←
  1507675[170721297]                         Использовать индекс ≡ Доки ∙ 12124204[170721372] ←
  1507676[170721297]                           Уточняющий параметр ≡ Подразделение --> Класс --> Тип --> Дата --> ID ∙ 1507445[1507400] ←
  1507675[170721298]                         Использовать индекс ≡ Строки доков ∙ 12124204[170721373] ←
  1507676[170721298]                           Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
 12124200[170721351]                       From         (Таблицы) ←
 12124204[170721372]                         Таблица • Доки ≡ Документ ∙ 108[5] ←
 12124204[170721373]                         Таблица • Строки доков ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[170721371]                       Where      (Ограничения на отбор данных) ←
  1507376[170721553]                         Выражение ←
  1507455[170721616]                           Результат ≡ Доки ∙ 12124204[170721372] ←
  1507494[170721833]                             Уточняющий параметр ≡ Класс ∙ 331[3] ←
  1638473[170721539]                           Равно ←
  1507488[170721335]                           Константа (Ограничение по классу, типу, плану счетов) ≡ ПРИКАЗ ∙ 541[14417922] ←
  1507376[170721554]                         Выражение ←
  1507455[170721617]                           Результат ≡ Доки ∙ 12124204[170721372] ←
  1507494[170721834]                             Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[170721540]                           Равно ←
  1507488[170721336]                           Константа (Ограничение по классу, типу, плану счетов) ≡ Приказ на назначение ценовой схемы на товары ∙ 332[3342368] ←
  1507376[170721555]                         Выражение ←
  1507455[170721618]                           Результат ≡ Доки ∙ 12124204[170721372] ←
  1507494[170721835]                             Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1638473[170721541]                           Равно ←
  1507452[170721444]                           Константа ≡ ТТ ∙ 65545[170721761] ←
      411[170721559]                             Уточняющий параметр ≡ Подразделение для назначения цен ∙ 283[42401850] ←
  1507376[170721556]                         Выражение ←
  1507455[170721619]                           Результат ≡ Доки ∙ 12124204[170721372] ←
  1507494[170721836]                             Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638477[170721301]                           Больше или равно ←
  1507452[170721445]                           Константа ≡ Дата1 ∙ 65545[170721779] ←
  1507376[170721557]                         Выражение ←
  1507455[170721620]                           Результат ≡ Доки ∙ 12124204[170721372] ←
  1507494[170721837]                             Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638475[170721306]                           Меньше или равно ←
  1507452[170721446]                           Константа ≡ Дата2 ∙ 65545[170721780] ←
  1507376[170721558]                         Выражение ←
  1507455[170721621]                           Результат ≡ Доки ∙ 12124204[170721372] ←
  1507494[170721838]                             Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[170721307]                           Меньше или равно ←
  1507452[170721447]                           Константа ≡ Дата2 ∙ 65545[170721780] ←
  1507376[170721559]                         Выражение ←
  1507455[170721622]                           Результат ≡ Доки ∙ 12124204[170721372] ←
  1507494[170721839]                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638478[170721321]                           Больше ←
  1507452[170721448]                           Константа ≡ Дата начальная ∙ 381[131078] ←
  1507376[170721560]                         Выражение ←
  1507455[170721623]                           Результат ≡ Строки доков ∙ 12124204[170721373] ←
  1507494[170721840]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638473[170721542]                           Равно ←
  1507455[170721624]                           Результат ≡ Доки ∙ 12124204[170721372] ←
  1507494[170721841]                             Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1507376[170721561]                         Выражение ←
  1507455[170721625]                           Результат ≡ Строки доков ∙ 12124204[170721373] ←
  1507494[170721842]                             Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[170721543]                           Равно ←
  1507452[170721449]                           Константа ≡ Продукт из чека ∙ 65545[170721762] ←
 30867466[170721364]                       Выполнить после получения записи ←
 11010080[170722306]                         = ≡ Выставлено ∙ 65545[170721745] ←
      404[170724619]                           Результат ∙ 1507335[170721504] ←
  1507728[170721362]                     Начало многострочного комментария ←
 11010088[170721561]                     ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170721385]                       Выражение ←
      404[170724620]                         Результат ⁼ ККЛ; ←
      404[170724621]                         Результат ≡ Строка ККЛ ∙ 65545[170721778] ←
      404[170724622]                         Результат ⁼ ; ←
      404[170724623]                         Результат ≡ Приказы : Продукт (приказы) ∙ 65545[170721754] ←
      411[170721560]                           Уточняющий параметр ≡ Код ∙ 305[5] ←
      404[170724624]                         Результат ⁼ ; ←
      404[170724625]                         Результат ≡ Приказы : Продукт (приказы) ∙ 65545[170721754] ←
      411[170721561]                           Уточняющий параметр ≡ Наименование ∙ 305[6] ←
      404[170724626]                         Результат ⁼ ; ←
      404[170724627]                         Результат ≡ Дата продажи ∙ 65545[170721781] ←
      404[170724628]                         Результат ⁼ ; ←
      404[170724629]                         Результат ≡ Скидка ∙ 65545[170721749] ←
      404[170724630]                         Результат ⁼ ; ←
      404[170724631]                         Результат ≡ Ценовая схема ∙ 65545[170721784] ←
      404[170724632]                         Результат ⁼ ; ←
      404[170724633]                         Результат ≡ лп Точный приказ ∙ 65545[170721785] ←
      404[170724634]                         Результат ⁼ ; ←
      404[170724635]                         Результат ≡ Множество.Количество элементов ∙ 387[1507487] ←
   327700[170722152]                           Выражение ≡ Список приказов ценовых схем ∙ 65545[170721782] ←
      404[170724636]                         Результат ⁼ ; ←
      404[170724637]                         Результат ≡ лп Строка приказа на ценовую схему ∙ 65545[170721786] ←
  1507729[170721362]                     Конец многострочного комментария ←
 11010093[170721339]                 Комментарий •  проверим сумму фактическую, из-за расчёта Премией, она может быть неадекватной, пересчитаем цифры ←
 30867470[170721497]                 IF ←
  1638463[170721540]                   Условие ←
  1638460[170721329]                     НЕ ←
      404[170724638]                     Результат ≡ КЯ или Д ∙ 65545[170721777] ←
 30867472[170721496]                   THEN • для КЯ проверим применимость Премии ←
 30867470[170721498]                     IF ←
  1638463[170721541]                       Условие ←
      116[170721601]                         Выражение ←
      404[170724639]                           Результат ≡ Цена (факт.) ∙ 65545[170721748] ←
      402[170721292]                           Делить ←
      116[170721602]                           Выражение ←
      404[170724640]                             Результат ≡ Цена (розн.) ∙ 65545[170721746] ←
      406[170721322]                             Вычесть ←
      116[170721603]                             Выражение ←
      404[170724641]                               Результат ≡ Цена (розн.) ∙ 65545[170721746] ←
      403[170721321]                               Умножить ←
      404[170724642]                               Результат ≡ Скидка ∙ 65545[170721749] ←
      402[170721293]                               Делить ←
      404[170724643]                               Результат ⁼ 100 ←
  1638476[170721301]                         Меньше ←
      404[170724644]                         Результат ⁼ 0.8 ←
 30867472[170721497]                       THEN ←
 11010080[170722307]                         = ≡ Цена (факт.) ∙ 65545[170721748] ←
      116[170721604]                           Выражение ←
      404[170724645]                             Результат ≡ Цена (розн.) ∙ 65545[170721746] ←
      406[170721323]                             Вычесть ←
      116[170721605]                             Выражение ←
      404[170724646]                               Результат ≡ Цена (розн.) ∙ 65545[170721746] ←
      403[170721322]                               Умножить ←
      404[170724647]                               Результат ≡ Скидка ∙ 65545[170721749] ←
      402[170721294]                               Делить ←
      404[170724648]                               Результат ⁼ 100 ←
 11010080[170722308]                         = ≡ Сумма (факт.) ∙ 65545[170721750] ←
      404[170724649]                           Результат ≡ Цена (факт.) ∙ 65545[170721748] ←
      403[170721323]                           Умножить ←
      404[170724650]                           Результат ≡ Продано ∙ 65545[170721744] ←
  1507728[170721363]                         Начало многострочного комментария ←
 11010088[170721562]                         ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170721386]                           Выражение ←
      404[170724651]                             Результат ⁼                             Похоже, рассчитались Премией. Цена фактическая не соответствует цене со скидкой: ←
      116[170721606]                             Выражение ←
      404[170724652]                               Результат ≡ Цена (факт.) ∙ 65545[170721748] ←
      402[170721295]                               Делить ←
      116[170721607]                               Выражение ←
      404[170724653]                                 Результат ≡ Цена (розн.) ∙ 65545[170721746] ←
      406[170721324]                                 Вычесть ←
      116[170721608]                                 Выражение ←
      404[170724654]                                   Результат ≡ Цена (розн.) ∙ 65545[170721746] ←
      403[170721324]                                   Умножить ←
      404[170724655]                                   Результат ≡ Скидка ∙ 65545[170721749] ←
      402[170721296]                                   Делить ←
      404[170724656]                                   Результат ⁼ 100 ←
 11010088[170721563]                         ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170721387]                           Выражение ←
      404[170724657]                             Результат ⁼                Коррекция: ←
      404[170724658]                             Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      404[170724659]                             Результат ⁼   | ←
      404[170724660]                             Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[170721562]                               Уточняющий параметр ≡ Дата окончания гарантии ∙ 359[14286866] ←
      404[170724661]                             Результат ⁼   | ←
      404[170724662]                             Результат ≡ Строка.Продукт ∙ 1507335[1508517] ←
      411[170721563]                               Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
      404[170724663]                             Результат ⁼   | ←
      404[170724664]                             Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[170721564]                               Уточняющий параметр ≡ Сервер SMTP ∙ 359[48431122] ←
      404[170724665]                             Результат ⁼   | ←
      404[170724666]                             Результат ≡ Продано ∙ 65545[170721744] ←
      404[170724667]                             Результат ⁼   | ←
      404[170724668]                             Результат ≡ Цена (розн.) ∙ 65545[170721746] ←
      404[170724669]                             Результат ⁼   | ←
      404[170724670]                             Результат ≡ Цена (факт.) ∙ 65545[170721748] ←
      404[170724671]                             Результат ⁼   | ←
      404[170724672]                             Результат ≡ Сумма (факт.) ∙ 65545[170721750] ←
      404[170724673]                             Результат ⁼   | ←
      404[170724674]                             Результат ≡ Скидка ∙ 65545[170721749] ←
      404[170724675]                             Результат ⁼ % ←
  1507729[170721363]                         Конец многострочного комментария ←
 30867470[170721499]                 IF ←
  1638463[170721542]                   Условие ←
  1638460[170721330]                     НЕ ←
      404[170724676]                     Результат ≡ ЛТ Продано ∙ 65545[170721763] ←
 30867472[170721498]                   THEN • если продукта в таблице нет, то добавляем данные, иначе, аккумулируем ←
 11010080[170722309]                     = ≡ ЛТ Продано ∙ 65545[170721763] ←
      404[170724677]                       Результат ≡ Продано ∙ 65545[170721744] ←
 11010080[170722310]                     = ≡ ЛТ Выставлено ∙ 65545[170721764] ←
      404[170724678]                       Результат ≡ Выставлено ∙ 65545[170721745] ←
 11010080[170722311]                     = ≡ ЛТ Цена (розн.) ∙ 65545[170721765] ←
      404[170724679]                       Результат ≡ Цена (розн.) ∙ 65545[170721746] ←
 11010080[170722312]                     = ≡ ЛТ Цена (факт.) ∙ 65545[170721767] ←
      404[170724680]                       Результат ≡ Цена (факт.) ∙ 65545[170721748] ←
 11010080[170722313]                     = ≡ ЛТ Сумма (факт.) ∙ 65545[170721768] ←
      404[170724681]                       Результат ≡ Сумма (факт.) ∙ 65545[170721750] ←
 11010080[170722314]                     = ≡ ЛТ Убыток ∙ 65545[170721769] ←
      116[170721609]                       Выражение ←
      116[170721610]                         Выражение ←
      404[170724682]                           Результат ≡ Цена (розн.) ∙ 65545[170721746] ←
      406[170721325]                           Вычесть ←
      404[170724683]                           Результат ≡ Цена (факт.) ∙ 65545[170721748] ←
      403[170721325]                       Умножить ←
      404[170724684]                       Результат ≡ Продано ∙ 65545[170721744] ←
 11010088[170721564]                     ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[170721688]                       Значения формальных параметров при вызове ←
      117[170721375]                         Выражение • Сообщение ≡ Длинная строка (1024) ∙ 107[48431108] ←
      404[170724685]                           Результат ⁼ '1. Цена роз : ' ←
      404[170724686]                           Результат ≡ Цена (розн.) ∙ 65545[170721746] ←
      404[170724687]                           Результат ⁼ ', факт : ' ←
      404[170724688]                           Результат ≡ Цена (факт.) ∙ 65545[170721748] ←
      404[170724689]                           Результат ⁼ ', кол-во : ' ←
      404[170724690]                           Результат ≡ Продано ∙ 65545[170721744] ←
      404[170724691]                           Результат ⁼ ', убыток : ' ←
      404[170724692]                           Результат ≡ ЛТ Убыток ∙ 65545[170721769] ←
 32505860[170722067]                         Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[170722153]                           Выражение ≡ Сообщение ∙ 117[170721375] ←
 11010080[170722315]                     = ≡ Счётчик операций ∙ 65545[170721770] ←
      404[170724693]                       Результат ⁼ 1 ←
 11010092[170721289]                     Добавить в локальную таблицу ≡ Продажи ∙ 30867458[170721284] ←
 30867473[170721369]                   ELSE ←
 48431132[170721305]                     += ≡ ЛТ Продано ∙ 65545[170721763] ←
      404[170724694]                       Результат ≡ Продано ∙ 65545[170721744] ←
 11010093[170721340]                     Комментарий • Выставлено не инкрементируется, так как ищется запросом через SUM за период отчёта ←
  1507728[170721364]                     Начало многострочного комментария ←
 11010080[170722316]                     = ≡ ЛТ Выставлено ∙ 65545[170721764] ←
      404[170724695]                       Результат ≡ Выставлено ∙ 65545[170721745] ←
  1507729[170721364]                     Конец многострочного комментария ←
 48431132[170721306]                     += ≡ ЛТ Цена (розн.) ∙ 65545[170721765] ←
      404[170724696]                       Результат ≡ Цена (розн.) ∙ 65545[170721746] ←
 48431132[170721307]                     += ≡ ЛТ Цена (факт.) ∙ 65545[170721767] ←
      404[170724697]                       Результат ≡ Цена (факт.) ∙ 65545[170721748] ←
 48431132[170721308]                     += ≡ ЛТ Сумма (факт.) ∙ 65545[170721768] ←
      404[170724698]                       Результат ≡ Сумма (факт.) ∙ 65545[170721750] ←
 48431132[170721309]                     += ≡ ЛТ Убыток ∙ 65545[170721769] ←
      116[170721611]                       Выражение ←
      116[170721612]                         Выражение ←
      404[170724699]                           Результат ≡ Цена (розн.) ∙ 65545[170721746] ←
      406[170721326]                           Вычесть ←
      404[170724700]                           Результат ≡ Цена (факт.) ∙ 65545[170721748] ←
      403[170721326]                       Умножить ←
      404[170724701]                       Результат ≡ Продано ∙ 65545[170721744] ←
 11010088[170721565]                     ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[170721689]                       Значения формальных параметров при вызове ←
      117[170721376]                         Выражение • Сообщение ≡ Длинная строка (1024) ∙ 107[48431108] ←
      404[170724702]                           Результат ⁼ '2. Цена роз : ' ←
      404[170724703]                           Результат ≡ Цена (розн.) ∙ 65545[170721746] ←
      404[170724704]                           Результат ⁼ ', факт : ' ←
      404[170724705]                           Результат ≡ Цена (факт.) ∙ 65545[170721748] ←
      404[170724706]                           Результат ⁼ ', кол-во : ' ←
      404[170724707]                           Результат ≡ Продано ∙ 65545[170721744] ←
      404[170724708]                           Результат ⁼ ', убыток : ' ←
      404[170724709]                           Результат ≡ ЛТ Убыток ∙ 65545[170721769] ←
 32505860[170722068]                         Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[170722154]                           Выражение ≡ Сообщение ∙ 117[170721376] ←
 48431132[170721310]                     += ≡ Счётчик операций ∙ 65545[170721770] ←
      404[170724710]                       Результат ⁼ 1 ←
  1507625[170721281]                     Изменить локальную таблицу ≡ Продажи ∙ 30867458[170721284] ←
 11010088[170721566]                 ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170721388]                   Выражение ←
      404[170724711]                     Результат ⁼          Стало: ←
      404[170724712]                     Результат ≡ ЛТ Выставлено ∙ 65545[170721764] ←
 11010080[170722317]                 = ≡ Строка ∙ 65545[655299188] ←
      404[170724713]                   Результат ≡ Дата продажи ∙ 65545[170721781] ←
      404[170724714]                   Результат ⁼ ; ←
      404[170724715]                   Результат ≡ Продукт из чека ∙ 65545[170721762] ←
      411[170721565]                     Уточняющий параметр ≡ Код ∙ 305[5] ←
      404[170724716]                   Результат ⁼ ; ←
      404[170724717]                   Результат ≡ Продукт из чека ∙ 65545[170721762] ←
      411[170721566]                     Уточняющий параметр ≡ Наименование ∙ 305[6] ←
      404[170724718]                   Результат ⁼ ; ←
      404[170724719]                   Результат ≡ Цена (розн.) ∙ 65545[170721746] ←
      404[170724720]                   Результат ⁼ ; ←
      404[170724721]                   Результат ≡ Цена (факт.) ∙ 65545[170721748] ←
      404[170724722]                   Результат ⁼ ; ←
      404[170724723]                   Результат ≡ Продано ∙ 65545[170721744] ←
      404[170724724]                   Результат ⁼ ; ←
      404[170724725]                   Результат ≡ Сумма (факт.) ∙ 65545[170721750] ←
      404[170724726]                   Результат ⁼ ; ←
 30867467[170721291]               Выполнить при завершении ←
 30867470[170721500]                 IF ←
  1638463[170721543]                   Условие ←
      404[170724727]                     Результат ≡ Автоматически ∙ 65545[58393339] ←
 30867472[170721499]                   THEN ←
 11010088[170721567]                     ВЫПОЛНИТЬ ≡ Файл.Закрыть ∙ 249[1507341] ←
 39780367[170721391]                       Файл ≡ Файл ∙ 65545[655299187] ←
 11010088[170721568]                     ВЫПОЛНИТЬ ≡ Файл.Удалить ∙ 249[1507333] ←
 39780367[170721392]                       Файл ≡ Файл ∙ 65545[655299187] ←
 30867477[170721285]                     Отбор данных из локальной таблицы • КД ≡ Продажи ∙ 30867458[170721284] ←
 30867484[170721281]                       Выполнить перед обработкой блока ≡ КД ∙ 30867481[170721282] ←
 11010105[170721302]                         Индикатор ⁼ Ученка. Рассылка КД ←
 11010080[170722318]                         = ≡ Имя ∙ 65545[655299190] ←
      404[170724728]                           Результат ⁼ 'ucenka-' ←
      404[170724729]                           Результат ≡ Случайное число (7 знаков) ∙ 117[1507630] ←
  1507410[170721432]                         ВЫПОЛНИТЬ БЛОК ≡ Создание файла ∙ 30867469[655295596] ←
 11010080[170722319]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170724730]                           Результат ⁼ ; ←
      404[170724731]                           Результат ⁼ Отчёт 20/30/50 за период с ; ←
      404[170724732]                           Результат ≡ Дата начальная ∙ 381[131078] ←
      404[170724733]                           Результат ⁼  по ; ←
      404[170724734]                           Результат ≡ Дата конечная ∙ 381[131079] ←
  1507410[170721433]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 11010080[170722320]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170724735]                           Результат ⁼ Код магазина; ←
      404[170724736]                           Результат ⁼ Магазин; ←
      404[170724737]                           Результат ⁼ Код; ←
      404[170724738]                           Результат ⁼ Продукт; ←
      404[170724739]                           Результат ⁼ Кол-во (факт.); ←
      404[170724740]                           Результат ⁼ Кол-во (приказ); ←
      404[170724741]                           Результат ⁼ Цена (розн); ←
      404[170724742]                           Результат ⁼ Цена (факт); ←
      404[170724743]                           Результат ⁼ Сумма (факт); ←
      404[170724744]                           Результат ⁼ Списано бонусов; ←
      404[170724745]                           Результат ⁼ Убыток; ←
      404[170724746]                           Результат ⁼ Чеков; ←
      404[170724747]                           Результат ⁼ Список приказов; ←
      404[170724748]                           Результат ⁼ Список скидок; ←
      404[170724749]                           Результат ⁼ Поставщик; ←
      404[170724750]                           Результат ⁼ Возврат; ←
      404[170724751]                           Результат ⁼ Группа; ←
  1507410[170721434]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 30867466[170721365]                       Выполнить после получения записи ←
 30867477[170721286]                         Отбор данных из локальной таблицы • собираем приказы  и скидки в строку ≡ Приказы ∙ 30867458[170721285] ←
 30867465[170721297]                           Выполнить при старте ←
 11010080[170722321]                             = ≡ Список приказов ЦС (строка) ∙ 65545[170721783] ←
      404[170724752]                               Результат ⁼ '' ←
 11010080[170722322]                             = ≡ Список скидок ∙ 65545[170721787] ←
      404[170724753]                               Результат ⁼ '' ←
 30867466[170721366]                           Выполнить после получения записи ←
 11010099[170721309]                             CONTINUE ←
      116[170721613]                               Выражение ←
      116[170721614]                                 Выражение ←
      404[170724754]                                   Результат ≡ Приказы : Продукт (приказы) ∙ 65545[170721754] ←
  1638479[170721400]                                   Не равно ←
      404[170724755]                                   Результат ≡ Продукт из чека ∙ 65545[170721762] ←
      412[170721348]                                 ИЛИ ←
      116[170721615]                                 Выражение ←
      404[170724756]                                   Результат ≡ Приказы : Строка приказа ∙ 65545[170721755] ←
      411[170721567]                                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[170721568]                                       Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[170721569]                                         Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638479[170721401]                                   Не равно ←
      404[170724757]                                   Результат ≡ ТТ ∙ 65545[170721761] ←
 11010080[170722323]                             = ≡ Скидка ∙ 65545[170721749] ←
      404[170724758]                               Результат ≡ Приказы : Строка приказа ∙ 65545[170721755] ←
      411[170721570]                                 Уточняющий параметр ≡ Цена закупочная ∙ 359[15007745] ←
 11010080[170722324]                             = ≡ tmpstr ∙ 65545[170721774] ←
      404[170724759]                               Результат ⁼ '' ←
      404[170724760]                               Результат ≡ Скидка ∙ 65545[170721749] ←
      404[170724761]                               Результат ⁼ '' ←
 48431138[170721281]                             &= ≡ Список приказов ЦС (строка) ∙ 65545[170721783] ←
      404[170724762]                               Результат ≡ Приказы : Строка приказа ∙ 65545[170721755] ←
      411[170721571]                                 Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[170721572]                                   Уточняющий параметр ≡ Код ∙ 331[6] ←
      404[170724763]                               Результат ⁼ , ←
  1507728[170721365]                             Начало многострочного комментария ←
 11010088[170721569]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170721389]                               Выражение ←
      404[170724764]                                 Результат ≡ Приказы : Продукт (приказы) ∙ 65545[170721754] ←
      411[170721573]                                   Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
      404[170724765]                                 Результат ⁼ ; ←
      404[170724766]                                 Результат ≡ Приказы : Строка приказа ∙ 65545[170721755] ←
      404[170724767]                                 Результат ⁼ :  Список скидок < ←
      404[170724768]                                 Результат ≡ Список скидок ∙ 65545[170721787] ←
      404[170724769]                                 Результат ⁼ >    Скидка ←
      404[170724770]                                 Результат ≡ tmpstr ∙ 65545[170721774] ←
      404[170724771]                                 Результат ⁼ %,  POS: ←
      116[170721616]                                 Выражение ←
      404[170724772]                                   Результат ≡ POS ∙ 387[1507422] ←
 11010095[170721390]                                     Выражение ←
      404[170724773]                                       Результат ≡ Список скидок ∙ 65545[170721787] ←
  1507510[170721283]                                     Искомая подстрока ←
      404[170724774]                                       Результат ≡ tmpstr ∙ 65545[170721774] ←
 11010073[170721292]                                     Позиция ⁼ 1 ←
  1507729[170721365]                             Конец многострочного комментария ←
 11010099[170721310]                             CONTINUE ←
      116[170721617]                               Выражение ←
      404[170724775]                                 Результат ≡ POS ∙ 387[1507422] ←
 11010095[170721391]                                   Выражение ←
      404[170724776]                                     Результат ≡ Список скидок ∙ 65545[170721787] ←
  1507510[170721284]                                   Искомая подстрока ←
      404[170724777]                                     Результат ≡ tmpstr ∙ 65545[170721774] ←
 11010073[170721293]                                   Позиция ⁼ 1 ←
 48431138[170721282]                             &= ≡ Список скидок ∙ 65545[170721787] ←
      404[170724778]                               Результат ≡ tmpstr ∙ 65545[170721774] ←
      404[170724779]                               Результат ⁼ '%,' ←
  1507728[170721366]                             Начало многострочного комментария ←
 11010088[170721570]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170721392]                               Выражение ←
      404[170724780]                                 Результат ⁼          Список скидок < ←
      404[170724781]                                 Результат ≡ Список скидок ∙ 65545[170721787] ←
      404[170724782]                                 Результат ⁼ > ←
  1507729[170721366]                             Конец многострочного комментария ←
 30867467[170721292]                           Выполнить при завершении ←
 11010093[170721341]                             Комментарий •  обрежем запятую на конце, переменная "Скидка" используется как целочисленный буфер ←
 11010080[170722325]                             = ≡ tmp ∙ 65545[170721773] ←
      404[170724783]                               Результат ≡ LEN ∙ 387[1507420] ←
 11010095[170721393]                                 Выражение ←
      404[170724784]                                   Результат ≡ Список приказов ЦС (строка) ∙ 65545[170721783] ←
      406[170721327]                               Вычесть ←
      404[170724785]                               Результат ⁼ 1 ←
 11010080[170722326]                             = ≡ Список приказов ЦС (строка) ∙ 65545[170721783] ←
      404[170724786]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[170721690]                                 Значения формальных параметров при вызове ←
 32505860[170722069]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[170722155]                                     Выражение ≡ Список приказов ЦС (строка) ∙ 65545[170721783] ←
 32505860[170722070]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[170722156]                                     Выражение ⁼ 1 ←
 32505860[170722071]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[170722157]                                     Выражение ≡ tmp ∙ 65545[170721773] ←
 11010080[170722327]                             = ≡ tmp ∙ 65545[170721773] ←
      116[170721618]                               Выражение ←
      404[170724787]                                 Результат ≡ LEN ∙ 387[1507420] ←
 11010095[170721394]                                   Выражение ←
      404[170724788]                                     Результат ≡ Список скидок ∙ 65545[170721787] ←
      406[170721328]                                 Вычесть ←
      404[170724789]                                 Результат ⁼ 1 ←
 11010080[170722328]                             = ≡ Список скидок ∙ 65545[170721787] ←
      404[170724790]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[170721691]                                 Значения формальных параметров при вызове ←
 32505860[170722072]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[170722158]                                     Выражение ≡ Список скидок ∙ 65545[170721787] ←
 32505860[170722073]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[170722159]                                     Выражение ⁼ 1 ←
 32505860[170722074]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[170722160]                                     Выражение ≡ tmp ∙ 65545[170721773] ←
 11010080[170722329]                         = ≡ Список поставщиков ∙ 65545[170721788] ←
  1638402[170721435]                           NULL ←
 11010080[170722330]                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
  1638402[170721436]                           NULL ←
  1507360[170721362]                         Отбор данных (по запросу) • Поставщики ←
  1507673[170721295]                           Ключи оптимизации ←
  1507675[170721299]                             Использовать индекс ∙ 12124204[170721374] ←
  1507676[170721299]                               Уточняющий параметр ≡ ПРОДУКТ ∙ 1507445[54919247] ←
 12124200[170721352]                           From         (Таблицы) ←
 12124204[170721374]                             Таблица ≡ СПЕЦИФИКАЦИЯ ПОСТАВЩИКА ∙ 1507433[43122705] ←
 12124215[170721372]                           Where      (Ограничения на отбор данных) ←
  1507376[170721562]                             Выражение ←
  1507455[170721626]                               Результат ∙ 12124204[170721374] ←
  1507494[170721843]                                 Уточняющий параметр ≡ ПРОДУКТ ∙ 1507443[43122766] ←
  1638473[170721544]                               Равно ←
  1507452[170721450]                               Константа ≡ Продукт из чека ∙ 65545[170721762] ←
      413[170721465]                             И ←
  1507376[170721563]                             Выражение ←
  1507455[170721627]                               Результат ∙ 12124204[170721374] ←
  1507494[170721844]                                 Уточняющий параметр ≡ РЕГИОН ∙ 1507443[40043162] ←
  1638473[170721545]                               Равно ←
  1507452[170721451]                               Константа ≡ ТТ ∙ 65545[170721761] ←
      411[170721574]                                 Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
 12124213[170721365]                           Параметры ←
  1507335[170721505]                             Параметр • Поставщик ∙ 12124204[170721374] ←
  1507494[170721845]                               Уточняющий параметр ≡ ПОСТАВЩИК ∙ 1507443[43122765] ←
 12124224[170721284]                           Group By  (Группировка) ←
  1507533[170721285]                             Группировать по параметру ≡ Поставщик ∙ 1507335[170721505] ←
 30867466[170721367]                           Выполнить после получения записи ←
 11010080[170722331]                             = ≡ Поставщик ∙ 65545[170721789] ←
      404[170724791]                               Результат ≡ Поставщик ∙ 1507335[170721505] ←
 30867470[170721501]                             IF ←
  1638463[170721544]                               Условие ←
      404[170724792]                                 Результат ≡ Список поставщиков ∙ 65545[170721788] ←
 30867472[170721500]                               THEN ←
 11010080[170722332]                                 = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724793]                                   Результат ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724794]                                   Результат ⁼ , ←
      404[170724795]                                   Результат ≡ Поставщик ∙ 1507335[170721505] ←
      411[170721575]                                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722333]                                 = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724796]                                   Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724797]                                   Результат ⁼ , ←
      404[170724798]                                   Результат ≡ Поставщик ∙ 65545[170721789] ←
      411[170721576]                                     Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721577]                                       Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170721370]                               ELSE ←
 11010080[170722334]                                 = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724799]                                   Результат ≡ Поставщик ∙ 1507335[170721505] ←
      411[170721578]                                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722335]                                 = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724800]                                   Результат ≡ Поставщик ∙ 65545[170721789] ←
      411[170721579]                                     Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721580]                                       Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867470[170721502]                         IF ←
  1638463[170721545]                           Условие ←
  1638460[170721331]                             НЕ ←
      404[170724801]                             Результат ≡ Список поставщиков ∙ 65545[170721788] ←
 30867472[170721501]                           THEN ←
 30867470[170721503]                             IF ←
  1638463[170721546]                               Условие ←
      404[170724802]                                 Результат ≡ Отладка (BUGS) ∙ 249[165478456] ←
 32505862[170721692]                                   Значения формальных параметров при вызове ←
 32505860[170722075]                                     Значение параметра при вызове процедуры/функции ≡ ID ∙ 65545[165480002] ←
   327700[170722161]                                       Выражение ⁼ #545807 ←
 30867472[170721502]                               THEN ←
  1507360[170721363]                                 Отбор данных (по запросу) ≡ Партии с остатком (VPSTOCK) ∙ 12124205[170721318] ←
 30867466[170721368]                                   Выполнить после получения записи ←
 30867470[170721504]                                     IF ←
  1638463[170721547]                                       Условие ←
      404[170724803]                                         Результат ≡ Список поставщиков ∙ 65545[170721788] ←
 30867472[170721503]                                       THEN ←
 11010080[170722336]                                         = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724804]                                           Результат ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724805]                                           Результат ⁼ , ←
      404[170724806]                                           Результат ≡ Партия ∙ 1507335[170721476] ←
      411[170721581]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721582]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722337]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724807]                                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724808]                                           Результат ⁼ , ←
      404[170724809]                                           Результат ≡ Партия ∙ 1507335[170721476] ←
      411[170721583]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721584]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721585]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170721371]                                       ELSE ←
 11010080[170722338]                                         = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724810]                                           Результат ≡ Партия ∙ 1507335[170721476] ←
      411[170721586]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721587]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722339]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724811]                                           Результат ≡ Партия ∙ 1507335[170721476] ←
      411[170721588]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721589]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721590]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[170721320]                                     BREAK ←
 30867473[170721372]                               ELSE ←
  1507360[170721364]                                 Отбор данных (по запросу) ≡ Партии с остатком ∙ 12124205[170721317] ←
 30867466[170721369]                                   Выполнить после получения записи ←
 30867470[170721505]                                     IF ←
  1638463[170721548]                                       Условие ←
      404[170724812]                                         Результат ≡ Список поставщиков ∙ 65545[170721788] ←
 30867472[170721504]                                       THEN ←
 11010080[170722340]                                         = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724813]                                           Результат ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724814]                                           Результат ⁼ , ←
      404[170724815]                                           Результат ≡ Партия ∙ 1507335[170721473] ←
      411[170721591]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721592]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722341]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724816]                                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724817]                                           Результат ⁼ , ←
      404[170724818]                                           Результат ≡ Партия ∙ 1507335[170721473] ←
      411[170721593]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721594]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721595]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170721373]                                       ELSE ←
 11010080[170722342]                                         = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724819]                                           Результат ≡ Партия ∙ 1507335[170721473] ←
      411[170721596]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721597]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722343]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724820]                                           Результат ≡ Партия ∙ 1507335[170721473] ←
      411[170721598]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721599]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721600]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[170721321]                                     BREAK ←
 11010080[170722344]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170724821]                           Результат ≡ ТТ ∙ 65545[170721761] ←
      411[170721601]                             Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
      411[170721602]                               Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
      404[170724822]                           Результат ⁼ ; ←
      404[170724823]                           Результат ≡ ТТ ∙ 65545[170721761] ←
      411[170721603]                             Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      404[170724824]                           Результат ⁼ ; ←
      404[170724825]                           Результат ≡ Продукт из чека ∙ 65545[170721762] ←
      411[170721604]                             Уточняющий параметр ≡ Код ∙ 305[5] ←
      404[170724826]                           Результат ⁼ ; ←
      404[170724827]                           Результат ≡ Продукт из чека ∙ 65545[170721762] ←
      411[170721605]                             Уточняющий параметр ≡ Наименование ∙ 305[6] ←
      404[170724828]                           Результат ⁼ ; ←
      404[170724829]                           Результат ≡ ЛТ Продано ∙ 65545[170721763] ←
      404[170724830]                           Результат ⁼ ; ←
      404[170724831]                           Результат ≡ ЛТ Выставлено ∙ 65545[170721764] ←
      404[170724832]                           Результат ⁼ ; ←
      404[170724833]                           Результат ≡ avg ∙ 249[170721286] ←
 32505862[170721693]                             Значения формальных параметров при вызове ←
 32505860[170722076]                               Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[170721793] ←
   327700[170722162]                                 Выражение ≡ ЛТ Цена (розн.) ∙ 65545[170721765] ←
 32505860[170722077]                               Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[170721792] ←
   327700[170722163]                                 Выражение ≡ Счётчик операций ∙ 65545[170721770] ←
      404[170724834]                           Результат ⁼ ; ←
      404[170724835]                           Результат ≡ avg ∙ 249[170721286] ←
 32505862[170721694]                             Значения формальных параметров при вызове ←
 32505860[170722078]                               Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[170721793] ←
   327700[170722164]                                 Выражение ≡ ЛТ Цена (факт.) ∙ 65545[170721767] ←
 32505860[170722079]                               Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[170721792] ←
   327700[170722165]                                 Выражение ≡ Счётчик операций ∙ 65545[170721770] ←
      404[170724836]                           Результат ⁼ ; ←
      404[170724837]                           Результат ≡ ЛТ Сумма (факт.) ∙ 65545[170721768] ←
      404[170724838]                           Результат ⁼ ; ←
      404[170724839]                           Результат ≡ Списано бонусов ∙ 65545[170721743] ←
      404[170724840]                           Результат ⁼ ; ←
      404[170724841]                           Результат ≡ ЛТ Убыток ∙ 65545[170721769] ←
      404[170724842]                           Результат ⁼ ; ←
      404[170724843]                           Результат ≡ Счётчик операций ∙ 65545[170721770] ←
      404[170724844]                           Результат ⁼ ; ←
      404[170724845]                           Результат ≡ Список приказов ЦС (строка) ∙ 65545[170721783] ←
      404[170724846]                           Результат ⁼ ; ←
      404[170724847]                           Результат ≡ Список скидок ∙ 65545[170721787] ←
      404[170724848]                           Результат ⁼ ; ←
      404[170724849]                           Результат ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724850]                           Результат ⁼ ; ←
      404[170724851]                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724852]                           Результат ⁼ ; ←
      404[170724853]                           Результат ≡ Продукт из чека ∙ 65545[170721762] ←
      411[170721606]                             Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[170721607]                               Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[170721608]                                 Уточняющий параметр ≡ Наименование ∙ 296[6] ←
  1507410[170721435]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 11010107[170721281]                       Выполнить после обработки блока ≡ КД ∙ 30867481[170721282] ←
 11010088[170721571]                         ВЫПОЛНИТЬ ≡ Файл.Закрыть ∙ 249[1507341] ←
 39780367[170721393]                           Файл ≡ Файл ∙ 65545[655299187] ←
 30867470[170721506]                         IF ←
  1638463[170721549]                           Условие ←
      404[170724854]                             Результат ≡ Адрес КД ∙ 65545[170721760] ←
 30867472[170721505]                           THEN ←
 11010088[170721572]                             ВЫПОЛНИТЬ ≡ Передача файла на адреса эл.почты ∙ 127[656081354] ←
 32505862[170721695]                               Значения формальных параметров при вызове ←
 32505860[170722080]                                 Значение параметра при вызове процедуры/функции ≡ Файл имя (ф) ∙ 65545[656084450] ←
   327700[170722166]                                   Выражение ≡ Файл ∙ 65545[655299187] ←
 32505860[170722081]                                 Значение параметра при вызове процедуры/функции ≡ Менять кодировку ∙ 65545[656088207] ←
   327700[170722167]                                   Выражение ⁼ 1 ←
 32505860[170722082]                                 Значение параметра при вызове процедуры/функции ≡ Сообщение письма (ф) ∙ 65545[656084454] ←
   327700[170722168]                                   Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 32505860[170722083]                                 Значение параметра при вызове процедуры/функции ≡ Тема письма (ф) ∙ 65545[656084453] ←
   327700[170722169]                                   Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 12124189[170721288]                                     Выполнить при завершении ←
 39780366[170721308]                                       RETURN ←
      404[170724855]                                         Результат ⁼ 'Отчет уценка за ' ←
      404[170724856]                                         Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[170722170]                                           Выражение ≡ Дата начальная ∙ 381[131078] ←
   131097[170721287]                                           Формат ≡ Дата без времени ∙ 131096[131073] ←
 32505860[170722084]                                 Значение параметра при вызове процедуры/функции ≡ E-mail(ы) получателей  (ф) ∙ 65545[656084452] ←
   327700[170722171]                                   Выражение ≡ Адрес КД ∙ 65545[170721760] ←
 32505860[170722085]                                 Значение параметра при вызове процедуры/функции ≡ Отправлено ∙ 65545[656084440] ←
   327700[170722172]                                   Выражение ≡ Отправлено ∙ 65545[164825640] ←
 32505860[170722086]                                 Значение параметра при вызове процедуры/функции ≡ E-mail отправителя (ф) ∙ 65545[656084451] ←
   327700[170722173]                                   Выражение ⁼ 'd8office@krasyar.ru' ←
 11010088[170721573]                         ВЫПОЛНИТЬ ≡ Файл.Удалить ∙ 249[1507333] ←
 39780367[170721394]                           Файл ≡ Файл ∙ 65545[655299187] ←
 30867477[170721287]                     Отбор данных из локальной таблицы • ДД ≡ Продажи ∙ 30867458[170721284] ←
 30867484[170721282]                       Выполнить перед обработкой блока ≡ ДД ∙ 30867481[170721281] ←
 11010105[170721303]                         Индикатор ⁼ Ученка. Рассылка ДД ←
 11010080[170722345]                         = ≡ Имя ∙ 65545[655299190] ←
      404[170724857]                           Результат ⁼ 'ucenka-' ←
      404[170724858]                           Результат ≡ Случайное число (7 знаков) ∙ 117[1507630] ←
  1507410[170721436]                         ВЫПОЛНИТЬ БЛОК ≡ Создание файла ∙ 30867469[655295596] ←
 11010080[170722346]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170724859]                           Результат ⁼ ; ←
      404[170724860]                           Результат ⁼ Отчёт 20/30/50 за период с ; ←
      404[170724861]                           Результат ≡ Дата начальная ∙ 381[131078] ←
      404[170724862]                           Результат ⁼  по ; ←
      404[170724863]                           Результат ≡ Дата конечная ∙ 381[131079] ←
  1507410[170721437]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 11010080[170722347]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170724864]                           Результат ⁼ Код магазина; ←
      404[170724865]                           Результат ⁼ Магазин; ←
      404[170724866]                           Результат ⁼ Код; ←
      404[170724867]                           Результат ⁼ Продукт; ←
      404[170724868]                           Результат ⁼ Кол-во (факт.); ←
      404[170724869]                           Результат ⁼ Кол-во (приказ); ←
      404[170724870]                           Результат ⁼ Цена (розн); ←
      404[170724871]                           Результат ⁼ Цена (факт); ←
      404[170724872]                           Результат ⁼ Сумма (факт); ←
      404[170724873]                           Результат ⁼ Списано бонусов; ←
      404[170724874]                           Результат ⁼ Убыток; ←
      404[170724875]                           Результат ⁼ Чеков; ←
      404[170724876]                           Результат ⁼ Список приказов; ←
      404[170724877]                           Результат ⁼ Список скидок; ←
      404[170724878]                           Результат ⁼ Поставщик; ←
      404[170724879]                           Результат ⁼ Возврат; ←
      404[170724880]                           Результат ⁼ Группа; ←
  1507410[170721438]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 30867466[170721370]                       Выполнить после получения записи ←
 30867477[170721288]                         Отбор данных из локальной таблицы • собираем приказы  и скидки в строку ≡ Приказы ∙ 30867458[170721285] ←
 30867465[170721298]                           Выполнить при старте ←
 11010080[170722348]                             = ≡ Список приказов ЦС (строка) ∙ 65545[170721783] ←
      404[170724881]                               Результат ⁼ '' ←
 11010080[170722349]                             = ≡ Список скидок ∙ 65545[170721787] ←
      404[170724882]                               Результат ⁼ '' ←
 30867466[170721371]                           Выполнить после получения записи ←
 11010099[170721311]                             CONTINUE ←
      116[170721619]                               Выражение ←
      116[170721620]                                 Выражение ←
      404[170724883]                                   Результат ≡ Приказы : Продукт (приказы) ∙ 65545[170721754] ←
  1638479[170721402]                                   Не равно ←
      404[170724884]                                   Результат ≡ Продукт из чека ∙ 65545[170721762] ←
      412[170721349]                                 ИЛИ ←
      116[170721621]                                 Выражение ←
      404[170724885]                                   Результат ≡ Приказы : Строка приказа ∙ 65545[170721755] ←
      411[170721609]                                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[170721610]                                       Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[170721611]                                         Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638479[170721403]                                   Не равно ←
      404[170724886]                                   Результат ≡ ТТ ∙ 65545[170721761] ←
 11010080[170722350]                             = ≡ Скидка ∙ 65545[170721749] ←
      404[170724887]                               Результат ≡ Приказы : Строка приказа ∙ 65545[170721755] ←
      411[170721612]                                 Уточняющий параметр ≡ Цена закупочная ∙ 359[15007745] ←
 11010080[170722351]                             = ≡ tmpstr ∙ 65545[170721774] ←
      404[170724888]                               Результат ⁼ '' ←
      404[170724889]                               Результат ≡ Скидка ∙ 65545[170721749] ←
      404[170724890]                               Результат ⁼ '' ←
 48431138[170721283]                             &= ≡ Список приказов ЦС (строка) ∙ 65545[170721783] ←
      404[170724891]                               Результат ≡ Приказы : Строка приказа ∙ 65545[170721755] ←
      411[170721613]                                 Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[170721614]                                   Уточняющий параметр ≡ Код ∙ 331[6] ←
      404[170724892]                               Результат ⁼ , ←
  1507728[170721367]                             Начало многострочного комментария ←
 11010088[170721574]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170721395]                               Выражение ←
      404[170724893]                                 Результат ≡ Приказы : Продукт (приказы) ∙ 65545[170721754] ←
      411[170721615]                                   Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
      404[170724894]                                 Результат ⁼ ; ←
      404[170724895]                                 Результат ≡ Приказы : Строка приказа ∙ 65545[170721755] ←
      404[170724896]                                 Результат ⁼ :  Список скидок < ←
      404[170724897]                                 Результат ≡ Список скидок ∙ 65545[170721787] ←
      404[170724898]                                 Результат ⁼ >    Скидка ←
      404[170724899]                                 Результат ≡ tmpstr ∙ 65545[170721774] ←
      404[170724900]                                 Результат ⁼ %,  POS: ←
      116[170721622]                                 Выражение ←
      404[170724901]                                   Результат ≡ POS ∙ 387[1507422] ←
 11010095[170721396]                                     Выражение ←
      404[170724902]                                       Результат ≡ Список скидок ∙ 65545[170721787] ←
  1507510[170721285]                                     Искомая подстрока ←
      404[170724903]                                       Результат ≡ tmpstr ∙ 65545[170721774] ←
 11010073[170721294]                                     Позиция ⁼ 1 ←
  1507729[170721367]                             Конец многострочного комментария ←
 11010099[170721312]                             CONTINUE ←
      116[170721623]                               Выражение ←
      404[170724904]                                 Результат ≡ POS ∙ 387[1507422] ←
 11010095[170721397]                                   Выражение ←
      404[170724905]                                     Результат ≡ Список скидок ∙ 65545[170721787] ←
  1507510[170721286]                                   Искомая подстрока ←
      404[170724906]                                     Результат ≡ tmpstr ∙ 65545[170721774] ←
 11010073[170721295]                                   Позиция ⁼ 1 ←
 48431138[170721284]                             &= ≡ Список скидок ∙ 65545[170721787] ←
      404[170724907]                               Результат ≡ tmpstr ∙ 65545[170721774] ←
      404[170724908]                               Результат ⁼ '%,' ←
  1507728[170721368]                             Начало многострочного комментария ←
 11010088[170721575]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170721398]                               Выражение ←
      404[170724909]                                 Результат ⁼          Список скидок < ←
      404[170724910]                                 Результат ≡ Список скидок ∙ 65545[170721787] ←
      404[170724911]                                 Результат ⁼ > ←
  1507729[170721368]                             Конец многострочного комментария ←
 30867467[170721293]                           Выполнить при завершении ←
 11010093[170721342]                             Комментарий •  обрежем запятую на конце, переменная "Скидка" используется как целочисленный буфер ←
 11010080[170722352]                             = ≡ tmp ∙ 65545[170721773] ←
      404[170724912]                               Результат ≡ LEN ∙ 387[1507420] ←
 11010095[170721399]                                 Выражение ←
      404[170724913]                                   Результат ≡ Список приказов ЦС (строка) ∙ 65545[170721783] ←
      406[170721329]                               Вычесть ←
      404[170724914]                               Результат ⁼ 1 ←
 11010080[170722353]                             = ≡ Список приказов ЦС (строка) ∙ 65545[170721783] ←
      404[170724915]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[170721696]                                 Значения формальных параметров при вызове ←
 32505860[170722087]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[170722174]                                     Выражение ≡ Список приказов ЦС (строка) ∙ 65545[170721783] ←
 32505860[170722088]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[170722175]                                     Выражение ⁼ 1 ←
 32505860[170722089]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[170722176]                                     Выражение ≡ tmp ∙ 65545[170721773] ←
 11010080[170722354]                             = ≡ tmp ∙ 65545[170721773] ←
      116[170721624]                               Выражение ←
      404[170724916]                                 Результат ≡ LEN ∙ 387[1507420] ←
 11010095[170721400]                                   Выражение ←
      404[170724917]                                     Результат ≡ Список скидок ∙ 65545[170721787] ←
      406[170721330]                                 Вычесть ←
      404[170724918]                                 Результат ⁼ 1 ←
 11010080[170722355]                             = ≡ Список скидок ∙ 65545[170721787] ←
      404[170724919]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[170721697]                                 Значения формальных параметров при вызове ←
 32505860[170722090]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[170722177]                                     Выражение ≡ Список скидок ∙ 65545[170721787] ←
 32505860[170722091]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[170722178]                                     Выражение ⁼ 1 ←
 32505860[170722092]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[170722179]                                     Выражение ≡ tmp ∙ 65545[170721773] ←
 11010080[170722356]                         = ≡ Список поставщиков ∙ 65545[170721788] ←
  1638402[170721437]                           NULL ←
  1507360[170721365]                         Отбор данных (по запросу) • Поставщики ←
  1507673[170721296]                           Ключи оптимизации ←
  1507675[170721300]                             Использовать индекс ∙ 12124204[170721375] ←
  1507676[170721300]                               Уточняющий параметр ≡ ПРОДУКТ ∙ 1507445[54919247] ←
 12124200[170721353]                           From         (Таблицы) ←
 12124204[170721375]                             Таблица ≡ СПЕЦИФИКАЦИЯ ПОСТАВЩИКА ∙ 1507433[43122705] ←
 12124215[170721373]                           Where      (Ограничения на отбор данных) ←
  1507376[170721564]                             Выражение ←
  1507455[170721628]                               Результат ∙ 12124204[170721375] ←
  1507494[170721846]                                 Уточняющий параметр ≡ ПРОДУКТ ∙ 1507443[43122766] ←
  1638473[170721546]                               Равно ←
  1507452[170721452]                               Константа ≡ Продукт из чека ∙ 65545[170721762] ←
      413[170721466]                             И ←
  1507376[170721565]                             Выражение ←
  1507455[170721629]                               Результат ∙ 12124204[170721375] ←
  1507494[170721847]                                 Уточняющий параметр ≡ РЕГИОН ∙ 1507443[40043162] ←
  1638473[170721547]                               Равно ←
  1507452[170721453]                               Константа ≡ ТТ ∙ 65545[170721761] ←
      411[170721616]                                 Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
 12124213[170721366]                           Параметры ←
  1507335[170721506]                             Параметр • Поставщик ∙ 12124204[170721375] ←
  1507494[170721848]                               Уточняющий параметр ≡ ПОСТАВЩИК ∙ 1507443[43122765] ←
 12124224[170721285]                           Group By  (Группировка) ←
  1507533[170721286]                             Группировать по параметру ≡ Поставщик ∙ 1507335[170721506] ←
 30867466[170721372]                           Выполнить после получения записи ←
 11010080[170722357]                             = ≡ Поставщик ∙ 65545[170721789] ←
      404[170724920]                               Результат ≡ Поставщик ∙ 1507335[170721506] ←
 30867470[170721507]                             IF ←
  1638463[170721550]                               Условие ←
      404[170724921]                                 Результат ≡ Список поставщиков ∙ 65545[170721788] ←
 30867472[170721506]                               THEN ←
 11010080[170722358]                                 = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724922]                                   Результат ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724923]                                   Результат ⁼ , ←
      404[170724924]                                   Результат ≡ Поставщик ∙ 1507335[170721506] ←
      411[170721617]                                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722359]                                 = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724925]                                   Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724926]                                   Результат ⁼ , ←
      404[170724927]                                   Результат ≡ Поставщик ∙ 65545[170721789] ←
      411[170721618]                                     Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721619]                                       Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170721374]                               ELSE ←
 11010080[170722360]                                 = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724928]                                   Результат ≡ Поставщик ∙ 1507335[170721506] ←
      411[170721620]                                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722361]                                 = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724929]                                   Результат ≡ Поставщик ∙ 65545[170721789] ←
      411[170721621]                                     Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721622]                                       Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867470[170721508]                         IF ←
  1638463[170721551]                           Условие ←
  1638460[170721332]                             НЕ ←
      404[170724930]                             Результат ≡ Список поставщиков ∙ 65545[170721788] ←
 30867472[170721507]                           THEN ←
 30867470[170721509]                             IF ←
  1638463[170721552]                               Условие ←
      404[170724931]                                 Результат ≡ Отладка (BUGS) ∙ 249[165478456] ←
 32505862[170721698]                                   Значения формальных параметров при вызове ←
 32505860[170722093]                                     Значение параметра при вызове процедуры/функции ≡ ID ∙ 65545[165480002] ←
   327700[170722180]                                       Выражение ⁼ #545807 ←
 30867472[170721508]                               THEN ←
  1507360[170721366]                                 Отбор данных (по запросу) ≡ Партии с остатком (VPSTOCK) ∙ 12124205[170721318] ←
 30867466[170721373]                                   Выполнить после получения записи ←
 30867470[170721510]                                     IF ←
  1638463[170721553]                                       Условие ←
      404[170724932]                                         Результат ≡ Список поставщиков ∙ 65545[170721788] ←
 30867472[170721509]                                       THEN ←
 11010080[170722362]                                         = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724933]                                           Результат ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724934]                                           Результат ⁼ , ←
      404[170724935]                                           Результат ≡ Партия ∙ 1507335[170721476] ←
      411[170721623]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721624]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722363]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724936]                                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724937]                                           Результат ⁼ , ←
      404[170724938]                                           Результат ≡ Партия ∙ 1507335[170721476] ←
      411[170721625]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721626]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721627]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170721375]                                       ELSE ←
 11010080[170722364]                                         = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724939]                                           Результат ≡ Партия ∙ 1507335[170721476] ←
      411[170721628]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721629]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722365]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724940]                                           Результат ≡ Партия ∙ 1507335[170721476] ←
      411[170721630]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721631]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721632]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[170721322]                                     BREAK ←
 30867473[170721376]                               ELSE ←
  1507360[170721367]                                 Отбор данных (по запросу) ≡ Партии с остатком ∙ 12124205[170721317] ←
 30867466[170721374]                                   Выполнить после получения записи ←
 30867470[170721511]                                     IF ←
  1638463[170721554]                                       Условие ←
      404[170724941]                                         Результат ≡ Список поставщиков ∙ 65545[170721788] ←
 30867472[170721510]                                       THEN ←
 11010080[170722366]                                         = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724942]                                           Результат ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724943]                                           Результат ⁼ , ←
      404[170724944]                                           Результат ≡ Партия ∙ 1507335[170721473] ←
      411[170721633]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721634]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722367]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724945]                                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724946]                                           Результат ⁼ , ←
      404[170724947]                                           Результат ≡ Партия ∙ 1507335[170721473] ←
      411[170721635]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721636]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721637]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170721377]                                       ELSE ←
 11010080[170722368]                                         = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724948]                                           Результат ≡ Партия ∙ 1507335[170721473] ←
      411[170721638]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721639]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722369]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724949]                                           Результат ≡ Партия ∙ 1507335[170721473] ←
      411[170721640]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721641]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721642]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[170721323]                                     BREAK ←
 11010080[170722370]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170724950]                           Результат ≡ ТТ ∙ 65545[170721761] ←
      411[170721643]                             Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
      411[170721644]                               Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
      404[170724951]                           Результат ⁼ ; ←
      404[170724952]                           Результат ≡ ТТ ∙ 65545[170721761] ←
      411[170721645]                             Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      404[170724953]                           Результат ⁼ ; ←
      404[170724954]                           Результат ≡ Продукт из чека ∙ 65545[170721762] ←
      411[170721646]                             Уточняющий параметр ≡ Код ∙ 305[5] ←
      404[170724955]                           Результат ⁼ ; ←
      404[170724956]                           Результат ≡ Продукт из чека ∙ 65545[170721762] ←
      411[170721647]                             Уточняющий параметр ≡ Наименование ∙ 305[6] ←
      404[170724957]                           Результат ⁼ ; ←
      404[170724958]                           Результат ≡ ЛТ Продано ∙ 65545[170721763] ←
      404[170724959]                           Результат ⁼ ; ←
      404[170724960]                           Результат ≡ ЛТ Выставлено ∙ 65545[170721764] ←
      404[170724961]                           Результат ⁼ ; ←
      404[170724962]                           Результат ≡ avg ∙ 249[170721286] ←
 32505862[170721699]                             Значения формальных параметров при вызове ←
 32505860[170722094]                               Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[170721793] ←
   327700[170722181]                                 Выражение ≡ ЛТ Цена (розн.) ∙ 65545[170721765] ←
 32505860[170722095]                               Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[170721792] ←
   327700[170722182]                                 Выражение ≡ Счётчик операций ∙ 65545[170721770] ←
      404[170724963]                           Результат ⁼ ; ←
      404[170724964]                           Результат ≡ avg ∙ 249[170721286] ←
 32505862[170721700]                             Значения формальных параметров при вызове ←
 32505860[170722096]                               Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[170721793] ←
   327700[170722183]                                 Выражение ≡ ЛТ Цена (факт.) ∙ 65545[170721767] ←
 32505860[170722097]                               Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[170721792] ←
   327700[170722184]                                 Выражение ≡ Счётчик операций ∙ 65545[170721770] ←
      404[170724965]                           Результат ⁼ ; ←
      404[170724966]                           Результат ≡ ЛТ Сумма (факт.) ∙ 65545[170721768] ←
      404[170724967]                           Результат ⁼ ; ←
      404[170724968]                           Результат ≡ Списано бонусов ∙ 65545[170721743] ←
      404[170724969]                           Результат ⁼ ; ←
      404[170724970]                           Результат ≡ ЛТ Убыток ∙ 65545[170721769] ←
      404[170724971]                           Результат ⁼ ; ←
      404[170724972]                           Результат ≡ Счётчик операций ∙ 65545[170721770] ←
      404[170724973]                           Результат ⁼ ; ←
      404[170724974]                           Результат ≡ Список приказов ЦС (строка) ∙ 65545[170721783] ←
      404[170724975]                           Результат ⁼ ; ←
      404[170724976]                           Результат ≡ Список скидок ∙ 65545[170721787] ←
      404[170724977]                           Результат ⁼ ; ←
      404[170724978]                           Результат ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170724979]                           Результат ⁼ ; ←
      404[170724980]                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170724981]                           Результат ⁼ ; ←
      404[170724982]                           Результат ≡ Продукт из чека ∙ 65545[170721762] ←
      411[170721648]                             Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[170721649]                               Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[170721650]                                 Уточняющий параметр ≡ Наименование ∙ 296[6] ←
  1507410[170721439]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 11010107[170721282]                       Выполнить после обработки блока ≡ ДД ∙ 30867481[170721281] ←
 11010088[170721576]                         ВЫПОЛНИТЬ ≡ Файл.Закрыть ∙ 249[1507341] ←
 39780367[170721395]                           Файл ≡ Файл ∙ 65545[655299187] ←
 30867470[170721512]                         IF ←
  1638463[170721555]                           Условие ←
      404[170724983]                             Результат ≡ Адрес ДД ∙ 65545[170721759] ←
 30867472[170721511]                           THEN ←
 11010088[170721577]                             ВЫПОЛНИТЬ ≡ Передача файла на адреса эл.почты ∙ 127[656081354] ←
 32505862[170721701]                               Значения формальных параметров при вызове ←
 32505860[170722098]                                 Значение параметра при вызове процедуры/функции ≡ Файл имя (ф) ∙ 65545[656084450] ←
   327700[170722185]                                   Выражение ≡ Файл ∙ 65545[655299187] ←
 32505860[170722099]                                 Значение параметра при вызове процедуры/функции ≡ Менять кодировку ∙ 65545[656088207] ←
   327700[170722186]                                   Выражение ⁼ 1 ←
 32505860[170722100]                                 Значение параметра при вызове процедуры/функции ≡ Сообщение письма (ф) ∙ 65545[656084454] ←
   327700[170722187]                                   Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 32505860[170722101]                                 Значение параметра при вызове процедуры/функции ≡ Тема письма (ф) ∙ 65545[656084453] ←
   327700[170722188]                                   Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 12124189[170721289]                                     Выполнить при завершении ←
 39780366[170721309]                                       RETURN ←
      404[170724984]                                         Результат ⁼ 'Отчет уценка за ' ←
      404[170724985]                                         Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[170722189]                                           Выражение ≡ Дата начальная ∙ 381[131078] ←
   131097[170721290]                                           Формат ≡ Дата без времени ∙ 131096[131073] ←
 32505860[170722102]                                 Значение параметра при вызове процедуры/функции ≡ E-mail(ы) получателей  (ф) ∙ 65545[656084452] ←
   327700[170722190]                                   Выражение ≡ Адрес ДД ∙ 65545[170721759] ←
 32505860[170722103]                                 Значение параметра при вызове процедуры/функции ≡ Отправлено ∙ 65545[656084440] ←
   327700[170722191]                                   Выражение ≡ Отправлено ∙ 65545[164825640] ←
 32505860[170722104]                                 Значение параметра при вызове процедуры/функции ≡ E-mail отправителя (ф) ∙ 65545[656084451] ←
   327700[170722192]                                   Выражение ⁼ 'd8office@krasyar.ru' ←
 11010088[170721578]                         ВЫПОЛНИТЬ ≡ Файл.Удалить ∙ 249[1507333] ←
 39780367[170721396]                           Файл ≡ Файл ∙ 65545[655299187] ←
 30867473[170721378]                   ELSE ←
 30867477[170721289]                     Отбор данных из локальной таблицы ≡ Продажи ∙ 30867458[170721284] ←
 30867465[170721299]                       Выполнить при старте ←
 11010080[170722371]                         = ≡ Итого убытков ∙ 65545[170721751] ←
      404[170724986]                           Результат ⁼ 0 ←
 11010080[170722372]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170724987]                           Результат ⁼ ; ←
      404[170724988]                           Результат ⁼ Отчёт 20/30/50 за период с ; ←
      404[170724989]                           Результат ≡ Дата начальная ∙ 381[131078] ←
      404[170724990]                           Результат ⁼  по ; ←
      404[170724991]                           Результат ≡ Дата конечная ∙ 381[131079] ←
  1507410[170721440]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 11010080[170722373]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170724992]                           Результат ⁼ Код магазина; ←
      404[170724993]                           Результат ⁼ Магазин; ←
      404[170724994]                           Результат ⁼ Код; ←
      404[170724995]                           Результат ⁼ Продукт; ←
      404[170724996]                           Результат ⁼ Кол-во (факт.); ←
      404[170724997]                           Результат ⁼ Кол-во (приказ); ←
      404[170724998]                           Результат ⁼ Цена (розн); ←
      404[170724999]                           Результат ⁼ Цена (факт); ←
      404[170725000]                           Результат ⁼ Сумма (факт); ←
      404[170725001]                           Результат ⁼ Списано бонусов; ←
      404[170725002]                           Результат ⁼ Убыток; ←
      404[170725003]                           Результат ⁼ Чеков; ←
      404[170725004]                           Результат ⁼ Список приказов; ←
      404[170725005]                           Результат ⁼ Список скидок; ←
      404[170725006]                           Результат ⁼ Поставщик; ←
      404[170725007]                           Результат ⁼ Возврат; ←
      404[170725008]                           Результат ⁼ Группа; ←
  1507410[170721441]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 30867484[170721283]                       Выполнить перед обработкой блока ≡ ТТ ∙ 30867481[170721283] ←
 11010080[170722374]                         = ≡ Итого по ТТ ∙ 65545[170721752] ←
      404[170725009]                           Результат ⁼ 0 ←
 30867466[170721375]                       Выполнить после получения записи ←
 30867477[170721290]                         Отбор данных из локальной таблицы • собираем приказы  и скидки в строку ≡ Приказы ∙ 30867458[170721285] ←
 30867465[170721300]                           Выполнить при старте ←
 11010080[170722375]                             = ≡ Список приказов ЦС (строка) ∙ 65545[170721783] ←
      404[170725010]                               Результат ⁼ '' ←
 11010080[170722376]                             = ≡ Список скидок ∙ 65545[170721787] ←
      404[170725011]                               Результат ⁼ '' ←
 30867466[170721376]                           Выполнить после получения записи ←
 11010099[170721313]                             CONTINUE ←
      116[170721625]                               Выражение ←
      116[170721626]                                 Выражение ←
      404[170725012]                                   Результат ≡ Приказы : Продукт (приказы) ∙ 65545[170721754] ←
  1638479[170721404]                                   Не равно ←
      404[170725013]                                   Результат ≡ Продукт из чека ∙ 65545[170721762] ←
      412[170721350]                                 ИЛИ ←
      116[170721627]                                 Выражение ←
      404[170725014]                                   Результат ≡ Приказы : ТТ ∙ 65545[170721757] ←
  1638479[170721405]                                   Не равно ←
      404[170725015]                                   Результат ≡ ТТ ∙ 65545[170721761] ←
 11010080[170722377]                             = ≡ Скидка ∙ 65545[170721749] ←
      404[170725016]                               Результат ≡ Приказы : Скидка ∙ 65545[170721756] ←
 11010080[170722378]                             = ≡ tmpstr ∙ 65545[170721774] ←
      404[170725017]                               Результат ⁼ '' ←
      404[170725018]                               Результат ≡ Скидка ∙ 65545[170721749] ←
      404[170725019]                               Результат ⁼ '' ←
 48431138[170721285]                             &= ≡ Список приказов ЦС (строка) ∙ 65545[170721783] ←
      404[170725020]                               Результат ≡ Приказы : Код ∙ 65545[170721758] ←
      404[170725021]                               Результат ⁼ , ←
  1507728[170721369]                             Начало многострочного комментария ←
 11010088[170721579]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170721401]                               Выражение ←
      404[170725022]                                 Результат ≡ Приказы : Продукт (приказы) ∙ 65545[170721754] ←
      411[170721651]                                   Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
      404[170725023]                                 Результат ⁼ ; ←
      404[170725024]                                 Результат ≡ Приказы : Строка приказа ∙ 65545[170721755] ←
      404[170725025]                                 Результат ⁼ :  Список скидок < ←
      404[170725026]                                 Результат ≡ Список скидок ∙ 65545[170721787] ←
      404[170725027]                                 Результат ⁼ >    Скидка ←
      404[170725028]                                 Результат ≡ tmpstr ∙ 65545[170721774] ←
      404[170725029]                                 Результат ⁼ %,  POS: ←
      116[170721628]                                 Выражение ←
      404[170725030]                                   Результат ≡ POS ∙ 387[1507422] ←
 11010095[170721402]                                     Выражение ←
      404[170725031]                                       Результат ≡ Список скидок ∙ 65545[170721787] ←
  1507510[170721287]                                     Искомая подстрока ←
      404[170725032]                                       Результат ≡ tmpstr ∙ 65545[170721774] ←
 11010073[170721296]                                     Позиция ⁼ 1 ←
  1507729[170721369]                             Конец многострочного комментария ←
 11010099[170721314]                             CONTINUE ←
      116[170721629]                               Выражение ←
      404[170725033]                                 Результат ≡ POS ∙ 387[1507422] ←
 11010095[170721403]                                   Выражение ←
      404[170725034]                                     Результат ≡ Список скидок ∙ 65545[170721787] ←
  1507510[170721288]                                   Искомая подстрока ←
      404[170725035]                                     Результат ≡ tmpstr ∙ 65545[170721774] ←
 11010073[170721297]                                   Позиция ⁼ 1 ←
 48431138[170721286]                             &= ≡ Список скидок ∙ 65545[170721787] ←
      404[170725036]                               Результат ≡ tmpstr ∙ 65545[170721774] ←
      404[170725037]                               Результат ⁼ '%,' ←
  1507728[170721370]                             Начало многострочного комментария ←
 11010088[170721580]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170721404]                               Выражение ←
      404[170725038]                                 Результат ⁼          Список скидок < ←
      404[170725039]                                 Результат ≡ Список скидок ∙ 65545[170721787] ←
      404[170725040]                                 Результат ⁼ > ←
  1507729[170721370]                             Конец многострочного комментария ←
 30867467[170721294]                           Выполнить при завершении ←
 11010093[170721343]                             Комментарий •  обрежем запятую на конце, переменная "Скидка" используется как целочисленный буфер ←
 11010080[170722379]                             = ≡ tmp ∙ 65545[170721773] ←
      404[170725041]                               Результат ≡ LEN ∙ 387[1507420] ←
 11010095[170721405]                                 Выражение ←
      404[170725042]                                   Результат ≡ Список приказов ЦС (строка) ∙ 65545[170721783] ←
      406[170721331]                               Вычесть ←
      404[170725043]                               Результат ⁼ 1 ←
 11010080[170722380]                             = ≡ Список приказов ЦС (строка) ∙ 65545[170721783] ←
      404[170725044]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[170721702]                                 Значения формальных параметров при вызове ←
 32505860[170722105]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[170722193]                                     Выражение ≡ Список приказов ЦС (строка) ∙ 65545[170721783] ←
 32505860[170722106]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[170722194]                                     Выражение ⁼ 1 ←
 32505860[170722107]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[170722195]                                     Выражение ≡ tmp ∙ 65545[170721773] ←
 11010080[170722381]                             = ≡ tmp ∙ 65545[170721773] ←
      116[170721630]                               Выражение ←
      404[170725045]                                 Результат ≡ LEN ∙ 387[1507420] ←
 11010095[170721406]                                   Выражение ←
      404[170725046]                                     Результат ≡ Список скидок ∙ 65545[170721787] ←
      406[170721332]                                 Вычесть ←
      404[170725047]                                 Результат ⁼ 1 ←
 11010080[170722382]                             = ≡ Список скидок ∙ 65545[170721787] ←
      404[170725048]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[170721703]                                 Значения формальных параметров при вызове ←
 32505860[170722108]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[170722196]                                     Выражение ≡ Список скидок ∙ 65545[170721787] ←
 32505860[170722109]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[170722197]                                     Выражение ⁼ 1 ←
 32505860[170722110]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[170722198]                                     Выражение ≡ tmp ∙ 65545[170721773] ←
 11010080[170722383]                         = ≡ Список поставщиков ∙ 65545[170721788] ←
  1638402[170721438]                           NULL ←
  1507360[170721368]                         Отбор данных (по запросу) • Поставщики ←
  1507673[170721297]                           Ключи оптимизации ←
  1507675[170721301]                             Использовать индекс ∙ 12124204[170721376] ←
  1507676[170721301]                               Уточняющий параметр ≡ ПРОДУКТ ∙ 1507445[54919247] ←
 12124200[170721354]                           From         (Таблицы) ←
 12124204[170721376]                             Таблица ≡ СПЕЦИФИКАЦИЯ ПОСТАВЩИКА ∙ 1507433[43122705] ←
 12124215[170721374]                           Where      (Ограничения на отбор данных) ←
  1507376[170721566]                             Выражение ←
  1507455[170721630]                               Результат ∙ 12124204[170721376] ←
  1507494[170721849]                                 Уточняющий параметр ≡ ПРОДУКТ ∙ 1507443[43122766] ←
  1638473[170721548]                               Равно ←
  1507452[170721454]                               Константа ≡ Продукт из чека ∙ 65545[170721762] ←
      413[170721467]                             И ←
  1507376[170721567]                             Выражение ←
  1507455[170721631]                               Результат ∙ 12124204[170721376] ←
  1507494[170721850]                                 Уточняющий параметр ≡ РЕГИОН ∙ 1507443[40043162] ←
  1638473[170721549]                               Равно ←
  1507452[170721455]                               Константа ≡ ТТ ∙ 65545[170721761] ←
      411[170721652]                                 Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
 12124213[170721367]                           Параметры ←
  1507335[170721507]                             Параметр • Поставщик ∙ 12124204[170721376] ←
  1507494[170721851]                               Уточняющий параметр ≡ ПОСТАВЩИК ∙ 1507443[43122765] ←
 12124224[170721286]                           Group By  (Группировка) ←
  1507533[170721287]                             Группировать по параметру ≡ Поставщик ∙ 1507335[170721507] ←
 30867466[170721377]                           Выполнить после получения записи ←
 11010080[170722384]                             = ≡ Поставщик ∙ 65545[170721789] ←
      404[170725049]                               Результат ≡ Поставщик ∙ 1507335[170721507] ←
 30867470[170721513]                             IF ←
  1638463[170721556]                               Условие ←
      404[170725050]                                 Результат ≡ Список поставщиков ∙ 65545[170721788] ←
 30867472[170721512]                               THEN ←
 11010080[170722385]                                 = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170725051]                                   Результат ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170725052]                                   Результат ⁼ , ←
      404[170725053]                                   Результат ≡ Поставщик ∙ 1507335[170721507] ←
      411[170721653]                                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722386]                                 = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170725054]                                   Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170725055]                                   Результат ⁼ , ←
      404[170725056]                                   Результат ≡ Поставщик ∙ 65545[170721789] ←
      411[170721654]                                     Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721655]                                       Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170721379]                               ELSE ←
 11010080[170722387]                                 = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170725057]                                   Результат ≡ Поставщик ∙ 1507335[170721507] ←
      411[170721656]                                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722388]                                 = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170725058]                                   Результат ≡ Поставщик ∙ 65545[170721789] ←
      411[170721657]                                     Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721658]                                       Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867470[170721514]                         IF ←
  1638463[170721557]                           Условие ←
  1638460[170721333]                             НЕ ←
      404[170725059]                             Результат ≡ Список поставщиков ∙ 65545[170721788] ←
 30867472[170721513]                           THEN ←
 30867470[170721515]                             IF ←
  1638463[170721558]                               Условие ←
      404[170725060]                                 Результат ≡ Отладка (BUGS) ∙ 249[165478456] ←
 32505862[170721704]                                   Значения формальных параметров при вызове ←
 32505860[170722111]                                     Значение параметра при вызове процедуры/функции ≡ ID ∙ 65545[165480002] ←
   327700[170722199]                                       Выражение ⁼ #545807 ←
 30867472[170721514]                               THEN ←
  1507360[170721369]                                 Отбор данных (по запросу) ≡ Партии с остатком (VPSTOCK) ∙ 12124205[170721318] ←
 30867466[170721378]                                   Выполнить после получения записи ←
 30867470[170721516]                                     IF ←
  1638463[170721559]                                       Условие ←
      404[170725061]                                         Результат ≡ Список поставщиков ∙ 65545[170721788] ←
 30867472[170721515]                                       THEN ←
 11010080[170722389]                                         = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170725062]                                           Результат ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170725063]                                           Результат ⁼ , ←
      404[170725064]                                           Результат ≡ Партия ∙ 1507335[170721476] ←
      411[170721659]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721660]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722390]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170725065]                                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170725066]                                           Результат ⁼ , ←
      404[170725067]                                           Результат ≡ Партия ∙ 1507335[170721476] ←
      411[170721661]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721662]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721663]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170721380]                                       ELSE ←
 11010080[170722391]                                         = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170725068]                                           Результат ≡ Партия ∙ 1507335[170721476] ←
      411[170721664]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721665]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722392]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170725069]                                           Результат ≡ Партия ∙ 1507335[170721476] ←
      411[170721666]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721667]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721668]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[170721324]                                     BREAK ←
 30867473[170721381]                               ELSE ←
  1507360[170721370]                                 Отбор данных (по запросу) ≡ Партии с остатком ∙ 12124205[170721317] ←
 30867466[170721379]                                   Выполнить после получения записи ←
 30867470[170721517]                                     IF ←
  1638463[170721560]                                       Условие ←
      404[170725070]                                         Результат ≡ Список поставщиков ∙ 65545[170721788] ←
 30867472[170721516]                                       THEN ←
 11010080[170722393]                                         = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170725071]                                           Результат ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170725072]                                           Результат ⁼ , ←
      404[170725073]                                           Результат ≡ Партия ∙ 1507335[170721473] ←
      411[170721669]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721670]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722394]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170725074]                                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170725075]                                           Результат ⁼ , ←
      404[170725076]                                           Результат ≡ Партия ∙ 1507335[170721473] ←
      411[170721671]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721672]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721673]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170721382]                                       ELSE ←
 11010080[170722395]                                         = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170725077]                                           Результат ≡ Партия ∙ 1507335[170721473] ←
      411[170721674]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721675]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722396]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170725078]                                           Результат ≡ Партия ∙ 1507335[170721473] ←
      411[170721676]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721677]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721678]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[170721325]                                     BREAK ←
 30867469[170721425]                         БЛОК • ---- ←
 39780361[170721310]                           ЗАВЕРШИТЬ БЛОК ←
 30867470[170721518]                           IF ←
  1638463[170721561]                             Условие ←
  1638460[170721334]                               НЕ ←
      404[170725079]                               Результат ≡ Список поставщиков ∙ 65545[170721788] ←
 30867472[170721517]                             THEN ←
  1507360[170721371]                               Отбор данных (по запросу) ≡ Партии с остатком ∙ 12124205[170721317] ←
 30867466[170721380]                                 Выполнить после получения записи ←
 30867470[170721519]                                   IF ←
  1638463[170721562]                                     Условие ←
      404[170725080]                                       Результат ≡ Список поставщиков ∙ 65545[170721788] ←
 30867472[170721518]                                     THEN ←
 11010080[170722397]                                       = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170725081]                                         Результат ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170725082]                                         Результат ⁼ , ←
      404[170725083]                                         Результат ≡ Партия ∙ 1507335[170721473] ←
      411[170721679]                                           Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721680]                                             Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722398]                                       = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170725084]                                         Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170725085]                                         Результат ⁼ , ←
      404[170725086]                                         Результат ≡ Партия ∙ 1507335[170721473] ←
      411[170721681]                                           Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721682]                                             Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721683]                                               Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170721383]                                     ELSE ←
 11010080[170722399]                                       = ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170725087]                                         Результат ≡ Партия ∙ 1507335[170721473] ←
      411[170721684]                                           Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721685]                                             Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170722400]                                       = ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170725088]                                         Результат ≡ Партия ∙ 1507335[170721473] ←
      411[170721686]                                           Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170721687]                                             Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170721688]                                               Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[170721326]                                   BREAK ←
 11010080[170722401]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170725089]                           Результат ≡ ТТ ∙ 65545[170721761] ←
      411[170721689]                             Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
      411[170721690]                               Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
      404[170725090]                           Результат ⁼ ; ←
      404[170725091]                           Результат ≡ ТТ ∙ 65545[170721761] ←
      411[170721691]                             Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      404[170725092]                           Результат ⁼ ; ←
      404[170725093]                           Результат ≡ Продукт из чека ∙ 65545[170721762] ←
      411[170721692]                             Уточняющий параметр ≡ Код ∙ 305[5] ←
      404[170725094]                           Результат ⁼ ; ←
      404[170725095]                           Результат ≡ Продукт из чека ∙ 65545[170721762] ←
      411[170721693]                             Уточняющий параметр ≡ Наименование ∙ 305[6] ←
      404[170725096]                           Результат ⁼ ; ←
      404[170725097]                           Результат ≡ ЛТ Продано ∙ 65545[170721763] ←
      404[170725098]                           Результат ⁼ ; ←
      404[170725099]                           Результат ≡ ЛТ Выставлено ∙ 65545[170721764] ←
      404[170725100]                           Результат ⁼ ; ←
      404[170725101]                           Результат ≡ avg ∙ 249[170721286] ←
 32505862[170721705]                             Значения формальных параметров при вызове ←
 32505860[170722112]                               Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[170721793] ←
   327700[170722200]                                 Выражение ≡ ЛТ Цена (розн.) ∙ 65545[170721765] ←
 32505860[170722113]                               Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[170721792] ←
   327700[170722201]                                 Выражение ≡ Счётчик операций ∙ 65545[170721770] ←
      404[170725102]                           Результат ⁼ ; ←
      404[170725103]                           Результат ≡ avg ∙ 249[170721286] ←
 32505862[170721706]                             Значения формальных параметров при вызове ←
 32505860[170722114]                               Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[170721793] ←
   327700[170722202]                                 Выражение ≡ ЛТ Цена (факт.) ∙ 65545[170721767] ←
 32505860[170722115]                               Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[170721792] ←
   327700[170722203]                                 Выражение ≡ Счётчик операций ∙ 65545[170721770] ←
      404[170725104]                           Результат ⁼ ; ←
      404[170725105]                           Результат ≡ ЛТ Сумма (факт.) ∙ 65545[170721768] ←
      404[170725106]                           Результат ⁼ ; ←
      404[170725107]                           Результат ≡ Списано бонусов ∙ 65545[170721743] ←
      404[170725108]                           Результат ⁼ ; ←
      404[170725109]                           Результат ≡ ЛТ Убыток ∙ 65545[170721769] ←
      404[170725110]                           Результат ⁼ ; ←
      404[170725111]                           Результат ≡ Счётчик операций ∙ 65545[170721770] ←
      404[170725112]                           Результат ⁼ ; ←
      404[170725113]                           Результат ≡ Список приказов ЦС (строка) ∙ 65545[170721783] ←
      404[170725114]                           Результат ⁼ ; ←
      404[170725115]                           Результат ≡ Список скидок ∙ 65545[170721787] ←
      404[170725116]                           Результат ⁼ ; ←
      404[170725117]                           Результат ≡ Список поставщиков ∙ 65545[170721788] ←
      404[170725118]                           Результат ⁼ ; ←
      404[170725119]                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[170721790] ←
      404[170725120]                           Результат ⁼ ; ←
      404[170725121]                           Результат ≡ Продукт из чека ∙ 65545[170721762] ←
      411[170721694]                             Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[170721695]                               Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[170721696]                                 Уточняющий параметр ≡ Наименование ∙ 296[6] ←
  1507410[170721442]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 11010093[170721344]                         Комментарий • заявка 408683. Хотели итоги по отчету. Сделал по аналогии с ускоренным (127[2518-160]) ←
 30867470[170721520]                         IF ←
  1638463[170721563]                           Условие ←
      404[170725122]                             Результат ≡ ЛТ Убыток ∙ 65545[170721769] ←
 30867472[170721519]                           THEN ←
 48431132[170721311]                             += ≡ Итого убытков ∙ 65545[170721751] ←
      404[170725123]                               Результат ≡ ЛТ Убыток ∙ 65545[170721769] ←
 48431132[170721312]                             += ≡ Итого по ТТ ∙ 65545[170721752] ←
      404[170725124]                               Результат ≡ ЛТ Убыток ∙ 65545[170721769] ←
 11010107[170721283]                       Выполнить после обработки блока ≡ ТТ ∙ 30867481[170721283] ←
 11010080[170722402]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170725125]                           Результат ≡ ТТ ∙ 65545[170721761] ←
      411[170721697]                             Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
      411[170721698]                               Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
      404[170725126]                           Результат ⁼ ; ←
      404[170725127]                           Результат ⁼ Итого по ТТ; ←
      404[170725128]                           Результат ⁼ ; ←
      404[170725129]                           Результат ⁼ ; ←
      404[170725130]                           Результат ⁼ ; ←
      404[170725131]                           Результат ⁼ ; ←
      404[170725132]                           Результат ⁼ ; ←
      404[170725133]                           Результат ⁼ ; ←
      404[170725134]                           Результат ⁼ ; ←
      404[170725135]                           Результат ≡ Итого по ТТ ∙ 65545[170721752] ←
      404[170725136]                           Результат ⁼ ; ←
      404[170725137]                           Результат ⁼ ; ←
      404[170725138]                           Результат ≡ CR+LF ∙ 117[1508547] ←
  1507410[170721443]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 30867467[170721295]                       Выполнить при завершении ←
 11010080[170722403]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170725139]                           Результат ⁼ ; ←
      404[170725140]                           Результат ⁼ Итого; ←
      404[170725141]                           Результат ⁼ ; ←
      404[170725142]                           Результат ⁼ ; ←
      404[170725143]                           Результат ⁼ ; ←
      404[170725144]                           Результат ⁼ ; ←
      404[170725145]                           Результат ⁼ ; ←
      404[170725146]                           Результат ⁼ ; ←
      404[170725147]                           Результат ⁼ ; ←
      404[170725148]                           Результат ≡ Итого убытков ∙ 65545[170721751] ←
      404[170725149]                           Результат ⁼ ; ←
      404[170725150]                           Результат ⁼ ; ←
  1507410[170721444]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 30867473[170721399]           ELSE ←
 11010088[170721603]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 387[59375699] ←
 32505862[170721729]               Значения формальных параметров при вызове ←
 32505860[170722171]                 Значение параметра при вызове процедуры/функции ≡ Текст сообщения ∙ 65545[59378874] ←
   327700[170722264]                   Выражение ⁼ Не задано подразделение !!! ←
 11010104[170721288]         Очистить локальную таблицу ≡ Приказы ∙ 30867458[170721285] ←
 11010104[170721289]         Очистить локальную таблицу ≡ Продажи ∙ 30867458[170721284] ←
