ETK\Admin

      127[164823593]   Процедура • Отчет револьвер ДМП ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505861[164823184]     Формальные параметры ←
    65545[164823942]       Локальная переменная • Автоматически ≡ bool ∙ 107[1507344] ←
      355[164823194]         Начальное значение ≡ false ∙ 117[30867469] ←
    65545[164829574]       Локальная переменная • Группа документов ПРОМО-акций, на которую нужно сделать рассылку ≡ Список документов ∙ 107[1507335] ←
      355[164824357]         Начальное значение ≡ NULL ∙ 117[30670850] ←
 32505863[164823372]     Локальные переменные ←
 30867495[164823091]       Группа локальных переменных • Форма ввода ←
    65545[164827783]         Локальная переменная • Дата формирования ≡ Дата ∙ 107[3] ←
    65545[164827784]         Локальная переменная • Подразделения ≡ Список партнеров ∙ 107[1507332] ←
    65545[164827787]         Локальная переменная • Товар ≡ Продукт ∙ 107[7] ←
    65545[164824662]         Локальная переменная • Показывать текущее промо ≡ Признак (Да/Нет) ∙ 107[131203074] ←
      355[164823140]           Начальное значение ≡ Нет ∙ 131203075[131203073] ←
    65545[164824663]         Локальная переменная • Показывать распродажи ≡ Признак (Да/Нет) ∙ 107[131203074] ←
      355[164823236]           Начальное значение ≡ Нет ∙ 131203075[131203073] ←
    65545[164823940]       Локальная переменная • Дата начальная (для заказов) ≡ Дата ∙ 107[3] ←
    65545[164823941]       Локальная переменная • Дата конечная (для заказов) ≡ Дата ∙ 107[3] ←
    65545[164827786]       Локальная переменная • Перечень товаров для акции (список) ≡ Список документов ∙ 107[1507335] ←
    65545[164827785]       Локальная переменная • Перечень товаров для акции (документ) ≡ Документ ∙ 107[8] ←
    65545[164827788]       Локальная переменная • ЦО ≡ Партнер ∙ 107[5] ←
    65545[164824006]       Локальная переменная • ЦО наименование ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[164823939]       Локальная переменная • Список ТТ и ЦО для поиска заказов ≡ Список партнеров ∙ 107[1507332] ←
    65545[164827789]       Локальная переменная • Номер ДМП ≡ Наименование объекта (80) ∙ 107[262147] ←
    65545[164827790]       Локальная переменная • Продукт ≡ Продукт ∙ 107[7] ←
    65545[164827791]       Локальная переменная • Спецценник ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[164823944]       Локальная переменная • Наименование документа ПРОМО ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[164824052]       Локальная переменная • Распеденное значение на ПРОМО ≡ Число ∙ 107[4] ←
    65545[164824024]       Локальная переменная • Тип оборудования ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[164827792]       Локальная переменная • Документ промо ≡ Объект ∙ 107[19] ←
    65545[164823938]       Локальная переменная • Список заказов/приходов ≡ Список документов ∙ 107[1507335] ←
    65545[164823923]       Локальная переменная • Дата начала ≡ Дата ∙ 107[3] ←
    65545[164823924]       Локальная переменная • Дата окончания ≡ Дата ∙ 107[3] ←
    65545[164827967]       Локальная переменная • Документ распродажа ≡ Объект ∙ 107[19] ←
    65545[164827994]       Локальная переменная • Оборудование ДМП ≡ Объект ∙ 107[19] ←
    65545[164827854]       Локальная переменная • Расшифровка ДМП ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[164827958]       Локальная переменная • Торец ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[164827855]       Локальная переменная • Список типов ДМП для расшифровки ≡ Список объектов ∙ 107[1507330] ←
    65545[164827856]       Локальная переменная • i ≡ Число ∙ 107[4] ←
    65545[164823936]       Локальная переменная • Остаток ≡ Число ∙ 107[4] ←
    65545[164823937]       Локальная переменная • Фьючерсный приход ≡ Строка для примечания (4000 знаков) ∙ 107[30867457] ←
    65545[164823943]       Локальная переменная • Адреса ≡ Строка для примечания (4000 знаков) ∙ 107[30867457] ←
    65545[164824005]       Локальная переменная • Файл на ТТ ≡ Строка для примечания (4000 знаков) ∙ 107[30867457] ←
    65545[164824007]       Локальная переменная • Файл отчета ≡ Строка для примечания (4000 знаков) ∙ 107[30867457] ←
 12124192[164823049]     Шаблоны отчетов ←
 12124193[164823062]       Шаблон отчета • ПРОМО ДМП ≡ Базовый шаблон ∙ 12124193[1507346] ⁼ {{Заголовок}}
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
   <link rel=stylesheet href="file:{STYLE}" type="text/css">
</head>
<body>
<p>Отпечатано {Текущая дата}</p>

<H1 align=center>Дополнительные места продаж на {Дата формирования}</H1>

{{Шапка по 1 ТТ}}

<table class=MainTable border=1 width=95% cellspacing=0 cellpadding=4>
<tr>
  <td class=TableHeader>КЯ</td>
  <td class=TableHeader>ДМП</td>
  <td class=TableHeader>Код товара</td>
  <td class=TableHeader>Наименование</td>
  <td class=TableHeader>Тип спецценника</td>
  <td class=TableHeader>Текущий остаток</td>
  <td class=TableHeader>Объем распреденный на ПРОМО</td>
  <td class=TableHeader>Фьючерсный приход</td>
  <td class=TableHeader>Акция</td>
  <td class=TableHeader>Дата начала</td>
  <td class=TableHeader>Дата окончания</td>
</tr>

{{Шапка по сети}}

<table class=MainTable border=1 width=95% cellspacing=0 cellpadding=4>
<tr>
  <td class=TableHeader>КЯ</td>
  <td class=TableHeader>ДМП</td>
  <td class=TableHeader>Код товара</td>
  <td class=TableHeader>Наименование</td>
  <td class=TableHeader>Тип спецценника</td>
  <td class=TableHeader>Текущий остаток</td>
  <td class=TableHeader>Объем распреденный на ПРОМО</td>
  <td class=TableHeader>Фьючерсный приход</td>
  <td class=TableHeader>Акция</td>
  <td class=TableHeader>Дата начала</td>
  <td class=TableHeader>Дата окончания</td>
</tr>

{{Шапка по SKU}}

<table class=MainTable border=1 width=95% cellspacing=0 cellpadding=4>
<tr>
  <td class=TableHeader>КЯ</td>
  <td class=TableHeader>ДМП</td>
  <td class=TableHeader>Тип спецценника</td>
  <td class=TableHeader>Текущий остаток</td>
  <td class=TableHeader>Объем распреденный на ПРОМО</td>
  <td class=TableHeader>Фьючерсный приход</td>
  <td class=TableHeader>Акция</td>
  <td class=TableHeader>Дата начала</td>
  <td class=TableHeader>Дата окончания</td>
</tr>

{{Подразделение}}
<tr class=TableLine>
  <td colspan=11>{Подразеделение}</td>
</tr>

{{Подразделение по SKU}}
<tr class=TableLine>
  <td colspan=9>{Подразеделение}</td>
</tr>

{{Строка по 1 ТТ}}

<tr>
  <td>{КЯ}</td>
  <td>{ДМП}</td>
  <td>{Код товара}</td>
  <td>{Наименование товара}</td>
  <td>{Спецценник}</td>
  <td>{Остаток}</td>
  <td>{Распределенное количество}</td>
  <td>{Фьючерс}</td>
  <td>{Акция}</td>
  <td>{Дата начала}</td>
  <td>{Дата окончания}</td>
</tr>

{{Строка по сети}}

<tr>
  <td>{КЯ}</td>
  <td>{ДМП}</td>
  <td>{Код товара}</td>
  <td>{Наименование товара}</td>
  <td>{Спецценник}</td>
  <td>{Остаток}</td>
  <td>{Распределенное количество}</td>
  <td>{Фьючерс}</td>
  <td>{Акция}</td>
  <td>{Дата начала}</td>
  <td>{Дата окончания}</td>
</tr>

{{Строка по SKU}}

<tr>
  <td>{КЯ}</td>
  <td>{ДМП}</td>
  <td>{Спецценник}</td>
  <td>{Остаток}</td>
  <td>{Распределенное количество}</td>
  <td>{Фьючерс}</td>
  <td>{Акция}</td>
  <td>{Дата начала}</td>
  <td>{Дата окончания}</td>
</tr>

{{Закрыть таблицу}}

</table>

{{Строка расшифровки ДМП}}
<p>{Расшифровка}</p>

{{Конец файла}}
</body>
 ←
 12124195[164823042]         Блоки шаблона ←
 12124197[164823062]           Блок шаблона • Заголовок ←
 12124197[164823056]           Блок шаблона • Шапка по 1 ТТ ←
 12124197[164823057]           Блок шаблона • Шапка по сети ←
 12124197[164823058]           Блок шаблона • Шапка по SKU ←
 12124197[164823072]           Блок шаблона • Подразделение ←
 12124197[164823073]           Блок шаблона • Подразделение по SKU ←
 12124197[164823059]           Блок шаблона • Строка по 1 ТТ ←
 12124197[164823060]           Блок шаблона • Строка по сети ←
 12124197[164823061]           Блок шаблона • Строка по SKU ←
 12124197[164823066]           Блок шаблона • Закрыть таблицу ←
 12124197[164823068]           Блок шаблона • Строка расшифровки ДМП ←
 12124197[164823067]           Блок шаблона • Конец файла ←
 12124194[164823062]         Поля шаблона ←
 12124196[164823849]           Поле шаблона • STYLE ≡ Стиль 1 (голубой мелкий) ∙ 381[11534337] ←
 12124196[164823850]           Поле шаблона • ----------- ←
 12124196[164823114]           Поле шаблона • Текущая дата ≡ Текущие дата-время ∙ 249[42467332] ←
   131097[164824112]             Формат ≡ Дата + Время без секунд (DD-MM-YYYY HH:NN) ∙ 131096[56033281] ←
 12124196[164823712]           Поле шаблона • Дата формирования ≡ Дата формирования ∙ 65545[164827783] ←
   131097[164823146]             Формат ≡ Дата без времени ∙ 131096[131073] ←
 12124196[164823115]           Поле шаблона • КЯ ≡ ЦО ∙ 65545[164827788] ←
      411[164831877]             Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
 12124196[164823116]           Поле шаблона • ДМП ≡ Номер ДМП ∙ 65545[164827789] ←
 12124196[164823176]           Поле шаблона • Тип оборудования ≡ Тип оборудования ∙ 65545[164824024] ←
 12124196[164823117]           Поле шаблона • Код товара ≡ Продукт ∙ 65545[164827790] ←
      411[164831878]             Уточняющий параметр ≡ Код ∙ 305[5] ←
 12124196[164823118]           Поле шаблона • Наименование товара ≡ Продукт ∙ 65545[164827790] ←
      411[164831879]             Уточняющий параметр ≡ Наименование ∙ 305[6] ←
 12124196[164823119]           Поле шаблона • Спецценник ≡ Спецценник ∙ 65545[164827791] ←
 12124196[164823713]           Поле шаблона • Остаток ≡ Остаток ∙ 65545[164823936] ←
   131097[164823152]             Формат ≡ Количество N19.3 ∙ 131096[30867458] ←
 12124196[164823714]           Поле шаблона • Фьючерс ≡ Фьючерсный приход ∙ 65545[164823937] ←
 12124196[164823175]           Поле шаблона • Распределенное количество ≡ Распеденное значение на ПРОМО ∙ 65545[164824052] ←
 12124196[164823120]           Поле шаблона • Акция ≡ Наименование документа ПРОМО ∙ 65545[164823944] ←
 12124196[164823122]           Поле шаблона • Дата начала ≡ Дата начала ∙ 65545[164823923] ←
   131097[164824116]             Формат ≡ Дата без времени ∙ 131096[131073] ←
 12124196[164823121]           Поле шаблона • Дата окончания ≡ Дата окончания ∙ 65545[164823924] ←
   131097[164824114]             Формат ≡ Дата без времени ∙ 131096[131073] ←
 12124196[164823125]           Поле шаблона • Расшифровка ≡ Расшифровка ДМП ∙ 65545[164827854] ←
 12124196[164823848]           Поле шаблона • Торец ≡ Торец ∙ 65545[164827958] ←
 12124196[164823715]           Поле шаблона • Подразеделение ≡ ЦО ∙ 65545[164827788] ←
      411[164832775]             Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
 12124196[164824468]           Поле шаблона • Оборудование ≡ Оборудование ДМП ∙ 65545[164827994] ←
      411[164835303]             Уточняющий параметр ≡ Наименование ∙ 296[6] ←
 30867463[164823648]     Выполнить действия ←
 30867469[164823887]       БЛОК ≡ Инициализация ∙ 30867469[12058692] ←
 30867470[164825969]         IF ←
  1638463[164826596]           Условие ←
      116[164826859]             Выражение ←
      404[164856821]               Результат ≡ День недели 1..6 (Воскресенье = 7) ∙ 249[164298831] ←
 32505862[164827022]                 Значения формальных параметров при вызове ←
 32505860[164831638]                   Значение параметра при вызове процедуры/функции ≡ фп Дата ∙ 65545[164301597] ←
   327700[164834602]                     Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
  1638477[164823546]               Больше или равно ←
      404[164856822]               Результат ⁼ 2 ←
      413[164827192]             И ←
      116[164826860]             Выражение ←
      404[164856823]               Результат ≡ День недели 1..6 (Воскресенье = 7) ∙ 249[164298831] ←
 32505862[164827023]                 Значения формальных параметров при вызове ←
 32505860[164831639]                   Значение параметра при вызове процедуры/функции ≡ фп Дата ∙ 65545[164301597] ←
   327700[164834603]                     Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
  1638475[164823309]               Меньше или равно ←
      404[164856824]               Результат ⁼ 4 ←
 30867472[164825923]           THEN ←
 11010080[164833654]             = ≡ Дата формирования ∙ 65545[164827783] ←
      404[164854886]               Результат ≡ Сегодня, начало дня ∙ 249[2293761] ←
      380[164823905]               Сложить ←
      116[164826861]               Выражение ←
      404[164856826]                 Результат ≡ Сутки ∙ 117[16843851] ←
      403[164823826]                 Умножить ←
      116[164826862]                 Выражение ←
      404[164856827]                   Результат ⁼ 4 ←
      406[164823870]                   Вычесть ←
      404[164856828]                   Результат ≡ День недели 1..6 (Воскресенье = 7) ∙ 249[164298831] ←
 32505862[164827020]                     Значения формальных параметров при вызове ←
 32505860[164831635]                       Значение параметра при вызове процедуры/функции ≡ фп Дата ∙ 65545[164301597] ←
   327700[164834601]                         Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 30867473[164824117]           ELSE ←
 11010080[164834166]             = ≡ Дата формирования ∙ 65545[164827783] ←
      404[164856825]               Результат ≡ Сегодня, начало дня ∙ 249[2293761] ←
 11010080[164833768]         = ≡ Список типов ДМП для расшифровки ∙ 65545[164827855] ←
  1638402[164824524]           NULL ←
 30867470[164825975]         IF ←
  1638463[164826604]           Условие ←
  1638460[164823814]             НЕ ←
      404[164828578]             Результат ≡ Автоматически ∙ 65545[164823942] ←
 30867472[164825930]           THEN ←
 12124190[164823266]             Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823279]               Список полей формы ←
      598[164824188]                 Поле (колонка) для ввода данных ≡ Дата формирования ∙ 65545[164827783] ←
      598[164824106]                 Поле (колонка) для ввода данных ≡ Подразделения ∙ 65545[164827784] ←
  2621481[164823286]                   Доступно (видимо), если: ≡ Текущий узел является консолидированной базой ∙ 249[1507768] ←
 29163536[164823345]                   Отображаемый текст для объектов БД ≡ Наименование ∙ 283[5] ←
      209[164823545]                   Выбор из списка ≡ Торговые точки (Магазины) + РЦ + ПЦ ∙ 371[144310390] ←
   262165[164823154]                     Выбор нескольких объектов из списка ≡ Да ∙ 534[40566785] ←
 41746466[164823053]                     Ограничения по классам/типам ←
   262158[164823086]                       Ограничение на класс/тип объектов ≡ Торговая точка (Магазин) ∙ 284[40566786] ←
  1638486[164823071]                     Ограничение на отбор данных ←
 41746472[164823066]                       Where ≡ Не рассчитывать скорость продаж ∙ 283[43122692] ←
 41746478[164823066]                         Равно ≡ Да ∙ 131203075[131203074] ←
      598[164824107]                 Поле (колонка) для ввода данных ≡ Товар ∙ 65545[164827787] ←
      209[164823544]                   Выбор из списка ≡ Выбор справочник товаров (Магазин) ∙ 371[164823146] ←
   262164[164823104]                     Выбор одного объекта из списка ≡ Да ∙ 534[40566785] ←
 29163536[164823344]                   Отображаемый текст для объектов БД ≡ Наименование ∙ 305[6] ←
      598[164823163]                 Поле (колонка) для ввода данных ≡ Показывать текущее промо ∙ 65545[164824662] ←
      598[164823164]                 Поле (колонка) для ввода данных ≡ Показывать распродажи ∙ 65545[164824663] ←
 30867469[164823889]       БЛОК ≡ Печать данных ∙ 30867469[12058690] ←
 11010105[164823289]         Индикатор ←
      404[164854388]           Результат ⁼ Поиск документов ←
 30867470[164825976]         IF ←
  1638463[164826605]           Условие ←
  1638460[164823815]             НЕ ←
      404[164828580]             Результат ≡ Автоматически ∙ 65545[164823942] ←
 30867472[164825931]           THEN ←
 11010080[164824267]             = ≡ Файл отчета ∙ 65545[164824007] ←
      404[164824505]               Результат ⁼ 'C:\\Domino8\\HOME\\dmp_' ←
      404[164826428]               Результат ≡ СЛУЧАЙНОЕ ЧИСЛО ∙ 387[1638412] ←
  1638458[164823087]                 Минимальное значение ⁼ 10 ←
  1638459[164823086]                 Максимальное значение ⁼ 50 ←
      404[164826462]               Результат ⁼ '.htm' ←
 11010088[164825551]             ВЫПОЛНИТЬ ≡ Отчет.Инициализация ∙ 249[12124171] ←
 39780367[164824174]               Файл ≡ Файл отчета ∙ 65545[164824007] ←
 12124199[164823089]               Ссылка на шаблон ≡ ПРОМО ДМП ∙ 12124193[164823062] ←
 11010088[164825396]             ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164823683]               Файл ≡ Файл отчета ∙ 65545[164824007] ←
 39780357[164823337]               Ссылка на блок шаблона ≡ Заголовок ∙ 12124197[164823062] ←
 30867470[164825791]             IF ←
  1638463[164826381]               Условие ←
      404[164854409]                 Результат ≡ Товар ∙ 65545[164827787] ←
 30867472[164825750]               THEN ←
 11010088[164825547]                 ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164823635]                   Файл ≡ Файл отчета ∙ 65545[164824007] ←
 39780357[164823079]                   Ссылка на блок шаблона ≡ Шапка по SKU ∙ 12124197[164823058] ←
 30867473[164824021]               ELSE ←
 30867470[164825792]                 IF ←
  1638463[164826382]                   Условие ←
      404[164854410]                     Результат ≡ Подразделения ∙ 65545[164827784] ←
 30867472[164825751]                   THEN ←
 11010088[164825548]                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164823636]                       Файл ≡ Файл отчета ∙ 65545[164824007] ←
 39780357[164823080]                       Ссылка на блок шаблона ≡ Шапка по 1 ТТ ∙ 12124197[164823056] ←
 30867473[164824022]                   ELSE ←
 11010088[164825549]                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164823637]                       Файл ≡ Файл отчета ∙ 65545[164824007] ←
 39780357[164823087]                       Ссылка на блок шаблона ≡ Шапка по сети ∙ 12124197[164823057] ←
 11010080[164834220]         = ≡ Дата начальная (для заказов) ∙ 65545[164823940] ←
      404[164828544]           Результат ≡ Дата, начало дня ∙ 249[30867471] ←
 32505862[164827055]             Значения формальных параметров при вызове ←
 32505860[164831731]               Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867497] ←
   327700[164834729]                 Выражение ≡ Дата формирования ∙ 65545[164827783] ←
 30867470[164823487]         IF ←
  1638463[164823575]           Условие ←
      404[164828545]             Результат ≡ День недели 1..6 (Воскресенье = 7) ∙ 249[164298831] ←
 32505862[164827058]               Значения формальных параметров при вызове ←
 32505860[164831734]                 Значение параметра при вызове процедуры/функции ≡ фп Дата ∙ 65545[164301597] ←
   327700[164834745]                   Выражение ≡ Дата формирования ∙ 65545[164827783] ←
  1638476[164823263]             Меньше ←
      404[164828546]             Результат ⁼ 4 ←
 30867472[164823478]           THEN ←
 11010080[164834221]             = ≡ Дата конечная (для заказов) ∙ 65545[164823941] ←
      404[164828518]               Результат ≡ Дата, конец дня ∙ 249[30867475] ←
 32505862[164827057]                 Значения формальных параметров при вызове ←
 32505860[164831733]                   Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
   327700[164834744]                     Выражение ≡ Дата формирования ∙ 65545[164827783] ←
      380[164823047]               Сложить ←
      116[164823486]               Выражение ←
      116[164823485]                 Выражение ←
      116[164823484]                   Выражение ←
      404[164828548]                     Результат ⁼ 4 ←
      406[164823872]                     Вычесть ←
      404[164828547]                     Результат ≡ День недели 1..6 (Воскресенье = 7) ∙ 249[164298831] ←
 32505862[164827059]                       Значения формальных параметров при вызове ←
 32505860[164831735]                         Значение параметра при вызове процедуры/функции ≡ фп Дата ∙ 65545[164301597] ←
   327700[164834746]                           Выражение ≡ Дата формирования ∙ 65545[164827783] ←
      380[164823906]                   Сложить ←
      404[164828549]                   Результат ⁼ 5 ←
      403[164823112]                 Умножить ←
      404[164828550]                 Результат ≡ Сутки ∙ 117[16843851] ←
 30867473[164823188]           ELSE ←
 11010080[164834222]             = ≡ Дата конечная (для заказов) ∙ 65545[164823941] ←
      404[164828551]               Результат ≡ Дата, конец дня ∙ 249[30867475] ←
 32505862[164827060]                 Значения формальных параметров при вызове ←
 32505860[164831736]                   Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
   327700[164834747]                     Выражение ≡ Дата формирования ∙ 65545[164827783] ←
      380[164823907]               Сложить ←
      116[164823488]               Выражение ←
      116[164823510]                 Выражение ←
      116[164823511]                   Выражение ←
      404[164828553]                     Результат ≡ День недели 1..6 (Воскресенье = 7) ∙ 249[164298831] ←
 32505862[164827061]                       Значения формальных параметров при вызове ←
 32505860[164831737]                         Значение параметра при вызове процедуры/функции ≡ фп Дата ∙ 65545[164301597] ←
   327700[164834748]                           Выражение ≡ Дата формирования ∙ 65545[164827783] ←
      406[164823873]                     Вычесть ←
      404[164828552]                     Результат ⁼ 4 ←
      380[164823908]                   Сложить ←
      404[164828554]                   Результат ⁼ 5 ←
      403[164823827]                 Умножить ←
      404[164828555]                 Результат ≡ Сутки ∙ 117[16843851] ←
  1507360[164824489]         Отбор данных (по запросу) • Отбор ←
 12124200[164823621]           From         (Таблицы) ←
 12124205[164823303]             Запрос • Максимальный номер ДМП на подразделении ←
 12124200[164823624]               From         (Таблицы) ←
 12124205[164823304]                 Запрос ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
 32505862[164827040]                   Значения формальных параметров при вызове ←
 32505860[164831678]                     Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547258] ←
   327700[164834646]                       Выражение ≡ Перечень ДМП ∙ 332[164364303] ←
 32505860[164831679]                     Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа начальная ∙ 65545[18547260] ←
   327700[164834647]                       Выражение ≡ DMY2Date (День, Месяц, Год) {через параметры} ∙ 249[33161309] ←
 32505862[164827041]                         Значения формальных параметров при вызове ←
 32505860[164831680]                           Значение параметра при вызове процедуры/функции ≡ День ∙ 65545[33162512] ←
   327700[164834648]                             Выражение ⁼ 1 ←
 32505860[164831681]                           Значение параметра при вызове процедуры/функции ≡ Месяц ∙ 65545[33162513] ←
   327700[164834649]                             Выражение ⁼ 6 ←
 32505860[164831682]                           Значение параметра при вызове процедуры/функции ≡ Год ∙ 65545[33162514] ←
   327700[164834650]                             Выражение ⁼ 2017 ←
 32505860[164831683]                     Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа конечная ∙ 65545[18547261] ←
   327700[164834651]                       Выражение ≡ Дата формирования ∙ 65545[164827783] ←
 12124224[164823173]                   Group By  (Группировка) ←
  1507533[164823356]                     Группировать по параметру ≡ Подразделение ∙ 1507335[164824633] ←
  1507447[164823286]                   Выражения ←
  1507449[164824104]                     Выражение • Максимальная дата ≡ Дата ∙ 107[3] ←
  1507455[164828294]                       Результат ≡ MAX ∙ 1507471[1507332] ←
  1507476[164823453]                         Значения параметров ←
  1507477[164823478]                           Параметр ≡ Выражение ∙ 1507473[1507332] ←
  1507478[164823478]                             Выражение ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164830335]                               Уточняющий параметр ≡ Дата ∙ 331[8] ←
 12124213[164823706]                   Параметры ←
  1507335[164824633]                     Параметр • Подразделение ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164830336]                       Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1507335[164824634]                     Параметр • Максимальная дата ≡ Максимальная дата ∙ 1507449[164824104] ←
 12124204[164824177]                 Таблица ≡ Документ ∙ 108[5] ←
 12124204[164824178]                 Таблица ≡ Строка (объект БД) ∙ 108[6] ←
  1507673[164823491]               Ключи оптимизации ←
  1507675[164823819]                 Использовать индекс ∙ 12124204[164824177] ←
  1507676[164823823]                   Уточняющий параметр ≡ Класс --> Тип --> Дата --> ID ∙ 1507445[1507398] ←
  1507675[164823820]                 Использовать индекс ∙ 12124204[164824178] ←
  1507676[164823824]                   Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
 12124215[164823943]               Where      (Ограничения на отбор данных) ←
  1507376[164827816]                 Выражение ←
  1507455[164828295]                   Результат ∙ 12124205[164823304] ←
  1507494[164830337]                     Уточняющий параметр ≡ Подразделение ∙ 1507335[164824633] ←
  1638473[164828291]                   Равно ←
  1507455[164828296]                   Результат ∙ 12124204[164824177] ←
  1507494[164830338]                     Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1507376[164827817]                 Выражение ←
  1507455[164828297]                   Результат ∙ 12124205[164823304] ←
  1507494[164830339]                     Уточняющий параметр ≡ Максимальная дата ∙ 1507335[164824634] ←
  1638473[164828292]                   Равно ←
  1507455[164828298]                   Результат ∙ 12124204[164824177] ←
  1507494[164830340]                     Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1507376[164827818]                 Выражение ←
  1507455[164828299]                   Результат ∙ 12124204[164824177] ←
  1507494[164830341]                     Уточняющий параметр ≡ Класс ∙ 331[3] ←
  1638473[164828293]                   Равно ←
  1507488[164823614]                   Константа (Ограничение по классу, типу, плану счетов) ≡ АДМИНИСТРАТИВНЫЙ ДОКУМЕНТ ∙ 541[15859713] ←
  1507376[164827819]                 Выражение ←
  1507455[164828300]                   Результат ∙ 12124204[164824177] ←
  1507494[164830342]                     Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[164828294]                   Равно ←
  1507488[164823615]                   Константа (Ограничение по классу, типу, плану счетов) ≡ Перечень ДМП ∙ 332[164364303] ←
  1507376[164827820]                 Выражение ←
  1507455[164828301]                   Результат ∙ 12124204[164824177] ←
  1507494[164830343]                     Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638473[164828295]                   Равно ←
  1507455[164828302]                   Результат ∙ 12124204[164824178] ←
  1507494[164830344]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1507376[164827821]                 Выражение ←
  1507455[164828303]                   Результат ∙ 12124204[164824178] ←
  1507494[164830345]                     Уточняющий параметр ≡ Тип ∙ 359[4] ←
  1638473[164828296]                   Равно ←
  1507488[164823616]                   Константа (Ограничение по классу, типу, плану счетов) ≡ Строка перечня ДМП ∙ 360[164364305] ←
  1507447[164823287]               Выражения ←
  1507449[164824105]                 Выражение • Максимальный номер ДМП ≡ Число ∙ 107[4] ←
  1507455[164828304]                   Результат ≡ MAX ∙ 1507471[1507332] ←
  1507476[164823454]                     Значения параметров ←
  1507477[164823479]                       Параметр ≡ Выражение ∙ 1507473[1507332] ←
  1507478[164823479]                         Выражение ∙ 12124204[164824178] ←
  1507494[164830346]                           Уточняющий параметр ≡ Скидка ∙ 359[14286851] ←
 12124224[164823174]               Group By  (Группировка) ←
  1507533[164823357]                 Группировать по параметру ≡ Магазин ∙ 1507335[164824635] ←
  1507533[164823358]                 Группировать по параметру ≡ Тип ДМП ∙ 1507335[164824636] ←
 12124213[164823707]               Параметры ←
  1507335[164824635]                 Параметр • Магазин ∙ 12124204[164824177] ←
  1507494[164830347]                   Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1507335[164824636]                 Параметр • Тип ДМП ∙ 12124204[164824178] ←
  1507494[164830348]                   Уточняющий параметр ≡ Виды затрат при списании ∙ 359[28835862] ←
  1507335[164824637]                 Параметр • Максимальный номер ДМП ≡ Максимальный номер ДМП ∙ 1507449[164824105] ←
 12124205[164823305]             Запрос • СтрокиДокументаСЦО ←
 12124200[164823625]               From         (Таблицы) ←
 12124205[164823302]                 Запрос • Запрос перечня товаров в акцию ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
 32505862[164827032]                   Значения формальных параметров при вызове ←
 32505860[164831661]                     Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547258] ←
   327700[164834629]                       Выражение ≡ Перечень товаров для акции ∙ 332[3342383] ←
 32505860[164831662]                     Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа начальная ∙ 65545[18547260] ←
   327700[164834630]                       Выражение ≡ Дата минус количество дней ∙ 249[164364372] ←
 32505862[164827033]                         Значения формальных параметров при вызове ←
 32505860[164831663]                           Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164368988] ←
   327700[164834631]                             Выражение ≡ Дата формирования ∙ 65545[164827783] ←
 32505860[164831664]                           Значение параметра при вызове процедуры/функции ≡ Количество дней ∙ 65545[164368989] ←
   327700[164834632]                             Выражение ⁼ 30 ←
 32505860[164831665]                     Значение параметра при вызове процедуры/функции ≡ Фильтр.Подразделения ∙ 65545[18547259] ←
   327700[164834633]                       Выражение ≡ Подразделения ∙ 65545[164827784] ←
 12124215[164823942]                   Where      (Ограничения на отбор данных) ←
  1507381[164823410]                     <Наследуемые ограничения> ←
  1507376[164827802]                     Выражение ←
  1507376[164827803]                       Выражение ←
  1507376[164827804]                         Выражение ←
  1507455[164828285]                           Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164830325]                             Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[164823316]                           Меньше или равно ←
  1507452[164826570]                           Константа ≡ Дата формирования ∙ 65545[164827783] ←
      413[164827213]                         И ←
  1507376[164827805]                         Выражение ←
  1507455[164828286]                           Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164830327]                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638477[164823553]                           Больше или равно ←
  1507452[164826571]                           Константа ≡ Дата формирования ∙ 65545[164827783] ←
      412[164823656]                       ИЛИ ←
  1507506[164824806]                         Использование (в режиме выполнения) ≡ Нет ∙ 534[11599875] ←
  1507376[164827806]                       Выражение ←
  1507506[164824807]                         Использование (в режиме выполнения) ≡ Нет ∙ 534[11599875] ←
  1507376[164827807]                         Выражение ←
  1507455[164828287]                           Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164830328]                             Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[164823317]                           Меньше или равно ←
  1507452[164826572]                           Константа ≡ Дата минус количество дней ∙ 249[164364372] ←
 32505862[164827034]                             Значения формальных параметров при вызове ←
 32505860[164831666]                               Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164368988] ←
   327700[164834634]                                 Выражение ≡ Дата формирования ∙ 65545[164827783] ←
 32505860[164831667]                               Значение параметра при вызове процедуры/функции ≡ Количество дней ∙ 65545[164368989] ←
   327700[164834635]                                 Выражение ⁼ -7 ←
      413[164827214]                         И ←
  1507376[164827808]                         Выражение ←
  1507455[164828288]                           Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164830329]                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638477[164823554]                           Больше или равно ←
  1507452[164826575]                           Константа ≡ Дата минус количество дней ∙ 249[164364372] ←
 32505862[164827035]                             Значения формальных параметров при вызове ←
 32505860[164831668]                               Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164368988] ←
   327700[164834636]                                 Выражение ≡ Дата формирования ∙ 65545[164827783] ←
 32505860[164831669]                               Значение параметра при вызове процедуры/функции ≡ Количество дней ∙ 65545[164368989] ←
   327700[164834637]                                 Выражение ⁼ -7 ←
      412[164823685]                       ИЛИ ←
  1507506[164825460]                         Использование (в режиме выполнения) ≡ Нет ∙ 534[11599875] ←
  1507376[164827809]                       Выражение ←
  1507506[164825461]                         Использование (в режиме выполнения) ≡ Нет ∙ 534[11599875] ←
  1507376[164827810]                         Выражение ←
  1507455[164828289]                           Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164830330]                             Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[164823318]                           Меньше или равно ←
  1507452[164826577]                           Константа ≡ Дата минус количество дней ∙ 249[164364372] ←
 32505862[164827036]                             Значения формальных параметров при вызове ←
 32505860[164831670]                               Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164368988] ←
   327700[164834638]                                 Выражение ≡ Дата формирования ∙ 65545[164827783] ←
 32505860[164831671]                               Значение параметра при вызове процедуры/функции ≡ Количество дней ∙ 65545[164368989] ←
   327700[164834639]                                 Выражение ⁼ 7 ←
      413[164827215]                         И ←
  1507376[164827811]                         Выражение ←
  1507455[164828290]                           Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164830331]                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638477[164823555]                           Больше или равно ←
  1507452[164826580]                           Константа ≡ Дата минус количество дней ∙ 249[164364372] ←
 32505862[164827037]                             Значения формальных параметров при вызове ←
 32505860[164831672]                               Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164368988] ←
   327700[164834640]                                 Выражение ≡ Дата формирования ∙ 65545[164827783] ←
 32505860[164831673]                               Значение параметра при вызове процедуры/функции ≡ Количество дней ∙ 65545[164368989] ←
   327700[164834641]                                 Выражение ⁼ 7 ←
      412[164823686]                       ИЛИ ←
  1507376[164827812]                       Выражение ←
  1507506[164825464]                         Использование (в режиме выполнения) ≡ Нет ∙ 534[11599875] ←
  1507376[164827813]                         Выражение ←
  1507455[164828291]                           Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164830332]                             Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[164823319]                           Меньше или равно ←
  1507452[164826582]                           Константа ≡ Дата минус количество дней ∙ 249[164364372] ←
 32505862[164827038]                             Значения формальных параметров при вызове ←
 32505860[164831674]                               Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164368988] ←
   327700[164834642]                                 Выражение ≡ Дата формирования ∙ 65545[164827783] ←
 32505860[164831675]                               Значение параметра при вызове процедуры/функции ≡ Количество дней ∙ 65545[164368989] ←
   327700[164834643]                                 Выражение ⁼ 14 ←
      413[164827216]                         И ←
  1507376[164827814]                         Выражение ←
  1507455[164828292]                           Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164830333]                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638477[164823556]                           Больше или равно ←
  1507452[164826583]                           Константа ≡ Дата минус количество дней ∙ 249[164364372] ←
 32505862[164827039]                             Значения формальных параметров при вызове ←
 32505860[164831676]                               Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164368988] ←
   327700[164834644]                                 Выражение ≡ Дата формирования ∙ 65545[164827783] ←
 32505860[164831677]                               Значение параметра при вызове процедуры/функции ≡ Количество дней ∙ 65545[164368989] ←
   327700[164834645]                                 Выражение ⁼ 14 ←
  1507376[164827815]                     Выражение ←
  1507455[164828293]                       Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164830334]                         Уточняющий параметр ≡ Условия оплаты ∙ 331[14352404] ←
  1638473[164828290]                       Равно ←
  1507452[164826584]                       Константа ≡ Дополнительные места продаж ∙ 655294473[655294478] ←
  1507376[164830413]                     Выражение ←
  1507455[164830576]                       Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164835557]                         Уточняющий параметр ≡ Вид отнесения затрат по списанию ∙ 331[42401905] ←
  1638473[164829812]                       Равно ←
  1507452[164829340]                       Константа ≡ Акционные ДМП ∙ 164364318[164364289] ←
  1507376[164830889]                     Выражение ←
  1507506[164825826]                       Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164827765]                         Если истинно выражение ≡ Группа документов ПРОМО-акций, на которую нужно сделать рассылку ∙ 65545[164829574] ←
  1507455[164830999]                       Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164836901]                         Уточняющий параметр ≡ Родитель ∙ 331[2] ←
  1638473[164830537]                       Равно ←
  1507452[164829865]                       Константа ≡ Группа документов ПРОМО-акций, на которую нужно сделать рассылку ∙ 65545[164829574] ←
 12124204[164824184]                 Таблица • Документ перечень товаров для акции ≡ Документ ∙ 108[5] ←
 12124204[164824180]                 Таблица • Строка перечня товаров для акции ≡ Строка (объект БД) ∙ 108[6] ←
 12124204[164824181]                 Таблица ≡ Продукт ∙ 108[3] ←
 12124204[164824182]                 Таблица • Подгруппа ≡ Каталог ∙ 108[2] ←
 12124204[164824183]                 Таблица • Группа ≡ Каталог ∙ 108[2] ←
 12124204[164824179]                 Таблица • ТТ ≡ Партнер ∙ 108[4] ←
  1507673[164823492]               Ключи оптимизации ←
  1507675[164823821]                 Использовать индекс ≡ Документ перечень товаров для акции ∙ 12124204[164824184] ←
  1507676[164823825]                   Уточняющий параметр ≡ ID ∙ 1507445[1507432] ←
  1507675[164823822]                 Использовать индекс ≡ Строка перечня товаров для акции ∙ 12124204[164824180] ←
  1507676[164823826]                   Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
  1507675[164823823]                 Использовать индекс ≡ ТТ ∙ 12124204[164824179] ←
  1507676[164823827]                   Уточняющий параметр ≡ ID ∙ 1507445[1507430] ←
  1507675[164823824]                 Использовать индекс ∙ 12124204[164824181] ←
  1507676[164823828]                   Уточняющий параметр ≡ ID ∙ 1507445[1507431] ←
  1507675[164823825]                 Использовать индекс ≡ Подгруппа ∙ 12124204[164824182] ←
  1507676[164823829]                   Уточняющий параметр ≡ ID ∙ 1507445[1507429] ←
  1507675[164823826]                 Использовать индекс ≡ Группа ∙ 12124204[164824183] ←
  1507676[164823830]                   Уточняющий параметр ≡ ID ∙ 1507445[1507429] ←
 12124215[164823944]               Where      (Ограничения на отбор данных) ←
  1507376[164827822]                 Выражение ←
  1507455[164828305]                   Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824184] ←
  1507494[164830349]                     Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638473[164828297]                   Равно ←
  1507455[164828306]                   Результат ≡ Запрос перечня товаров в акцию ∙ 12124205[164823302] ←
  1507494[164830350]                     Уточняющий параметр ≡ з.Документ ∙ 1507335[18547059] ←
  1507376[164827823]                 Выражение ←
  1507455[164828307]                   Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824180] ←
  1507494[164830351]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638473[164828298]                   Равно ←
  1507455[164828308]                   Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824184] ←
  1507494[164830352]                     Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1507376[164827824]                 Выражение ←
  1507455[164828309]                   Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824180] ←
  1507494[164830353]                     Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[164828299]                   Равно ←
  1507455[164828310]                   Результат ∙ 12124204[164824181] ←
  1507494[164830354]                     Уточняющий параметр ≡ Продукт ∙ 305[1] ←
  1507376[164827825]                 Выражение ←
  1507455[164828311]                   Результат ∙ 12124204[164824181] ←
  1507494[164830355]                     Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
  1638473[164828300]                   Равно ←
  1507455[164828312]                   Результат ≡ Подгруппа ∙ 12124204[164824182] ←
  1507494[164830356]                     Уточняющий параметр ≡ Каталог ∙ 296[1] ←
  1507376[164827826]                 Выражение ←
  1507455[164828313]                   Результат ≡ Подгруппа ∙ 12124204[164824182] ←
  1507494[164830357]                     Уточняющий параметр ≡ Родитель ∙ 296[2] ←
  1638473[164828301]                   Равно ←
  1507455[164828314]                   Результат ≡ Группа ∙ 12124204[164824183] ←
  1507494[164830358]                     Уточняющий параметр ≡ Каталог ∙ 296[1] ←
  1507376[164827827]                 Выражение ←
  1507455[164828315]                   Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824184] ←
  1507494[164830359]                     Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1638473[164828302]                   Равно ←
  1507455[164828316]                   Результат ≡ ТТ ∙ 12124204[164824179] ←
  1507494[164830360]                     Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1507376[164827828]                 Выражение ←
  1507506[164824516]                   Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164824661]                     Если истинно выражение ≡ Товар ∙ 65545[164827787] ←
  1507455[164828317]                   Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824180] ←
  1507494[164830361]                     Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[164828303]                   Равно ←
  1507452[164826585]                   Константа ≡ Товар ∙ 65545[164827787] ←
  1507376[164827831]                 Выражение ←
  1507455[164828322]                   Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824180] ←
  1507494[164830365]                     Уточняющий параметр ≡ Тип ∙ 359[4] ←
  1638473[164828306]                   Равно ←
  1507488[164823617]                   Константа (Ограничение по классу, типу, плану счетов) ≡ Строка перечня товаров для акции ∙ 360[3342408] ←
  1507376[164827832]                 Выражение ←
  1507455[164828323]                   Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824180] ←
  1507494[164830366]                     Уточняющий параметр ≡ Страна производства ∙ 359[14286854] ←
  1638479[164823826]                   Не равно ←
  1638402[164824582]                   NULL ←
  1507376[164827833]                 Выражение ←
  1507455[164828324]                   Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824180] ←
  1507494[164830367]                     Уточняющий параметр ≡ Серия ∙ 359[15138817] ←
  1638479[164823827]                   Не равно ←
  1638402[164824583]                   NULL ←
  1507447[164823289]               Выражения ←
  1507449[164824106]                 Выражение • Тип ДМП для сортировки ≡ Объект ∙ 107[19] ←
  1507589[164823045]                   CASE ←
  1507591[164823276]                     Условие ←
  1507455[164828325]                       Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824180] ←
  1507494[164830377]                         Уточняющий параметр ≡ Страна производства ∙ 359[14286854] ←
  1507592[164823052]                     OF ≡ Торец (алкоголь) ∙ 164823049[164823048] ←
  1507452[164826586]                       Константа ≡ Акция (Алкоголь) ∙ 164823049[164823043] ←
  1507592[164823053]                     OF ≡ Торец (фуд) ∙ 164823049[164823049] ←
  1507452[164826587]                       Константа ≡ Акция (Фуд) ∙ 164823049[164823044] ←
  1507592[164823220]                     OF ≡ Торец (десерты) ∙ 164823049[164823054] ←
  1507452[164829843]                       Константа ≡ Акция (Десерты) ∙ 164823049[164823053] ←
  1507592[164823054]                     OF ≡ Торец (нон-фуд) ∙ 164823049[164823050] ←
  1507452[164826588]                       Константа ≡ Акция (Нон-фуд) ∙ 164823049[164823045] ←
  1507592[164823057]                     OF ≡ Наружка (Нон-фуд) ∙ 164823049[164823041] ←
  1507631[164823272]                       IF ←
  1507591[164823277]                         Условие ←
  1507376[164827834]                           Выражение ←
  1507455[164828326]                             Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824184] ←
  1507494[164830378]                               Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[164823320]                             Меньше или равно ←
  1507452[164826589]                             Константа ≡ Дата формирования ∙ 65545[164827783] ←
      413[164827234]                           И ←
  1507376[164827835]                           Выражение ←
  1507455[164828327]                             Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824184] ←
  1507494[164830379]                               Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638477[164823557]                             Больше или равно ←
  1507452[164826590]                             Константа ≡ Дата формирования ∙ 65545[164827783] ←
  1507633[164823272]                         THEN ←
  1507455[164828318]                           Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824180] ←
  1507494[164830412]                             Уточняющий параметр ≡ Страна производства ∙ 359[14286854] ←
  1507593[164823276]                         ELSE ←
  1507631[164823273]                           IF ←
  1507591[164823278]                             Условие ←
  1507376[164827836]                               Выражение ←
  1507455[164828328]                                 Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824184] ←
  1507494[164830380]                                   Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638478[164823388]                                 Больше ←
  1507452[164826592]                                 Константа ≡ Дата формирования ∙ 65545[164827783] ←
  1507633[164823273]                             THEN ←
  1507455[164828319]                               Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824180] ←
  1507494[164830413]                                 Уточняющий параметр ≡ Страна производства ∙ 359[14286854] ←
  1507593[164823277]                             ELSE ←
  1507455[164828329]                               Результат ≡ Группа ∙ 12124204[164824183] ←
  1507494[164830381]                                 Уточняющий параметр ≡ Тип стандарта ∙ 296[3342337] ←
  1507592[164823058]                     OF ≡ Наружка (Фуд) ∙ 164823049[164823042] ←
  1507631[164823274]                       IF ←
  1507591[164823279]                         Условие ←
  1507376[164827829]                           Выражение ←
  1507455[164828320]                             Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824184] ←
  1507494[164830382]                               Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[164823321]                             Меньше или равно ←
  1507452[164826591]                             Константа ≡ Дата формирования ∙ 65545[164827783] ←
      413[164827230]                           И ←
  1507376[164827830]                           Выражение ←
  1507455[164828321]                             Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824184] ←
  1507494[164830383]                               Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638477[164823558]                             Больше или равно ←
  1507452[164826593]                             Константа ≡ Дата формирования ∙ 65545[164827783] ←
  1507633[164823274]                         THEN ←
  1507455[164828330]                           Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824180] ←
  1507494[164830384]                             Уточняющий параметр ≡ Страна производства ∙ 359[14286854] ←
  1507593[164823278]                         ELSE ←
  1507631[164823275]                           IF ←
  1507591[164823280]                             Условие ←
  1507376[164827837]                               Выражение ←
  1507455[164828331]                                 Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824184] ←
  1507494[164830385]                                   Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638478[164823389]                                 Больше ←
  1507452[164826594]                                 Константа ≡ Дата формирования ∙ 65545[164827783] ←
  1507633[164823275]                             THEN ←
  1507455[164828332]                               Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824180] ←
  1507494[164830414]                                 Уточняющий параметр ≡ Страна производства ∙ 359[14286854] ←
  1507593[164823279]                             ELSE ←
  1507455[164828333]                               Результат ≡ Группа ∙ 12124204[164824183] ←
  1507494[164830415]                                 Уточняющий параметр ≡ Тип стандарта ∙ 296[3342337] ←
  1507593[164823280]                     ELSE ←
  1507455[164828334]                       Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824180] ←
  1507494[164830386]                         Уточняющий параметр ≡ Страна производства ∙ 359[14286854] ←
  1507449[164824108]                 Выражение • Третий патрон для сотрировки ≡ Число ∙ 107[4] ←
  1507631[164823280]                   IF ←
  1507591[164823286]                     Условие ←
  1507376[164827846]                       Выражение ←
  1507455[164828349]                         Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824184] ←
  1507494[164830401]                           Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[164823324]                         Меньше или равно ←
  1507452[164826605]                         Константа ≡ Дата формирования ∙ 65545[164827783] ←
      413[164827238]                       И ←
  1507376[164827847]                       Выражение ←
  1507455[164828350]                         Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824184] ←
  1507494[164830402]                           Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638477[164823561]                         Больше или равно ←
  1507452[164826606]                         Константа ≡ Дата формирования ∙ 65545[164827783] ←
  1507633[164823280]                     THEN ←
  1507452[164826607]                       Константа ⁼ 1 ←
  1507593[164823286]                     ELSE ←
  1507631[164823281]                       IF ←
  1507591[164823287]                         Условие ←
  1507376[164827848]                           Выражение ←
  1507455[164828351]                             Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824184] ←
  1507494[164830403]                               Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638478[164823392]                             Больше ←
  1507452[164826608]                             Константа ≡ Дата формирования ∙ 65545[164827783] ←
  1507633[164823281]                         THEN ←
  1507452[164826609]                           Константа ⁼ 2 ←
  1507593[164823287]                         ELSE ←
  1507452[164826610]                           Константа ⁼ 3 ←
 12124213[164823710]               Параметры ←
  1507335[164824648]                 Параметр • Документ ≡ Документ перечень товаров для акции ∙ 12124204[164824184] ←
  1507494[164830362]                   Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1507335[164824652]                 Параметр • Документ. Дата начальная ≡ Документ перечень товаров для акции ∙ 12124204[164824184] ←
  1507494[164830405]                   Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1507335[164824653]                 Параметр • Документ. Дата конечная ≡ Документ перечень товаров для акции ∙ 12124204[164824184] ←
  1507494[164830406]                   Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1507335[164824649]                 Параметр • ТТ ≡ Документ перечень товаров для акции ∙ 12124204[164824184] ←
  1507494[164830363]                   Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1507335[164824650]                 Параметр • ТТ наименование ≡ ТТ ∙ 12124204[164824179] ←
  1507494[164830364]                   Уточняющий параметр ≡ Наименование ∙ 283[5] ←
  1507335[164824651]                 Параметр • ЦО ≡ ТТ ∙ 12124204[164824179] ←
  1507494[164830404]                   Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
  1507335[164824654]                 Параметр • Строка документа ≡ Строка перечня товаров для акции ∙ 12124204[164824180] ←
  1507494[164830407]                   Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507335[164824655]                 Параметр • Продукт ∙ 12124204[164824181] ←
  1507494[164830408]                   Уточняющий параметр ≡ Продукт ∙ 305[1] ←
  1507335[164824656]                 Параметр • Продукт наименование ∙ 12124204[164824181] ←
  1507494[164830409]                   Уточняющий параметр ≡ Наименование ∙ 305[6] ←
  1507335[164824658]                 Параметр • Тип ДМП оригинал ≡ Строка перечня товаров для акции ∙ 12124204[164824180] ←
  1507494[164830411]                   Уточняющий параметр ≡ Страна производства ∙ 359[14286854] ←
  1507335[164824659]                 Параметр • Тип ДМП рассчитанный ≡ Тип ДМП для сортировки ∙ 1507449[164824106] ←
  1507335[164824657]                 Параметр • Номер ДМП оригинал ≡ Строка перечня товаров для акции ∙ 12124204[164824180] ←
  1507494[164830410]                   Уточняющий параметр ≡ Серия ∙ 359[15138817] ←
  1507335[164823976]                 Параметр • Номер ДМП сортировка ≡ Строка перечня товаров для акции ∙ 12124204[164824180] ←
  1507494[164827245]                   Уточняющий параметр ≡ Количество палет [док] ∙ 359[2818049] ←
  1507335[164824660]                 Параметр • Третий револьвер ≡ Третий патрон для сотрировки ∙ 1507449[164824108] ←
 12124215[164823945]           Where      (Ограничения на отбор данных) ←
  1507376[164827838]             Выражение ←
  1507455[164828352]               Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830416]                 Уточняющий параметр ≡ ЦО ∙ 1507335[164824651] ←
  1638473[164828304]               Равно ←
  1507455[164828353]               Результат ≡ Максимальный номер ДМП на подразделении ∙ 12124205[164823303] ←
  1507494[164830417]                 Уточняющий параметр ≡ Магазин ∙ 1507335[164824635] ←
      413[164827231]             И ←
  1507376[164827839]             Выражение ←
  1507455[164828354]               Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830418]                 Уточняющий параметр ≡ Тип ДМП рассчитанный ∙ 1507335[164824659] ←
  1638473[164828305]               Равно ←
  1507455[164828355]               Результат ≡ Максимальный номер ДМП на подразделении ∙ 12124205[164823303] ←
  1507494[164830419]                 Уточняющий параметр ≡ Тип ДМП ∙ 1507335[164824636] ←
  1507447[164823290]           Выражения ←
  1507449[164824107]             Выражение • Номер ДМП ≡ Число ∙ 107[4] ←
  1507589[164823046]               CASE ←
  1507591[164823281]                 Условие ←
  1507455[164828335]                   Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830387]                     Уточняющий параметр ≡ Тип ДМП оригинал ∙ 1507335[164824658] ←
  1507592[164823059]                 OF ≡ Наружка (Нон-фуд) ∙ 164823049[164823041] ←
  1507631[164823276]                   IF ←
  1507591[164823282]                     Условие ←
  1507376[164827840]                       Выражение ←
  1507455[164828336]                         Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830388]                           Уточняющий параметр ≡ Документ. Дата начальная ∙ 1507335[164824652] ←
  1638475[164823322]                         Меньше или равно ←
  1507452[164826599]                         Константа ≡ Дата формирования ∙ 65545[164827783] ←
      413[164827236]                       И ←
  1507376[164827841]                       Выражение ←
  1507455[164828356]                         Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830433]                           Уточняющий параметр ≡ Документ. Дата конечная ∙ 1507335[164824653] ←
  1638477[164823559]                         Больше или равно ←
  1507452[164826600]                         Константа ≡ Дата формирования ∙ 65545[164827783] ←
  1507633[164823276]                     THEN ←
  1507455[164828338]                       Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830390]                         Уточняющий параметр ≡ Номер ДМП оригинал ∙ 1507335[164824657] ←
  1507593[164823281]                     ELSE ←
  1507631[164823277]                       IF ←
  1507591[164823283]                         Условие ←
  1507376[164827842]                           Выражение ←
  1507455[164828337]                             Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830389]                               Уточняющий параметр ≡ Документ. Дата начальная ∙ 1507335[164824652] ←
  1638478[164823390]                             Больше ←
  1507452[164826601]                             Константа ≡ Дата формирования ∙ 65545[164827783] ←
  1507633[164823277]                         THEN ←
  1507455[164828339]                           Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830391]                             Уточняющий параметр ≡ Номер ДМП оригинал ∙ 1507335[164824657] ←
  1507593[164823282]                         ELSE ←
  1507455[164828341]                           Результат ≡ Максимальный номер ДМП на подразделении ∙ 12124205[164823303] ←
  1507494[164830393]                             Уточняющий параметр ≡ Максимальный номер ДМП ∙ 1507335[164824637] ←
  1507592[164823060]                 OF ≡ Наружка (Фуд) ∙ 164823049[164823042] ←
  1507631[164823278]                   IF ←
  1507591[164823284]                     Условие ←
  1507376[164827843]                       Выражение ←
  1507455[164828340]                         Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830392]                           Уточняющий параметр ≡ Документ. Дата начальная ∙ 1507335[164824652] ←
  1638475[164823323]                         Меньше или равно ←
  1507452[164826595]                         Константа ≡ Дата формирования ∙ 65545[164827783] ←
      413[164827235]                       И ←
  1507376[164827844]                       Выражение ←
  1507455[164828342]                         Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830394]                           Уточняющий параметр ≡ Документ. Дата конечная ∙ 1507335[164824653] ←
  1638477[164823560]                         Больше или равно ←
  1507452[164826596]                         Константа ≡ Дата формирования ∙ 65545[164827783] ←
  1507633[164823278]                     THEN ←
  1507455[164828343]                       Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830395]                         Уточняющий параметр ≡ Номер ДМП оригинал ∙ 1507335[164824657] ←
  1507593[164823283]                     ELSE ←
  1507631[164823279]                       IF ←
  1507591[164823285]                         Условие ←
  1507376[164827845]                           Выражение ←
  1507455[164828344]                             Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830396]                               Уточняющий параметр ≡ Документ. Дата начальная ∙ 1507335[164824652] ←
  1638478[164823391]                             Больше ←
  1507452[164826597]                             Константа ≡ Дата формирования ∙ 65545[164827783] ←
  1507633[164823279]                         THEN ←
  1507455[164828345]                           Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830397]                             Уточняющий параметр ≡ Номер ДМП оригинал ∙ 1507335[164824657] ←
  1507593[164823284]                         ELSE ←
  1507455[164828346]                           Результат ≡ Максимальный номер ДМП на подразделении ∙ 12124205[164823303] ←
  1507494[164830398]                             Уточняющий параметр ≡ Максимальный номер ДМП ∙ 1507335[164824637] ←
  1507593[164823285]                 ELSE ←
  1507455[164828347]                   Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830399]                     Уточняющий параметр ≡ Номер ДМП оригинал ∙ 1507335[164824657] ←
 12124213[164823709]           Параметры ←
  1507335[164824661]             Параметр • Документ ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830420]               Уточняющий параметр ≡ Документ ∙ 1507335[164824648] ←
  1507335[164824662]             Параметр • Документ. Дата начальная ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830421]               Уточняющий параметр ≡ Документ. Дата начальная ∙ 1507335[164824652] ←
  1507335[164824663]             Параметр • Документ. Дата конечная ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830422]               Уточняющий параметр ≡ Документ. Дата конечная ∙ 1507335[164824653] ←
  1507335[164824664]             Параметр • ТТ ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830423]               Уточняющий параметр ≡ ТТ ∙ 1507335[164824649] ←
  1507335[164824665]             Параметр • ТТ наименование ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830424]               Уточняющий параметр ≡ ТТ наименование ∙ 1507335[164824650] ←
  1507335[164824666]             Параметр • ЦО ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830425]               Уточняющий параметр ≡ ЦО ∙ 1507335[164824651] ←
  1507335[164824667]             Параметр • Строка документа ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830426]               Уточняющий параметр ≡ Строка документа ∙ 1507335[164824654] ←
  1507335[164824668]             Параметр • Продукт ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830427]               Уточняющий параметр ≡ Продукт ∙ 1507335[164824655] ←
  1507335[164824669]             Параметр • Продукт Наименование ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830428]               Уточняющий параметр ≡ Продукт наименование ∙ 1507335[164824656] ←
  1507335[164824670]             Параметр • Тип ДМП оригинал ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830429]               Уточняющий параметр ≡ Тип ДМП оригинал ∙ 1507335[164824658] ←
  1507335[164824671]             Параметр • Тип ДМП рассчитанный ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830430]               Уточняющий параметр ≡ Тип ДМП рассчитанный ∙ 1507335[164824659] ←
  1507335[164824672]             Параметр • Номер ДМП оригинал ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830431]               Уточняющий параметр ≡ Номер ДМП оригинал ∙ 1507335[164824657] ←
  1507335[164826644]             Параметр • Номер ДМП сортировка ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164827249]               Уточняющий параметр ≡ Номер ДМП сортировка ∙ 1507335[164823976] ←
  1507335[164824674]             Параметр • Номер ДМП рассчитаный ≡ Номер ДМП ∙ 1507449[164824107] ←
  1507335[164824673]             Параметр • Третий револьвер ≡ СтрокиДокументаСЦО ∙ 12124205[164823305] ←
  1507494[164830432]               Уточняющий параметр ≡ Третий револьвер ∙ 1507335[164824660] ←
 12124222[164823400]           Order By   (Сортировка) ←
  1507465[164823136]             Блок (Сортировка с генерацией события) • ТТ ←
  1507559[164823132]               Сортировать по возрастанию ≡ ТТ наименование ∙ 1507335[164824665] ←
  1507464[164823409]             Сортировать по возрастанию ≡ Номер ДМП сортировка ∙ 1507335[164826644] ←
  1507464[164823410]             Сортировать по возрастанию ≡ Продукт Наименование ∙ 1507335[164824669] ←
  1507464[164823407]             Сортировать по возрастанию ≡ Тип ДМП рассчитанный ∙ 1507335[164824671] ←
  1507467[164823146]           Выполнить перед обработкой блока ≡ ТТ ∙ 1507465[164823136] ←
 11010080[164834218]             = ≡ ЦО ∙ 65545[164827788] ←
      404[164828516]               Результат ≡ ЦО ∙ 1507335[164824666] ←
 11010080[164834219]             = ≡ Список ТТ и ЦО для поиска заказов ∙ 65545[164823939] ←
      404[164828517]               Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823500]                 Список элементов ←
   327700[164834741]                   Выражение ≡ ЦО ∙ 65545[164827788] ←
   327700[164834742]                   Выражение ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[164827056]                     Значения формальных параметров при вызове ←
 32505860[164831732]                       Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
   327700[164834743]                         Выражение ≡ ЦО ∙ 65545[164827788] ←
 11010080[164834223]             = ≡ Список заказов/приходов ∙ 65545[164823938] ←
  1638402[164824589]               NULL ←
 11010105[164823409]             Индикатор ←
      404[164828558]               Результат ⁼ 'Ищем приход ' ←
      404[164828560]               Результат ≡ ТТ наименование ∙ 1507335[164824665] ←
      404[164828559]               Результат ≡ CR+LF ∙ 117[1508547] ←
 30867470[164825977]             IF ←
  1638463[164826606]               Условие ←
      404[164852579]                 Результат ≡ Автоматически ∙ 65545[164823942] ←
 30867472[164825932]               THEN ←
 11010080[164834228]                 = ≡ Список типов ДМП для расшифровки ∙ 65545[164827855] ←
  1638402[164824584]                   NULL ←
 11010080[164824266]                 = ≡ Файл на ТТ ∙ 65545[164824005] ←
      404[164823503]                   Результат ⁼ 'C:\\Domino8\\HOME\\dmp_' ←
      404[164823527]                   Результат ≡ ЦО ∙ 65545[164827788] ←
      411[164823536]                     Уточняющий параметр ≡ ЦО ∙ 65545[164827788] ←
      411[164831028]                       Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
      404[164824450]                   Результат ⁼ '.htm' ←
 11010088[164825550]                 ВЫПОЛНИТЬ ≡ Отчет.Инициализация ∙ 249[12124171] ←
 39780367[164823638]                   Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 12124199[164823088]                   Ссылка на шаблон ≡ ПРОМО ДМП ∙ 12124193[164823062] ←
  1507728[164823087]                 Начало многострочного комментария ←
 11010080[164834229]                 = ≡ Файл на ТТ ∙ 65545[164824005] ←
      404[164852580]                   Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[164823087]                     Ссылка на шаблон ≡ ПРОМО ДМП ∙ 12124193[164823062] ←
  1507729[164823087]                 Конец многострочного комментария ←
 11010088[164823566]                 ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164823294]                   Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 39780357[164823117]                   Ссылка на блок шаблона ≡ Заголовок ∙ 12124197[164823062] ←
 30867470[164825978]                 IF ←
  1638463[164826607]                   Условие ←
      404[164828575]                     Результат ≡ Товар ∙ 65545[164827787] ←
 30867472[164825933]                   THEN ←
 11010088[164825769]                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164823295]                       Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 39780357[164823127]                       Ссылка на блок шаблона ≡ Шапка по SKU ∙ 12124197[164823058] ←
 11010088[164825775]                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164823293]                       Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 39780357[164823138]                       Ссылка на блок шаблона ≡ Подразделение по SKU ∙ 12124197[164823073] ←
 30867473[164824121]                   ELSE ←
 30867470[164825979]                     IF ←
  1638463[164826608]                       Условие ←
      404[164852581]                         Результат ≡ Подразделения ∙ 65545[164827784] ←
 30867472[164825934]                       THEN ←
 11010088[164825770]                         ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824155]                           Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 39780357[164823136]                           Ссылка на блок шаблона ≡ Шапка по 1 ТТ ∙ 12124197[164823056] ←
 30867473[164824122]                       ELSE ←
 11010088[164825771]                         ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824156]                           Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 39780357[164823137]                           Ссылка на блок шаблона ≡ Шапка по сети ∙ 12124197[164823057] ←
 11010088[164825776]                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824157]                       Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 39780357[164823147]                       Ссылка на блок шаблона ≡ Подразделение ∙ 12124197[164823072] ←
 30867473[164824123]               ELSE ←
 30867470[164825974]                 IF ←
  1638463[164826603]                   Условие ←
      404[164828574]                     Результат ≡ Товар ∙ 65545[164827787] ←
 30867472[164825929]                   THEN ←
 11010088[164823564]                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164823290]                       Файл ≡ Файл отчета ∙ 65545[164824007] ←
 39780357[164823099]                       Ссылка на блок шаблона ≡ Подразделение по SKU ∙ 12124197[164823073] ←
 30867473[164823191]                   ELSE ←
 11010088[164823565]                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164823291]                       Файл ≡ Файл отчета ∙ 65545[164824007] ←
 39780357[164823115]                       Ссылка на блок шаблона ≡ Подразделение ∙ 12124197[164823072] ←
  1507360[164824491]             Отбор данных (по запросу) • Отбираем заказы на ТТ ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
 32505862[164827053]               Значения формальных параметров при вызове ←
 32505860[164831706]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547258] ←
   327700[164834721]                   Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823498]                     Список элементов ←
   327700[164834722]                       Выражение ≡ Заказ товаров поставщику [магазин] ∙ 332[28836002] ←
   327700[164834723]                       Выражение ≡ Заказ на склад (РЦ) с торговой точки (ТТ) ∙ 332[28835998] ←
 32505860[164831726]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Подразделения ∙ 65545[18547259] ←
   327700[164834724]                   Выражение ≡ Список ТТ и ЦО для поиска заказов ∙ 65545[164823939] ←
 32505860[164831727]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа начальная ∙ 65545[18547260] ←
   327700[164834725]                   Выражение ≡ Дата минус количество дней ∙ 249[164364372] ←
 32505862[164827054]                     Значения формальных параметров при вызове ←
 32505860[164831728]                       Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164368988] ←
   327700[164834726]                         Выражение ≡ Дата формирования ∙ 65545[164827783] ←
 32505860[164831729]                       Значение параметра при вызове процедуры/функции ≡ Количество дней ∙ 65545[164368989] ←
   327700[164834727]                         Выражение ⁼ 10 ←
 32505860[164831730]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Состояние ∙ 65545[11600041] ←
   327700[164834728]                   Выражение ⁼ 1 ←
 12124215[164823124]               Where      (Ограничения на отбор данных) ←
  1507381[164823414]                 <Наследуемые ограничения> ←
      413[164823407]                 И ←
  1507376[164823341]                 Выражение ←
  1507376[164823342]                   Выражение ←
  1507455[164823355]                     Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164823537]                       Уточняющий параметр ≡ Дата поставки ∙ 331[14352402] ←
  1638477[164823097]                     Больше или равно ←
  1507452[164826616]                     Константа ≡ Дата начальная (для заказов) ∙ 65545[164823940] ←
      413[164823408]                   И ←
  1507376[164823345]                   Выражение ←
  1507455[164823356]                     Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164823538]                       Уточняющий параметр ≡ Дата поставки ∙ 331[14352402] ←
  1638475[164823100]                     Меньше или равно ←
  1507452[164826617]                     Константа ≡ Дата конечная (для заказов) ∙ 65545[164823941] ←
      413[164823409]                 И ←
  1507376[164823397]                 Выражение ←
  1507455[164823357]                   Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164823539]                     Уточняющий параметр ≡ Состояние заказа поставщика ∙ 331[15204354] ←
  1638473[164823604]                   Равно ←
  1507452[164826618]                   Константа ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823499]                     Список элементов ←
   327700[164834730]                       Выражение ≡ Размещен ∙ 15204353[18022403] ←
 30867466[164823261]               Выполнить после получения записи ←
 11010080[164834224]                 = ≡ Список заказов/приходов ∙ 65545[164823938] ←
      404[164828556]                   Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823501]                     Список элементов ←
   327700[164834749]                       Выражение ≡ Список заказов/приходов ∙ 65545[164823938] ←
   327700[164834750]                       Выражение ≡ з.Документ ∙ 1507335[18547059] ←
  1507360[164824492]             Отбор данных (по запросу) • Отбираем приходов на ТТ ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
 32505862[164827062]               Значения формальных параметров при вызове ←
 32505860[164831744]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547258] ←
   327700[164834732]                   Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823502]                     Список элементов ←
   327700[164834733]                       Выражение ≡ Приход товаров ∙ 332[14286901] ←
   327700[164834731]                       Выражение ≡ Приход от организации ∙ 332[6684753] ←
 32505860[164831739]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Подразделения ∙ 65545[18547259] ←
   327700[164834734]                   Выражение ≡ Список ТТ и ЦО для поиска заказов ∙ 65545[164823939] ←
 32505860[164831740]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа начальная ∙ 65545[18547260] ←
   327700[164834735]                   Выражение ≡ Дата минус количество дней ∙ 249[164364372] ←
 32505862[164827063]                     Значения формальных параметров при вызове ←
 32505860[164831741]                       Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164368988] ←
   327700[164834736]                         Выражение ≡ Дата формирования ∙ 65545[164827783] ←
 32505860[164831742]                       Значение параметра при вызове процедуры/функции ≡ Количество дней ∙ 65545[164368989] ←
   327700[164834737]                         Выражение ⁼ 10 ←
 12124215[164823136]               Where      (Ограничения на отбор данных) ←
  1507381[164823415]                 <Наследуемые ограничения> ←
      413[164823410]                 И ←
  1507376[164823433]                 Выражение ←
  1507455[164823448]                   Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164823681]                     Уточняющий параметр ≡ Состояние заказа поставщика ∙ 331[15204354] ←
  1638473[164823605]                   Равно ←
  1507452[164826621]                   Константа ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823503]                     Список элементов ←
   327700[164834739]                       Выражение ≡ Товар в пути ∙ 655294477[655294465] ←
 30867466[164823263]               Выполнить после получения записи ←
 11010080[164834225]                 = ≡ Список заказов/приходов ∙ 65545[164823938] ←
      404[164828557]                   Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823504]                     Список элементов ←
   327700[164834740]                       Выражение ≡ Список заказов/приходов ∙ 65545[164823938] ←
   327700[164834751]                       Выражение ≡ з.Документ ∙ 1507335[18547059] ←
 30867466[164824637]           Выполнить после получения записи ←
 11010105[164823405]             Индикатор ←
      404[164856896]               Результат ⁼ Строки ←
      404[164856897]               Результат ≡ CR+LF ∙ 117[1508547] ←
      404[164856898]               Результат ≡ Документ ∙ 1507335[164824661] ←
      411[164832755]                 Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[164832756]                   Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[164834195]             = ≡ Продукт ∙ 65545[164827790] ←
      404[164856890]               Результат ≡ Продукт ∙ 1507335[164824668] ←
 11010080[164834192]             = ≡ ЦО ∙ 65545[164827788] ←
      404[164856883]               Результат ≡ ЦО ∙ 1507335[164824666] ←
 11010080[164834193]             = ≡ Документ промо ∙ 65545[164827792] ←
      404[164856884]               Результат ≡ Документ ∙ 1507335[164824661] ←
  1507728[164823408]             Начало многострочного комментария ←
 11010080[164834194]             = ≡ Номер ДМП ∙ 65545[164827789] ←
      404[164856885]               Результат ≡ Тип ДМП рассчитанный ∙ 1507335[164824671] ←
      411[164832753]                 Уточняющий параметр ≡ Значение ∙ 249[262147] ←
      404[164856886]               Результат ⁼ '_' ←
      404[164856887]               Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164834668]                 Выражение ≡ Номер ДМП рассчитаный ∙ 1507335[164824674] ←
   131097[164824382]                 Формат ≡ Целое N19.0 ∙ 131096[1507329] ←
      404[164856888]               Результат ⁼ '_' ←
      404[164856889]               Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164834669]                 Выражение ≡ Третий револьвер ∙ 1507335[164824673] ←
   131097[164824383]                 Формат ≡ Целое N19.0 ∙ 131096[1507329] ←
 11010080[164823714]             = ≡ Номер ДМП ∙ 65545[164827789] ←
      404[164843857]               Результат ≡ Тип ДМП рассчитанный ∙ 1507335[164824671] ←
      411[164828304]                 Уточняющий параметр ≡ Значение ∙ 249[262147] ←
      404[164843860]               Результат ⁼ '_' ←
      404[164843867]               Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164829173]                 Выражение ≡ Третий револьвер ∙ 1507335[164824673] ←
   131097[164823682]                 Формат ≡ Целое N19.0 ∙ 131096[1507329] ←
 11010080[164836603]             = ≡ Документ промо ∙ 65545[164827792] ←
      404[164870888]               Результат ≡ Товар в списке промо на дату ∙ 249[164823189] ←
 32505862[164831074]                 Значения формальных параметров при вызове ←
 32505860[164838533]                   Значение параметра при вызове процедуры/функции ≡ ЦО ∙ 65545[164828935] ←
   327700[164844893]                     Выражение ≡ ЦО ∙ 65545[164827788] ←
 32505860[164838534]                   Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164828936] ←
   327700[164844894]                     Выражение ≡ Продукт ∙ 65545[164827790] ←
 32505860[164838535]                   Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[164828937] ←
   327700[164844895]                     Выражение ≡ Документ промо ∙ 65545[164827792] ←
      411[164840251]                       Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
 32505860[164838536]                   Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[164828941] ←
   327700[164844896]                     Выражение ≡ Документ промо ∙ 65545[164827792] ←
      411[164840252]                       Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1507729[164823405]             Конец многострочного комментария ←
 11010080[164836602]             = ≡ Номер ДМП ∙ 65545[164827789] ←
      404[164837595]               Результат ≡ Номер ДМП оригинал ∙ 1507335[164824672] ←
 11010080[164834262]             = ≡ Оборудование ДМП ∙ 65545[164827994] ←
      404[164861050]               Результат ≡ Строка документа ∙ 1507335[164824667] ←
      411[164835304]                 Уточняющий параметр ≡ Направить товар ∙ 359[15138820] ←
 11010080[164825271]             = ≡ Тип оборудования ∙ 65545[164824024] ←
      404[164832583]               Результат ≡ Документ промо ∙ 65545[164827792] ←
      411[164825388]                 Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
      411[164825389]                   Уточняющий параметр ≡ Имя ∙ 249[262146] ←
 11010080[164825325]             = ≡ Распеденное значение на ПРОМО ∙ 65545[164824052] ←
  1638402[164823465]               NULL ←
 11010080[164836604]             = ≡ Документ промо ∙ 65545[164827792] ←
      404[164824614]               Результат ≡ Строка документа ∙ 1507335[164824667] ←
      411[164840253]                 Уточняющий параметр ≡ Виды затрат при списании ∙ 359[28835862] ←
  1507360[164823402]             Отбор данных (по запросу) ≡ ПРОВОДКИ ∙ 12124205[48431274] ←
 32505862[164825918]               Значения формальных параметров при вызове ←
 32505860[164830646]                 Значение параметра при вызове процедуры/функции ≡ Список ЦФО ∙ 65545[48433455] ←
   327700[164835101]                   Выражение ≡ Центр финанс. ответственности для ТОВАРНЫХ ПЛАНОВ ∙ 117[45613057] ←
 32505860[164830930]                 Значение параметра при вызове процедуры/функции ≡ Счета по дебету ∙ 65545[48433459] ←
   327700[164835102]                   Выражение ≡ Акции ∙ 131[655294465] ←
 32505860[164831030]                 Значение параметра при вызове процедуры/функции ≡ Дт [1] ∙ 65545[48433462] ←
   327700[164835105]                   Выражение ≡ ЦО ∙ 65545[164827788] ←
 32505860[164830931]                 Значение параметра при вызове процедуры/функции ≡ Дт [2] ∙ 65545[48433463] ←
   327700[164835103]                   Выражение ≡ Продукт ∙ 65545[164827790] ←
 32505860[164831002]                 Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[48433456] ←
   327700[164835104]                   Выражение ≡ Дата, начало дня ∙ 249[30867471] ←
 32505862[164825940]                     Значения формальных параметров при вызове ←
 32505860[164831033]                       Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867497] ←
   327700[164835106]                         Выражение ≡ Документ промо ∙ 65545[164827792] ←
      411[164825645]                           Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
 32505860[164831032]                 Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[48433457] ←
   327700[164835107]                   Выражение ≡ Дата, конец дня ∙ 249[30867475] ←
 32505862[164825941]                     Значения формальных параметров при вызове ←
 32505860[164831036]                       Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
   327700[164835108]                         Выражение ≡ Документ промо ∙ 65545[164827792] ←
      411[164825673]                           Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
 30867466[164823452]               Выполнить после получения записи ←
 11010080[164825324]                 = ≡ Распеденное значение на ПРОМО ∙ 65545[164824052] ←
      404[164832751]                   Результат ≡ Строка из проводки ∙ 1507335[48432632] ←
      411[164825674]                     Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
 11010080[164824942]             = ≡ Дата начала ∙ 65545[164823923] ←
      404[164828112]               Результат ≡ Документ промо ∙ 65545[164827792] ←
      411[164824298]                 Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
 11010080[164824947]             = ≡ Дата окончания ∙ 65545[164823924] ←
      404[164828113]               Результат ≡ Документ промо ∙ 65545[164827792] ←
      411[164824348]                 Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 11010080[164834202]             = ≡ Остаток ∙ 65545[164823936] ←
      404[164828185]               Результат ≡ Актуальные остатки Базового товара (ШТ) @_STOCK ∙ 249[58392584] ←
 32505862[164827065]                 Значения формальных параметров при вызове ←
 32505860[164831743]                   Значение параметра при вызове процедуры/функции ≡ фп Товарные склады/секции ∙ 65545[58392793] ←
   327700[164834757]                     Выражение ≡ Первый ТЗ/ПЦ для ЦО/ТТ/Узла (действ. магазины) ∙ 249[655294491] ←
 32505862[164827066]                       Значения формальных параметров при вызове ←
 32505860[164831747]                         Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[655298326] ←
   327700[164834759]                           Выражение ≡ ЦО ∙ 65545[164827788] ←
 32505860[164831746]                   Значение параметра при вызове процедуры/функции ≡ фп Базовый продукт ∙ 65545[58392796] ←
   327700[164834758]                     Выражение ≡ Продукт ∙ 65545[164827790] ←
 11010080[164834215]             = ≡ Фьючерсный приход ∙ 65545[164823937] ←
  1638402[164824588]               NULL ←
 11010080[164834236]             = ≡ Наименование документа ПРОМО ∙ 65545[164823944] ←
      404[164856866]               Результат ≡ Документ промо ∙ 65545[164827792] ←
      411[164831881]                 Уточняющий параметр ≡ Комментарий ∙ 331[11] ←
      404[164856867]               Результат ⁼ ' (' ←
      404[164856868]               Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164834770]                 Выражение ≡ Документ промо ∙ 65545[164827792] ←
      411[164832776]                   Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
   131097[164824148]                 Формат ≡ Дата без времени ∙ 131096[131073] ←
      404[164856869]               Результат ⁼ ' - ' ←
      404[164856870]               Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164834771]                 Выражение ≡ Документ промо ∙ 65545[164827792] ←
      411[164832779]                   Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
   131097[164824384]                 Формат ≡ Дата без времени ∙ 131096[131073] ←
      404[164856871]               Результат ⁼ ')' ←
 30867470[164825989]             IF ←
  1638463[164826619]               Условие ←
      116[164823513]                 Выражение ←
  1638460[164823813]                   НЕ ←
      404[164856872]                   Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[164827070]                     Значения формальных параметров при вызове ←
 32505860[164831754]                       Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[164834772]                         Выражение ≡ Список типов ДМП для расшифровки ∙ 65545[164827855] ←
 32505860[164831755]                       Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[164834773]                         Выражение ≡ Тип ДМП рассчитанный ∙ 1507335[164824671] ←
      412[164823690]                 ИЛИ ←
      116[164823517]                 Выражение ←
  1638460[164823817]                   НЕ ←
      404[164856874]                   Результат ≡ Список типов ДМП для расшифровки ∙ 65545[164827855] ←
 30867472[164825944]               THEN ←
 11010080[164834237]                 = ≡ Список типов ДМП для расшифровки ∙ 65545[164827855] ←
      404[164856873]                   Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823505]                     Список элементов ←
   327700[164834774]                       Выражение ≡ Список типов ДМП для расшифровки ∙ 65545[164827855] ←
   327700[164834775]                       Выражение ≡ Тип ДМП рассчитанный ∙ 1507335[164824671] ←
 11010079[164823310]             CASE ←
  1572877[164823345]               Условие ←
      404[164827932]                 Результат ≡ Строка документа ∙ 1507335[164824667] ←
      411[164824288]                   Уточняющий параметр ≡ Способ оплаты ∙ 359[6684673] ←
      411[164824290]                     Уточняющий параметр ≡ Значение ∙ 249[262147] ←
 11010081[164824187]               OF ⁼ 1 ←
 11010080[164824750]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827933]                   Результат ⁼ 'Просто цены ниже' ←
 11010081[164824188]               OF ⁼ 2 ←
 11010080[164824751]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827934]                   Результат ⁼ 'Просто цены ниже' ←
 11010081[164824189]               OF ⁼ 3 ←
 11010080[164824752]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827935]                   Результат ⁼ 'Просто цены ниже' ←
 11010081[164824190]               OF ⁼ 4 ←
 11010080[164824753]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827936]                   Результат ⁼ 'Просто цены ниже' ←
 11010081[164824191]               OF ⁼ 5 ←
 11010080[164824754]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827937]                   Результат ⁼ 'Просто цены ниже' ←
 11010081[164824192]               OF ⁼ 10 ←
 11010080[164824755]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827938]                   Результат ⁼ 'Только сегодня' ←
 11010081[164824193]               OF ⁼ 11 ←
 11010080[164824756]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827939]                   Результат ⁼ 'Премия' ←
 11010081[164824194]               OF ⁼ 12 ←
 11010080[164824757]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827940]                   Результат ⁼ 'Премия' ←
 11010081[164824195]               OF ⁼ 13 ←
 11010080[164824758]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827941]                   Результат ⁼ 'Все по' ←
 11010081[164824196]               OF ⁼ 14 ←
 11010080[164824759]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827942]                   Результат ⁼ 'Регулярный ценник' ←
 11010081[164824197]               OF ⁼ 15 ←
 11010080[164824760]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827944]                   Результат ⁼ 'Премия' ←
 11010081[164824198]               OF ⁼ 16 ←
 11010080[164824761]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827945]                   Результат ⁼ 'Тематическая акция' ←
 11010081[164824199]               OF ⁼ 17 ←
 11010080[164824762]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827946]                   Результат ⁼ 'Премия' ←
 11010081[164824200]               OF ⁼ 19 ←
 11010080[164824763]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827947]                   Результат ⁼ 'Просто цены ниже' ←
 11010081[164824201]               OF ⁼ 20 ←
 11010080[164824834]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827948]                   Результат ⁼ 'Тематическая акция' ←
 11010081[164824202]               OF ⁼ 201 ←
 11010080[164824836]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827949]                   Результат ⁼ 'Тематическая акция' ←
 11010081[164824203]               OF ⁼ 202 ←
 11010080[164824837]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827950]                   Результат ⁼ 'Тематическая акция' ←
 11010081[164824204]               OF ⁼ 203 ←
 11010080[164824838]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827953]                   Результат ⁼ 'Тематическая акция' ←
 11010081[164824205]               OF ⁼ 204 ←
 11010080[164824839]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827954]                   Результат ⁼ 'Тематическая акция' ←
 11010081[164824206]               OF ⁼ 205 ←
 11010080[164824840]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827955]                   Результат ⁼ 'Тематическая акция' ←
 30867470[164825985]             IF ←
  1638463[164826614]               Условие ←
      404[164856846]                 Результат ≡ Автоматически ∙ 65545[164823942] ←
 30867472[164825940]               THEN ←
 30867470[164825986]                 IF ←
  1638463[164826615]                   Условие ←
      404[164856847]                     Результат ≡ Товар ∙ 65545[164827787] ←
 30867472[164825941]                   THEN ←
 11010088[164825779]                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824164]                       Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 39780357[164823150]                       Ссылка на блок шаблона ≡ Строка по SKU ∙ 12124197[164823061] ←
 30867473[164824130]                   ELSE ←
 30867470[164825992]                     IF ←
  1638463[164826622]                       Условие ←
      404[164856848]                         Результат ≡ Подразделения ∙ 65545[164827784] ←
 30867472[164825947]                       THEN ←
 11010088[164825780]                         ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824165]                           Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 39780357[164823151]                           Ссылка на блок шаблона ≡ Строка по 1 ТТ ∙ 12124197[164823059] ←
 30867473[164824131]                       ELSE ←
 11010088[164825781]                         ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824166]                           Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 39780357[164823152]                           Ссылка на блок шаблона ≡ Строка по сети ∙ 12124197[164823060] ←
 30867473[164824134]               ELSE ←
 30867470[164825993]                 IF ←
  1638463[164826623]                   Условие ←
      404[164856849]                     Результат ≡ Товар ∙ 65545[164827787] ←
 30867472[164825948]                   THEN ←
 11010088[164825787]                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824167]                       Файл ≡ Файл отчета ∙ 65545[164824007] ←
 39780357[164823665]                       Ссылка на блок шаблона ≡ Строка по SKU ∙ 12124197[164823061] ←
 30867473[164824135]                   ELSE ←
 30867470[164825994]                     IF ←
  1638463[164826624]                       Условие ←
      404[164856852]                         Результат ≡ Подразделения ∙ 65545[164827784] ←
 30867472[164825949]                       THEN ←
 11010088[164825788]                         ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824169]                           Файл ≡ Файл отчета ∙ 65545[164824007] ←
 39780357[164823666]                           Ссылка на блок шаблона ≡ Строка по 1 ТТ ∙ 12124197[164823059] ←
 30867473[164824136]                       ELSE ←
 11010088[164825789]                         ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824170]                           Файл ≡ Файл отчета ∙ 65545[164824007] ←
 39780357[164823667]                           Ссылка на блок шаблона ≡ Строка по сети ∙ 12124197[164823060] ←
  1507728[164823786]             Начало многострочного комментария ←
 11010079[164823311]             CASE ←
  1572877[164823346]               Условие ←
      404[164827956]                 Результат ≡ Третий револьвер ∙ 1507335[164824673] ←
 11010081[164823371]               OF ⁼ 1 ←
 11010081[164824207]               OF ⁼ 2 ←
 30867470[164823488]                 IF ←
  1638463[164823576]                   Условие ←
      404[164828561]                     Результат ≡ Список заказов/приходов ∙ 65545[164823938] ←
 30867472[164823479]                   THEN ←
  1507360[164824493]                     Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
  1507673[164823493]                       Ключи оптимизации ←
  1507675[164823827]                         Использовать индекс ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507676[164823831]                           Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
  1507675[164823828]                         Использовать индекс ≡ ПРОДУКТЫ ∙ 12124204[1507787] ←
  1507676[164823832]                           Уточняющий параметр ≡ ID ∙ 1507445[1507431] ←
 32505862[164827064]                       Значения формальных параметров при вызове ←
 32505860[164831738]                         Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164834752]                           Выражение ≡ Список заказов/приходов ∙ 65545[164823938] ←
 32505860[164831745]                         Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт ∙ 65545[1510111] ←
   327700[164834753]                           Выражение ≡ Продукт ∙ 65545[164827790] ←
 12124215[164823147]                       Where      (Ограничения на отбор данных) ←
  1507381[164823416]                         <Наследуемые ограничения> ←
      413[164823411]                         И ←
  1507376[164823398]                         Выражение ←
  1507455[164823358]                           Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164823679]                             Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[164823606]                           Равно ←
  1638402[164824590]                           NULL ←
      413[164823412]                         И ←
  1507376[164823399]                         Выражение ←
  1507455[164823360]                           Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164823680]                             Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  1638478[164823083]                           Больше ←
  1507452[164826619]                           Константа ⁼ 0 ←
 30867466[164823265]                       Выполнить после получения записи ←
 30867470[164823489]                         IF ←
  1638463[164826601]                           Условие ←
      404[164828562]                             Результат ≡ Фьючерсный приход ∙ 65545[164823937] ←
 30867472[164823480]                           THEN ←
 11010080[164834226]                             = ≡ Фьючерсный приход ∙ 65545[164823937] ←
      404[164828563]                               Результат ≡ Фьючерсный приход ∙ 65545[164823937] ←
      404[164828564]                               Результат ≡ CR+LF ∙ 117[1508547] ←
      404[164828565]                               Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164834754]                                 Выражение ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[164832744]                                   Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
   131097[164823153]                                 Формат ≡ Количество N19.3 ∙ 131096[30867458] ←
      404[164828566]                               Результат ⁼ ' - ' ←
      404[164828567]                               Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164834755]                                 Выражение ≡ Строка.Документ ∙ 1507335[1508505] ←
      411[164832745]                                   Уточняющий параметр ≡ Дата поставки ∙ 331[14352402] ←
   131097[164823154]                                 Формат ≡ Дата без времени ∙ 131096[131073] ←
 30867473[164823190]                           ELSE ←
 11010080[164834227]                             = ≡ Фьючерсный приход ∙ 65545[164823937] ←
      404[164828570]                               Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164834738]                                 Выражение ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[164832746]                                   Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
   131097[164823155]                                 Формат ≡ Количество N19.3 ∙ 131096[30867458] ←
      404[164828571]                               Результат ⁼ ' - ' ←
      404[164828572]                               Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164834756]                                 Выражение ≡ Строка.Документ ∙ 1507335[1508505] ←
      411[164832772]                                   Уточняющий параметр ≡ Дата поставки ∙ 331[14352402] ←
   131097[164824002]                                 Формат ≡ Дата без времени ∙ 131096[131073] ←
 11010080[164824941]                 = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827958]                   Результат ⁼ 'Регулярный ценник' ←
 30867470[164823412]                 IF ←
  1638463[164823378]                   Условие ←
      116[164823190]                     Выражение ←
      404[164824616]                       Результат ≡ Тип ДМП рассчитанный ∙ 1507335[164824671] ←
  1638473[164823238]                       Равно ←
      404[164824617]                       Результат ≡ Наружка (Нон-фуд) ∙ 164823049[164823041] ←
      412[164823056]                     ИЛИ ←
      116[164823193]                     Выражение ←
      404[164824618]                       Результат ≡ Тип ДМП рассчитанный ∙ 1507335[164824671] ←
  1638473[164823239]                       Равно ←
      404[164824619]                       Результат ≡ Наружка (Фуд) ∙ 164823049[164823042] ←
 30867472[164823310]                   THEN ←
 11010080[164834177]                     = ≡ Дата начала ∙ 65545[164823923] ←
      404[164828114]                       Результат ≡ Документ промо ∙ 65545[164827792] ←
      411[164824350]                         Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
 11010080[164834176]                     = ≡ Дата окончания ∙ 65545[164823924] ←
      404[164824624]                       Результат ≡ Документ промо ∙ 65545[164827792] ←
      411[164825361]                         Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 30867473[164823299]                   ELSE ←
 11010080[164825882]                     = ≡ Дата окончания ∙ 65545[164823924] ←
      404[164824620]                       Результат ≡ Документ промо ∙ 65545[164827792] ←
      411[164825360]                         Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
 11010080[164825896]                     = ≡ Дата начала ∙ 65545[164823923] ←
      404[164824621]                       Результат ≡ Дата окончания ∙ 65545[164823924] ←
      406[164823409]                       Вычесть ←
      116[164823195]                       Выражение ←
      404[164824622]                         Результат ≡ Сутки ∙ 117[16843851] ←
      403[164823057]                         Умножить ←
      404[164824623]                         Результат ⁼ 7 ←
 30867470[164825995]                 IF ←
  1638463[164826625]                   Условие ←
      404[164856853]                     Результат ≡ Автоматически ∙ 65545[164823942] ←
 30867472[164825950]                   THEN ←
 30867470[164825996]                     IF ←
  1638463[164826626]                       Условие ←
      404[164856858]                         Результат ≡ Товар ∙ 65545[164827787] ←
 30867472[164825951]                       THEN ←
 11010088[164825794]                         ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824176]                           Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 39780357[164823668]                           Ссылка на блок шаблона ≡ Строка по SKU ∙ 12124197[164823061] ←
 30867473[164824137]                       ELSE ←
 30867470[164825997]                         IF ←
  1638463[164826627]                           Условие ←
      404[164856859]                             Результат ≡ Подразделения ∙ 65545[164827784] ←
 30867472[164825952]                           THEN ←
 11010088[164825795]                             ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824177]                               Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 39780357[164823669]                               Ссылка на блок шаблона ≡ Строка по 1 ТТ ∙ 12124197[164823059] ←
 30867473[164824138]                           ELSE ←
 11010088[164825796]                             ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824178]                               Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 39780357[164823670]                               Ссылка на блок шаблона ≡ Строка по сети ∙ 12124197[164823060] ←
 30867473[164824139]                   ELSE ←
 30867470[164825998]                     IF ←
  1638463[164826628]                       Условие ←
      404[164856860]                         Результат ≡ Товар ∙ 65545[164827787] ←
 30867472[164825953]                       THEN ←
 11010088[164825797]                         ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164823680]                           Файл ≡ Файл отчета ∙ 65545[164824007] ←
 39780357[164823671]                           Ссылка на блок шаблона ≡ Строка по SKU ∙ 12124197[164823061] ←
 30867473[164824140]                       ELSE ←
 30867470[164825999]                         IF ←
  1638463[164826629]                           Условие ←
      404[164856861]                             Результат ≡ Подразделения ∙ 65545[164827784] ←
 30867472[164825954]                           THEN ←
 11010088[164825798]                             ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164823681]                               Файл ≡ Файл отчета ∙ 65545[164824007] ←
 39780357[164823672]                               Ссылка на блок шаблона ≡ Строка по 1 ТТ ∙ 12124197[164823059] ←
 30867473[164824141]                           ELSE ←
 11010088[164825799]                             ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824158]                               Файл ≡ Файл отчета ∙ 65545[164824007] ←
 39780357[164823673]                               Ссылка на блок шаблона ≡ Строка по сети ∙ 12124197[164823060] ←
 11010081[164824208]               OF ⁼ 3 ←
 30867470[164823413]                 IF ←
  1638463[164823379]                   Условие ←
      404[164824625]                     Результат ≡ Показывать распродажи ∙ 65545[164824663] ←
  1638473[164823240]                     Равно ←
      404[164824626]                     Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[164823311]                   THEN ←
 11010080[164824841]                     = ≡ Спецценник ∙ 65545[164827791] ←
      404[164827957]                       Результат ⁼ 'Просто цены ниже' ←
 11010080[164834203]                     = ≡ Документ распродажа ∙ 65545[164827967] ←
      404[164828148]                       Результат ≡ Товар в распродаже ∙ 249[164823120] ←
 32505862[164823251]                         Значения формальных параметров при вызове ←
 32505860[164823484]                           Значение параметра при вызове процедуры/функции ≡ ЦО ∙ 65545[164827960] ←
   327700[164823661]                             Выражение ≡ ЦО ∙ 65545[164827788] ←
 32505860[164823485]                           Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164827961] ←
   327700[164823662]                             Выражение ≡ Продукт ∙ 65545[164827790] ←
 32505860[164824410]                           Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164827966] ←
   327700[164824777]                             Выражение ≡ Дата формирования ∙ 65545[164827783] ←
 30867470[164823448]                     IF ←
  1638463[164823515]                       Условие ←
      404[164828149]                         Результат ≡ Документ распродажа ∙ 65545[164827967] ←
 30867472[164823440]                       THEN ←
 11010080[164834178]                         = ≡ Дата начала ∙ 65545[164823923] ←
      404[164828115]                           Результат ≡ Документ промо ∙ 65545[164827792] ←
      411[164824351]                             Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
 11010080[164834179]                         = ≡ Дата окончания ∙ 65545[164823924] ←
      404[164828121]                           Результат ≡ Документ распродажа ∙ 65545[164827967] ←
      411[164824352]                             Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
 30867470[164825980]                         IF ←
  1638463[164826609]                           Условие ←
      404[164854176]                             Результат ≡ Автоматически ∙ 65545[164823942] ←
 30867472[164825935]                           THEN ←
 30867470[164825982]                             IF ←
  1638463[164826612]                               Условие ←
      404[164854423]                                 Результат ≡ Товар ∙ 65545[164827787] ←
 30867472[164825939]                               THEN ←
 11010088[164825777]                                 ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824161]                                   Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 39780357[164823148]                                   Ссылка на блок шаблона ≡ Строка по SKU ∙ 12124197[164823061] ←
 30867473[164824124]                               ELSE ←
 30867470[164825991]                                 IF ←
  1638463[164826618]                                   Условие ←
      404[164855321]                                     Результат ≡ Подразделения ∙ 65545[164827784] ←
 30867472[164825946]                                   THEN ←
 11010088[164825778]                                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824162]                                       Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 39780357[164823460]                                       Ссылка на блок шаблона ≡ Строка по 1 ТТ ∙ 12124197[164823059] ←
 30867473[164824125]                                   ELSE ←
 11010088[164825786]                                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824163]                                       Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 39780357[164823664]                                       Ссылка на блок шаблона ≡ Строка по сети ∙ 12124197[164823060] ←
 30867473[164824126]                           ELSE ←
 30867470[164825987]                             IF ←
  1638463[164826616]                               Условие ←
      404[164856850]                                 Результат ≡ Товар ∙ 65545[164827787] ←
 30867472[164825942]                               THEN ←
 11010088[164825782]                                 ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824159]                                   Файл ≡ Файл отчета ∙ 65545[164824007] ←
 39780357[164823153]                                   Ссылка на блок шаблона ≡ Строка по SKU ∙ 12124197[164823061] ←
 30867473[164824132]                               ELSE ←
 30867470[164825988]                                 IF ←
  1638463[164826617]                                   Условие ←
      404[164856851]                                     Результат ≡ Подразделения ∙ 65545[164827784] ←
 30867472[164825943]                                   THEN ←
 11010088[164825783]                                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824160]                                       Файл ≡ Файл отчета ∙ 65545[164824007] ←
 39780357[164823154]                                       Ссылка на блок шаблона ≡ Строка по 1 ТТ ∙ 12124197[164823059] ←
 30867473[164824133]                                   ELSE ←
 11010088[164825784]                                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824168]                                       Файл ≡ Файл отчета ∙ 65545[164824007] ←
 39780357[164823155]                                       Ссылка на блок шаблона ≡ Строка по сети ∙ 12124197[164823060] ←
 30867473[164824127]               ELSE ←
  1507729[164823786]             Конец многострочного комментария ←
  1507468[164823100]           Выполнить после обработки блока ≡ ТТ ∙ 1507465[164823136] ←
 30867470[164823490]             IF ←
  1638463[164826602]               Условие ←
      404[164856875]                 Результат ≡ Автоматически ∙ 65545[164823942] ←
 30867472[164825928]               THEN ←
 11010088[164825790]                 ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824171]                   Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 39780357[164823149]                   Ссылка на блок шаблона ≡ Закрыть таблицу ∙ 12124197[164823066] ←
  1507728[170590220]                 Начало многострочного комментария ←
 11010080[164834238]                 = ≡ i ∙ 65545[164827856] ←
      404[164856876]                   Результат ⁼ 0 ←
 12124162[164823102]                 WHILE ←
  1638463[164826620]                   Условие ←
      404[164856877]                     Результат ≡ Множество.Элемент (первый элемент имеет нулевой индекс) ∙ 387[1507488] ←
   327700[164834776]                       Выражение ≡ Список типов ДМП для расшифровки ∙ 65545[164827855] ←
  1507670[164823104]                       Индекс ≡ i ∙ 65545[164827856] ←
 30867469[164823284]                   БЛОК ←
 11010080[164834239]                     = ≡ Расшифровка ДМП ∙ 65545[164827854] ←
      404[164856878]                       Результат ≡ Множество.Элемент (первый элемент имеет нулевой индекс) ∙ 387[1507488] ←
      411[164832773]                         Уточняющий параметр ≡ Значение ∙ 249[262147] ←
   327700[164834777]                         Выражение ≡ Список типов ДМП для расшифровки ∙ 65545[164827855] ←
  1507670[164823105]                         Индекс ≡ i ∙ 65545[164827856] ←
      404[164856880]                       Результат ⁼ ' - ' ←
      404[164856881]                       Результат ≡ Множество.Элемент (первый элемент имеет нулевой индекс) ∙ 387[1507488] ←
      411[164832774]                         Уточняющий параметр ≡ Имя ∙ 249[262146] ←
   327700[164834778]                         Выражение ≡ Список типов ДМП для расшифровки ∙ 65545[164827855] ←
  1507670[164823106]                         Индекс ≡ i ∙ 65545[164827856] ←
 11010088[164825791]                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824172]                       Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 39780357[164823458]                       Ссылка на блок шаблона ≡ Строка расшифровки ДМП ∙ 12124197[164823068] ←
 48431134[164823140]                     ++ ≡ i ∙ 65545[164827856] ←
  1507729[170590220]                 Конец многострочного комментария ←
 11010088[164825792]                 ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824173]                   Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 39780357[164823459]                   Ссылка на блок шаблона ≡ Конец файла ∙ 12124197[164823067] ←
 11010080[164834240]                 = ≡ Адреса ∙ 65545[164823943] ←
      404[164856882]                   Результат ≡ Получить адреса для отчета по всем доступным уровням ∙ 249[164823073] ←
 32505862[164827071]                     Значения формальных параметров при вызове ←
 32505860[164831756]                       Значение параметра при вызове процедуры/функции ≡ Функция. Подразделение ∙ 65545[164825686] ←
   327700[164834779]                         Выражение ≡ ЦО ∙ 65545[164827788] ←
 32505860[164831757]                       Значение параметра при вызове процедуры/функции ≡ Функция. УИД Отчета ∙ 65545[164825689] ←
   327700[164834780]                         Выражение ≡ ПроектныйЭлемент.UID ∙ 387[1507397] ←
  1507425[164823229]                           Проектный элемент ≡ Отчет револьвер ДМП ∙ 127[164823593] ←
 30867470[164825990]                 IF ←
  1638463[164826621]                   Условие ←
      404[164856894]                     Результат ≡ Адреса ∙ 65545[164823943] ←
 30867472[164825945]                   THEN ←
 11010088[164888626]                     ВЫПОЛНИТЬ ≡ Отчет.Закрыть ∙ 220[12124163] ←
 39780367[164888806]                       Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 11010088[164825793]                     ВЫПОЛНИТЬ ≡ Передача файла на адреса эл.почты ∙ 127[656081354] ←
 32505862[164827072]                       Значения формальных параметров при вызове ←
 32505860[164831758]                         Значение параметра при вызове процедуры/функции ≡ Файл имя (ф) ∙ 65545[656084450] ←
   327700[164834781]                           Выражение ≡ Файл на ТТ ∙ 65545[164824005] ←
 32505860[164831759]                         Значение параметра при вызове процедуры/функции ≡ Сообщение письма (ф) ∙ 65545[656084454] ←
   327700[164834782]                           Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164823649]                             Выполнить действия ←
 39780366[164823906]                               RETURN ←
      116[164823518]                                 Выражение ←
      404[164856895]                                   Результат ⁼ Добрый день. ←
      404[164856899]                                   Результат ≡ CR+LF ∙ 117[1508547] ←
      404[164856901]                                   Результат ≡ CR+LF ∙ 117[1508547] ←
      404[164856902]                                   Результат ⁼ Во вложении данного письма находится файл отчета по размещению товаров на ДМП на вашем магазине. ←
 32505860[164831760]                         Значение параметра при вызове процедуры/функции ≡ Тема письма (ф) ∙ 65545[656084453] ←
   327700[164834783]                           Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 12124189[164823096]                             Выполнить при завершении ←
 39780366[164823907]                               RETURN ←
      404[164856903]                                 Результат ⁼ 'DMP ' ←
      404[164856904]                                 Результат ≡ ЦО ∙ 65545[164827788] ←
      411[164832780]                                   Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
 32505860[164831761]                         Значение параметра при вызове процедуры/функции ≡ E-mail(ы) получателей  (ф) ∙ 65545[656084452] ←
   327700[164834784]                           Выражение ≡ Адреса ∙ 65545[164823943] ←
 32505860[164831762]                         Значение параметра при вызове процедуры/функции ≡ E-mail отправителя (ф) ∙ 65545[656084451] ←
   327700[164834785]                           Выражение ⁼ 'd8office@krasyar.ru' ←
  1507728[164823792]                     Начало многострочного комментария ←
 11010088[164827588]                     ВЫПОЛНИТЬ ≡ Передача файла на адреса эл.почты ∙ 127[656081354] ←
 32505862[164831347]                       Значения формальных параметров при вызове ←
 32505860[164838116]                         Значение параметра при вызове процедуры/функции ≡ Файл имя (ф) ∙ 65545[656084450] ←
   327700[164831692]                           Выражение ≡ Файл на ТТ ∙ 65545[164824005] ←
 32505860[164838117]                         Значение параметра при вызове процедуры/функции ≡ Сообщение письма (ф) ∙ 65545[656084454] ←
   327700[164831693]                           Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164824656]                             Выполнить действия ←
 39780366[164825237]                               RETURN ←
      116[164829535]                                 Выражение ←
      404[164872322]                                   Результат ⁼ Добрый день. ←
      404[164872323]                                   Результат ≡ CR+LF ∙ 117[1508547] ←
      404[164872324]                                   Результат ≡ CR+LF ∙ 117[1508547] ←
      404[164872325]                                   Результат ⁼ Во вложении данного письма находится файл отчета по размещению товаров на ДМП на вашем магазине. ←
 32505860[164838118]                         Значение параметра при вызове процедуры/функции ≡ Тема письма (ф) ∙ 65545[656084453] ←
   327700[164831701]                           Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 12124189[164823132]                             Выполнить при завершении ←
 39780366[164825238]                               RETURN ←
      404[164872326]                                 Результат ⁼ 'DMP ' ←
      404[164872327]                                 Результат ≡ ЦО ∙ 65545[164827788] ←
      411[164840843]                                   Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
 32505860[164838119]                         Значение параметра при вызове процедуры/функции ≡ E-mail(ы) получателей  (ф) ∙ 65545[656084452] ←
   327700[164842092]                           Выражение ⁼ andreyk@krasyar.ru ←
 32505860[164838957]                         Значение параметра при вызове процедуры/функции ≡ E-mail отправителя (ф) ∙ 65545[656084451] ←
   327700[164844134]                           Выражение ⁼ 'd8office@krasyar.ru' ←
  1507729[164823792]                     Конец многострочного комментария ←
 11010088[164825772]                 ВЫПОЛНИТЬ ≡ Файл.Удалить ∙ 249[1507333] ←
 39780367[164824175]                   Файл ≡ Файл на ТТ ∙ 65545[164824005] ←
 30867470[164825981]         IF ←
  1638463[164826613]           Условие ←
  1638460[164823816]             НЕ ←
      404[164856854]             Результат ≡ Автоматически ∙ 65545[164823942] ←
 30867472[164825936]           THEN ←
 11010088[164825553]             ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164823682]               Файл ≡ Файл отчета ∙ 65545[164824007] ←
 39780357[164823091]               Ссылка на блок шаблона ≡ Закрыть таблицу ∙ 12124197[164823066] ←
  1507728[170590221]             Начало многострочного комментария ←
 11010080[164833770]             = ≡ i ∙ 65545[164827856] ←
      404[164855639]               Результат ⁼ 0 ←
 12124162[164823098]             WHILE ←
  1638463[164826479]               Условие ←
      404[164855638]                 Результат ≡ Множество.Элемент (первый элемент имеет нулевой индекс) ∙ 387[1507488] ←
   327700[164834032]                   Выражение ≡ Список типов ДМП для расшифровки ∙ 65545[164827855] ←
  1507670[164823097]                   Индекс ≡ i ∙ 65545[164827856] ←
 30867469[164823896]               БЛОК ←
 11010080[164833771]                 = ≡ Расшифровка ДМП ∙ 65545[164827854] ←
      404[164855640]                   Результат ≡ Множество.Элемент (первый элемент имеет нулевой индекс) ∙ 387[1507488] ←
      411[164832357]                     Уточняющий параметр ≡ Значение ∙ 249[262147] ←
   327700[164834033]                     Выражение ≡ Список типов ДМП для расшифровки ∙ 65545[164827855] ←
  1507670[164823098]                     Индекс ≡ i ∙ 65545[164827856] ←
      404[164855641]                   Результат ⁼ ' - ' ←
      404[164855642]                   Результат ≡ Множество.Элемент (первый элемент имеет нулевой индекс) ∙ 387[1507488] ←
      411[164832358]                     Уточняющий параметр ≡ Имя ∙ 249[262146] ←
   327700[164834034]                     Выражение ≡ Список типов ДМП для расшифровки ∙ 65545[164827855] ←
  1507670[164823099]                     Индекс ≡ i ∙ 65545[164827856] ←
 11010088[164825626]                 ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164823705]                   Файл ≡ Файл отчета ∙ 65545[164824007] ←
 39780357[164823351]                   Ссылка на блок шаблона ≡ Строка расшифровки ДМП ∙ 12124197[164823068] ←
 48431134[164823105]                 ++ ≡ i ∙ 65545[164827856] ←
  1507729[170590221]             Конец многострочного комментария ←
 11010088[164825625]             ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164823704]               Файл ≡ Файл отчета ∙ 65545[164824007] ←
 39780357[164823350]               Ссылка на блок шаблона ≡ Конец файла ∙ 12124197[164823067] ←
  1507412[164823095]       Закрыть индикатор ←
 30867470[164825793]       IF ←
  1638463[164826383]         Условие ←
  1638460[164823735]           НЕ ←
      404[164826486]           Результат ≡ Автоматически ∙ 65545[164823942] ←
 30867472[164825752]         THEN ←
 11010088[164825552]           ВЫПОЛНИТЬ ≡ Отчет.Показать ∙ 220[12124164] ←
 39780367[164823292]             Файл ≡ Файл отчета ∙ 65545[164824007] ←
  1507334[164823053]             Интерфейс ≡ HTML ∙ 486[3342337] ←
 12124189[164823094]     Выполнить при завершении ←
 30867470[164825794]       IF ←
  1638463[164826384]         Условие ←
  1638460[164823804]           НЕ ←
      404[164826488]           Результат ≡ Автоматически ∙ 65545[164823942] ←
 30867472[164825753]         THEN ←
 11010088[164825773]           ВЫПОЛНИТЬ ≡ Файл.Закрыть ∙ 249[1507341] ←
 39780367[164824179]             Файл ≡ Файл отчета ∙ 65545[164824007] ←
 11010088[164825800]           ВЫПОЛНИТЬ ≡ Файл.Удалить ∙ 249[1507333] ←
 39780367[164824180]             Файл ≡ Файл отчета ∙ 65545[164824007] ←
