ETK\Admin

      127[172097583]   Процедура • тестовая ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[172097565]     Локальные переменные ←
    65545[172098674]       Локальная переменная • Договоры ≡ Партнер ∙ 107[5] ←
    65545[172098381]       Локальная переменная • Список спецификаций ≡ Список документов ∙ 107[1507335] ←
    65545[172098380]       Локальная переменная • Спецификация ≡ Строка (объект БД) ∙ 107[10] ←
      355[172097851]         Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[172098372]       Локальная переменная • Причины выставления претензии (должны отниматься от кол-ва) ≡ Список объектов ∙ 107[1507330] ←
      355[172097849]         Начальное значение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[172097666]           Список элементов ←
   327700[172098369]             Выражение ≡ Излишки ∙ 164364313[164364293] ←
   327700[172098370]             Выражение ≡ Пересорт излишки ∙ 164364313[165347329] ←
    65545[172098405]       Локальная переменная • ТЗ от ЦО ≡ Партнер ∙ 107[5] ←
    65545[172098401]       Локальная переменная • кол-во ≡ Количество ∙ 107[15] ←
      355[172097844]         Начальное значение ⁼ 10 ←
    65545[172098402]       Локальная переменная • цена ≡ Число ∙ 107[4] ←
      355[172097845]         Начальное значение ⁼ 129.89 ←
    65545[172098403]       Локальная переменная • произведение ≡ Число ∙ 107[4] ←
    65545[172098393]       Локальная переменная • остаток продукта ≡ Количество ∙ 107[15] ←
    65545[172098382]       Локальная переменная • цена закуп ≡ Число ∙ 107[4] ←
    65545[172098366]       Локальная переменная • Каталог для сохранения ≡ Длинная строка (250) ∙ 107[28835851] ←
      355[172097836]         Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[172098365]       Локальная переменная • Тестовый файл ≡ Наименование объекта (80) ∙ 107[262147] ←
    65545[172098329]       Локальная переменная • Остаток по онлайн чекам ≡ Количество ∙ 107[15] ←
    65545[172098300]       Локальная переменная • Найдено? ≡ bool ∙ 107[1507344] ←
    65545[172098105]       Локальная переменная • документ спецификация ≡ Документ ∙ 107[8] ←
    65545[172098299]       Локальная переменная • Документ корректировки ≡ Документ ∙ 107[8] ←
    65545[172097889]       Локальная переменная • лп Для резки ≡ Строка (40) ∙ 107[1] ←
      355[172097684]         Начальное значение ⁼ '20131' ←
    65545[172097869]       Локальная переменная • строки ≡ Список строк ∙ 107[1507337] ←
    65545[172097830]       Локальная переменная • день_недели_цифра ≡ Целое ∙ 107[2] ←
    65545[172097829]       Локальная переменная • дата_сегодня ≡ Дата+Время ∙ 107[2621441] ←
      355[172097668]         Начальное значение ≡ Сегодня, начало дня ∙ 249[2293761] ←
    65545[172097801]       Локальная переменная • Проверочная ≡ Партнер ∙ 107[5] ←
    65545[172097866]       Локальная переменная • товар ≡ Продукт ∙ 107[7] ←
      355[172097655]         Начальное значение ⁼ 3:0:0:11593 ←
    65545[172097867]       Локальная переменная • типы цехов ≡ Список объектов ∙ 107[1507330] ←
    65545[172097854]       Локальная переменная • документ ≡ Документ ∙ 107[8] ←
      355[172097652]         Начальное значение ⁼ 5:0:0:154875617 ←
    65545[172097855]       Локальная переменная • партнер.ид ≡ Партнер ∙ 107[5] ←
    65545[172097856]       Локальная переменная • партнер.наименование ≡ Наименование объекта (80) ∙ 107[262147] ←
    65545[172097857]       Локальная переменная • партнер.внешний код ≡ Строка (40) ∙ 107[1] ←
    65545[172097861]       Локальная переменная • Проверочный документ для проводок ≡ Документ ∙ 107[8] ←
      355[172097653]         Начальное значение ⁼ 5:0:0:153755998 ←
 30867495[172097550]       Группа локальных переменных • для проверки ←
    65545[172097862]         Локальная переменная • Инициатор1 ≡ Партнер ∙ 107[5] ←
      355[172097654]           Начальное значение ⁼ 4:0:0:1113784 ←
    65545[172097863]         Локальная переменная • Потребитель1 ≡ Партнер ∙ 107[5] ←
    65545[172097864]         Локальная переменная • Сумма1 ≡ Сумма ∙ 107[12] ←
    65545[172097865]         Локальная переменная • Партнер уид ≡ Строка (объект БД) ∙ 107[10] ←
    65545[172098084]       Локальная переменная • Список групп ≡ Список объектов ∙ 107[1507330] ←
    65545[172098077]       Локальная переменная • Список подгрупп ≡ Список объектов ∙ 107[1507330] ←
    65545[172098085]       Локальная переменная • Список mku ≡ Список объектов ∙ 107[1507330] ←
    65545[172098086]       Локальная переменная • Список продуктов ≡ Список объектов ∙ 107[1507330] ←
    65545[172098078]       Локальная переменная • Выбранный ≡ Строка (20) ∙ 107[59375621] ←
    65545[172098081]       Локальная переменная • Цифра ≡ Целое ∙ 107[2] ←
    65545[172098087]       Локальная переменная • документ сроков коэф ≡ Документ ∙ 107[8] ←
      355[172097749]         Начальное значение ⁼ 5:0:0:143539808 ←
    65545[172098088]       Локальная переменная • Товар ≡ Продукт ∙ 107[7] ←
      355[172097750]         Начальное значение ⁼ 3:0:0:48363881 ←
    65545[172098089]       Локальная переменная • коэф осг ≡ Число ∙ 107[4] ←
    65545[172098090]       Локальная переменная • строка ≡ Строка (объект БД) ∙ 107[10] ←
    65545[172098091]       Локальная переменная • нашли? ≡ bool ∙ 107[1507344] ←
      355[172097751]         Начальное значение ⁼ 0 ←
    65545[172098092]       Локальная переменная • Порядковый номер ≡ Целое ∙ 107[2] ←
    65545[172098093]       Локальная переменная • Найденный ≡ Целое ∙ 107[2] ←
      249[172097537]       Функция • Сроки годности по группам ≡ { ... скрипт ... } ∙ 249[39780357] ←
 32505861[172097553]         Формальные параметры ←
    65545[172098094]           Локальная переменная • Документ ограничения сроков годности по группам ≡ Документ ∙ 107[8] ←
    65545[172098095]           Локальная переменная • Ищем Группу или подгруппу ≡ Объект ∙ 107[19] ←
 32505863[172097578]         Локальные переменные ←
    65545[172098096]           Локальная переменная • Список групп ≡ Список объектов ∙ 107[1507330] ←
    65545[172098097]           Локальная переменная • Коэф ≡ Число ∙ 107[4] ←
 12124203[172097541]         Запросы ←
 12124205[172097567]           Запрос • Запрос ←
  1507673[172097552]             Ключи оптимизации ←
  1507675[172097554]               Использовать индекс ∙ 12124204[172097660] ←
  1507676[172097554]                 Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
 12124213[172097649]             Параметры ←
  1507335[172097894]               Параметр • строка_ид ∙ 12124204[172097660] ←
  1507494[172098366]                 Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507335[172097895]               Параметр • строка_коэф ∙ 12124204[172097660] ←
  1507494[172098367]                 Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
 12124200[172097621]             From         (Таблицы) ←
 12124204[172097660]               Таблица ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[172097656]             Where      (Ограничения на отбор данных) ←
  1507376[172097861]               Выражение ←
  1507455[172098033]                 Результат ∙ 12124204[172097660] ←
  1507494[172098368]                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638473[172098072]                 Равно ←
  1507452[172097715]                 Константа ≡ Документ ограничения сроков годности по группам ∙ 65545[172098094] ←
 30867463[172097585]         Выполнить действия ←
 30867470[172097859]           IF ←
  1638463[172097936]             Условие ←
      404[172100994]               Результат ≡ Документ ограничения сроков годности по группам ∙ 65545[172098094] ←
  1638473[172098073]               Равно ←
  1638402[172097619]               NULL ←
 30867472[172097859]             THEN ←
 39780366[172097571]               RETURN ≡ NULL ∙ 117[30670850] ←
 11010080[172098517]           = ≡ Коэф ∙ 65545[172098097] ←
  1638402[172097620]             NULL ←
 30867469[172097630]           БЛОК • отладка ←
 39780361[172097560]             ЗАВЕРШИТЬ БЛОК ≡ DEBUG : WriteMessageToLog ??? (ЛОЖЬ ЕСЛИ РАБОТАЕТ АДМИН) ∙ 249[165478458] ←
 11010088[172097977]             ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[172097805]               Значения формальных параметров при вызове ←
      117[172097564]                 Выражение • Сообщение ≡ Длинная строка (512) ∙ 107[61669379] ←
      404[172100995]                   Результат ⁼ 'Поиск группы в документе "' ←
      404[172101002]                   Результат ≡ Документ ограничения сроков годности по группам ∙ 65545[172098094] ←
      404[172101004]                   Результат ⁼ '" Ищем группу "' ←
      404[172101005]                   Результат ≡ Ищем Группу или подгруппу ∙ 65545[172098095] ←
      411[172098196]                     Уточняющий параметр ≡ Наименование + UID ∙ 117[165478701] ←
      404[172101006]                   Результат ⁼ '"' ←
 32505860[172097996]                 Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[172098173]                   Выражение ≡ Сообщение ∙ 117[172097564] ←
  1507360[172097634]           Отбор данных (по запросу) ≡ Запрос ∙ 12124205[172097567] ←
 30867466[172097654]             Выполнить после получения записи ←
 11010080[172098518]               = ≡ Список групп ∙ 65545[172098096] ←
      404[172101007]                 Результат ≡ строка_ид ∙ 1507335[172097894] ←
      411[172098198]                   Уточняющий параметр ≡ Дни недели ∙ 359[42401884] ←
 30867469[172097631]               БЛОК • отладка ←
 39780361[172097561]                 ЗАВЕРШИТЬ БЛОК ←
 11010088[172097978]                 ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[172097806]                   Значения формальных параметров при вызове ←
      117[172097565]                     Выражение • Сообщение ≡ Длинная строка (512) ∙ 107[61669379] ←
      404[172101009]                       Результат ⁼ 'Список установленных груп "' ←
      404[172101010]                       Результат ≡ Список групп ∙ 65545[172098096] ←
      404[172101011]                       Результат ⁼ '"' ←
 32505860[172097997]                     Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[172098174]                       Выражение ≡ Сообщение ∙ 117[172097565] ←
 30867470[172097860]               IF ←
  1638463[172097937]                 Условие ←
      404[172101012]                   Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[172097807]                     Значения формальных параметров при вызове ←
 32505860[172097998]                       Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[172098175]                         Выражение ≡ Список групп ∙ 65545[172098096] ←
 32505860[172097999]                       Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[172098176]                         Выражение ≡ Ищем Группу или подгруппу ∙ 65545[172098095] ←
 30867472[172097860]                 THEN ←
 11010080[172098521]                   = ≡ Коэф ∙ 65545[172098097] ←
      404[172101017]                     Результат ≡ строка_коэф ∙ 1507335[172097895] ←
 30867469[172097632]                   БЛОК • отладка ←
 39780361[172097562]                     ЗАВЕРШИТЬ БЛОК ≡ DEBUG : WriteMessageToLog ??? (ЛОЖЬ ЕСЛИ РАБОТАЕТ АДМИН) ∙ 249[165478458] ←
 11010088[172097979]                     ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[172097808]                       Значения формальных параметров при вызове ←
      117[172097566]                         Выражение • Сообщение ≡ Длинная строка (512) ∙ 107[61669379] ←
      404[172101018]                           Результат ⁼ 'Найден коэффициент неизвестно откуда : "' ←
      404[172101045]                           Результат ≡ Коэф ∙ 65545[172098097] ←
      404[172101046]                           Результат ⁼ '"' ←
 32505860[172098000]                         Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[172098177]                           Выражение ≡ Сообщение ∙ 117[172097566] ←
 39780366[172097572]           RETURN ≡ Коэф ∙ 65545[172098097] ←
      262[172097538]         Наследуемые атрибуты ≡ Значения формальных параметров при вызове ∙ 1[32505862] ←
    65545[172098098]       Локальная переменная • документ заказа ≡ Документ ∙ 107[8] ←
      355[172097752]         Начальное значение ⁼ 5:0:0:161855153 ←
      249[172097539]       Функция • поиск кол-ва продаж за период по продукту ≡ { ... скрипт ... } ∙ 249[39780357] ←
 32505861[172097565]         Формальные параметры ←
    65545[172098394]           Локальная переменная • ~продукт ≡ Продукт ∙ 107[7] ←
    65545[172098396]           Локальная переменная • ~ТЗ ≡ Партнер ∙ 107[5] ←
    65545[172098397]           Локальная переменная • ~дата начальная ≡ Дата+Время ∙ 107[2621441] ←
    65545[172098398]           Локальная переменная • ~дата конечная ≡ Дата+Время ∙ 107[2621441] ←
    65545[172098395]           Локальная переменная • кол-во ~ ←
 30867555[172097541]             Вернуть значение в вызывающую процедуру ←
 30867463[172097610]         Выполнить действия ←
  1507360[172097723]           Отбор данных (по запросу) • Поиск чеков по товару ←
  1507447[172097605]             Выражения ←
  1507449[172097667]               Выражение • Количество проданного продукта ≡ Количество ∙ 107[15] ←
  1507455[172098282]                 Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[172097625]                   Значения параметров ←
  1507477[172097654]                     Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[172097654]                       Выражение ∙ 12124204[172097681] ←
  1507494[172098680]                         Уточняющий параметр ≡ Колво ∙ 1507443[164298845] ←
 12124200[172097647]             From         (Таблицы) ←
 12124204[172097681]               Таблица ≡ CHECK_ONLINE ∙ 1507433[164298769] ←
 12124213[172097707]             Параметры ←
  1507335[172098011]               Параметр • намен ∙ 12124204[172097681] ←
  1507494[172098681]                 Уточняющий параметр ≡ Продукт ∙ 1507443[164298843] ←
  1507335[172098012]               Параметр • кол-во ∙ 12124204[172097681] ←
  1507506[172097756]                 Использование (в режиме выполнения) ≡ Нет ∙ 534[11599875] ←
  1507494[172098682]                 Уточняющий параметр ≡ Колво ∙ 1507443[164298845] ←
  1507335[172098013]               Параметр ≡ Количество проданного продукта ∙ 1507449[172097667] ←
 12124215[172097707]             Where      (Ограничения на отбор данных) ←
  1507376[172098147]               Выражение ←
  1507455[172098283]                 Результат ∙ 12124204[172097681] ←
  1507494[172098683]                   Уточняющий параметр ≡ Дата ∙ 1507443[164298844] ←
  1638477[172097589]                 Больше или равно ←
  1507452[172097919]                 Константа ≡ ~дата начальная ∙ 65545[172098397] ←
  1507376[172098148]               Выражение ←
  1507455[172098284]                 Результат ∙ 12124204[172097681] ←
  1507494[172098684]                   Уточняющий параметр ≡ Дата ∙ 1507443[164298844] ←
  1638475[172097599]                 Меньше или равно ←
  1507452[172097920]                 Константа ≡ ~дата конечная ∙ 65545[172098398] ←
  1507376[172098149]               Выражение ←
  1507455[172098285]                 Результат ∙ 12124204[172097681] ←
  1507494[172098685]                   Уточняющий параметр ≡ Подразделение (ТЗ) ∙ 1507443[164298850] ←
  1638473[172098289]                 Равно ←
  1507452[172097921]                 Константа ≡ ~ТЗ ∙ 65545[172098396] ←
  1507376[172098150]               Выражение ←
  1507455[172098286]                 Результат ∙ 12124204[172097681] ←
  1507494[172098686]                   Уточняющий параметр ≡ Продукт ∙ 1507443[164298843] ←
  1638473[172098290]                 Равно ←
  1507452[172097922]                 Константа ≡ ~продукт ∙ 65545[172098394] ←
 12124224[172097567]             Group By  (Группировка) ←
  1507533[172097590]               Группировать по параметру ≡ намен ∙ 1507335[172098011] ←
 30867466[172097748]             Выполнить после получения записи ←
 11010088[172098194]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097988]                 Выражение ←
      404[172103755]                   Результат ≡ намен ∙ 1507335[172098011] ←
      404[172103756]                   Результат ⁼ ; ←
      404[172103757]                   Результат ∙ 1507335[172098013] ←
 39780366[172097595]               RETURN ≡ кол-во ~ ∙ 65545[172098395] ←
    65545[172098407]       Локальная переменная • Общее кол-во реализации продукта за день ≡ Количество ∙ 107[15] ←
      355[172097848]         Начальное значение ⁼ 0 ←
    65545[172098408]       Локальная переменная • Дата врем ≡ Дата+Время ∙ 107[2621441] ←
    65545[172098675]       Локальная переменная • Час ≡ Число ∙ 107[4] ←
    65545[172098676]       Локальная переменная • День недели ≡ Целое ∙ 107[2] ←
    65545[172098677]       Локальная переменная • Время продажи ≡ Дата+Время ∙ 107[2621441] ←
      355[172097958]         Начальное значение ⁼ 14/04/2022 15:23:17 ←
    65545[172098678]       Локальная переменная • Коэф. чеков в час ≡ Число ∙ 107[4] ←
    65545[172098679]       Локальная переменная • ДЕНЬ НЕДЕЛИ ≡ Объект ∙ 107[19] ←
 30867463[172097616]     Выполнить действия ←
 11010105[172097600]       Индикатор ←
      404[172103234]         Результат ⁼ Идет поиск... ←
  1507728[172097744]       Начало многострочного комментария ←
 11010088[172097593]       ВЫПОЛНИТЬ ≡ Передача файла на адреса эл.почты ∙ 127[656081354] ←
 32505862[172097607]         Значения формальных параметров при вызове ←
 32505860[172097679]           Значение параметра при вызове процедуры/функции ≡ E-mail(ы) получателей  (ф) ∙ 65545[656084452] ←
   327700[172097991]             Выражение ⁼ 'TatyanaNazarova@krasyar.ru' ←
 32505860[172097680]           Значение параметра при вызове процедуры/функции ≡ Тема письма (ф) ∙ 65545[656084453] ←
   327700[172097992]             Выражение ⁼ Тестовая отправка письма из Домино ←
 32505860[172097690]           Значение параметра при вызове процедуры/функции ≡ Сообщение письма (ф) ∙ 65545[656084454] ←
   327700[172097993]             Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[172097591]               Выполнить действия ←
 39780366[172097537]                 RETURN ←
      116[172097652]                   Выражение ←
      404[172098515]                     Результат ⁼ Добрый день! ←
      404[172098516]                     Результат ≡ CR+LF ∙ 117[1508547] ←
      404[172098519]                     Результат ⁼ Это тестовая рассылка, отвечать на нее не нужно! ←
 32505860[172097691]           Значение параметра при вызове процедуры/функции ≡ Менять кодировку ∙ 65545[656088207] ←
   327700[172097994]             Выражение ⁼ 1 ←
 32505860[172097698]           Значение параметра при вызове процедуры/функции ≡ Отправлено ∙ 65545[656084440] ←
   327700[172097995]             Выражение ≡ Отправлено? ∙ 65545[165151385] ←
 11010088[172097709]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097739]         Выражение ←
      404[172099687]           Результат ≡ Глобальная переменная : Работает администратор ∙ 381[165478402] ←
 11010080[172099405]       = ≡ Час ∙ 65545[172098675] ←
      404[172104931]         Результат ≡ ЧАСЫ ∙ 387[1638426] ←
   327700[172098803]           Выражение ≡ Время продажи ∙ 65545[172098677] ←
 11010080[172099406]       = ≡ День недели ∙ 65545[172098676] ←
      404[172104932]         Результат ≡ День недели 1..6 (Воскресенье = 7) ∙ 249[164298831] ←
 32505862[172098095]           Значения формальных параметров при вызове ←
 32505860[172098540]             Значение параметра при вызове процедуры/функции ≡ фп Дата ∙ 65545[164301597] ←
   327700[172098804]               Выражение ≡ Время продажи ∙ 65545[172098677] ←
 11010079[172097556]       CASE ←
  1572877[172097573]         Условие ←
      404[172104938]           Результат ≡ День недели ∙ 65545[172098676] ←
 11010081[172097589]         OF ⁼ 1 ←
 11010080[172099408]           = ≡ ДЕНЬ НЕДЕЛИ ∙ 65545[172098679] ←
      404[172104939]             Результат ≡ Понедельник ∙ 12779523[20774913] ←
 11010081[172097590]         OF ⁼ 2 ←
 11010080[172099409]           = ≡ ДЕНЬ НЕДЕЛИ ∙ 65545[172098679] ←
      404[172104940]             Результат ≡ Вторник ∙ 12779523[20774914] ←
 11010081[172097591]         OF ⁼ 3 ←
 11010080[172099410]           = ≡ ДЕНЬ НЕДЕЛИ ∙ 65545[172098679] ←
      404[172104941]             Результат ≡ Среда ∙ 12779523[20774915] ←
 11010081[172097592]         OF ⁼ 4 ←
 11010080[172099411]           = ≡ ДЕНЬ НЕДЕЛИ ∙ 65545[172098679] ←
      404[172104942]             Результат ≡ Четверг ∙ 12779523[20774916] ←
 11010081[172097593]         OF ⁼ 5 ←
 11010080[172099412]           = ≡ ДЕНЬ НЕДЕЛИ ∙ 65545[172098679] ←
      404[172104943]             Результат ≡ Пятница ∙ 12779523[20774917] ←
 11010081[172097594]         OF ⁼ 6 ←
 11010080[172099413]           = ≡ ДЕНЬ НЕДЕЛИ ∙ 65545[172098679] ←
      404[172104944]             Результат ≡ Суббота ∙ 12779523[20774918] ←
 11010081[172097595]         OF ⁼ 7 ←
 11010080[172099414]           = ≡ ДЕНЬ НЕДЕЛИ ∙ 65545[172098679] ←
      404[172104945]             Результат ≡ Воскресенье ∙ 12779523[20774919] ←
  1507360[172097824]       Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[172098094]         Значения формальных параметров при вызове ←
 32505860[172098539]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[172098802]             Выражение ⁼ 5:67:0:699802 ←
 12124215[172097808]         Where      (Ограничения на отбор данных) ←
  1507381[172097622]           <Наследуемые ограничения> ←
      413[172097852]           И ←
  1507376[172098348]           Выражение ←
  1507455[172098525]             Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[172098964]               Уточняющий параметр ≡ Объем продукции ∙ 359[14483469] ←
  1638473[172098599]             Равно ←
  1507452[172097950]             Константа ≡ Час ∙ 65545[172098675] ←
      413[172097853]           И ←
  1507376[172098349]           Выражение ←
  1507455[172098526]             Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[172098965]               Уточняющий параметр ≡ Вид деятельности ∙ 359[6684676] ←
  1638473[172098600]             Равно ←
  1507452[172097959]             Константа ≡ ДЕНЬ НЕДЕЛИ ∙ 65545[172098679] ←
 30867466[172097860]         Выполнить после получения записи ←
 11010080[172099407]           = ≡ Коэф. чеков в час ∙ 65545[172098678] ←
  1638464[172097773]             Ноль (0.0), если NULL ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[172098662]               Уточняющий параметр ≡ Пробег ∙ 359[14483468] ←
 11010088[172098394]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172098149]             Выражение ←
      404[172104946]               Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      404[172104947]               Результат ⁼   ←
      404[172104933]               Результат ≡ День недели ∙ 65545[172098676] ←
      404[172104936]               Результат ⁼   ←
      404[172104934]               Результат ≡ Час ∙ 65545[172098675] ←
      404[172104937]               Результат ⁼   ←
      404[172104935]               Результат ≡ Коэф. чеков в час ∙ 65545[172098678] ←
 11010088[172098393]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172098148]         Выражение ←
      404[172104930]           Результат ≡ Договоры ∙ 65545[172098674] ←
 11010080[172099404]       = ≡ Договоры ∙ 65545[172098674] ←
      404[172104929]         Результат ≡ Договоры /Дискаунтер/Сеть гастрономов ∙ 249[164823072] ←
 32505862[172098093]           Значения формальных параметров при вызове ←
 32505860[172098538]             Значение параметра при вызове процедуры/функции ≡ Дискаунтер-0,Договоры-1,Сеть-2, Экспрес-3 ∙ 65545[164826510] ←
   327700[172098801]               Выражение ⁼ 0 ←
 11010088[172098164]       ВЫПОЛНИТЬ ≡ Акцепт детей-документа (сам док-родитель без акцепта) ∙ 220[172097539] ←
 32505862[172097922]         Значения формальных параметров при вызове ←
 32505860[172098190]           Значение параметра при вызове процедуры/функции ≡ ~Док-родитель ∙ 65545[172098404] ←
   327700[172098481]             Выражение ⁼ 5:0:0:169940753 ←
  1507360[172097691]       Отбор данных (по запросу) • Поиск спецификаций ←
 12124200[172097641]         From         (Таблицы) ←
 12124204[172097676]           Таблица ≡ СПЕЦИФИКАЦИЯ ПОСТАВЩИКА ∙ 1507433[43122705] ←
 12124213[172097677]         Параметры ←
  1507335[172097948]           Параметр • Дата начальная ∙ 12124204[172097676] ←
  1507494[172098538]             Уточняющий параметр ≡ ДАТА НАЧАЛЬНАЯ ∙ 1507443[57868335] ←
  1507335[172097949]           Параметр • Дата конечная ∙ 12124204[172097676] ←
  1507494[172098539]             Уточняющий параметр ≡ ДАТА КОНЕЧНАЯ ∙ 1507443[57868336] ←
  1507335[172097950]           Параметр • Строка спецификации ∙ 12124204[172097676] ←
  1507494[172098541]             Уточняющий параметр ≡ UID СТРОКИ ∙ 1507443[40043283] ←
 12124215[172097690]         Where      (Ограничения на отбор данных) ←
  1507376[172098020]           Выражение ←
  1507455[172098178]             Результат ∙ 12124204[172097676] ←
  1507494[172098540]               Уточняющий параметр ≡ ПРОДУКТ ∙ 1507443[43122766] ←
  1638473[172098251]             Равно ←
  1507452[172097849]             Константа ⁼ 3:0:0:19352746 ←
 30867466[172097716]         Выполнить после получения записи ←
 11010080[172098878]           = ≡ Спецификация ∙ 65545[172098380] ←
      404[172103236]             Результат ≡ Строка спецификации ∙ 1507335[172097950] ←
 30867470[172097974]           IF ←
  1638463[172098133]             Условие ←
  1638460[172097671]               НЕ ←
      404[172103238]               Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[172097916]                 Значения формальных параметров при вызове ←
 32505860[172098176]                   Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[172098433]                     Выражение ≡ Список спецификаций ∙ 65545[172098381] ←
 32505860[172098177]                   Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[172098434]                     Выражение ≡ Спецификация ∙ 65545[172098380] ←
      411[172098518]                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
 30867472[172097964]             THEN • Добавим ←
 11010080[172098880]               = ≡ Список спецификаций ∙ 65545[172098381] ←
      404[172103237]                 Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[172097674]                   Список элементов ←
   327700[172098435]                     Выражение ≡ Список спецификаций ∙ 65545[172098381] ←
   327700[172098436]                     Выражение ≡ Спецификация ∙ 65545[172098380] ←
      411[172098529]                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
 11010088[172098149]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097950]                 Выражение ←
      404[172103235]                   Результат ≡ Дата начальная ∙ 1507335[172097948] ←
      404[172103240]                   Результат ⁼ ; ←
      404[172103241]                   Результат ≡ Дата конечная ∙ 1507335[172097949] ←
      404[172103242]                   Результат ⁼ ; ←
      404[172103239]                   Результат ≡ Спецификация ∙ 65545[172098380] ←
      411[172098530]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
 30867473[172097732]             ELSE • пропустим ←
 11010099[172097630]               CONTINUE ←
 30867467[172097551]         Выполнить при завершении ←
 11010088[172098148]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097949]             Выражение ←
      404[172103243]               Результат ≡ Список спецификаций ∙ 65545[172098381] ←
 11010105[172097588]       Индикатор ←
      404[172101676]         Результат ⁼ Поиск... ←
  1507360[172097688]       Отбор данных (по запросу) • поиск строк претензии ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[172097908]         Значения формальных параметров при вызове ←
 32505860[172098147]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[172098368]             Выражение ⁼ 5:38:0:2370564 ←
 12124213[172097676]         Параметры ←
  1507380[172097560]           <Наследуемые пункты> ←
  1507335[172097946]           Параметр • Причина выставления претензии ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[172098535]             Уточняющий параметр ≡ Причина списания ∙ 359[28835843] ←
 30867466[172097712]         Выполнить после получения записи ←
 30867470[172097963]           IF ←
  1638463[172098121]             Условие ←
      404[172103050]               Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[172097909]                 Значения формальных параметров при вызове ←
 32505860[172098148]                   Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[172098378]                     Выражение ≡ Причины выставления претензии (должны отниматься от кол-ва) ∙ 65545[172098372] ←
 32505860[172098166]                   Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[172098390]                     Выражение ≡ Причина выставления претензии ∙ 1507335[172097946] ←
 30867472[172097953]             THEN • Нашли! ←
 11010088[172098131]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097922]                 Выражение ←
      404[172103056]                   Результат ⁼ Нашли!  ←
      404[172103051]                   Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      404[172103052]                   Результат ⁼  причина выставления претензии  ←
      404[172103053]                   Результат ≡ Причина выставления претензии ∙ 1507335[172097946] ←
      404[172103054]                   Результат ⁼   ←
      404[172103055]                   Результат ≡ Причина выставления претензии ∙ 1507335[172097946] ←
      411[172098510]                     Уточняющий параметр ≡ Имя ∙ 249[262146] ←
 30867473[172097730]             ELSE • Не нашли ←
 11010088[172098132]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097927]                 Выражение ←
      404[172103057]                   Результат ⁼ НЕ нашли!  ←
      404[172103058]                   Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      404[172103059]                   Результат ⁼  причина выставления претензии  ←
      404[172103060]                   Результат ≡ Причина выставления претензии ∙ 1507335[172097946] ←
      404[172103061]                   Результат ⁼   ←
      404[172103062]                   Результат ≡ Причина выставления претензии ∙ 1507335[172097946] ←
      411[172098511]                     Уточняющий параметр ≡ Имя ∙ 249[262146] ←
 11010080[172098851]       = ≡ кол-во ∙ 65545[172098401] ←
      404[172103045]         Результат ≡ цена ∙ 65545[172098402] ←
      406[172097610]         Вычесть ←
      404[172103046]         Результат ≡ кол-во ∙ 65545[172098401] ←
 11010088[172098130]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097921]         Выражение ←
      404[172103047]           Результат ⁼ Колво =  ←
      404[172103048]           Результат ≡ кол-во ∙ 65545[172098401] ←
 11010080[172099062]       = ≡ Дата врем ∙ 65545[172098408] ←
      116[172098074]         Выражение ←
      404[172103862]           Результат ≡ Сегодня, начало дня ∙ 249[2293761] ←
      406[172097609]           Вычесть ←
      116[172098075]           Выражение ←
      404[172103863]             Результат ⁼ 1 ←
      403[172097603]             Умножить ←
      404[172104087]             Результат ≡ Сутки ∙ 117[16843851] ←
 11010080[172098968]       = ≡ Общее кол-во реализации продукта за день ∙ 65545[172098407] ←
  1638464[172097762]         Ноль (0.0), если NULL ≡ Количество продаж по онлайн чекам v2 ∙ 249[164298824] ←
 32505862[172097893]           Значения формальных параметров при вызове ←
 32505860[172098149]             Значение параметра при вызове процедуры/функции ≡ Продукт Ид ∙ 65545[164298874] ←
   327700[172098371]               Выражение ⁼ 3:0:0:19808073 ←
 32505860[172098150]             Значение параметра при вызове процедуры/функции ≡ Подразделения Ид ∙ 65545[164298993] ←
   327700[172098372]               Выражение ⁼ 4:0:0:817855 ←
 32505860[172098151]             Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[164371085] ←
   327700[172098373]               Выражение ≡ Дата врем ∙ 65545[172098408] ←
 11010088[172098224]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172098013]         Выражение ←
      404[172104088]           Результат ⁼ Общее кол-во реализации продукта за день  ←
      404[172104089]           Результат ≡ Общее кол-во реализации продукта за день ∙ 65545[172098407] ←
  1507360[172097686]       Отбор данных (по запросу) • поиск документов реализации ←
 12124200[172097648]         From         (Таблицы) ←
 12124204[172097682]           Таблица • Документ реализации ≡ Документ ∙ 108[5] ←
 12124213[172097708]         Параметры ←
  1507335[172098006]           Параметр • Документ-реализация ≡ Документ реализации ∙ 12124204[172097682] ←
  1507494[172098668]             Уточняющий параметр ≡ Документ ∙ 331[1] ←
 12124215[172097708]         Where      (Ограничения на отбор данных) ←
  1507376[172098151]           Выражение ←
  1507455[172098287]             Результат ≡ Документ реализации ∙ 12124204[172097682] ←
  1507494[172098687]               Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[172098291]             Равно ←
  1507488[172097607]             Константа (Ограничение по классу, типу, плану счетов) ≡ Продажа через кассовый аппарат ∙ 332[14286850] ←
  1507376[172098154]           Выражение ←
  1507455[172098290]             Результат ≡ Документ реализации ∙ 12124204[172097682] ←
  1507494[172098690]               Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1638473[172098292]             Равно ←
  1507452[172097925]             Константа ⁼ 4:0:0:817893 ←
  1507376[172098152]           Выражение ←
  1507455[172098288]             Результат ≡ Документ реализации ∙ 12124204[172097682] ←
  1507494[172098688]               Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638477[172097590]             Больше или равно ←
  1507452[172097923]             Константа ⁼ 08/03/2022 00:00:00 ←
  1507376[172098153]           Выражение ←
  1507455[172098289]             Результат ≡ Документ реализации ∙ 12124204[172097682] ←
  1507494[172098689]               Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638475[172097575]             Меньше или равно ←
  1507452[172097924]             Константа ⁼ 09/03/2022 00:00:00 ←
 30867466[172097750]         Выполнить после получения записи ←
 11010088[172098195]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097989]             Выражение ←
      404[172103754]               Результат ≡ Документ-реализация ∙ 1507335[172098006] ←
  1507360[172097687]           Отбор данных (по запросу) • поиск строк реализации продуктов ←
 12124200[172097653]             From         (Таблицы) ←
 12124204[172097689]               Таблица • Строка реализации ≡ Строка (объект БД) ∙ 108[6] ←
 12124213[172097721]             Параметры ←
  1507335[172098014]               Параметр • кол-во реализации из строки ≡ Строка реализации ∙ 12124204[172097689] ←
  1507494[172098691]                 Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
 12124215[172097717]             Where      (Ограничения на отбор данных) ←
  1507376[172098184]               Выражение ←
  1507455[172098332]                 Результат ≡ Строка реализации ∙ 12124204[172097689] ←
  1507494[172098761]                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638473[172098314]                 Равно ←
  1507452[172097926]                 Константа ≡ Документ-реализация ∙ 1507335[172098006] ←
  1507376[172098183]               Выражение ←
  1507455[172098291]                 Результат ≡ Строка реализации ∙ 12124204[172097689] ←
  1507494[172098760]                   Уточняющий параметр ≡ Тип ∙ 359[4] ←
  1638473[172098313]                 Равно ←
  1507488[172097608]                 Константа (Ограничение по классу, типу, плану счетов) ≡ Реализация (продажа) товара через кассу ∙ 360[14286866] ←
  1507376[172098186]               Выражение ←
  1507455[172098334]                 Результат ≡ Строка реализации ∙ 12124204[172097689] ←
  1507494[172098763]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[172098315]                 Равно ←
  1507452[172097938]                 Константа ⁼ 3:0:0:35151207 ←
  1507376[172098185]               Выражение ←
  1507455[172098333]                 Результат ≡ Строка реализации ∙ 12124204[172097689] ←
  1507494[172098762]                   Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  1638479[172097631]                 Не равно ←
  1507452[172097932]                 Константа ⁼ 0 ←
 30867466[172097760]             Выполнить после получения записи ←
 11010088[172098222]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172098011]                 Выражение ←
      404[172103765]                   Результат ⁼ кол-во из реализации  ←
      404[172103764]                   Результат ≡ кол-во реализации из строки ∙ 1507335[172098014] ←
 48431132[172097622]               += ≡ Общее кол-во реализации продукта за день ∙ 65545[172098407] ←
      404[172103859]                 Результат ≡ кол-во реализации из строки ∙ 1507335[172098014] ←
 30867467[172097547]             Выполнить при завершении ←
 11010088[172098223]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172098012]                 Выражение ←
      404[172103860]                   Результат ⁼ Общее кол-во реализации за день   ←
      404[172103861]                   Результат ≡ Общее кол-во реализации продукта за день ∙ 65545[172098407] ←
 11010088[172098191]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097985]         Выражение ←
      404[172103722]           Результат ⁼ начало отбора  ←
  1507360[172097725]       Отбор данных (по запросу) • поиск дивизионов --> магазинов ---> отправка директорам ←
 12124200[172097649]         From         (Таблицы) ←
 12124204[172097683]           Таблица • Дивизион ≡ Партнер ∙ 108[4] ←
 12124204[172097685]           Таблица • ТД ≡ Партнер ∙ 108[4] ←
 12124205[172097591]           Запрос • Поиск ЦО ←
 12124213[172097710]             Параметры ←
  1507335[172098019]               Параметр • уид ≡ ЦО ∙ 12124204[172097684] ←
  1507494[172098695]                 Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1507335[172098021]               Параметр • уид родитель ≡ ЦО ∙ 12124204[172097684] ←
  1507494[172098702]                 Уточняющий параметр ≡ Родитель ∙ 283[2] ←
 12124215[172097709]             Where      (Ограничения на отбор данных) ←
  1507376[172098155]               Выражение ←
  1507455[172098292]                 Результат ≡ ЦО ∙ 12124204[172097684] ←
  1507494[172098696]                   Уточняющий параметр ≡ Ранг партнера ∙ 283[28835905] ←
  1638473[172098294]                 Равно ←
  1507452[172097927]                 Константа ≡ Супермаркет ∙ 164364327[164364289] ←
 12124200[172097650]             From         (Таблицы) ←
 12124204[172097684]               Таблица • ЦО ≡ Партнер ∙ 108[4] ←
 12124205[172097593]           Запрос • поиск ТЗ ≡ ПАРТНЕРЫ ∙ 12124205[18546727] ←
 32505862[172098190]             Значения формальных параметров при вызове ←
 32505860[172098652]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547202] ←
   327700[172098756]                 Выражение ≡ Фильтр.Типы ∙ 65545[18547202] ←
 12124213[172097709]         Параметры ←
  1507335[172098016]           Параметр • уид дивизиона ≡ Дивизион ∙ 12124204[172097683] ←
  1507494[172098693]             Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1507335[172098018]           Параметр • уид ТД ≡ Дивизион ∙ 12124204[172097683] ←
  1507494[172098694]             Уточняющий параметр ≡ Управляющий ∙ 283[28835886] ←
  1507335[172098022]           Параметр • ТД Имя ≡ ТД ∙ 12124204[172097685] ←
  1507494[172098705]             Уточняющий параметр ≡ Наименование ∙ 283[5] ←
  1507335[172098023]           Параметр • е-маил ТД ≡ ТД ∙ 12124204[172097685] ←
  1507494[172098708]             Уточняющий параметр ≡ Электронный адрес ∙ 283[14745623] ←
  1507335[172098020]           Параметр • ЦО уид ≡ Поиск ЦО ∙ 12124205[172097591] ←
  1507494[172098697]             Уточняющий параметр ≡ уид ∙ 1507335[172098019] ←
 12124215[172097711]         Where      (Ограничения на отбор данных) ←
  1507376[172098158]           Выражение ←
  1507455[172098296]             Результат ≡ Дивизион ∙ 12124204[172097683] ←
  1507494[172098704]               Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[172098298]             Равно ←
  1507488[172097603]             Константа (Ограничение по классу, типу, плану счетов) ≡ Кинозал ∙ 284[42401803] ←
  1507376[172098156]           Выражение ←
  1507455[172098293]             Результат ≡ Дивизион ∙ 12124204[172097683] ←
  1507494[172098699]               Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1638473[172098296]             Равно ←
  1507455[172098294]             Результат ≡ Поиск ЦО ∙ 12124205[172097591] ←
  1507494[172098701]               Уточняющий параметр ≡ уид родитель ∙ 1507335[172098021] ←
  1507376[172098157]           Выражение ←
  1507455[172098295]             Результат ≡ Дивизион ∙ 12124204[172097683] ←
  1507494[172098703]               Уточняющий параметр ≡ Запрещен ∙ 283[40566785] ←
  1638473[172098297]             Равно ←
  1507452[172097928]             Константа ≡ Нет ∙ 131203075[131203073] ←
  1507376[172098160]           Выражение ←
  1507455[172098299]             Результат ≡ Дивизион ∙ 12124204[172097683] ←
  1507494[172098707]               Уточняющий параметр ≡ Управляющий ∙ 283[28835886] ←
  1638473[172098299]             Равно ←
  1507455[172098298]             Результат ≡ ТД ∙ 12124204[172097685] ←
  1507494[172098706]               Уточняющий параметр ≡ Партнер ∙ 283[1] ←
 12124222[172097598]         Order By   (Сортировка) ←
  1507465[172097569]           Блок (Сортировка с генерацией события) • ТД ←
  1507559[172097573]             Сортировать по возрастанию ≡ уид ТД ∙ 1507335[172098018] ←
  1507467[172097559]         Выполнить перед обработкой блока ≡ ТД ∙ 1507465[172097569] ←
 11010088[172098199]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097980]             Выражение ←
      404[172103829]               Результат ⁼ уид дивизиона ←
      404[172103838]               Результат ⁼ ----перед обработкой блока---- ←
      404[172103830]               Результат ⁼   ←
      404[172103831]               Результат ≡ уид дивизиона ∙ 1507335[172098016] ←
      404[172103832]               Результат ⁼   ←
      404[172103833]               Результат ≡ уид дивизиона ∙ 1507335[172098016] ←
      411[172098650]                 Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      404[172103834]               Результат ⁼  ДД:  ←
      404[172103835]               Результат ≡ уид ТД ∙ 1507335[172098018] ←
      411[172098651]                 Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      404[172103828]               Результат ⁼  почта тд:  ←
      404[172103827]               Результат ≡ е-маил ТД ∙ 1507335[172098023] ←
      404[172103839]               Результат ⁼ ----конец перед обработкой блока---- ←
 30867466[172097749]         Выполнить после получения записи ←
  1507728[172097837]           Начало многострочного комментария ←
 11010080[172098976]           = ≡ ТЗ от ЦО ∙ 65545[172098405] ←
      404[172103774]             Результат ≡ Вернуть ЦО, ТТ, ТЗ, Склад, Ком отдел по Коду/Внешнему коду ∙ 249[165609488] ←
 32505862[172098143]               Значения формальных параметров при вызове ←
 32505860[172098574]                 Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[165610243] ←
   327700[172098649]                   Выражение ≡ ЦО уид ∙ 1507335[172098020] ←
 32505860[172098575]                 Значение параметра при вызове процедуры/функции ≡ Тип возвращаемого значения (1-ЦО, 2-ТТ, 3-ТЗ,4-Склад, 5-Ком отдел) ЦО-по умолчанию ∙ 65545[165610237] ←
   327700[172098673]                   Выражение ⁼ 3 ←
 11010099[172097656]           CONTINUE ←
      116[172098072]             Выражение ←
  1638460[172097619]               НЕ ←
      404[172103836]               Результат ≡ ТЗ от ЦО ∙ 65545[172098405] ←
 11010088[172098156]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097956]             Выражение ←
      404[172103822]               Результат ⁼  ДД:  ←
      404[172103823]               Результат ≡ уид ТД ∙ 1507335[172098018] ←
      411[172098647]                 Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      404[172103824]               Результат ⁼  ЦО:  ←
      404[172103825]               Результат ≡ ЦО уид ∙ 1507335[172098020] ←
      404[172103786]               Результат ⁼  ТЗ:  ←
      404[172103826]               Результат ≡ ТЗ от ЦО ∙ 65545[172098405] ←
  1507729[172097834]           Конец многострочного комментария ←
 11010088[172098165]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097960]         Выражение ←
      404[172103752]           Результат ⁼ конец отбора  ←
 11010088[172098190]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097984]         Выражение ←
      404[172103751]           Результат ⁼ поиск начат ←
  1507360[172097722]       Отбор данных (по запросу) • Поиск чеков по товару ←
  1507447[172097604]         Выражения ←
  1507449[172097666]           Выражение • Количество проданного продукта ≡ Количество ∙ 107[15] ←
  1507455[172098277]             Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[172097624]               Значения параметров ←
  1507477[172097653]                 Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[172097653]                   Выражение ∙ 12124204[172097680] ←
  1507494[172098673]                     Уточняющий параметр ≡ Колво ∙ 1507443[164298845] ←
 12124200[172097646]         From         (Таблицы) ←
 12124204[172097680]           Таблица ≡ CHECK_ONLINE ∙ 1507433[164298769] ←
 12124213[172097706]         Параметры ←
  1507335[172098008]           Параметр • намен ∙ 12124204[172097680] ←
  1507494[172098674]             Уточняющий параметр ≡ Продукт ∙ 1507443[164298843] ←
  1507335[172098009]           Параметр • кол-во ∙ 12124204[172097680] ←
  1507506[172097755]             Использование (в режиме выполнения) ≡ Нет ∙ 534[11599875] ←
  1507494[172098675]             Уточняющий параметр ≡ Колво ∙ 1507443[164298845] ←
  1507335[172098010]           Параметр ≡ Количество проданного продукта ∙ 1507449[172097666] ←
 12124215[172097706]         Where      (Ограничения на отбор данных) ←
  1507376[172098143]           Выражение ←
  1507455[172098278]             Результат ∙ 12124204[172097680] ←
  1507494[172098676]               Уточняющий параметр ≡ Дата ∙ 1507443[164298844] ←
  1638477[172097588]             Больше или равно ←
  1507452[172097915]             Константа ⁼ 23/02/2022 00:00:00 ←
  1507376[172098144]           Выражение ←
  1507455[172098279]             Результат ∙ 12124204[172097680] ←
  1507494[172098677]               Уточняющий параметр ≡ Дата ∙ 1507443[164298844] ←
  1638475[172097598]             Меньше или равно ←
  1507452[172097916]             Константа ≡ Текущие дата-время ∙ 249[42467332] ←
  1507376[172098145]           Выражение ←
  1507455[172098280]             Результат ∙ 12124204[172097680] ←
  1507494[172098678]               Уточняющий параметр ≡ Подразделение (ТЗ) ∙ 1507443[164298850] ←
  1638473[172098287]             Равно ←
  1507452[172097917]             Константа ⁼ 4:0:0:1889315 ←
  1507376[172098146]           Выражение ←
  1507455[172098281]             Результат ∙ 12124204[172097680] ←
  1507494[172098679]               Уточняющий параметр ≡ Продукт ∙ 1507443[164298843] ←
  1638473[172098288]             Равно ←
  1507452[172097918]             Константа ⁼ 3:0:0:15338487 ←
 12124224[172097566]         Group By  (Группировка) ←
  1507533[172097589]           Группировать по параметру ≡ намен ∙ 1507335[172098008] ←
 30867465[172097575]         Выполнить при старте ←
 11010088[172098188]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097982]             Выражение ←
      404[172103745]               Результат ⁼ Выполнить после получения записи ТАБЛИЦА , выполнить при старте поиск чеков ←
 30867466[172097747]         Выполнить после получения записи ←
 11010088[172098189]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097983]             Выражение ←
      404[172103746]               Результат ≡ намен ∙ 1507335[172098008] ←
      404[172103747]               Результат ⁼ ; ←
      404[172103748]               Результат ∙ 1507335[172098010] ←
 30867467[172097554]         Выполнить при завершении ←
 11010088[172098192]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097986]             Выражение ←
      404[172103749]               Результат ≡ намен ∙ 1507335[172098008] ←
      404[172103750]               Результат ⁼ ; ←
      404[172103753]               Результат ∙ 1507335[172098010] ←
 11010080[172098922]       = ≡ цена закуп ∙ 65545[172098382] ←
  1638464[172097734]         Ноль (0.0), если NULL ≡ Цена из реестра цен на дату по партнеру (через параметр) ∙ 249[40370272] ←
 32505862[172098052]           Значения формальных параметров при вызове ←
 32505860[172098423]             Значение параметра при вызове процедуры/функции ≡ фп Продукт ∙ 65545[40375122] ←
   327700[172098546]               Выражение ⁼ 3:0:0:15885823 ←
 32505860[172098424]             Значение параметра при вызове процедуры/функции ≡ фп Партнер (Коммерческий отдел) ∙ 65545[40375123] ←
   327700[172098547]               Выражение ⁼ 4:0:0:1888220 ←
 11010088[172098151]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097951]         Выражение ←
      404[172103415]           Результат ≡ цена закуп ∙ 65545[172098382] ←
 12124190[172097580]       Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[172097582]         Список полей формы ←
      598[172097681]           Поле (колонка) для ввода данных ≡ Каталог для сохранения ∙ 65545[172098366] ←
 45940768[172097537]             Внешний редактор поля объекта БД ≡ Диалог выбора каталога ∙ 387[48431153] ←
 11010080[172098843]       = ≡ Тестовый файл ∙ 65545[172098365] ←
      404[172103003]         Результат ≡ Каталог.Добавить завершающий \ ∙ 249[1507399] ←
 39780375[172097576]           Путь (каталог, папка) к файлам (как выражение) ≡ Каталог для сохранения ∙ 65545[172098366] ←
 11010088[172098101]       ВЫПОЛНИТЬ ≡ Файл.Закрыть ∙ 249[1507341] ←
 39780367[172097608]         Файл ≡ Тестовый файл ∙ 65545[172098365] ←
 11010088[172098104]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097916]         Выражение ←
      404[172103002]           Результат ≡ Тестовый файл ∙ 65545[172098365] ←
 30867470[172097949]       IF ←
  1638463[172098107]         Условие ←
  1638460[172097611]           НЕ ←
      404[172103010]           Результат ≡ Файл.Существует ∙ 249[1507336] ←
 39780367[172097607]             Файл ≡ Тестовый файл ∙ 65545[172098365] ←
 30867472[172097939]         THEN ←
 11010080[172098842]           = ≡ Тестовый файл ∙ 65545[172098365] ←
      404[172103011]             Результат ≡ Файл.Создать ∙ 249[1507338] ←
 39780375[172097575]               Путь (каталог, папка) к файлам (как выражение) ≡ Тестовый файл ∙ 65545[172098365] ←
 11010080[172098841]       = ≡ Тестовый файл ∙ 65545[172098365] ←
      404[172103006]         Результат ≡ Каталог.Добавить завершающий \ ∙ 249[1507399] ←
 39780375[172097574]           Путь (каталог, папка) к файлам (как выражение) ≡ DOMINO_HOME ∙ 249[30867477] ←
      404[172103007]         Результат ⁼ hello.txt ←
 11010080[172098839]       = ≡ Глобальная переменная : Работает администратор ∙ 381[165478402] ←
      404[172102993]         Результат ≡ false ∙ 117[30867469] ←
 30867470[172097947]       IF ←
  1638463[172098104]         Условие ←
      404[172102996]           Результат ≡ POS ∙ 387[1507422] ←
 11010095[172097915]             Выражение ←
      404[172102997]               Результат ≡ <<Пользователь>> ∙ 367[1] ←
      411[172098508]                 Уточняющий параметр ≡ Имя ∙ 249[262146] ←
  1507510[172097554]             Искомая подстрока ←
 11010080[172098838]       = ≡ Глобальная переменная : Включить отладочные сообщения ∙ 381[165478404] ←
      404[172102992]         Результат ≡ true ∙ 117[30867468] ←
  1507729[172097743]       Конец многострочного комментария ←
 11010093[172097607]       Комментарий • Пашет ←
 11010093[172097608]       Комментарий ←
  1507728[172097713]       Начало многострочного комментария • ДОЛГО ←
 11010088[172098100]       ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[172097939]         Значения формальных параметров при вызове ←
 32505860[172098205]           Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[172098408]             Выражение ⁼ отладка включена ←
 11010088[172098067]       ВЫПОЛНИТЬ ≡ Остаток товара учитывая онлайн чеки ∙ 249[656081032] ←
 32505862[172097862]         Значения формальных параметров при вызове ←
 11010080[172098760]       = ≡ Остаток по онлайн чекам ∙ 65545[172098329] ←
      404[172101835]         Результат ≡ Остаток товара учитывая онлайн чеки ∙ 249[656081032] ←
  1507360[172097651]       Отбор данных (по запросу) • поиск документов корректирующих проводок ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
 32505862[172097846]         Значения формальных параметров при вызове ←
 32505860[172098058]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547258] ←
   327700[172098245]             Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[172097660]               Список элементов ←
   327700[172098246]                 Выражение ≡ Корректирующие проводки ∙ 332[6684762] ←
 32505860[172098059]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа начальная ∙ 65545[18547260] ←
   327700[172098247]             Выражение ⁼ 01/12/2021 00:00:00 ←
 32505860[172098060]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа конечная ∙ 65545[18547261] ←
   327700[172098248]             Выражение ⁼ 31/12/2021 23:59:59 ←
 30867466[172097691]         Выполнить после получения записи ←
 11010080[172098728]           = ≡ Документ корректировки ∙ 65545[172098299] ←
      404[172101690]             Результат ≡ з.Документ ∙ 1507335[18547059] ←
 11010080[172098727]           = ≡ Найдено? ∙ 65545[172098300] ←
      404[172101685]             Результат ⁼ 0 ←
  1507360[172097652]           Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[172097847]             Значения формальных параметров при вызове ←
 32505860[172098061]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[172098249]                 Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[172097661]                   Список элементов ←
   327700[172098250]                     Выражение ≡ Документ корректировки ∙ 65545[172098299] ←
 12124215[172097676]             Where      (Ограничения на отбор данных) ←
  1507381[172097596]               <Наследуемые ограничения> ←
  1507376[172097982]               Выражение ←
  1507455[172098135]                 Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[172098477]                   Уточняющий параметр ≡ Аналитика 2 - Дебет ∙ 359[6684678] ←
  1638473[172098207]                 Равно ←
  1507452[172097817]                 Константа ⁼ 4:0:0:2713042 ←
 30867466[172097692]             Выполнить после получения записи ←
 11010080[172098729]               = ≡ Найдено? ∙ 65545[172098300] ←
      404[172101692]                 Результат ⁼ 1 ←
 11010088[172098051]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097883]                 Выражение ←
      404[172101687]                   Результат ⁼ Нашли!   ←
      404[172101688]                   Результат ⁼ Строку   ←
      404[172101689]                   Результат ⁼   ←
      404[172101691]                   Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 11010100[172097560]               BREAK ←
 30867470[172097919]           IF ←
  1638463[172098064]             Условие ←
  1638460[172097604]               НЕ ←
      404[172101693]               Результат ≡ Найдено? ∙ 65545[172098300] ←
 30867472[172097910]             THEN ←
 11010099[172097592]               CONTINUE ←
 30867473[172097704]             ELSE ←
 11010088[172098052]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097884]                 Выражение ←
      404[172101694]                   Результат ⁼ Нашли!   ←
      404[172101695]                   Результат ⁼ Документ  ←
      404[172101696]                   Результат ≡ Документ корректировки ∙ 65545[172098299] ←
  1507360[172097641]       Отбор данных (по запросу) • поиск корректирующих проводок ≡ ПРОВОДКИ ∙ 12124205[48431274] ←
 32505862[172097845]         Значения формальных параметров при вызове ←
 32505860[172098053]           Значение параметра при вызове процедуры/функции ≡ Список ЦФО ∙ 65545[48433455] ←
   327700[172098239]             Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[172097659]               Список элементов ←
   327700[172098240]                 Выражение ⁼ 4:0:0:568066 ←
 32505860[172098054]           Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[48433456] ←
   327700[172098241]             Выражение ⁼ 01/12/2021 00:00:00 ←
 32505860[172098055]           Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[48433457] ←
   327700[172098242]             Выражение ⁼ 31/12/2021 23:59:59 ←
 32505860[172098056]           Значение параметра при вызове процедуры/функции ≡ Дт [2] ∙ 65545[48433463] ←
   327700[172098243]             Выражение ⁼ 4:0:0:2713042 ←
 32505860[172098057]           Значение параметра при вызове процедуры/функции ≡ План счетов ∙ 65545[48433472] ←
   327700[172098244]             Выражение ⁼ 65561[14745664] ←
 30867466[172097690]         Выполнить после получения записи ←
 30867470[172097918]           IF ←
  1638463[172098063]             Условие ←
      404[172101677]               Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      411[172098420]                 Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[172098206]               Равно ←
      404[172101678]               Результат ≡ ПроектныйЭлемент.Индекс ∙ 249[42467331] ←
 11010064[172097545]                 Выражение ≡ Корректирующие проводки ∙ 332[6684762] ←
 30867472[172097909]             THEN ←
 11010088[172098050]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097882]                 Выражение ←
      404[172101672]                   Результат ⁼ Нашли!   ←
      404[172101679]                   Результат ⁼ Документ  ←
      404[172101680]                   Результат ⁼   ←
      404[172101681]                   Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      404[172101682]                   Результат ⁼   ←
      404[172101671]                   Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      411[172098419]                     Уточняющий параметр ≡ Имя типа документа ∙ 249[45940737] ←
 30867473[172097703]             ELSE ←
 11010088[172098049]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097881]                 Выражение ←
      404[172101673]                   Результат ⁼ Не тот!   ←
      404[172101674]                   Результат ⁼ Документ  ←
      404[172101675]                   Результат ⁼   ←
      404[172101683]                   Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      404[172101684]                   Результат ⁼   ←
      404[172101686]                   Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      411[172098421]                     Уточняющий параметр ≡ Имя типа документа ∙ 249[45940737] ←
  1507729[172097712]       Конец многострочного комментария ←
  1507728[172097704]       Начало многострочного комментария • может пригодиться ←
 11010080[172098290]       = ≡ <<Документ>> ∙ 367[5] ←
      404[172099746]         Результат ⁼ 5:8:0:51137322 ←
 11010088[172097748]       ВЫПОЛНИТЬ ≡ Сличительная ведомость ∙ 127[135267545] ←
 32505862[172097819]         Значения формальных параметров при вызове ←
 32505860[172097908]           Значение параметра при вызове процедуры/функции ≡ Задайте тип документа инвентаризационной подописи ∙ 65545[135269051] ←
   327700[172098060]             Выражение ≡ Подопись. Полная инвентаризация ∙ 332[14286868] ←
 32505860[172097909]           Значение параметра при вызове процедуры/функции ≡ Задайте тип документа фиксации остатков ∙ 65545[135269052] ←
   327700[172098061]             Выражение ≡ Документ фиксации остатков ∙ 332[14286869] ←
 32505860[172097910]           Значение параметра при вызове процедуры/функции ≡ Задайте тип строки документа фиксации остатков ∙ 65545[135269053] ←
   327700[172098062]             Выражение ≡ Строка документа фиксации остатков ∙ 360[14286880] ←
 11010088[172097714]       ВЫПОЛНИТЬ ≡ Проверка соответствия групп и ставок ндс ∙ 220[172097537] ←
 11010105[172097569]       Индикатор ←
      404[172100974]         Результат ⁼ Поиск.... ←
 11010088[172097983]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097852]         Выражение ←
      404[172101113]           Результат ≡ документ заказа ∙ 65545[172098098] ←
      411[172098261]             Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[172098262]               Уточняющий параметр ≡ Родитель ∙ 283[2] ←
      411[172098263]                 Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
      404[172101112]           Результат ⁼ ': ' ←
      404[172101114]           Результат ≡ документ заказа ∙ 65545[172098098] ←
      411[172098264]             Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[172098265]               Уточняющий параметр ≡ Имя ∙ 249[262146] ←
 11010088[172097982]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097848]         Выражение ←
  1638461[172097633]           Условный оператор (IF) ←
  1638463[172097940]             Условие ←
      404[172101064]               Результат ≡ документ заказа ∙ 65545[172098098] ←
      411[172098214]                 Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[172098217]                   Уточняющий параметр ≡ Ранг партнера ∙ 283[28835905] ←
      105[172097633]             То ←
      404[172101111]               Результат ⁼ ранг партнера  ←
       19[172097546]               Выбор (CASE) ←
  1572877[172097553]                 Условие ←
      404[172101073]                   Результат ≡ документ заказа ∙ 65545[172098098] ←
      411[172098218]                     Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[172098219]                       Уточняющий параметр ≡ Ранг партнера ∙ 283[28835905] ←
      411[172098230]                         Уточняющий параметр ≡ Имя ∙ 249[262146] ←
      416[172097555]                 Если равно ⁼ Дискаунтер ←
      404[172101074]                   Результат ⁼ Дискаунтер ←
      416[172097556]                 Если равно ⁼ Супермаркет ←
      404[172101085]                   Результат ⁼ Гастроном ←
      424[172097625]                 Иначе ←
      404[172101071]                   Результат ≡ документ заказа ∙ 65545[172098098] ←
      411[172098210]                     Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[172098211]                       Уточняющий параметр ≡ Ранг партнера ∙ 283[28835905] ←
      411[172098220]                         Уточняющий параметр ≡ Имя ∙ 249[262146] ←
      424[172097622]             Иначе ←
  1638461[172097636]               Условный оператор (IF) ←
  1638463[172097943]                 Условие ←
      404[172101059]                   Результат ≡ документ заказа ∙ 65545[172098098] ←
      411[172098209]                     Уточняющий параметр ≡ Способ оплаты ∙ 331[15073281] ←
      105[172097636]                 То ←
      404[172101063]                   Результат ⁼ способ оплаты   ←
       19[172097539]                   Выбор (CASE) ←
  1572877[172097552]                     Условие ←
      404[172101065]                       Результат ≡ документ заказа ∙ 65545[172098098] ←
      411[172098221]                         Уточняющий параметр ≡ Способ оплаты ∙ 331[15073281] ←
      411[172098258]                           Уточняющий параметр ≡ Имя ∙ 249[262146] ←
      416[172097541]                     Если равно ⁼ Дискаунтер ←
      404[172101072]                       Результат ⁼ Дискаунтер ←
      416[172097542]                     Если равно ⁼ Супермаркет ←
      404[172101109]                       Результат ⁼ Гастроном ←
      424[172097626]                     Иначе ←
      404[172101110]                       Результат ≡ документ заказа ∙ 65545[172098098] ←
      411[172098259]                         Уточняющий параметр ≡ Способ оплаты ∙ 331[15073281] ←
      411[172098260]                           Уточняющий параметр ≡ Имя ∙ 249[262146] ←
 11010080[172098522]       = ≡ коэф осг ∙ 65545[172098089] ←
      404[172101047]         Результат ≡ Сроки годности по группам ∙ 249[172097537] ←
 32505862[172097809]           Значения формальных параметров при вызове ←
 32505860[172098001]             Значение параметра при вызове процедуры/функции ≡ Документ ограничения сроков годности по группам ∙ 65545[172098094] ←
   327700[172098178]               Выражение ⁼ 5:0:0:143539808 ←
 32505860[172098002]             Значение параметра при вызове процедуры/функции ≡ Ищем Группу или подгруппу ∙ 65545[172098095] ←
   327700[172098179]               Выражение ⁼ 2:0:0:312159 ←
 11010088[172097980]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097847]         Выражение ←
      404[172101050]           Результат ⁼  коэф осг   ←
      404[172101051]           Результат ≡ коэф осг ∙ 65545[172098089] ←
 11010093[172097600]       Комментарий • сроки годности по документам групп коэффицентов ←
  1507360[172097632]       Отбор данных (по запросу) ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
 32505862[172097791]         Значения формальных параметров при вызове ←
 32505860[172097971]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Список UID-ов ∙ 65545[1510083] ←
   327700[172098147]             Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[172097671]               Список элементов ←
   327700[172098148]                 Выражение ≡ документ сроков коэф ∙ 65545[172098087] ←
 30867466[172097652]         Выполнить после получения записи ←
 11010088[172097951]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097837]             Выражение ←
      404[172100977]               Результат ⁼ документ  ←
      404[172100978]               Результат ≡ з.Документ ∙ 1507335[18547059] ←
  1507360[172097633]           Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[172097792]             Значения формальных параметров при вызове ←
 32505860[172097972]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[172098149]                 Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[172097672]                   Список элементов ←
   327700[172098150]                     Выражение ≡ з.Документ ∙ 1507335[18547059] ←
 30867465[172097552]             Выполнить при старте ←
 11010080[172098520]               = ≡ Найденный ∙ 65545[172098093] ←
      404[172101000]                 Результат ⁼ 0 ←
 30867466[172097653]             Выполнить после получения записи ←
 11010080[172098519]               = ≡ Порядковый номер ∙ 65545[172098092] ←
      404[172100999]                 Результат ⁼ 0 ←
 11010088[172097952]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097838]                 Выражение ←
      404[172100979]                   Результат ⁼ строка  ←
      404[172100980]                   Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
  1507728[172097703]               Начало многострочного комментария ←
  1507729[172097702]               Конец многострочного комментария ←
 30867470[172097853]               IF ←
  1638463[172097930]                 Условие ←
      404[172100992]                   Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[172097801]                     Значения формальных параметров при вызове ←
 32505860[172097988]                       Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[172098165]                         Выражение ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[172098195]                           Уточняющий параметр ≡ Дни недели ∙ 359[42401884] ←
 32505860[172097989]                       Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[172098166]                         Выражение ≡ Товар ∙ 65545[172098088] ←
 30867472[172097853]                 THEN • скю ←
 11010080[172098525]                   = ≡ Порядковый номер ∙ 65545[172098092] ←
      404[172101013]                     Результат ⁼ 4 ←
 11010088[172097955]                   ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097841]                     Выражение ←
      404[172101014]                       Результат ⁼ скю  ←
 30867470[172097854]               IF ←
  1638463[172097931]                 Условие ←
      404[172100998]                   Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[172097802]                     Значения формальных параметров при вызове ←
 32505860[172097990]                       Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[172098167]                         Выражение ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[172098197]                           Уточняющий параметр ≡ Дни недели ∙ 359[42401884] ←
 32505860[172097991]                       Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[172098168]                         Выражение ≡ Товар ∙ 65545[172098088] ←
      411[172098203]                           Уточняющий параметр ≡ Группа 1 ∙ 305[42401867] ←
 30867472[172097854]                 THEN • мкю ←
 11010080[172098530]                   = ≡ Порядковый номер ∙ 65545[172098092] ←
      404[172101021]                     Результат ⁼ 3 ←
 11010088[172097956]                   ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097842]                     Выражение ←
      404[172101001]                       Результат ⁼ мкю ←
 30867470[172097856]               IF ←
  1638463[172097933]                 Условие ←
      404[172101008]                   Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[172097804]                     Значения формальных параметров при вызове ←
 32505860[172097994]                       Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[172098171]                         Выражение ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[172098201]                           Уточняющий параметр ≡ Дни недели ∙ 359[42401884] ←
 32505860[172097995]                       Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[172098172]                         Выражение ≡ Товар ∙ 65545[172098088] ←
      411[172098206]                           Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
 30867472[172097856]                 THEN • подгруппа ←
 11010080[172098529]                   = ≡ Порядковый номер ∙ 65545[172098092] ←
      404[172101020]                     Результат ⁼ 2 ←
 11010088[172097960]                   ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097844]                     Выражение ←
      404[172101016]                       Результат ⁼ подгруппа   ←
 30867470[172097855]               IF ←
  1638463[172097932]                 Условие ←
      404[172101003]                   Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[172097803]                     Значения формальных параметров при вызове ←
 32505860[172097992]                       Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[172098169]                         Выражение ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[172098199]                           Уточняющий параметр ≡ Дни недели ∙ 359[42401884] ←
 32505860[172097993]                       Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[172098170]                         Выражение ≡ Товар ∙ 65545[172098088] ←
      411[172098204]                           Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[172098205]                             Уточняющий параметр ≡ Родитель ∙ 296[2] ←
 30867472[172097855]                 THEN • группа ←
 11010080[172098528]                   = ≡ Порядковый номер ∙ 65545[172098092] ←
      404[172101019]                     Результат ⁼ 1 ←
 11010088[172097959]                   ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097843]                     Выражение ←
      404[172101015]                       Результат ⁼ группа   ←
  1507728[172097702]               Начало многострочного комментария ←
  1507729[172097701]               Конец многострочного комментария ←
 11010099[172097587]               CONTINUE ←
      116[172097881]                 Выражение ←
      404[172100996]                   Результат ≡ Порядковый номер ∙ 65545[172098092] ←
  1638473[172098071]                   Равно ←
      404[172100997]                   Результат ⁼ 0 ←
 30867470[172097857]               IF ←
  1638463[172097934]                 Условие ←
      404[172101022]                   Результат ≡ Найденный ∙ 65545[172098093] ←
  1638473[172098070]                   Равно ←
      404[172101023]                   Результат ⁼ 0 ←
 30867472[172097857]                 THEN • Первый найденный ←
 11010080[172098531]                   = ≡ Найденный ∙ 65545[172098093] ←
      404[172101024]                     Результат ≡ Порядковый номер ∙ 65545[172098092] ←
 11010080[172098532]                   = ≡ строка ∙ 65545[172098090] ←
      404[172101025]                     Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 11010080[172098533]                   = ≡ коэф осг ∙ 65545[172098089] ←
      404[172101026]                     Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[172098207]                       Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
 11010088[172097976]                   ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097846]                     Выражение ←
      404[172101044]                       Результат ⁼ Первое присваивание  ←
      404[172101038]                       Результат ⁼ Найденный  ←
      404[172101039]                       Результат ≡ Найденный ∙ 65545[172098093] ←
      404[172101040]                       Результат ⁼ Порядковый номер  ←
      404[172101041]                       Результат ≡ Порядковый номер ∙ 65545[172098092] ←
      404[172101042]                       Результат ⁼ Добавили строку  ←
      404[172101043]                       Результат ≡ строка ∙ 65545[172098090] ←
 30867473[172097690]                 ELSE • Смотрим приоритет ←
 30867470[172097858]                   IF ←
  1638463[172097935]                     Условие ←
      404[172101027]                       Результат ≡ Найденный ∙ 65545[172098093] ←
  1638475[172097570]                       Меньше или равно ←
      404[172101028]                       Результат ≡ Порядковый номер ∙ 65545[172098092] ←
 30867472[172097858]                     THEN • Переопределяем ←
 11010080[172098534]                       = ≡ Найденный ∙ 65545[172098093] ←
      404[172101029]                         Результат ≡ Порядковый номер ∙ 65545[172098092] ←
 11010080[172098535]                       = ≡ строка ∙ 65545[172098090] ←
      404[172101030]                         Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 11010080[172098536]                       = ≡ коэф осг ∙ 65545[172098089] ←
      404[172101031]                         Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[172098208]                           Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
 11010088[172097975]                       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097845]                         Выражение ←
      404[172101032]                           Результат ⁼ Найденный  ←
      404[172101035]                           Результат ≡ Найденный ∙ 65545[172098093] ←
      404[172101036]                           Результат ⁼ Порядковый номер  ←
      404[172101037]                           Результат ≡ Порядковый номер ∙ 65545[172098092] ←
      404[172101033]                           Результат ⁼ Добавили строку  ←
      404[172101034]                           Результат ≡ строка ∙ 65545[172098090] ←
  1507728[172097701]               Начало многострочного комментария ←
 30867470[172097851]               IF ←
  1638463[172097928]                 Условие ←
      404[172100981]                   Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[172097793]                     Значения формальных параметров при вызове ←
 32505860[172097973]                       Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[172098151]                         Выражение ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[172098178]                           Уточняющий параметр ≡ Дни недели ∙ 359[42401884] ←
 32505860[172097974]                       Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[172098158]                         Выражение ≡ Товар ∙ 65545[172098088] ←
      411[172098179]                           Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      412[172097568]                   ИЛИ ←
      404[172100982]                   Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[172097798]                     Значения формальных параметров при вызове ←
 32505860[172097975]                       Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[172098159]                         Выражение ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[172098180]                           Уточняющий параметр ≡ Дни недели ∙ 359[42401884] ←
 32505860[172097976]                       Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[172098160]                         Выражение ≡ Товар ∙ 65545[172098088] ←
      411[172098181]                           Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[172098182]                             Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      412[172097569]                   ИЛИ ←
      404[172100983]                   Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[172097799]                     Значения формальных параметров при вызове ←
 32505860[172097984]                       Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[172098161]                         Выражение ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[172098183]                           Уточняющий параметр ≡ Дни недели ∙ 359[42401884] ←
 32505860[172097985]                       Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[172098162]                         Выражение ≡ Товар ∙ 65545[172098088] ←
      411[172098184]                           Уточняющий параметр ≡ Группа 1 ∙ 305[42401867] ←
      412[172097572]                   ИЛИ ←
      404[172100984]                   Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[172097800]                     Значения формальных параметров при вызове ←
 32505860[172097986]                       Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[172098163]                         Выражение ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[172098185]                           Уточняющий параметр ≡ Дни недели ∙ 359[42401884] ←
 32505860[172097987]                       Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[172098164]                         Выражение ≡ Товар ∙ 65545[172098088] ←
 30867472[172097851]                 THEN • подходящая группа ←
 11010080[172098515]                   = ≡ строка ∙ 65545[172098090] ←
      404[172100985]                     Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 11010080[172098516]                   = ≡ коэф осг ∙ 65545[172098089] ←
      404[172100986]                     Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[172098186]                       Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
 11010088[172097954]                   ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097840]                     Выражение ←
      404[172100991]                       Результат ⁼ Добавили строку  ←
      404[172100993]                       Результат ≡ строка ∙ 65545[172098090] ←
  1507729[172097700]               Конец многострочного комментария ←
 11010088[172097953]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097839]             Выражение ←
      404[172100987]               Результат ⁼ строка  ←
      404[172100988]               Результат ≡ строка ∙ 65545[172098090] ←
      404[172100989]               Результат ⁼  коэф осг   ←
      404[172100990]               Результат ≡ коэф осг ∙ 65545[172098089] ←
 11010093[172097602]       Комментарий ←
  1507729[172097703]       Конец многострочного комментария ←
  1507728[172097617]       Начало многострочного комментария • Тестовые  ←
  1507360[172097631]       Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[172097794]         Значения формальных параметров при вызове ←
 32505860[172097977]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[172098145]             Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[172097670]               Список элементов ←
   327700[172098146]                 Выражение ≡ документ сроков коэф ∙ 65545[172098087] ←
 30867466[172097651]         Выполнить после получения записи ←
 11010088[172097950]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097836]             Выражение ←
      404[172100975]               Результат ⁼ строка  ←
      404[172100976]               Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 30867470[172097852]           IF ←
  1638463[172097929]             Условие ←
      404[172100969]               Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[172097795]                 Значения формальных параметров при вызове ←
 32505860[172097978]                   Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[172098152]                     Выражение ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[172098187]                       Уточняющий параметр ≡ Дни недели ∙ 359[42401884] ←
 32505860[172097979]                   Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[172098153]                     Выражение ≡ Товар ∙ 65545[172098088] ←
      411[172098188]                       Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      412[172097570]               ИЛИ ←
      404[172100970]               Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[172097796]                 Значения формальных параметров при вызове ←
 32505860[172097980]                   Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[172098154]                     Выражение ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[172098189]                       Уточняющий параметр ≡ Дни недели ∙ 359[42401884] ←
 32505860[172097981]                   Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[172098155]                     Выражение ≡ Товар ∙ 65545[172098088] ←
      411[172098190]                       Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[172098191]                         Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      412[172097571]               ИЛИ ←
      404[172100971]               Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[172097797]                 Значения формальных параметров при вызове ←
 32505860[172097982]                   Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[172098156]                     Выражение ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[172098192]                       Уточняющий параметр ≡ Дни недели ∙ 359[42401884] ←
 32505860[172097983]                   Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[172098157]                     Выражение ≡ Товар ∙ 65545[172098088] ←
      411[172098193]                       Уточняющий параметр ≡ Группа 1 ∙ 305[42401867] ←
      412[172097566]               ИЛИ ←
      404[172100964]               Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[172097790]                 Значения формальных параметров при вызове ←
 32505860[172097969]                   Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[172098143]                     Выражение ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[172098177]                       Уточняющий параметр ≡ Дни недели ∙ 359[42401884] ←
 32505860[172097970]                   Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[172098144]                     Выражение ≡ Товар ∙ 65545[172098088] ←
 30867472[172097852]             THEN • подходящая группа ←
 11010080[172098513]               = ≡ строка ∙ 65545[172098090] ←
      404[172100965]                 Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 11010080[172098514]               = ≡ коэф осг ∙ 65545[172098089] ←
      404[172100972]                 Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[172098194]                   Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
 11010100[172097554]               BREAK ←
 11010088[172097949]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097835]         Выражение ←
      404[172100966]           Результат ⁼ строка  ←
      404[172100967]           Результат ≡ строка ∙ 65545[172098090] ←
      404[172100968]           Результат ⁼  коэф осг   ←
      404[172100973]           Результат ≡ коэф осг ∙ 65545[172098089] ←
 12124190[172097572]       Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[172097574]         Список полей формы ←
      598[172097635]           Поле (колонка) для ввода данных • Выбор групп ≡ Список подгрупп ∙ 65545[172098077] ←
      209[172097583]             Выбор из списка ≡ Мультивыбор групп продуктов по наименованию (Иерархия 2 уровня) ∙ 371[11141128] ←
 29163536[172097569]             Отображаемый текст для объектов БД ≡ Код ∙ 249 ←
      598[172097634]           Поле (колонка) для ввода данных • Выбор sku ≡ Список подгрупп ∙ 65545[172098077] ←
      209[172097584]             Выбор из списка ≡ Мультивыбор товаров по наименованию ∙ 371[11141162] ←
 29163536[172097570]             Отображаемый текст для объектов БД ≡ Имя ∙ 249[262146] ←
      598[172097636]           Поле (колонка) для ввода данных • Цифра ≡ Цифра ∙ 65545[172098081] ←
 11010088[172097928]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097815]         Выражение ←
      404[172100904]           Результат ≡ Список подгрупп ∙ 65545[172098077] ←
 11010088[172097942]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097822]         Выражение ←
      404[172100923]           Результат ⁼ цифра  ←
      404[172100921]           Результат ≡ Цифра ∙ 65545[172098081] ←
 12124190[172097570]       Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[172097572]         Список полей формы ←
      598[172097631]           Поле (колонка) для ввода данных • Выбор sku ≡ Список подгрупп ∙ 65545[172098077] ←
      209[172097581]             Выбор из списка ≡ Мультивыбор групп продуктов по наименованию (Иерархия 2 уровня) ∙ 371[11141128] ←
      212[172097540]               Сценарий ←
      127[172097619]                 Процедура • Выбор скю ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
       12[172097546]                   Иконка ≡ Меню ∙ 90[16842771] ←
 12124189[172097541]                   Выполнить при завершении ←
 12124190[172097571]                     Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[172097573]                       Список полей формы ←
      598[172097633]                         Поле (колонка) для ввода данных • выбор скю ≡ Список подгрупп ∙ 65545[172098077] ←
      209[172097582]                           Выбор из списка ≡ Мультивыбор товаров по наименованию ∙ 371[11141162] ←
 29163536[172097568]                           Отображаемый текст для объектов БД ≡ Имя ∙ 249[262146] ←
 39780366[172097570]                     RETURN ≡ Список подгрупп ∙ 65545[172098077] ←
   262165[172097558]               Выбор нескольких объектов из списка ≡ Да ∙ 534[40566785] ←
 29163536[172097567]             Отображаемый текст для объектов БД ≡ Имя ∙ 249[262146] ←
      598[172097632]           Поле (колонка) для ввода данных • Цифра ≡ Цифра ∙ 65545[172098081] ←
 12124190[172097566]       Форма ввода • Тестовая ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[172097568]         Список полей формы ←
      598[172097626]           Поле (колонка) для ввода данных • Выбранные группы, подгруппы, mku или sku ≡ Список подгрупп ∙ 65545[172098077] ←
   327700[172098142]             Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 32505863[172097577]               Локальные переменные ←
    65545[172098082]                 Локальная переменная • выбран ≡ Строка (40) ∙ 107[1] ←
    65545[172098083]                 Локальная переменная • список всяк ≡ Список объектов ∙ 107[1507330] ←
 30867463[172097584]               Выполнить действия ←
 12124190[172097567]                 Форма ввода • Тестовая ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[172097569]                   Список полей формы ←
      598[172097627]                     Поле (колонка) для ввода данных • Выбор групп, подгрупп, mku или sku ≡ выбран ∙ 65545[172098082] ←
      209[172097578]                       Выбор из списка ≡ ВЫБОР ИЗ СПИСКА {...} ∙ 371[1507507] ←
  1507614[172097541]                         Отбор данных ←
 11010080[172098509]                           = ≡ ID ∙ 65545[1509215] ←
      404[172100924]                             Результат ⁼ 'группа' ←
 11010080[172098510]                           = ≡ Имя ∙ 65545[1509216] ←
      404[172100925]                             Результат ≡ ID ∙ 65545[1509215] ←
 11010088[172097944]                           ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
 11010080[172098511]                           = ≡ ID ∙ 65545[1509215] ←
      404[172100926]                             Результат ⁼ 'скю' ←
 11010080[172098512]                           = ≡ Имя ∙ 65545[1509216] ←
      404[172100927]                             Результат ≡ ID ∙ 65545[1509215] ←
 11010088[172097945]                           ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
 11010088[172097946]                 ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097824]                   Выражение ←
      404[172100928]                     Результат ≡ выбран ∙ 65545[172098082] ←
 11010079[172097542]                 CASE ←
  1572877[172097548]                   Условие ←
      404[172100929]                     Результат ≡ выбран ∙ 65545[172098082] ←
 11010081[172097547]                   OF ⁼ группа ←
 12124190[172097568]                     Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[172097570]                       Список полей формы ←
      598[172097628]                         Поле (колонка) для ввода данных • Выбор групп, подгрупп, mku ≡ список всяк ∙ 65545[172098083] ←
      209[172097579]                           Выбор из списка ≡ Мультивыбор групп продуктов по наименованию (Иерархия 2 уровня) ∙ 371[11141128] ←
 29163536[172097564]                           Отображаемый текст для объектов БД ≡ Имя ∙ 249[262146] ←
 11010088[172097947]                     ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097825]                       Выражение ←
      404[172100930]                         Результат ⁼ выбрали группу ←
  1507728[172097700]                     Начало многострочного комментария ←
  1507729[172097699]                     Конец многострочного комментария ←
 11010081[172097548]                   OF ⁼ скю ←
 12124190[172097569]                     Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[172097571]                       Список полей формы ←
      598[172097629]                         Поле (колонка) для ввода данных • Выбор sku ≡ список всяк ∙ 65545[172098083] ←
      209[172097580]                           Выбор из списка ≡ Мультивыбор товаров по наименованию ∙ 371[11141162] ←
 29163536[172097565]                           Отображаемый текст для объектов БД ≡ Имя ∙ 249[262146] ←
 11010088[172097948]                     ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097834]                       Выражение ←
      404[172100931]                         Результат ⁼ выбрали скю ←
 39780366[172097569]                 RETURN ≡ список всяк ∙ 65545[172098083] ←
 29163536[172097566]             Отображаемый текст для объектов БД ≡ Имя ∙ 249[262146] ←
      598[172097630]           Поле (колонка) для ввода данных • Введите цифру ≡ Цифра ∙ 65545[172098081] ←
 12124190[172097562]       Форма ввода • Тестовая ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[172097564]         Список полей формы ←
      598[172097621]           Поле (колонка) для ввода данных • Выбранные группы, подгруппы, mku или sku ≡ Список подгрупп ∙ 65545[172098077] ←
   327700[172098139]             Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 32505863[172097576]               Локальные переменные ←
    65545[172098079]                 Локальная переменная • выбран ≡ Строка (40) ∙ 107[1] ←
    65545[172098080]                 Локальная переменная • список всяк ≡ Список объектов ∙ 107[1507330] ←
 30867463[172097583]               Выполнить действия ←
 12124190[172097563]                 Форма ввода • Тестовая ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[172097565]                   Список полей формы ←
      598[172097622]                     Поле (колонка) для ввода данных • Выбор групп, подгрупп, mku или sku ≡ выбран ∙ 65545[172098079] ←
      209[172097575]                       Выбор из списка ≡ ВЫБОР ИЗ СПИСКА {...} ∙ 371[1507507] ←
  1507614[172097540]                         Отбор данных ←
 11010080[172098498]                           = ≡ ID ∙ 65545[1509215] ←
      404[172100912]                             Результат ⁼ 'группа' ←
 11010080[172098506]                           = ≡ Имя ∙ 65545[1509216] ←
      404[172100915]                             Результат ≡ ID ∙ 65545[1509215] ←
 11010088[172097938]                           ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
 11010080[172098507]                           = ≡ ID ∙ 65545[1509215] ←
      404[172100916]                             Результат ⁼ 'скю' ←
 11010080[172098508]                           = ≡ Имя ∙ 65545[1509216] ←
      404[172100917]                             Результат ≡ ID ∙ 65545[1509215] ←
 11010088[172097939]                           ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
 11010088[172097940]                 ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097820]                   Выражение ←
      404[172100918]                     Результат ≡ выбран ∙ 65545[172098079] ←
 11010079[172097541]                 CASE ←
  1572877[172097547]                   Условие ←
      404[172100919]                     Результат ≡ выбран ∙ 65545[172098079] ←
 11010081[172097545]                   OF ⁼ группа ←
 12124190[172097564]                     Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[172097566]                       Список полей формы ←
      598[172097623]                         Поле (колонка) для ввода данных • Выбор групп, подгрупп, mku ≡ список всяк ∙ 65545[172098080] ←
      209[172097576]                           Выбор из списка ≡ Мультивыбор групп продуктов по наименованию (Иерархия 2 уровня) ∙ 371[11141128] ←
 29163536[172097561]                           Отображаемый текст для объектов БД ≡ Имя ∙ 249[262146] ←
 11010088[172097941]                     ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097821]                       Выражение ←
      404[172100920]                         Результат ⁼ выбрали группу ←
  1507728[172097698]                     Начало многострочного комментария ←
  1507729[172097697]                     Конец многострочного комментария ←
 11010081[172097546]                   OF ⁼ скю ←
 12124190[172097565]                     Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[172097567]                       Список полей формы ←
      598[172097624]                         Поле (колонка) для ввода данных • Выбор sku ≡ список всяк ∙ 65545[172098080] ←
      209[172097577]                           Выбор из списка ≡ Мультивыбор товаров по наименованию ∙ 371[11141162] ←
 29163536[172097562]                           Отображаемый текст для объектов БД ≡ Имя ∙ 249[262146] ←
 11010088[172097943]                     ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097823]                       Выражение ←
      404[172100922]                         Результат ⁼ выбрали скю ←
 39780366[172097568]                 RETURN ≡ список всяк ∙ 65545[172098080] ←
 29163536[172097563]             Отображаемый текст для объектов БД ≡ Имя ∙ 249[262146] ←
      598[172097625]           Поле (колонка) для ввода данных • Введите цифру ≡ Цифра ∙ 65545[172098081] ←
 12124190[172097559]       Форма ввода • Тестовая ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[172097561]         Список полей формы ←
      598[172097618]           Поле (колонка) для ввода данных • Выберите, нужный вариант ≡ Выбранный ∙ 65545[172098078] ←
      209[172097572]             Выбор из списка ≡ ВЫБОР ИЗ СПИСКА {...} ∙ 371[1507507] ←
  1507614[172097539]               Отбор данных ←
 11010080[172098494]                 = ≡ ID ∙ 65545[1509215] ←
      404[172100905]                   Результат ⁼ 'группа' ←
 11010080[172098495]                 = ≡ Имя ∙ 65545[1509216] ←
      404[172100906]                   Результат ≡ ID ∙ 65545[1509215] ←
 11010088[172097932]                 ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
 11010080[172098496]                 = ≡ ID ∙ 65545[1509215] ←
      404[172100907]                   Результат ⁼ 'скю' ←
 11010080[172098497]                 = ≡ Имя ∙ 65545[1509216] ←
      404[172100908]                   Результат ≡ ID ∙ 65545[1509215] ←
 11010088[172097933]                 ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
 11010079[172097540]       CASE ←
  1572877[172097546]         Условие ←
      404[172100910]           Результат ≡ Выбранный ∙ 65545[172098078] ←
 11010081[172097543]         OF ⁼ группа ←
 12124190[172097560]           Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[172097562]             Список полей формы ←
      598[172097619]               Поле (колонка) для ввода данных • Выберите ≡ Список подгрупп ∙ 65545[172098077] ←
      209[172097573]                 Выбор из списка ≡ Мультивыбор групп продуктов по наименованию (Иерархия 2 уровня) ∙ 371[11141128] ←
 29163536[172097560]                 Отображаемый текст для объектов БД ≡ Имя ∙ 249[262146] ←
 11010088[172097934]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097816]             Выражение ←
      404[172100911]               Результат ⁼ выбрали группу ←
 11010088[172097937]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097819]             Выражение ←
      404[172100914]               Результат ≡ Список подгрупп ∙ 65545[172098077] ←
  1507728[172097699]           Начало многострочного комментария ←
  1507729[172097698]           Конец многострочного комментария ←
 11010081[172097544]         OF ⁼ скю ←
 12124190[172097561]           Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[172097563]             Список полей формы ←
      598[172097620]               Поле (колонка) для ввода данных • Выберите ≡ Список подгрупп ∙ 65545[172098077] ←
      209[172097574]                 Выбор из списка ≡ Мультивыбор товаров по наименованию ∙ 371[11141162] ←
 29163536[172097559]                 Отображаемый текст для объектов БД ≡ Имя ∙ 249[262146] ←
 11010088[172097935]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097817]             Выражение ←
      404[172100913]               Результат ⁼ выбрали скю ←
 11010088[172097936]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097818]             Выражение ←
      404[172100909]               Результат ≡ Список подгрупп ∙ 65545[172098077] ←
 11010088[172097693]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097707]         Выражение ←
      404[172099586]           Результат ≡ лп Для резки ∙ 65545[172097889] ←
 30867470[172097688]       IF ←
  1638463[172097776]         Условие ←
      116[172097797]           Выражение ←
      404[172099622]             Результат ≡ POS ∙ 387[1507422] ←
 11010095[172097713]               Выражение ←
      404[172099623]                 Результат ≡ лп Для резки ∙ 65545[172097889] ←
  1507510[172097552]               Искомая подстрока ←
      404[172099624]                 Результат ⁼ 20 ←
 11010073[172097552]               Позиция ⁼ 1 ←
  1638473[172097882]             Равно ←
      404[172099585]             Результат ⁼ 1 ←
 30867472[172097690]         THEN ←
 11010088[172097686]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097711]             Выражение ←
      404[172099616]               Результат ≡ лп Для резки ∙ 65545[172097889] ←
      404[172099615]               Результат ⁼ Найдено! ←
 30867473[172097581]         ELSE ←
 11010088[172097690]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097712]             Выражение ←
      404[172099617]               Результат ≡ лп Для резки ∙ 65545[172097889] ←
      404[172099621]               Результат ⁼  не найдено  ←
 11010080[172097965]       = ≡ <<Документ>> ∙ 367[5] ←
      404[172099596]         Результат ⁼ 5:0:0:159496864 ←
 11010088[172097697]       ВЫПОЛНИТЬ ≡ Проверка изменения закупочной цены и поиск новых товаров при акцепте спецификации (ДУЦ) (в том числе 2.0) ∙ 127[164364756] ←
 32505862[172097706]         Значения формальных параметров при вызове ←
 32505860[172097804]           Значение параметра при вызове процедуры/функции ≡ ~ДУЦ_для_КЯ ∙ 65545[172097876] ←
   327700[172097912]             Выражение ⁼ 5:0:0:95501819 ←
 11010080[172097958]       = ≡ <<Документ>> ∙ 367[5] ←
      404[172099572]         Результат ⁼ 5:0:0:95501819 ←
 11010088[172097691]       ВЫПОЛНИТЬ ≡ Сформировать и прогрузить фиктивную спецификацию КЯ ∙ 127[172097601] ←
 11010080[172097945]       = ≡ <<Документ>> ∙ 367[5] ←
      404[172099524]         Результат ⁼ 5:0:0:158981328 ←
 11010088[172097687]       ВЫПОЛНИТЬ ≡ Создание карточек товаров при акцепте документа аудитором ∙ 220[164364426] ←
  1507360[172097597]       Отбор данных (по запросу) • поиск строк ←
 12124200[172097588]         From         (Таблицы) ←
 12124204[172097608]           Таблица • строки ≡ Строка (объект БД) ∙ 108[6] ←
 12124213[172097601]         Параметры ←
  1507335[172097716]           Параметр • строка_ид ≡ строки ∙ 12124204[172097608] ←
  1507494[172097981]             Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507335[172097717]           Параметр • продукт ≡ строки ∙ 12124204[172097608] ←
  1507494[172097982]             Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 12124215[172097607]         Where      (Ограничения на отбор данных) ←
  1507376[172097767]           Выражение ←
  1507455[172097846]             Результат ≡ строки ∙ 12124204[172097608] ←
  1507494[172097983]               Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638473[172097853]             Равно ←
  1507452[172097676]             Константа ⁼ 5:0:0:158891427 ←
 12124222[172097553]         Order By   (Сортировка) ←
  1507464[172097544]           Сортировать по возрастанию ≡ строка_ид ∙ 1507335[172097716] ←
  1507506[172097585]             Использование (в режиме выполнения) ≡ Нет ∙ 534[11599875] ←
 30867466[172097602]         Выполнить после получения записи ←
 11010088[172097681]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097702]             Выражение ←
      404[172099501]               Результат ≡ строка_ид ∙ 1507335[172097716] ←
      404[172099502]               Результат ⁼    ←
      404[172099503]               Результат ≡ продукт ∙ 1507335[172097717] ←
 11010080[172097944]           = ≡ строки ∙ 65545[172097869] ←
      404[172099500]             Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[172097553]               Список элементов ←
   327700[172097899]                 Выражение ≡ строки ∙ 65545[172097869] ←
   327700[172097898]                 Выражение ≡ строка_ид ∙ 1507335[172097716] ←
 11010088[172097684]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097703]             Выражение ←
      404[172099504]               Результат ≡ строки ∙ 65545[172097869] ←
 11010088[172097685]       ВЫПОЛНИТЬ ≡ Печать ценника А4 и А5 (Дискаунтер) ∙ 127[165347387] ←
 32505862[172097700]         Значения формальных параметров при вызове ←
 32505860[172097795]           Значение параметра при вызове процедуры/функции ≡ фп Строки in ∙ 65545[165348428] ←
   327700[172097900]             Выражение ≡ строки ∙ 65545[172097869] ←
 32505860[172097796]           Значение параметра при вызове процедуры/функции ≡ фп Планировщик ∙ 65545[165347768] ←
   327700[172097901]             Выражение ⁼ 0 ←
 32505860[172097797]           Значение параметра при вызове процедуры/функции ≡ фп Шаблон (-1 - обычный А6, 0 - паллетный А4, 1 - паллетный А5, 2 - Так просто А4, 3 - так просто А5, 4 - кармашек А4, 5 - уценка А4, 6 - уценка А5, 7 - А4 ПРОМО, 8 - А5 ПРОМО) ∙ 65545[165347771] ←
   327700[172097902]             Выражение ⁼ 3 ←
 48431132[172097562]       += ≡ дата_сегодня ∙ 65545[172097829] ←
      116[172097782]         Выражение ←
      404[172099494]           Результат ≡ Сутки ∙ 117[16843851] ←
      403[172097561]           Умножить ←
      404[172099490]           Результат ⁼ 3 ←
 11010080[172097942]       = ≡ день_недели_цифра ∙ 65545[172097830] ←
      404[172099487]         Результат ≡ ДЕНЬ НЕДЕЛИ ∙ 387[1638420] ←
   327700[172097893]           Выражение ≡ дата_сегодня ∙ 65545[172097829] ←
 11010088[172097677]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097701]         Выражение ←
      404[172099491]           Результат ⁼ дата проверочная  ←
      404[172099492]           Результат ≡ дата_сегодня ∙ 65545[172097829] ←
      404[172099493]           Результат ⁼   ←
      404[172099488]           Результат ⁼ день недели цифра  ←
      404[172099489]           Результат ≡ день_недели_цифра ∙ 65545[172097830] ←
 11010105[172097554]       Индикатор ←
      404[172099449]         Результат ⁼ Поиск... ←
  1507360[172097596]       Отбор данных (по запросу) • поиск фиктивных спецификаций ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
 32505862[172097695]         Значения формальных параметров при вызове ←
 32505860[172097786]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547258] ←
   327700[172097869]             Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[172097551]               Список элементов ←
   327700[172097890]                 Выражение ≡ Прейскурант поставщика ∙ 332[6684738] ←
 32505860[172097785]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Подразделения ∙ 65545[18547259] ←
   327700[172097867]             Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[172097550]               Список элементов ←
   327700[172097868]                 Выражение ≡ Гастрономы (бывшие Договоры) - Ком отдел ∙ 117[170459219] ←
 32505860[172097787]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Контрагент ∙ 65545[18547262] ←
   327700[172097891]             Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[172097552]               Список элементов ←
   327700[172097892]                 Выражение ≡ Поставщик Красный Яр ∙ 117[170459898] ←
 12124213[172097598]         Параметры ←
  1507335[172097715]           Параметр • фиктивная спецификация_ид ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[172097972]             Уточняющий параметр ≡ Документ ∙ 331[1] ←
 12124215[172097604]         Where      (Ограничения на отбор данных) ←
  1507381[172097559]           <Наследуемые ограничения> ←
  1507376[172097759]           Выражение ←
  1507455[172097840]             Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[172097973]               Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638478[172097575]             Больше ←
  1507452[172097670]             Константа ⁼ 01/11/2021 00:00:00 ←
  1507376[172097762]           Выражение ←
  1507455[172097841]             Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[172097974]               Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638475[172097556]             Меньше или равно ←
  1507452[172097671]             Константа ⁼ 09/11/2021 11:00:00 ←
  1507376[172097763]           Выражение ←
  1507455[172097842]             Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[172097975]               Уточняющий параметр ≡ Причина ∙ 331[1966098] ←
  1638473[172097848]             Равно ←
  1507452[172097672]             Константа ≡ Фиктивная спецификация для ДУЦ ∙ 1507640[164364352] ←
 30867466[172097600]         Выполнить после получения записи ←
 11010088[172097672]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097697]             Выражение ←
      404[172099448]               Результат ≡ фиктивная спецификация_ид ∙ 1507335[172097715] ←
 11010080[172097932]       = ≡ <<Документ>> ∙ 367[5] ←
      404[172099444]         Результат ⁼ 5:0:0:158199776 ←
 11010088[172097668]       ВЫПОЛНИТЬ ≡ Проверка изменения закупочной цены и поиск новых товаров при акцепте спецификации (ДУЦ) (в том числе 2.0) ∙ 127[164364756] ←
 11010105[172097553]       Индикатор ←
      404[172099644]         Результат ⁼ Поиск ←
  1507360[172097601]       Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
  1507703[172097546]         Показать текст запроса ←
  1507372[172097539]         Distinct     (Исключать дублирующиеся записи) ←
 32505862[172097696]         Значения формальных параметров при вызове ←
 32505860[172097782]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Документ.Список типов ∙ 65545[1510110] ←
   327700[172097860]             Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[172097548]               Список элементов ←
   327700[172097861]                 Выражение ≡ ДУЦ 2.0 ∙ 332[164364328] ←
 32505860[172097783]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Подразделение документа ∙ 65545[1510101] ←
   327700[172097862]             Выражение ≡ Дискаунтер - Ком отдел ∙ 117[170459221] ←
 12124215[172097613]         Where      (Ограничения на отбор данных) ←
  1507381[172097558]           <Наследуемые ограничения> ←
  1507376[172097774]           Выражение ←
  1507506[172097580]             Использование (в режиме выполнения) ≡ Нет ∙ 534[11599875] ←
  1507455[172097934]             Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[172098038]               Уточняющий параметр ≡ Договор ∙ 359[16515073] ←
  1638479[172097567]             Не равно ←
  1638402[172097583]             NULL ←
  1507376[172097758]           Выражение ←
  1507506[172097581]             Использование (в режиме выполнения) ≡ Да ∙ 534[11599874] ←
  1507455[172097839]             Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[172097971]               Уточняющий параметр ≡ Договор ∙ 359[16515073] ←
  1638473[172097847]             Равно ←
  1507452[172097668]             Константа ⁼ 5:0:0:158199777 ←
 12124213[172097607]         Параметры ←
  1507335[172097805]           Параметр • дуц_ид ≡ ДОКУМЕНТЫ ∙ 12124204[1507791] ←
  1507506[172097579]             Использование (в режиме выполнения) ≡ Нет ∙ 534[11599875] ←
  1507494[172098039]             Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1507335[172097714]           Параметр • строка_ид ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[172097970]             Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
 30867466[172097606]         Выполнить после получения записи ←
 11010088[172097695]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097722]             Выражение ←
      404[172099645]               Результат ≡ дуц_ид ∙ 1507335[172097805] ←
      404[172099443]               Результат ≡ строка_ид ∙ 1507335[172097714] ←
 11010093[172097546]       Комментарий • торговый зал ←
 11010088[172097665]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097694]         Выражение ←
      404[172099434]           Результат ⁼ проверочная это:  ←
      404[172099433]           Результат ≡ Проверочная ∙ 65545[172097801] ←
 11010080[172097920]       = ≡ Проверочная ∙ 65545[172097801] ←
      404[172099431]         Результат ≡ Первый ТЗ/ПЦ для ЦО/ТТ/Узла (действ. магазины) ∙ 249[655294491] ←
 32505862[172097687]           Значения формальных параметров при вызове ←
 32505860[172097766]             Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[655298326] ←
   327700[172097843]               Выражение ⁼ 4:0:0:100003 ←
 11010088[172097658]       ВЫПОЛНИТЬ ≡ Проверка спецификаций ∙ 127[172097595] ←
 32505862[172097685]         Значения формальных параметров при вызове ←
 32505860[172097764]           Значение параметра при вызове процедуры/функции ≡ ~Uid товара _вп ∙ 65545[172097805] ←
   327700[172097837]             Выражение ⁼ 3:0:0:49744651 ←
 12124190[172097551]       Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[172097551]         Список полей формы ←
      598[172097649]           Поле (колонка) для ввода данных • типы цеха ≡ типы цехов ∙ 65545[172097867] ←
 29163536[172097598]             Отображаемый текст для объектов БД ≡ Имя ∙ 249[262146] ←
      209[172097604]             Выбор из списка ≡ Тип цеха выбор нескольких ∙ 371[172097539] ←
   262166[172097542]               Заголовок ⁼ Типы цехов  ←
   262165[172097581]               Выбор нескольких объектов из списка ≡ Да ∙ 534[40566785] ←
 11010105[172097548]       Индикатор ←
      404[172097892]         Результат ⁼ смотрим... ←
  1507360[172097580]       Отбор данных (по запросу) • Вытащить из продукта тип цеха ←
 48431120[172097539]         Максимальное количество возвращаемых записей ⁼ 10 ←
  1507703[172097544]         Показать текст запроса ←
 12124200[172097563]         From         (Таблицы) ←
 12124204[172097573]           Таблица ≡ Продукт ∙ 108[3] ←
 12124204[172097574]           Таблица ≡ DOMINO_UIDSET ∙ 1507696[1507341] ←
 12124213[172097582]         Параметры ←
  1507335[172097571]           Параметр • id ∙ 12124204[172097573] ←
  1507494[172097629]             Уточняющий параметр ≡ Продукт ∙ 305[1] ←
  1507335[172097591]           Параметр • тип_цеха ∙ 12124204[172097574] ←
  1507494[172097630]             Уточняющий параметр ≡ VALUE ∙ 1507443[1507878] ←
 12124215[172097584]         Where      (Ограничения на отбор данных) ←
  1507376[172097633]           Выражение ←
  1507455[172097658]             Результат ∙ 12124204[172097574] ←
  1507494[172097631]               Уточняющий параметр ≡ OBJECT_ID ∙ 1507443[1507875] ←
  1638473[172097591]             Равно ←
  1507455[172097720]             Результат ∙ 12124204[172097573] ←
  1507494[172097806]               Уточняющий параметр ≡ Продукт ∙ 305[1] ←
  1507376[172097687]           Выражение ←
  1507455[172097721]             Результат ∙ 12124204[172097574] ←
  1507494[172097807]               Уточняющий параметр ≡ FIELD_ID ∙ 1507443[1507876] ←
  1638473[172097616]             Равно ←
  1507452[172097587]             Константа ⁼ 40042510 ←
  1507376[172097634]           Выражение ←
  1507506[172097538]             Использование (в режиме выполнения) ≡ Да ∙ 534[11599874] ←
  1507455[172097659]             Результат ∙ 12124204[172097573] ←
  1507494[172097722]               Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
  1638473[172097574]             Равно ←
  1507452[172097585]             Константа ⁼ 2:0:0:206261 ←
  1507376[172097690]           Выражение ←
  1507455[172097725]             Результат ∙ 12124204[172097574] ←
  1507494[172097812]               Уточняющий параметр ≡ VALUE ∙ 1507443[1507878] ←
  1638473[172097701]           Равно ←
  1507452[172097589]           Константа ≡ типы цехов ∙ 65545[172097867] ←
 30867465[172097537]         Выполнить при старте ←
 11010088[172097607]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097581]             Выражение ←
      404[172097891]               Результат ⁼ типы цехов ←
      404[172097893]               Результат ≡ типы цехов ∙ 65545[172097867] ←
 30867466[172097582]         Выполнить после получения записи ←
 11010088[172097605]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097579]             Выражение ←
      404[172097572]               Результат ≡ id ∙ 1507335[172097571] ←
      404[172097573]               Результат ⁼ ' ' ←
      404[172097574]               Результат ≡ тип_цеха ∙ 1507335[172097591] ←
 30867470[172097818]       IF ←
  1638463[172097976]         Условие ←
      116[172097634]           Выражение ←
      404[172102932]             Результат ≡ товар ∙ 65545[172097866] ←
      411[172099242]               Уточняющий параметр ≡ ЕИ ∙ 305[14745607] ←
  1638473[172098063]           Равно ←
      404[172102933]           Результат ≡ Килограмм ∙ 131108[28049411] ←
 30867472[172097818]         THEN • скажем, что да ←
 11010088[172097888]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097677]             Выражение ←
      404[172102934]               Результат ⁼ КГ ←
 30867473[172097634]         ELSE ←
 11010088[172097889]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097678]             Выражение ←
      404[172102935]               Результат ⁼ нет! ←
 11010088[172097579]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097674]         Выражение ←
      404[172102931]           Результат ≡ типы цехов ∙ 65545[172097867] ←
  1507360[172097675]       Отбор данных (по запросу) • ТЕСТ ←
  1507703[172097542]         Показать текст запроса ←
 48431120[172097538]         Максимальное количество возвращаемых записей ⁼ 1 ←
 12124200[172097597]         From         (Таблицы) ←
 12124204[172097632]           Таблица ≡ Продукт ∙ 108[3] ←
 12124213[172097631]         Параметры ←
  1507335[172097801]           Параметр • ТЕСТ1 ∙ 12124204[172097632] ←
  1507494[172098180]             Уточняющий параметр ≡ Продукт ∙ 305[1] ←
 12124215[172097630]         Where      (Ограничения на отбор данных) ←
  1507376[172098139]           Выражение ←
  1507455[172097908]             Результат ∙ 12124204[172097632] ←
  1507494[172098181]               Уточняющий параметр ≡ Список альтернативных поставщиков (из партий) ∙ 305[40042510] ←
  1638473[172098061]             Равно ←
  1638402[172097654]             NULL ←
 11010105[172097556]       Индикатор ←
      404[172102901]         Результат ⁼ что-то идет ←
 11010080[172098238]       = ≡ партнер.ид ∙ 65545[172097855] ←
      404[172102921]         Результат ≡ документ ∙ 65545[172097854] ←
      411[172099237]           Уточняющий параметр ≡ Принял М.О.Л. ∙ 331[42401865] ←
 11010080[172098239]       = ≡ партнер.наименование ∙ 65545[172097856] ←
      404[172102923]         Результат ≡ партнер.ид ∙ 65545[172097855] ←
      411[172099238]           Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[172098240]       = ≡ партнер.внешний код ∙ 65545[172097857] ←
      404[172102924]         Результат ≡ партнер.ид ∙ 65545[172097855] ←
      411[172099239]           Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
 11010088[172097581]       ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097676]         Выражение ←
      404[172102922]           Результат ≡ партнер.ид ∙ 65545[172097855] ←
      404[172102925]           Результат ≡ партнер.наименование ∙ 65545[172097856] ←
      404[172102926]           Результат ≡ партнер.внешний код ∙ 65545[172097857] ←
  1507360[172097676]       Отбор данных (по запросу) • выбрать наименование и код магазина ←
  1507703[172097543]         Показать текст запроса ←
 48431120[172097537]         Максимальное количество возвращаемых записей ⁼ 1 ←
 12124200[172097598]         From         (Таблицы) ←
 12124204[172097631]           Таблица ≡ Документ ∙ 108[5] ←
 12124204[172097633]           Таблица ≡ Партнер ∙ 108[4] ←
 12124213[172097632]         Параметры ←
  1507335[172097803]           Параметр • Наименование ТТ ∙ 12124204[172097633] ←
  1507494[172098182]             Уточняющий параметр ≡ Наименование ∙ 283[5] ←
  1507335[172097804]           Параметр • Внешний код ТТ ∙ 12124204[172097633] ←
  1507494[172098184]             Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
 12124215[172097631]         Where      (Ограничения на отбор данных) ←
  1507376[172098140]           Выражение ←
  1507452[172098319]             Константа ≡ документ ∙ 65545[172097854] ←
      411[172099236]               Уточняющий параметр ≡ Принял М.О.Л. ∙ 331[42401865] ←
  1638473[172098062]             Равно ←
  1507455[172097907]             Результат ∙ 12124204[172097633] ←
  1507494[172098185]               Уточняющий параметр ≡ Партнер ∙ 283[1] ←
 30867466[172097680]         Выполнить после получения записи ←
 11010088[172097580]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[172097675]             Выражение ←
      404[172102899]               Результат ≡ Наименование ТТ ∙ 1507335[172097803] ←
      404[172102900]               Результат ≡ Внешний код ТТ ∙ 1507335[172097804] ←
 11010093[172097555]       Комментарий • работает, письмо отправляет, отбор сработал, д и не те группы не трогает, файл удаляет ←
 11010088[172097798]       ВЫПОЛНИТЬ ≡ Отчет трейд-маркетологу на почту по гр.329-335 ∙ 127[172097576] ←
 32505862[172097594]         Значения формальных параметров при вызове ←
 32505860[172098346]           Значение параметра при вызове процедуры/функции ≡ Адреса эл. почты для отправки ∙ 65545[172097853] ←
   327700[172099092]             Выражение ⁼ DarinaMukhortova@krasyar.ru ←
 32505860[172098258]           Значение параметра при вызове процедуры/функции ≡ ТТН ∙ 65545[172097615] ←
   327700[172097675]             Выражение ⁼ 5:0:0:156021695 ←
 32505860[172097635]           Значение параметра при вызове процедуры/функции ≡ Автоматически ∙ 65545[58393339] ←
   327700[172098874]             Выражение ⁼ 1 ←
 32505860[172097630]           Значение параметра при вызове процедуры/функции ≡ Имя ∙ 65545[655299190] ←
   327700[172098869]             Выражение ⁼ Отчет_трейд_маркетологу ←
  1507729[172097616]       Конец многострочного комментария ←
