ETK\Admin

      127[164823578]   Процедура • Эффективность ДМП ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505861[164823303]     Формальные параметры ←
    65545[164823895]       Локальная переменная • Автоматически ≡ bool ∙ 107[1507344] ←
      355[164823601]         Начальное значение ≡ false ∙ 117[30867469] ←
 32505863[164823458]     Локальные переменные ←
 30867495[164823168]       Группа локальных переменных • Форма ввода ←
    65545[164823896]         Локальная переменная • Дата начальная ≡ Дата ∙ 107[3] ←
    65545[164828195]         Локальная переменная • Дата конечная ≡ Дата ∙ 107[3] ←
    65545[164823897]         Локальная переменная • Подразделения ≡ Список партнеров ∙ 107[1507332] ←
    65545[164823898]         Локальная переменная • Товар ≡ Продукт ∙ 107[7] ←
    65545[164823899]         Локальная переменная • Показывать текущее промо ≡ Признак (Да/Нет) ∙ 107[131203074] ←
      355[164823602]           Начальное значение ≡ Да ∙ 131203075[131203074] ←
    65545[164823900]         Локальная переменная • Показывать распродажи ≡ Признак (Да/Нет) ∙ 107[131203074] ←
      355[164823603]           Начальное значение ≡ Да ∙ 131203075[131203074] ←
    65545[164823901]       Локальная переменная • Дата начальная (для заказов) ≡ Дата ∙ 107[3] ←
    65545[164823902]       Локальная переменная • Дата конечная (для заказов) ≡ Дата ∙ 107[3] ←
    65545[164823903]       Локальная переменная • Перечень товаров для акции (список) ≡ Список документов ∙ 107[1507335] ←
    65545[164823904]       Локальная переменная • Перечень товаров для акции (документ) ≡ Документ ∙ 107[8] ←
    65545[164823905]       Локальная переменная • ЦО ≡ Партнер ∙ 107[5] ←
    65545[164826680]       Локальная переменная • ЦО наименование ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[164826681]       Локальная переменная • Список ТТ и ЦО для поиска заказов ≡ Список партнеров ∙ 107[1507332] ←
    65545[164826682]       Локальная переменная • Номер ДМП ≡ Наименование объекта (80) ∙ 107[262147] ←
    65545[164826683]       Локальная переменная • Продукт ≡ Продукт ∙ 107[7] ←
    65545[164826684]       Локальная переменная • Спецценник ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[164826685]       Локальная переменная • Наименование документа ПРОМО ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[164826686]       Локальная переменная • Распеденное значение на ПРОМО ≡ Число ∙ 107[4] ←
    65545[164826687]       Локальная переменная • Тип оборудования ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[164826688]       Локальная переменная • Документ промо ≡ Объект ∙ 107[19] ←
    65545[164826689]       Локальная переменная • Список заказов/приходов ≡ Список документов ∙ 107[1507335] ←
    65545[164826690]       Локальная переменная • Дата начала ≡ Дата ∙ 107[3] ←
    65545[164826691]       Локальная переменная • Дата окончания ≡ Дата ∙ 107[3] ←
    65545[164826692]       Локальная переменная • Документ распродажа ≡ Объект ∙ 107[19] ←
    65545[164826693]       Локальная переменная • Оборудование ДМП ≡ Объект ∙ 107[19] ←
    65545[164826694]       Локальная переменная • Расшифровка ДМП ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[164826695]       Локальная переменная • Торец ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[164826714]       Локальная переменная • Список типов ДМП для расшифровки ≡ Список объектов ∙ 107[1507330] ←
    65545[164826796]       Локальная переменная • i ≡ Число ∙ 107[4] ←
    65545[164826798]       Локальная переменная • Остаток ≡ Число ∙ 107[4] ←
    65545[164826799]       Локальная переменная • Движение ≡ Строка для примечания (4000 знаков) ∙ 107[30867457] ←
    65545[164828192]       Локальная переменная • Дата акционного прихода ≡ Дата ∙ 107[3] ←
    65545[164828193]       Локальная переменная • Количество продаж до ДМП ≡ Число ∙ 107[4] ←
    65545[164828194]       Локальная переменная • Количество продаж на ДМП ≡ Число ∙ 107[4] ←
    65545[164828196]       Локальная переменная • Ср. Количество продаж до ДМП ≡ Число ∙ 107[4] ←
    65545[164828197]       Локальная переменная • Ср. Количество продаж на ДМП ≡ Число ∙ 107[4] ←
    65545[164828222]       Локальная переменная • Количество дней до ДМП ≡ Число ∙ 107[4] ←
    65545[164828223]       Локальная переменная • Количество дней на ДМП ≡ Число ∙ 107[4] ←
    65545[164828198]       Локальная переменная • Показывать движение ≡ Признак (Да/Нет) ∙ 107[131203074] ←
    65545[164826800]       Локальная переменная • Адреса ≡ Строка для примечания (4000 знаков) ∙ 107[30867457] ←
    65545[164826803]       Локальная переменная • Файл на ТТ ≡ Строка для примечания (4000 знаков) ∙ 107[30867457] ←
    65545[164826814]       Локальная переменная • Файл отчета ≡ Строка для примечания (4000 знаков) ∙ 107[30867457] ←
 12124192[164823069]     Шаблоны отчетов ←
 12124193[164823091]       Шаблон отчета • Револьвер ДМП ≡ Базовый шаблон ∙ 12124193[1507346] ⁼ {{Заголовок}}
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
   <link rel=stylesheet href="file:{STYLE}" type="text/css">
</head>
<body>
<p>Отпечатано {Текущая дата}</p>

<H1 align=center>Эффективность ДМП</H1>

{{Шапка по 1 ТТ}}

<table class=MainTable border=1 width=95% cellspacing=0 cellpadding=4>
<tr>
  <td class=TableHeader>КЯ</td>
  <td class=TableHeader>ДМП</td>
  <td class=TableHeader>Группа</td>
  <td class=TableHeader>Подгруппа</td>
  <td class=TableHeader>Код товара</td>
  <td class=TableHeader>Наименование</td>
  <td class=TableHeader>Продажи до ДМП</td>
  <td class=TableHeader>Продажи после ДМП</td>
  <td class=TableHeader>Дней до ДМП</td>
  <td class=TableHeader>Дней после ДМП</td>
  <td class=TableHeader>Средние продажи до ДМП</td>
  <td class=TableHeader>Средние продажи после ДМП</td>
  <td class=TableHeader>Дата акционной поставки</td>
  <td class=TableHeader>Акция</td>
  <td class=TableHeader>Дата начала</td>
  <td class=TableHeader>Дата окончания</td>
  <td class=TableHeader>Движение</td>
</tr>

{{Шапка по сети}}

<table class=MainTable border=1 width=95% cellspacing=0 cellpadding=4>
<tr>
  <td class=TableHeader>КЯ</td>
  <td class=TableHeader>ДМП</td>
  <td class=TableHeader>Группа</td>
  <td class=TableHeader>Подгруппа</td>
  <td class=TableHeader>Код товара</td>
  <td class=TableHeader>Наименование</td>
  <td class=TableHeader>Продажи до ДМП</td>
  <td class=TableHeader>Продажи после ДМП</td>
  <td class=TableHeader>Дней до ДМП</td>
  <td class=TableHeader>Дней после ДМП</td>
  <td class=TableHeader>Средние продажи до ДМП</td>
  <td class=TableHeader>Средние продажи после ДМП</td>
  <td class=TableHeader>Дата акционной поставки</td>
  <td class=TableHeader>Акция</td>
  <td class=TableHeader>Дата начала</td>
  <td class=TableHeader>Дата окончания</td>
  <td class=TableHeader>Движение</td>
</tr>

{{Шапка по SKU}}

<table class=MainTable border=1 width=95% cellspacing=0 cellpadding=4>
<tr>
  <td class=TableHeader>КЯ</td>
  <td class=TableHeader>ДМП</td>
  <td class=TableHeader>Группа</td>
  <td class=TableHeader>Подгруппа</td>
  <td class=TableHeader>Код товара</td>
  <td class=TableHeader>Наименование</td>
  <td class=TableHeader>Продажи до ДМП</td>
  <td class=TableHeader>Продажи после ДМП</td>
  <td class=TableHeader>Дней до ДМП</td>
  <td class=TableHeader>Дней после ДМП</td>
  <td class=TableHeader>Средние продажи до ДМП</td>
  <td class=TableHeader>Средние продажи после ДМП</td>
  <td class=TableHeader>Дата акционной поставки</td>
  <td class=TableHeader>Акция</td>
  <td class=TableHeader>Дата начала</td>
  <td class=TableHeader>Дата окончания</td>
  <td class=TableHeader>Движение</td>
</tr>

{{Подразделение}}


{{Подразделение по SKU}}


{{Строка по 1 ТТ}}
<tr>
  <td>{КЯ}</td>
  <td>{ДМП}</td>
  <td>{Группа}</td>
  <td>{Подгруппа}</td>
  <td>{Код товара}</td>
  <td>{Наименование товара}</td>
  <td>{Продажи до}</td>
  <td>{Продажи после}</td>
  <td>{Дней без ДМП}</td>
  <td>{Дней с ДМП}</td>
  <td>{Ср. Продажи до}</td>
  <td>{Ср. Продажи после}</td>
  <td>{Дата акционной поставки}</td>
  <td>{Акция}</td>
  <td>{Дата начала}</td>
  <td>{Дата окончания}</td>
  <td>{Фьючерс}</td>
</tr>  
{{Строка по сети}}

<tr>
  <td>{КЯ}</td>
  <td>{ДМП}</td>
  <td>{Группа}</td>
  <td>{Подгруппа}</td>
  <td>{Код товара}</td>
  <td>{Наименование товара}</td>
  <td>{Продажи до}</td>
  <td>{Продажи после}</td>
  <td>{Дней без ДМП}</td>
  <td>{Дней с ДМП}</td>
  <td>{Ср. Продажи до}</td>
  <td>{Ср. Продажи после}</td>
  <td>{Дата акционной поставки}</td>
  <td>{Акция}</td>
  <td>{Дата начала}</td>
  <td>{Дата окончания}</td>
  <td>{Фьючерс}</td>
</tr>  
 
{{Строка по SKU}}

<tr>
  <td>{КЯ}</td>
  <td>{ДМП}</td>
  <td>{Группа}</td>
  <td>{Подгруппа}</td>
  <td>{Код товара}</td>
  <td>{Наименование товара}</td>
  <td>{Продажи до}</td>
  <td>{Продажи после}</td>
  <td>{Дней без ДМП}</td>
  <td>{Дней с ДМП}</td>
  <td>{Ср. Продажи до}</td>
  <td>{Ср. Продажи после}</td>
  <td>{Дата акционной поставки}</td>
  <td>{Акция}</td>
  <td>{Дата начала}</td>
  <td>{Дата окончания}</td>
  <td>{Фьючерс}</td>
</tr>  
 

{{Конец файла}}
</table>
</body>
</html>
 ←
 12124195[164823077]         Блоки шаблона ←
 12124197[164823428]           Блок шаблона • Заголовок ←
 12124197[164823429]           Блок шаблона • Шапка по 1 ТТ ←
 12124197[164823430]           Блок шаблона • Шапка по сети ←
 12124197[164823431]           Блок шаблона • Шапка по SKU ←
 12124197[164823432]           Блок шаблона • Подразделение ←
 12124197[164823433]           Блок шаблона • Подразделение по SKU ←
 12124197[164823434]           Блок шаблона • Строка по 1 ТТ ←
 12124197[164823435]           Блок шаблона • Строка по сети ←
 12124197[164823436]           Блок шаблона • Строка по SKU ←
 12124197[164823437]           Блок шаблона • Закрыть таблицу ←
 12124197[164823438]           Блок шаблона • Строка расшифровки ДМП ←
 12124197[164823439]           Блок шаблона • Конец файла ←
 12124194[164823090]         Поля шаблона ←
 12124196[164824800]           Поле шаблона • STYLE ≡ Стиль 1 (голубой мелкий) ∙ 381[11534337] ←
 12124196[164824801]           Поле шаблона • ----------- ←
 12124196[164824802]           Поле шаблона • Текущая дата ≡ Текущие дата-время ∙ 249[42467332] ←
   131097[164825295]             Формат ≡ Дата + Время без секунд (DD-MM-YYYY HH:NN) ∙ 131096[56033281] ←
 12124196[164824803]           Поле шаблона • Дата формирования ≡ Дата начальная ∙ 65545[164823896] ←
   131097[164825296]             Формат ≡ Дата без времени ∙ 131096[131073] ←
 12124196[164824804]           Поле шаблона • КЯ ≡ ЦО ∙ 65545[164823905] ←
      411[164836319]             Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
 12124196[164824805]           Поле шаблона • ДМП ≡ Номер ДМП ∙ 65545[164826682] ←
 12124196[164824806]           Поле шаблона • Тип оборудования ≡ Тип оборудования ∙ 65545[164826687] ←
 12124196[164824807]           Поле шаблона • Код товара ≡ Продукт ∙ 65545[164826683] ←
      411[164836320]             Уточняющий параметр ≡ Код ∙ 305[5] ←
 12124196[164824822]           Поле шаблона • Наименование товара ≡ Продукт ∙ 65545[164826683] ←
      411[164836321]             Уточняющий параметр ≡ Наименование ∙ 305[6] ←
 12124196[164824823]           Поле шаблона • Спецценник ≡ Спецценник ∙ 65545[164826684] ←
 12124196[164824824]           Поле шаблона • Остаток ≡ Остаток ∙ 65545[164826798] ←
   131097[164825297]             Формат ≡ Количество N19.3 ∙ 131096[30867458] ←
 12124196[164824825]           Поле шаблона • Фьючерс ≡ Движение ∙ 65545[164826799] ←
 12124196[164824826]           Поле шаблона • Распределенное количество ≡ Распеденное значение на ПРОМО ∙ 65545[164826686] ←
 12124196[164824827]           Поле шаблона • Акция ≡ Наименование документа ПРОМО ∙ 65545[164826685] ←
 12124196[164824828]           Поле шаблона • Дата начала ≡ Дата начала ∙ 65545[164826690] ←
   131097[164825298]             Формат ≡ Дата без времени ∙ 131096[131073] ←
 12124196[164824829]           Поле шаблона • Дата окончания ≡ Дата окончания ∙ 65545[164826691] ←
   131097[164825299]             Формат ≡ Дата без времени ∙ 131096[131073] ←
 12124196[164824830]           Поле шаблона • Расшифровка ≡ Расшифровка ДМП ∙ 65545[164826694] ←
 12124196[164824831]           Поле шаблона • Торец ≡ Торец ∙ 65545[164826695] ←
 12124196[164824832]           Поле шаблона • Подразеделение ≡ ЦО ∙ 65545[164823905] ←
      411[164836322]             Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
 12124196[164824833]           Поле шаблона • Оборудование ≡ Оборудование ДМП ∙ 65545[164826693] ←
      411[164836323]             Уточняющий параметр ≡ Наименование ∙ 296[6] ←
 12124196[164824993]           Поле шаблона • Дата акционной поставки ≡ Дата акционного прихода ∙ 65545[164828192] ←
   131097[164825342]             Формат ≡ Дата без времени ∙ 131096[131073] ←
 12124196[164824994]           Поле шаблона • Продажи до ≡ Количество продаж до ДМП ∙ 65545[164828193] ←
   131097[164825343]             Формат ≡ Целое N19.0 ∙ 131096[1507329] ←
 12124196[164825006]           Поле шаблона • Продажи после ≡ Количество продаж на ДМП ∙ 65545[164828194] ←
   131097[164825344]             Формат ≡ Целое N19.0 ∙ 131096[1507329] ←
 12124196[164825007]           Поле шаблона • Ср. Продажи до ≡ Ср. Количество продаж до ДМП ∙ 65545[164828196] ←
   131097[164825345]             Формат ≡ Количество N19.3 ∙ 131096[30867458] ←
 12124196[164825008]           Поле шаблона • Ср. Продажи после ≡ Ср. Количество продаж на ДМП ∙ 65545[164828197] ←
   131097[164825346]             Формат ≡ Количество N19.3 ∙ 131096[30867458] ←
 12124196[164825017]           Поле шаблона • Группа ≡ Продукт ∙ 65545[164826683] ←
      411[164825775]             Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[164825776]               Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[164836427]                 Уточняющий параметр ≡ Наименование ∙ 296[6] ←
 12124196[164825018]           Поле шаблона • Подгруппа ≡ Продукт ∙ 65545[164826683] ←
      411[164836431]             Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[164836462]               Уточняющий параметр ≡ Наименование ∙ 296[6] ←
 12124196[164825019]           Поле шаблона • Дней без ДМП ≡ Количество дней до ДМП ∙ 65545[164828222] ←
   131097[164825358]             Формат ≡ Целое N19.0 ∙ 131096[1507329] ←
 12124196[164825020]           Поле шаблона • Дней с ДМП ≡ Количество дней на ДМП ∙ 65545[164828223] ←
   131097[164825359]             Формат ≡ Целое N19.0 ∙ 131096[1507329] ←
 12124203[164823087]     Запросы ←
 12124205[164823183]       Запрос • Приход ←
  1507673[164823586]         Ключи оптимизации ←
  1507675[164823948]           Использовать индекс ∙ 12124204[164824308] ←
  1507676[164823951]             Уточняющий параметр ≡ ЦФО --> Счет.Дебет --> Ан2.Дебет --> Дата --> Валюта ∙ 1507445[1507456] ←
  1507675[164823945]           Использовать индекс ∙ 12124204[164824307] ←
  1507676[164823948]             Уточняющий параметр ≡ ID ∙ 1507445[1507432] ←
 12124213[164823834]         Параметры ←
  1507335[164825129]           Параметр • Строка ∙ 12124204[164824308] ←
  1507494[164831963]             Уточняющий параметр ≡ Строка документа ∙ 269[4] ←
  1507335[164825130]           Параметр • Кол-во ∙ 12124204[164824308] ←
  1507494[164831964]             Уточняющий параметр ≡ Сумма ∙ 269[19] ←
  1507335[164825131]           Параметр • Продукт ∙ 12124204[164824308] ←
  1507494[164831965]             Уточняющий параметр ≡ Аналитика по дебету (2) ∙ 269[8] ←
  1507335[164825132]           Параметр • Партия ∙ 12124204[164824308] ←
  1507494[164831966]             Уточняющий параметр ≡ Аналитика по дебету (3) ∙ 269[9] ←
  1507335[164825127]           Параметр • Дата ∙ 12124204[164824308] ←
  1507494[164831787]             Уточняющий параметр ≡ Дата ∙ 269[5] ←
 12124200[164823737]         From         (Таблицы) ←
 12124204[164824308]           Таблица ≡ Проводка ∙ 108[7] ←
 12124204[164824307]           Таблица ≡ Документ ∙ 108[5] ←
 12124215[164824205]         Where      (Ограничения на отбор данных) ←
  1507376[164828749]           Выражение ←
  1507455[164829111]             Результат ∙ 12124204[164824308] ←
  1507494[164831967]               Уточняющий параметр ≡ ЦФО ∙ 269[2] ←
  1638473[164829182]             Равно ←
  1507452[164827498]             Константа ≡ Центр финанс. ответственности для ТОВАРНЫХ ПЛАНОВ ∙ 117[45613057] ←
      413[164827823]           И ←
  1507376[164828750]           Выражение ←
  1507455[164829112]             Результат ∙ 12124204[164824308] ←
  1507494[164831968]               Уточняющий параметр ≡ Дата ∙ 269[5] ←
  1638477[164823680]             Больше или равно ←
  1507452[164827499]             Константа ≡ Дата минус количество дней ∙ 249[164364372] ←
 32505862[164828277]               Значения формальных параметров при вызове ←
 32505860[164834266]                 Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164368988] ←
   327700[164839431]                   Выражение ≡ Дата начала ∙ 65545[164826690] ←
 32505860[164834267]                 Значение параметра при вызове процедуры/функции ≡ Количество дней ∙ 65545[164368989] ←
   327700[164839432]                   Выражение ⁼ 21 ←
      413[164827824]           И ←
  1507376[164828813]           Выражение ←
  1507455[164829113]             Результат ∙ 12124204[164824308] ←
  1507494[164831969]               Уточняющий параметр ≡ Дата ∙ 269[5] ←
  1638475[164823393]             Меньше или равно ←
  1507452[164827500]             Константа ≡ Дата начала ∙ 65545[164826690] ←
      413[164827825]           И ←
  1507376[164828814]           Выражение ←
  1507455[164829114]             Результат ∙ 12124204[164824308] ←
  1507494[164831970]               Уточняющий параметр ≡ Счет дебет ∙ 269[6] ←
  1638473[164829183]             Равно ←
  1507452[164827501]             Константа ≡ Количество по партиям (товарный запас) ∙ 131[14417935] ←
      413[164827826]           И ←
  1507376[164828815]           Выражение ←
  1507455[164829115]             Результат ∙ 12124204[164824308] ←
  1507494[164831971]               Уточняющий параметр ≡ Аналитика по дебету (1) ∙ 269[7] ←
  1638473[164829184]             Равно ←
  1507452[164827502]             Константа ≡ Список ТТ и ЦО для поиска заказов ∙ 65545[164826681] ←
      413[164827827]           И ←
  1507376[164828816]           Выражение ←
  1507455[164829116]             Результат ∙ 12124204[164824308] ←
  1507494[164831972]               Уточняющий параметр ≡ Аналитика по дебету (2) ∙ 269[8] ←
  1638473[164829185]             Равно ←
  1507452[164827503]             Константа ≡ Продукт ∙ 65545[164826683] ←
      413[164827828]           И ←
  1507376[164828817]           Выражение ←
  1507455[164829117]             Результат ∙ 12124204[164824308] ←
  1507494[164831973]               Уточняющий параметр ≡ Валюта ∙ 269[18] ←
  1638473[164829186]             Равно ←
  1507452[164827504]             Константа ≡ Штука ∙ 131108[28049409] ←
      413[164827755]           И ←
  1507376[164828710]           Выражение ←
  1507455[164828996]             Результат ∙ 12124204[164824308] ←
  1507494[164831869]               Уточняющий параметр ≡ Документ ∙ 269[3] ←
  1638473[164829174]             Равно ←
  1507455[164828997]             Результат ∙ 12124204[164824307] ←
  1507494[164831870]               Уточняющий параметр ≡ Документ ∙ 331[1] ←
      413[164827772]           И ←
  1507376[164828707]           Выражение ←
  1507455[164828995]             Результат ∙ 12124204[164824307] ←
  1507494[164831792]               Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[164829136]             Равно ←
  1507488[164823650]             Константа (Ограничение по классу, типу, плану счетов) ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823095]               Список элементов ←
   327700[164839446]                 Выражение ≡ Приход товаров ∙ 332[14286901] ←
   327700[164839447]                 Выражение ≡ Приход от организации ∙ 332[6684753] ←
 12124222[164823571]         Order By   (Сортировка) ←
  1507464[164823681]           Сортировать по возрастанию ≡ Дата ∙ 1507335[164825127] ←
 12124205[164823184]       Запрос • Расход ←
  1507673[164823587]         Ключи оптимизации ←
  1507675[164823949]           Использовать индекс ∙ 12124204[164824310] ←
  1507676[164823952]             Уточняющий параметр ≡ ЦФО --> Счет.Кредит --> Ан2.Кредит --> Дата --> Валюта ∙ 1507445[1507415] ←
  1507675[164823944]           Использовать индекс ∙ 12124204[164824306] ←
  1507676[164823947]             Уточняющий параметр ≡ ID ∙ 1507445[1507432] ←
 12124213[164823835]         Параметры ←
  1507335[164825133]           Параметр • Строка ∙ 12124204[164824310] ←
  1507494[164831977]             Уточняющий параметр ≡ Строка документа ∙ 269[4] ←
  1507335[164825134]           Параметр • Кол-во ∙ 12124204[164824310] ←
  1507494[164831978]             Уточняющий параметр ≡ Сумма ∙ 269[19] ←
  1507335[164825135]           Параметр • Продукт ∙ 12124204[164824310] ←
  1507494[164831979]             Уточняющий параметр ≡ Аналитика по кредиту (2) ∙ 269[14] ←
  1507335[164825136]           Параметр • Партия ∙ 12124204[164824310] ←
  1507494[164831980]             Уточняющий параметр ≡ Аналитика по кредиту (3) ∙ 269[15] ←
  1507335[164825128]           Параметр • Дата ∙ 12124204[164824310] ←
  1507494[164831788]             Уточняющий параметр ≡ Дата ∙ 269[5] ←
 12124200[164823738]         From         (Таблицы) ←
 12124204[164824310]           Таблица ≡ Проводка ∙ 108[7] ←
 12124204[164824306]           Таблица ≡ Документ ∙ 108[5] ←
 12124215[164824220]         Where      (Ограничения на отбор данных) ←
  1507376[164828821]           Выражение ←
  1507455[164829121]             Результат ∙ 12124204[164824310] ←
  1507494[164831981]               Уточняющий параметр ≡ ЦФО ∙ 269[2] ←
  1638473[164829189]             Равно ←
  1507452[164827505]             Константа ≡ Центр финанс. ответственности для ТОВАРНЫХ ПЛАНОВ ∙ 117[45613057] ←
      413[164827831]           И ←
  1507376[164828822]           Выражение ←
  1507455[164829122]             Результат ∙ 12124204[164824310] ←
  1507494[164831982]               Уточняющий параметр ≡ Дата ∙ 269[5] ←
  1638477[164823686]             Больше или равно ←
  1507452[164827406]             Константа ≡ Дата минус количество дней ∙ 249[164364372] ←
 32505862[164828278]               Значения формальных параметров при вызове ←
 32505860[164834268]                 Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164368988] ←
   327700[164839433]                   Выражение ≡ Дата начала ∙ 65545[164826690] ←
 32505860[164834269]                 Значение параметра при вызове процедуры/функции ≡ Количество дней ∙ 65545[164368989] ←
   327700[164839434]                   Выражение ⁼ 21 ←
      413[164827832]           И ←
  1507376[164828823]           Выражение ←
  1507455[164829123]             Результат ∙ 12124204[164824310] ←
  1507494[164831983]               Уточняющий параметр ≡ Дата ∙ 269[5] ←
  1638475[164823399]             Меньше или равно ←
  1507452[164827507]             Константа ≡ Дата начала ∙ 65545[164826690] ←
      413[164827833]           И ←
  1507376[164828824]           Выражение ←
  1507455[164829124]             Результат ∙ 12124204[164824310] ←
  1507494[164831984]               Уточняющий параметр ≡ Счет кредит ∙ 269[12] ←
  1638473[164829190]             Равно ←
  1507452[164827508]             Константа ≡ Количество по партиям (товарный запас) ∙ 131[14417935] ←
      413[164827834]           И ←
  1507376[164828825]           Выражение ←
  1507455[164829125]             Результат ∙ 12124204[164824310] ←
  1507494[164831985]               Уточняющий параметр ≡ Аналитика по кредиту (1) ∙ 269[13] ←
  1638473[164829191]             Равно ←
  1507452[164827509]             Константа ≡ Список ТТ и ЦО для поиска заказов ∙ 65545[164826681] ←
      413[164827835]           И ←
  1507376[164828826]           Выражение ←
  1507455[164829126]             Результат ∙ 12124204[164824310] ←
  1507494[164831986]               Уточняющий параметр ≡ Аналитика по кредиту (2) ∙ 269[14] ←
  1638473[164829192]             Равно ←
  1507452[164827510]             Константа ≡ Продукт ∙ 65545[164826683] ←
      413[164827836]           И ←
  1507376[164828827]           Выражение ←
  1507455[164829127]             Результат ∙ 12124204[164824310] ←
  1507494[164831987]               Уточняющий параметр ≡ Валюта ∙ 269[18] ←
  1638473[164829193]             Равно ←
  1507452[164827511]             Константа ≡ Штука ∙ 131108[28049409] ←
      413[164827754]           И ←
  1507376[164828708]           Выражение ←
  1507455[164828992]             Результат ∙ 12124204[164824310] ←
  1507494[164831789]               Уточняющий параметр ≡ Документ ∙ 269[3] ←
  1638473[164829133]             Равно ←
  1507455[164828993]             Результат ∙ 12124204[164824306] ←
  1507494[164831790]               Уточняющий параметр ≡ Документ ∙ 331[1] ←
      413[164827753]           И ←
  1507376[164828709]           Выражение ←
  1507455[164828994]             Результат ∙ 12124204[164824306] ←
  1507494[164831791]               Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[164829134]             Равно ←
  1507488[164823649]             Константа (Ограничение по классу, типу, плану счетов) ≡ Продажа через кассовый аппарат ∙ 332[14286850] ←
 12124222[164823572]         Order By   (Сортировка) ←
  1507464[164823682]           Сортировать по возрастанию ≡ Дата ∙ 1507335[164825128] ←
 30867463[164824234]     Выполнить действия ←
 30867469[164823267]       БЛОК ≡ Инициализация ∙ 30867469[12058692] ←
 30867470[164827008]         IF ←
  1638463[164827932]           Условие ←
      116[164828067]             Выражение ←
      404[164863031]               Результат ≡ День недели 1..6 (Воскресенье = 7) ∙ 249[164298831] ←
 32505862[164828154]                 Значения формальных параметров при вызове ←
 32505860[164833989]                   Значение параметра при вызове процедуры/функции ≡ фп Дата ∙ 65545[164301597] ←
   327700[164839351]                     Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
  1638477[164823676]               Больше или равно ←
      404[164863032]               Результат ⁼ 2 ←
      413[164827744]             И ←
      116[164828068]             Выражение ←
      404[164863033]               Результат ≡ День недели 1..6 (Воскресенье = 7) ∙ 249[164298831] ←
 32505862[164828155]                 Значения формальных параметров при вызове ←
 32505860[164833990]                   Значение параметра при вызове процедуры/функции ≡ фп Дата ∙ 65545[164301597] ←
   327700[164839352]                     Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
  1638475[164823389]               Меньше или равно ←
      404[164863034]               Результат ⁼ 4 ←
 30867472[164826972]           THEN ←
 11010080[164834412]             = ≡ Дата начальная ∙ 65545[164823896] ←
      404[164863035]               Результат ≡ Сегодня, начало дня ∙ 249[2293761] ←
      380[164823434]               Сложить ←
      116[164828069]               Выражение ←
      404[164863036]                 Результат ≡ Сутки ∙ 117[16843851] ←
      403[164823979]                 Умножить ←
      116[164828070]                 Выражение ←
      404[164863037]                   Результат ⁼ 4 ←
      406[164823544]                   Вычесть ←
      404[164863038]                   Результат ≡ День недели 1..6 (Воскресенье = 7) ∙ 249[164298831] ←
 32505862[164828156]                     Значения формальных параметров при вызове ←
 32505860[164833991]                       Значение параметра при вызове процедуры/функции ≡ фп Дата ∙ 65545[164301597] ←
   327700[164839353]                         Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 30867473[164824559]           ELSE ←
 11010080[164834423]             = ≡ Дата начальная ∙ 65545[164823896] ←
      404[164863039]               Результат ≡ Сегодня, начало дня ∙ 249[2293761] ←
 11010080[164834425]         = ≡ Список типов ДМП для расшифровки ∙ 65545[164826714] ←
  1638402[164824775]           NULL ←
 30867470[164827009]         IF ←
  1638463[164827933]           Условие ←
  1638460[164824275]             НЕ ←
      404[164863040]             Результат ≡ Автоматически ∙ 65545[164823895] ←
 30867472[164826973]           THEN ←
 12124190[164823369]             Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823417]               Список полей формы ←
      598[164824943]                 Поле (колонка) для ввода данных ≡ Дата начальная ∙ 65545[164823896] ←
      598[164824946]                 Поле (колонка) для ввода данных ≡ Дата конечная ∙ 65545[164828195] ←
      598[164824944]                 Поле (колонка) для ввода данных ≡ Подразделения ∙ 65545[164823897] ←
  2621481[164823239]                   Доступно (видимо), если: ≡ Текущий узел является консолидированной базой ∙ 249[1507768] ←
 29163536[164823572]                   Отображаемый текст для объектов БД ≡ Наименование ∙ 283[5] ←
      209[164823870]                   Выбор из списка ≡ Торговые точки (Магазины) + РЦ + ПЦ ∙ 371[144310390] ←
   262165[164823375]                     Выбор нескольких объектов из списка ≡ Да ∙ 534[40566785] ←
 41746466[164823061]                     Ограничения по классам/типам ←
   262158[164823053]                       Ограничение на класс/тип объектов ≡ Торговая точка (Магазин) ∙ 284[40566786] ←
  1638486[164823081]                     Ограничение на отбор данных ←
 41746472[164823048]                       Where ≡ Не рассчитывать скорость продаж ∙ 283[43122692] ←
 41746478[164823048]                         Равно ≡ Да ∙ 131203075[131203074] ←
      598[164824945]                 Поле (колонка) для ввода данных ≡ Товар ∙ 65545[164823898] ←
      209[164823871]                   Выбор из списка ≡ Выбор справочник товаров (Магазин) ∙ 371[164823146] ←
   262164[164823165]                     Выбор одного объекта из списка ≡ Да ∙ 534[40566785] ←
 29163536[164823573]                   Отображаемый текст для объектов БД ≡ Наименование ∙ 305[6] ←
      598[164824947]                 Поле (колонка) для ввода данных ≡ Показывать движение ∙ 65545[164828198] ←
      355[164823605]                   Начальное значение ≡ Нет ∙ 131203075[131203073] ←
 30867469[164823273]       БЛОК ≡ Печать данных ∙ 30867469[12058690] ←
 11010105[164823415]         Индикатор ←
      404[164863041]           Результат ⁼ Поиск документов ←
 30867470[164827010]         IF ←
  1638463[164827934]           Условие ←
  1638460[164824276]             НЕ ←
      404[164863042]             Результат ≡ Автоматически ∙ 65545[164823895] ←
 30867472[164826974]           THEN ←
 11010080[164834426]             = ≡ Файл отчета ∙ 65545[164826814] ←
      404[164863043]               Результат ⁼ 'C:\\Domino8\\HOME\\dmp_' ←
      404[164863044]               Результат ≡ СЛУЧАЙНОЕ ЧИСЛО ∙ 387[1638412] ←
  1638458[164823109]                 Минимальное значение ⁼ 10 ←
  1638459[164823108]                 Максимальное значение ⁼ 50 ←
      404[164863045]               Результат ⁼ '.htm' ←
 11010088[164826701]             ВЫПОЛНИТЬ ≡ Отчет.Инициализация ∙ 249[12124171] ←
 39780367[164824443]               Файл ≡ Файл отчета ∙ 65545[164826814] ←
 12124199[164823105]               Ссылка на шаблон ≡ Револьвер ДМП ∙ 12124193[164823091] ←
 11010088[164826702]             ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824444]               Файл ≡ Файл отчета ∙ 65545[164826814] ←
 39780357[164823764]               Ссылка на блок шаблона ≡ Заголовок ∙ 12124197[164823428] ←
 30867470[164827011]             IF ←
  1638463[164827935]               Условие ←
      404[164863046]                 Результат ≡ Товар ∙ 65545[164823898] ←
 30867472[164826975]               THEN ←
 11010088[164826703]                 ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824445]                   Файл ≡ Файл отчета ∙ 65545[164826814] ←
 39780357[164823765]                   Ссылка на блок шаблона ≡ Шапка по SKU ∙ 12124197[164823431] ←
 30867473[164824560]               ELSE ←
 30867470[164827012]                 IF ←
  1638463[164827936]                   Условие ←
      404[164863047]                     Результат ≡ Подразделения ∙ 65545[164823897] ←
 30867472[164826976]                   THEN ←
 11010088[164826704]                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824446]                       Файл ≡ Файл отчета ∙ 65545[164826814] ←
 39780357[164823766]                       Ссылка на блок шаблона ≡ Шапка по 1 ТТ ∙ 12124197[164823429] ←
 30867473[164824561]                   ELSE ←
 11010088[164826705]                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824447]                       Файл ≡ Файл отчета ∙ 65545[164826814] ←
 39780357[164823767]                       Ссылка на блок шаблона ≡ Шапка по сети ∙ 12124197[164823430] ←
 11010080[164834427]         = ≡ Дата начальная (для заказов) ∙ 65545[164823901] ←
      404[164863048]           Результат ≡ Дата, начало дня ∙ 249[30867471] ←
 32505862[164828157]             Значения формальных параметров при вызове ←
 32505860[164833992]               Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867497] ←
   327700[164839354]                 Выражение ≡ Дата начальная ∙ 65545[164823896] ←
 30867470[164827013]         IF ←
  1638463[164827937]           Условие ←
      404[164863049]             Результат ≡ День недели 1..6 (Воскресенье = 7) ∙ 249[164298831] ←
 32505862[164828158]               Значения формальных параметров при вызове ←
 32505860[164833993]                 Значение параметра при вызове процедуры/функции ≡ фп Дата ∙ 65545[164301597] ←
   327700[164839355]                   Выражение ≡ Дата начальная ∙ 65545[164823896] ←
  1638476[164823298]             Меньше ←
      404[164863050]             Результат ⁼ 4 ←
 30867472[164826977]           THEN ←
 11010080[164834428]             = ≡ Дата конечная (для заказов) ∙ 65545[164823902] ←
      404[164863051]               Результат ≡ Дата, конец дня ∙ 249[30867475] ←
 32505862[164828159]                 Значения формальных параметров при вызове ←
 32505860[164833994]                   Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
   327700[164839356]                     Выражение ≡ Дата начальная ∙ 65545[164823896] ←
      380[164823435]               Сложить ←
      116[164828071]               Выражение ←
      116[164828072]                 Выражение ←
      116[164828073]                   Выражение ←
      404[164863052]                     Результат ⁼ 4 ←
      406[164823549]                     Вычесть ←
      404[164863053]                     Результат ≡ День недели 1..6 (Воскресенье = 7) ∙ 249[164298831] ←
 32505862[164828160]                       Значения формальных параметров при вызове ←
 32505860[164833995]                         Значение параметра при вызове процедуры/функции ≡ фп Дата ∙ 65545[164301597] ←
   327700[164839357]                           Выражение ≡ Дата начальная ∙ 65545[164823896] ←
      380[164823436]                   Сложить ←
      404[164863054]                   Результат ⁼ 5 ←
      403[164823980]                 Умножить ←
      404[164863055]                 Результат ≡ Сутки ∙ 117[16843851] ←
 30867473[164824562]           ELSE ←
 11010080[164834637]             = ≡ Дата конечная (для заказов) ∙ 65545[164823902] ←
      404[164863056]               Результат ≡ Дата, конец дня ∙ 249[30867475] ←
 32505862[164828161]                 Значения формальных параметров при вызове ←
 32505860[164833996]                   Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
   327700[164839358]                     Выражение ≡ Дата начальная ∙ 65545[164823896] ←
      380[164823437]               Сложить ←
      116[164828074]               Выражение ←
      116[164828075]                 Выражение ←
      116[164828076]                   Выражение ←
      404[164863057]                     Результат ≡ День недели 1..6 (Воскресенье = 7) ∙ 249[164298831] ←
 32505862[164828162]                       Значения формальных параметров при вызове ←
 32505860[164833997]                         Значение параметра при вызове процедуры/функции ≡ фп Дата ∙ 65545[164301597] ←
   327700[164839359]                           Выражение ≡ Дата начальная ∙ 65545[164823896] ←
      406[164823550]                     Вычесть ←
      404[164863058]                     Результат ⁼ 4 ←
      380[164823438]                   Сложить ←
      404[164863059]                   Результат ⁼ 5 ←
      403[164823981]                 Умножить ←
      404[164863060]                 Результат ≡ Сутки ∙ 117[16843851] ←
  1507360[164824738]         Отбор данных (по запросу) • Отбор ←
 12124200[164823726]           From         (Таблицы) ←
 12124205[164823087]             Запрос • Максимальный номер ДМП на подразделении ←
 12124200[164823727]               From         (Таблицы) ←
 12124205[164823088]                 Запрос ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
 32505862[164828163]                   Значения формальных параметров при вызове ←
 32505860[164834255]                     Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547258] ←
   327700[164839360]                       Выражение ≡ Перечень ДМП ∙ 332[164364303] ←
 32505860[164834256]                     Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа начальная ∙ 65545[18547260] ←
   327700[164839421]                       Выражение ≡ DMY2Date (День, Месяц, Год) {через параметры} ∙ 249[33161309] ←
 32505862[164828164]                         Значения формальных параметров при вызове ←
 32505860[164834257]                           Значение параметра при вызове процедуры/функции ≡ День ∙ 65545[33162512] ←
   327700[164839422]                             Выражение ⁼ 1 ←
 32505860[164834258]                           Значение параметра при вызове процедуры/функции ≡ Месяц ∙ 65545[33162513] ←
   327700[164839423]                             Выражение ⁼ 6 ←
 32505860[164834259]                           Значение параметра при вызове процедуры/функции ≡ Год ∙ 65545[33162514] ←
   327700[164839424]                             Выражение ⁼ 2017 ←
 32505860[164834260]                     Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа конечная ∙ 65545[18547261] ←
   327700[164839425]                       Выражение ≡ Дата начальная ∙ 65545[164823896] ←
 12124224[164823224]                   Group By  (Группировка) ←
  1507533[164823469]                     Группировать по параметру ≡ Подразделение ∙ 1507335[164825030] ←
  1507447[164823370]                   Выражения ←
  1507449[164823199]                     Выражение • Максимальная дата ≡ Дата ∙ 107[3] ←
  1507455[164828859]                       Результат ≡ MAX ∙ 1507471[1507332] ←
  1507476[164823573]                         Значения параметров ←
  1507477[164823605]                           Параметр ≡ Выражение ∙ 1507473[1507332] ←
  1507478[164823605]                             Выражение ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164831581]                               Уточняющий параметр ≡ Дата ∙ 331[8] ←
 12124213[164823822]                   Параметры ←
  1507335[164825030]                     Параметр • Подразделение ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164831772]                       Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1507335[164825031]                     Параметр • Максимальная дата ≡ Максимальная дата ∙ 1507449[164823199] ←
 12124204[164824292]                 Таблица ≡ Документ ∙ 108[5] ←
 12124204[164824293]                 Таблица ≡ Строка (объект БД) ∙ 108[6] ←
  1507673[164823580]               Ключи оптимизации ←
  1507675[164823936]                 Использовать индекс ∙ 12124204[164824292] ←
  1507676[164823939]                   Уточняющий параметр ≡ Класс --> Тип --> Дата --> ID ∙ 1507445[1507398] ←
  1507675[164823937]                 Использовать индекс ∙ 12124204[164824293] ←
  1507676[164823940]                   Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
 12124215[164824181]               Where      (Ограничения на отбор данных) ←
  1507376[164828460]                 Выражение ←
  1507455[164828980]                   Результат ∙ 12124205[164823088] ←
  1507494[164831773]                     Уточняющий параметр ≡ Подразделение ∙ 1507335[164825030] ←
  1638473[164829116]                   Равно ←
  1507455[164828981]                   Результат ∙ 12124204[164824292] ←
  1507494[164831774]                     Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      413[164827745]                 И ←
  1507376[164828698]                 Выражение ←
  1507455[164828982]                   Результат ∙ 12124205[164823088] ←
  1507494[164831775]                     Уточняющий параметр ≡ Максимальная дата ∙ 1507335[164825031] ←
  1638473[164829117]                   Равно ←
  1507455[164828983]                   Результат ∙ 12124204[164824292] ←
  1507494[164831776]                     Уточняющий параметр ≡ Дата ∙ 331[8] ←
      413[164827747]                 И ←
  1507376[164828699]                 Выражение ←
  1507455[164828984]                   Результат ∙ 12124204[164824292] ←
  1507494[164831777]                     Уточняющий параметр ≡ Класс ∙ 331[3] ←
  1638473[164829118]                   Равно ←
  1507488[164823476]                   Константа (Ограничение по классу, типу, плану счетов) ≡ АДМИНИСТРАТИВНЫЙ ДОКУМЕНТ ∙ 541[15859713] ←
      413[164827748]                 И ←
  1507376[164828700]                 Выражение ←
  1507455[164828985]                   Результат ∙ 12124204[164824292] ←
  1507494[164831778]                     Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[164829119]                   Равно ←
  1507488[164823636]                   Константа (Ограничение по классу, типу, плану счетов) ≡ Перечень ДМП ∙ 332[164364303] ←
      413[164827749]                 И ←
  1507376[164828701]                 Выражение ←
  1507455[164828986]                   Результат ∙ 12124204[164824292] ←
  1507494[164831779]                     Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638473[164829120]                   Равно ←
  1507455[164828987]                   Результат ∙ 12124204[164824293] ←
  1507494[164831780]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
      413[164827750]                 И ←
  1507376[164828702]                 Выражение ←
  1507455[164828988]                   Результат ∙ 12124204[164824293] ←
  1507494[164831781]                     Уточняющий параметр ≡ Тип ∙ 359[4] ←
  1638473[164829121]                   Равно ←
  1507488[164823637]                   Константа (Ограничение по классу, типу, плану счетов) ≡ Строка перечня ДМП ∙ 360[164364305] ←
  1507447[164823371]               Выражения ←
  1507449[164824356]                 Выражение • Максимальный номер ДМП ≡ Число ∙ 107[4] ←
  1507455[164828989]                   Результат ≡ MAX ∙ 1507471[1507332] ←
  1507476[164823574]                     Значения параметров ←
  1507477[164823606]                       Параметр ≡ Выражение ∙ 1507473[1507332] ←
  1507478[164823606]                         Выражение ∙ 12124204[164824293] ←
  1507494[164831782]                           Уточняющий параметр ≡ Скидка ∙ 359[14286851] ←
 12124224[164823225]               Group By  (Группировка) ←
  1507533[164823471]                 Группировать по параметру ≡ Магазин ∙ 1507335[164825072] ←
  1507533[164823488]                 Группировать по параметру ≡ Тип ДМП ∙ 1507335[164825073] ←
 12124213[164823823]               Параметры ←
  1507335[164825072]                 Параметр • Магазин ∙ 12124204[164824292] ←
  1507494[164831783]                   Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1507335[164825073]                 Параметр • Тип ДМП ∙ 12124204[164824293] ←
  1507494[164831784]                   Уточняющий параметр ≡ Виды затрат при списании ∙ 359[28835862] ←
  1507335[164825074]                 Параметр • Максимальный номер ДМП ≡ Максимальный номер ДМП ∙ 1507449[164824356] ←
 12124205[164823089]             Запрос • СтрокиДокументаСЦО ←
 12124200[164823728]               From         (Таблицы) ←
 12124205[164823090]                 Запрос • Запрос перечня товаров в акцию ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
 32505862[164828165]                   Значения формальных параметров при вызове ←
 32505860[164834261]                     Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547258] ←
   327700[164839426]                       Выражение ≡ Перечень товаров для акции ∙ 332[3342383] ←
 32505860[164834262]                     Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа начальная ∙ 65545[18547260] ←
   327700[164839427]                       Выражение ≡ Дата минус количество дней ∙ 249[164364372] ←
 32505862[164828166]                         Значения формальных параметров при вызове ←
 32505860[164834263]                           Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164368988] ←
   327700[164839428]                             Выражение ≡ Дата начальная ∙ 65545[164823896] ←
 32505860[164834264]                           Значение параметра при вызове процедуры/функции ≡ Количество дней ∙ 65545[164368989] ←
   327700[164839429]                             Выражение ⁼ 30 ←
 32505860[164834265]                     Значение параметра при вызове процедуры/функции ≡ Фильтр.Подразделения ∙ 65545[18547259] ←
   327700[164839430]                       Выражение ≡ Подразделения ∙ 65545[164823897] ←
 12124215[164824200]                   Where      (Ограничения на отбор данных) ←
  1507381[164823565]                     <Наследуемые ограничения> ←
      413[164827751]                     И ←
  1507376[164828703]                     Выражение ←
  1507376[164828704]                       Выражение ←
  1507376[164828705]                         Выражение ←
  1507455[164828990]                           Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164831785]                             Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[164823390]                           Меньше или равно ←
  1507452[164826989]                           Константа ≡ Дата конечная ∙ 65545[164828195] ←
      413[164827752]                         И ←
  1507376[164828706]                         Выражение ←
  1507455[164828991]                           Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164831786]                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638477[164823677]                           Больше или равно ←
  1507452[164827405]                           Константа ≡ Дата начальная ∙ 65545[164823896] ←
      413[164827756]                     И ←
  1507376[164828716]                     Выражение ←
  1507455[164828998]                       Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164831793]                         Уточняющий параметр ≡ Условия оплаты ∙ 331[14352404] ←
  1638473[164829122]                       Равно ←
  1507452[164827412]                       Константа ≡ Дополнительные места продаж ∙ 655294473[655294478] ←
 12124204[164824294]                 Таблица • Документ перечень товаров для акции ≡ Документ ∙ 108[5] ←
 12124204[164824295]                 Таблица • Строка перечня товаров для акции ≡ Строка (объект БД) ∙ 108[6] ←
 12124204[164824296]                 Таблица ≡ Продукт ∙ 108[3] ←
 12124204[164824297]                 Таблица • Подгруппа ≡ Каталог ∙ 108[2] ←
 12124204[164824298]                 Таблица • Группа ≡ Каталог ∙ 108[2] ←
 12124204[164824299]                 Таблица • ТТ ≡ Партнер ∙ 108[4] ←
  1507673[164823581]               Ключи оптимизации ←
  1507675[164823938]                 Использовать индекс ≡ Документ перечень товаров для акции ∙ 12124204[164824294] ←
  1507676[164823941]                   Уточняющий параметр ≡ ID ∙ 1507445[1507432] ←
  1507675[164823939]                 Использовать индекс ≡ Строка перечня товаров для акции ∙ 12124204[164824295] ←
  1507676[164823942]                   Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
  1507675[164823940]                 Использовать индекс ≡ ТТ ∙ 12124204[164824299] ←
  1507676[164823943]                   Уточняющий параметр ≡ ID ∙ 1507445[1507430] ←
  1507675[164823941]                 Использовать индекс ∙ 12124204[164824296] ←
  1507676[164823944]                   Уточняющий параметр ≡ ID ∙ 1507445[1507431] ←
  1507675[164823942]                 Использовать индекс ≡ Подгруппа ∙ 12124204[164824297] ←
  1507676[164823945]                   Уточняющий параметр ≡ ID ∙ 1507445[1507429] ←
  1507675[164823943]                 Использовать индекс ≡ Группа ∙ 12124204[164824298] ←
  1507676[164823946]                   Уточняющий параметр ≡ ID ∙ 1507445[1507429] ←
 12124215[164824201]               Where      (Ограничения на отбор данных) ←
  1507376[164828717]                 Выражение ←
  1507455[164828999]                   Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824294] ←
  1507494[164831794]                     Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638473[164829123]                   Равно ←
  1507455[164829000]                   Результат ≡ Запрос перечня товаров в акцию ∙ 12124205[164823090] ←
  1507494[164831795]                     Уточняющий параметр ≡ з.Документ ∙ 1507335[18547059] ←
      413[164827757]                 И ←
  1507376[164828718]                 Выражение ←
  1507455[164829001]                   Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824295] ←
  1507494[164831796]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638473[164829124]                   Равно ←
  1507455[164829002]                   Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824294] ←
  1507494[164831797]                     Уточняющий параметр ≡ Документ ∙ 331[1] ←
      413[164827758]                 И ←
  1507376[164828719]                 Выражение ←
  1507455[164829003]                   Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824295] ←
  1507494[164831798]                     Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[164829125]                   Равно ←
  1507455[164829004]                   Результат ∙ 12124204[164824296] ←
  1507494[164831799]                     Уточняющий параметр ≡ Продукт ∙ 305[1] ←
      413[164827759]                 И ←
  1507376[164828720]                 Выражение ←
  1507455[164829005]                   Результат ∙ 12124204[164824296] ←
  1507494[164831800]                     Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
  1638473[164829126]                   Равно ←
  1507455[164829006]                   Результат ≡ Подгруппа ∙ 12124204[164824297] ←
  1507494[164831801]                     Уточняющий параметр ≡ Каталог ∙ 296[1] ←
      413[164827760]                 И ←
  1507376[164828721]                 Выражение ←
  1507455[164829007]                   Результат ≡ Подгруппа ∙ 12124204[164824297] ←
  1507494[164831802]                     Уточняющий параметр ≡ Родитель ∙ 296[2] ←
  1638473[164829127]                   Равно ←
  1507455[164829008]                   Результат ≡ Группа ∙ 12124204[164824298] ←
  1507494[164831803]                     Уточняющий параметр ≡ Каталог ∙ 296[1] ←
      413[164827761]                 И ←
  1507376[164828722]                 Выражение ←
  1507455[164829009]                   Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824294] ←
  1507494[164831804]                     Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1638473[164829128]                   Равно ←
  1507455[164829010]                   Результат ≡ ТТ ∙ 12124204[164824299] ←
  1507494[164831805]                     Уточняющий параметр ≡ Партнер ∙ 283[1] ←
      413[164827762]                 И ←
  1507506[164825243]                   Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164825516]                     Если истинно выражение ≡ Товар ∙ 65545[164823898] ←
  1507376[164828723]                 Выражение ←
  1507506[164825244]                   Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164825517]                     Если истинно выражение ≡ Товар ∙ 65545[164823898] ←
  1507455[164829011]                   Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824295] ←
  1507494[164831806]                     Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[164829129]                   Равно ←
  1507452[164827413]                   Константа ≡ Товар ∙ 65545[164823898] ←
      413[164827763]                 И ←
  1507376[164828724]                 Выражение ←
  1507455[164829012]                   Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824295] ←
  1507494[164831807]                     Уточняющий параметр ≡ Тип ∙ 359[4] ←
  1638473[164829130]                   Равно ←
  1507488[164823638]                   Константа (Ограничение по классу, типу, плану счетов) ≡ Строка перечня товаров для акции ∙ 360[3342408] ←
      413[164827764]                 И ←
  1507376[164828725]                 Выражение ←
  1507455[164829013]                   Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824295] ←
  1507494[164831808]                     Уточняющий параметр ≡ Страна производства ∙ 359[14286854] ←
  1638479[164823927]                   Не равно ←
  1638402[164824776]                   NULL ←
      413[164827765]                 И ←
  1507376[164828726]                 Выражение ←
  1507455[164829014]                   Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824295] ←
  1507494[164831809]                     Уточняющий параметр ≡ Количество палет [док] ∙ 359[2818049] ←
  1638479[164823928]                   Не равно ←
  1638402[164824777]                   NULL ←
  1507447[164823372]               Выражения ←
  1507449[164824357]                 Выражение • Тип ДМП для сортировки ≡ Объект ∙ 107[19] ←
  1507589[164823066]                   CASE ←
  1507591[164823268]                     Условие ←
  1507455[164829015]                       Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824295] ←
  1507494[164831810]                         Уточняющий параметр ≡ Страна производства ∙ 359[14286854] ←
  1507592[164823101]                     OF ≡ Торец (алкоголь) ∙ 164823049[164823048] ←
  1507452[164827414]                       Константа ≡ Акция (Алкоголь) ∙ 164823049[164823043] ←
  1507592[164823102]                     OF ≡ Торец (фуд) ∙ 164823049[164823049] ←
  1507452[164827415]                       Константа ≡ Акция (Фуд) ∙ 164823049[164823044] ←
  1507592[164823221]                     OF ≡ Торец (десерты) ∙ 164823049[164823054] ←
  1507452[164829844]                       Константа ≡ Акция (Десерты) ∙ 164823049[164823053] ←
  1507592[164823103]                     OF ≡ Торец (нон-фуд) ∙ 164823049[164823050] ←
  1507452[164827416]                       Константа ≡ Акция (Нон-фуд) ∙ 164823049[164823045] ←
  1507592[164823104]                     OF ≡ Наружка (Нон-фуд) ∙ 164823049[164823041] ←
  1507631[164823107]                       IF ←
  1507591[164823269]                         Условие ←
  1507376[164828727]                           Выражение ←
  1507455[164829016]                             Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824294] ←
  1507494[164831811]                               Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[164823394]                             Меньше или равно ←
  1507452[164827417]                             Константа ≡ Дата начальная ∙ 65545[164823896] ←
      413[164827766]                           И ←
  1507376[164828728]                           Выражение ←
  1507455[164829017]                             Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824294] ←
  1507494[164831812]                               Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638477[164823681]                             Больше или равно ←
  1507452[164827418]                             Константа ≡ Дата начальная ∙ 65545[164823896] ←
  1507633[164823107]                         THEN ←
  1507455[164829018]                           Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824295] ←
  1507494[164831813]                             Уточняющий параметр ≡ Страна производства ∙ 359[14286854] ←
  1507593[164823186]                         ELSE ←
  1507631[164823108]                           IF ←
  1507591[164823270]                             Условие ←
  1507376[164828729]                               Выражение ←
  1507455[164829019]                                 Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824294] ←
  1507494[164831814]                                   Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638478[164823490]                                 Больше ←
  1507452[164827419]                                 Константа ≡ Дата начальная ∙ 65545[164823896] ←
  1507633[164823108]                             THEN ←
  1507455[164829020]                               Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824295] ←
  1507494[164831815]                                 Уточняющий параметр ≡ Страна производства ∙ 359[14286854] ←
  1507593[164823187]                             ELSE ←
  1507455[164829021]                               Результат ≡ Группа ∙ 12124204[164824298] ←
  1507494[164831816]                                 Уточняющий параметр ≡ Тип стандарта ∙ 296[3342337] ←
  1507592[164823105]                     OF ≡ Наружка (Фуд) ∙ 164823049[164823042] ←
  1507631[164823109]                       IF ←
  1507591[164823271]                         Условие ←
  1507376[164828730]                           Выражение ←
  1507455[164829022]                             Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824294] ←
  1507494[164831817]                               Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[164823395]                             Меньше или равно ←
  1507452[164827420]                             Константа ≡ Дата начальная ∙ 65545[164823896] ←
      413[164827767]                           И ←
  1507376[164828731]                           Выражение ←
  1507455[164829023]                             Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824294] ←
  1507494[164831818]                               Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638477[164823682]                             Больше или равно ←
  1507452[164827421]                             Константа ≡ Дата начальная ∙ 65545[164823896] ←
  1507633[164823109]                         THEN ←
  1507455[164829024]                           Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824295] ←
  1507494[164831819]                             Уточняющий параметр ≡ Страна производства ∙ 359[14286854] ←
  1507593[164823188]                         ELSE ←
  1507631[164823110]                           IF ←
  1507591[164823272]                             Условие ←
  1507376[164828732]                               Выражение ←
  1507455[164829025]                                 Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824294] ←
  1507494[164831820]                                   Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638478[164823491]                                 Больше ←
  1507452[164827422]                                 Константа ≡ Дата начальная ∙ 65545[164823896] ←
  1507633[164823110]                             THEN ←
  1507455[164829026]                               Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824295] ←
  1507494[164831821]                                 Уточняющий параметр ≡ Страна производства ∙ 359[14286854] ←
  1507593[164823189]                             ELSE ←
  1507455[164829027]                               Результат ≡ Группа ∙ 12124204[164824298] ←
  1507494[164831822]                                 Уточняющий параметр ≡ Тип стандарта ∙ 296[3342337] ←
  1507593[164823190]                     ELSE ←
  1507455[164829028]                       Результат ≡ Строка перечня товаров для акции ∙ 12124204[164824295] ←
  1507494[164831823]                         Уточняющий параметр ≡ Страна производства ∙ 359[14286854] ←
  1507449[164824358]                 Выражение • Третий патрон для сотрировки ≡ Число ∙ 107[4] ←
  1507631[164823144]                   IF ←
  1507591[164823273]                     Условие ←
  1507376[164828733]                       Выражение ←
  1507455[164829029]                         Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824294] ←
  1507494[164831824]                           Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[164823396]                         Меньше или равно ←
  1507452[164827423]                         Константа ≡ Дата начальная ∙ 65545[164823896] ←
      413[164827768]                       И ←
  1507376[164828734]                       Выражение ←
  1507455[164829030]                         Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824294] ←
  1507494[164831825]                           Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638477[164823683]                         Больше или равно ←
  1507452[164827424]                         Константа ≡ Дата начальная ∙ 65545[164823896] ←
  1507633[164823144]                     THEN ←
  1507452[164827425]                       Константа ⁼ 1 ←
  1507593[164823191]                     ELSE ←
  1507631[164823182]                       IF ←
  1507591[164823274]                         Условие ←
  1507376[164828735]                           Выражение ←
  1507455[164829031]                             Результат ≡ Документ перечень товаров для акции ∙ 12124204[164824294] ←
  1507494[164831826]                               Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638478[164823493]                             Больше ←
  1507452[164827426]                             Константа ≡ Дата начальная ∙ 65545[164823896] ←
  1507633[164823182]                         THEN ←
  1507452[164827427]                           Константа ⁼ 2 ←
  1507593[164823192]                         ELSE ←
  1507452[164827428]                           Константа ⁼ 3 ←
 12124213[164823824]               Параметры ←
  1507335[164825075]                 Параметр • Документ ≡ Документ перечень товаров для акции ∙ 12124204[164824294] ←
  1507494[164831827]                   Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1507335[164825076]                 Параметр • Документ. Дата начальная ≡ Документ перечень товаров для акции ∙ 12124204[164824294] ←
  1507494[164831828]                   Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1507335[164825077]                 Параметр • Документ. Дата конечная ≡ Документ перечень товаров для акции ∙ 12124204[164824294] ←
  1507494[164831829]                   Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1507335[164825078]                 Параметр • ТТ ≡ Документ перечень товаров для акции ∙ 12124204[164824294] ←
  1507494[164831830]                   Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1507335[164825079]                 Параметр • ТТ наименование ≡ ТТ ∙ 12124204[164824299] ←
  1507494[164831831]                   Уточняющий параметр ≡ Наименование ∙ 283[5] ←
  1507335[164825080]                 Параметр • ЦО ≡ ТТ ∙ 12124204[164824299] ←
  1507494[164831832]                   Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
  1507335[164825081]                 Параметр • Строка документа ≡ Строка перечня товаров для акции ∙ 12124204[164824295] ←
  1507494[164831833]                   Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507335[164825082]                 Параметр • Продукт ∙ 12124204[164824296] ←
  1507494[164831834]                   Уточняющий параметр ≡ Продукт ∙ 305[1] ←
  1507335[164825083]                 Параметр • Продукт наименование ∙ 12124204[164824296] ←
  1507494[164831835]                   Уточняющий параметр ≡ Наименование ∙ 305[6] ←
  1507335[164825084]                 Параметр • Тип ДМП оригинал ≡ Строка перечня товаров для акции ∙ 12124204[164824295] ←
  1507494[164831836]                   Уточняющий параметр ≡ Страна производства ∙ 359[14286854] ←
  1507335[164825085]                 Параметр • Тип ДМП рассчитанный ≡ Тип ДМП для сортировки ∙ 1507449[164824357] ←
  1507335[164825086]                 Параметр • Номер ДМП оригинал ≡ Строка перечня товаров для акции ∙ 12124204[164824295] ←
  1507494[164831837]                   Уточняющий параметр ≡ Количество палет [док] ∙ 359[2818049] ←
  1507335[164825087]                 Параметр • Третий револьвер ≡ Третий патрон для сотрировки ∙ 1507449[164824358] ←
 12124215[164824202]           Where      (Ограничения на отбор данных) ←
  1507376[164828736]             Выражение ←
  1507455[164829032]               Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831838]                 Уточняющий параметр ≡ ЦО ∙ 1507335[164825080] ←
  1638473[164829131]               Равно ←
  1507455[164829033]               Результат ≡ Максимальный номер ДМП на подразделении ∙ 12124205[164823087] ←
  1507494[164831839]                 Уточняющий параметр ≡ Магазин ∙ 1507335[164825072] ←
      413[164827769]             И ←
  1507376[164828737]             Выражение ←
  1507455[164829034]               Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831840]                 Уточняющий параметр ≡ Тип ДМП рассчитанный ∙ 1507335[164825085] ←
  1638473[164829132]               Равно ←
  1507455[164829035]               Результат ≡ Максимальный номер ДМП на подразделении ∙ 12124205[164823087] ←
  1507494[164831841]                 Уточняющий параметр ≡ Тип ДМП ∙ 1507335[164825073] ←
  1507447[164823373]           Выражения ←
  1507449[164824359]             Выражение • Номер ДМП ≡ Число ∙ 107[4] ←
  1507589[164823067]               CASE ←
  1507591[164823300]                 Условие ←
  1507455[164829036]                   Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831842]                     Уточняющий параметр ≡ Тип ДМП оригинал ∙ 1507335[164825084] ←
  1507592[164823112]                 OF ≡ Наружка (Нон-фуд) ∙ 164823049[164823041] ←
  1507631[164823183]                   IF ←
  1507591[164823302]                     Условие ←
  1507376[164828738]                       Выражение ←
  1507455[164829037]                         Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831843]                           Уточняющий параметр ≡ Документ. Дата начальная ∙ 1507335[164825076] ←
  1638475[164823397]                         Меньше или равно ←
  1507452[164827429]                         Константа ≡ Дата начальная ∙ 65545[164823896] ←
      413[164827770]                       И ←
  1507376[164828739]                       Выражение ←
  1507455[164829038]                         Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831844]                           Уточняющий параметр ≡ Документ. Дата конечная ∙ 1507335[164825077] ←
  1638477[164823684]                         Больше или равно ←
  1507452[164827430]                         Константа ≡ Дата начальная ∙ 65545[164823896] ←
  1507633[164823183]                     THEN ←
  1507455[164829039]                       Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831845]                         Уточняющий параметр ≡ Номер ДМП оригинал ∙ 1507335[164825086] ←
  1507593[164823262]                     ELSE ←
  1507631[164823184]                       IF ←
  1507591[164823303]                         Условие ←
  1507376[164828740]                           Выражение ←
  1507455[164829040]                             Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831846]                               Уточняющий параметр ≡ Документ. Дата начальная ∙ 1507335[164825076] ←
  1638478[164823494]                             Больше ←
  1507452[164827431]                             Константа ≡ Дата начальная ∙ 65545[164823896] ←
  1507633[164823184]                         THEN ←
  1507455[164829041]                           Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831847]                             Уточняющий параметр ≡ Номер ДМП оригинал ∙ 1507335[164825086] ←
  1507593[164823263]                         ELSE ←
  1507455[164829042]                           Результат ≡ Максимальный номер ДМП на подразделении ∙ 12124205[164823087] ←
  1507494[164831848]                             Уточняющий параметр ≡ Максимальный номер ДМП ∙ 1507335[164825074] ←
  1507592[164823113]                 OF ≡ Наружка (Фуд) ∙ 164823049[164823042] ←
  1507631[164823185]                   IF ←
  1507591[164823304]                     Условие ←
  1507376[164828741]                       Выражение ←
  1507455[164829043]                         Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831849]                           Уточняющий параметр ≡ Документ. Дата начальная ∙ 1507335[164825076] ←
  1638475[164823398]                         Меньше или равно ←
  1507452[164827432]                         Константа ≡ Дата начальная ∙ 65545[164823896] ←
      413[164827771]                       И ←
  1507376[164828742]                       Выражение ←
  1507455[164829044]                         Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831850]                           Уточняющий параметр ≡ Документ. Дата конечная ∙ 1507335[164825077] ←
  1638477[164823685]                         Больше или равно ←
  1507452[164827433]                         Константа ≡ Дата начальная ∙ 65545[164823896] ←
  1507633[164823185]                     THEN ←
  1507455[164829045]                       Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831851]                         Уточняющий параметр ≡ Номер ДМП оригинал ∙ 1507335[164825086] ←
  1507593[164823264]                     ELSE ←
  1507631[164823186]                       IF ←
  1507591[164823305]                         Условие ←
  1507376[164828743]                           Выражение ←
  1507455[164829046]                             Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831852]                               Уточняющий параметр ≡ Документ. Дата начальная ∙ 1507335[164825076] ←
  1638478[164823495]                             Больше ←
  1507452[164827434]                             Константа ≡ Дата начальная ∙ 65545[164823896] ←
  1507633[164823186]                         THEN ←
  1507455[164829047]                           Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831853]                             Уточняющий параметр ≡ Номер ДМП оригинал ∙ 1507335[164825086] ←
  1507593[164823267]                         ELSE ←
  1507455[164829048]                           Результат ≡ Максимальный номер ДМП на подразделении ∙ 12124205[164823087] ←
  1507494[164831854]                             Уточняющий параметр ≡ Максимальный номер ДМП ∙ 1507335[164825074] ←
  1507593[164823268]                 ELSE ←
  1507455[164829049]                   Результат ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831855]                     Уточняющий параметр ≡ Номер ДМП оригинал ∙ 1507335[164825086] ←
 12124213[164823825]           Параметры ←
  1507335[164825088]             Параметр • Документ ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831856]               Уточняющий параметр ≡ Документ ∙ 1507335[164825075] ←
  1507335[164825089]             Параметр • Документ. Дата начальная ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831857]               Уточняющий параметр ≡ Документ. Дата начальная ∙ 1507335[164825076] ←
  1507335[164825090]             Параметр • Документ. Дата конечная ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831858]               Уточняющий параметр ≡ Документ. Дата конечная ∙ 1507335[164825077] ←
  1507335[164825091]             Параметр • ТТ ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831859]               Уточняющий параметр ≡ ТТ ∙ 1507335[164825078] ←
  1507335[164825092]             Параметр • ТТ наименование ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831860]               Уточняющий параметр ≡ ТТ наименование ∙ 1507335[164825079] ←
  1507335[164825093]             Параметр • ЦО ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831861]               Уточняющий параметр ≡ ЦО ∙ 1507335[164825080] ←
  1507335[164825094]             Параметр • Строка документа ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831862]               Уточняющий параметр ≡ Строка документа ∙ 1507335[164825081] ←
  1507335[164825095]             Параметр • Продукт ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831863]               Уточняющий параметр ≡ Продукт ∙ 1507335[164825082] ←
  1507335[164825096]             Параметр • Продукт Наименование ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831864]               Уточняющий параметр ≡ Продукт наименование ∙ 1507335[164825083] ←
  1507335[164825097]             Параметр • Тип ДМП оригинал ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831865]               Уточняющий параметр ≡ Тип ДМП оригинал ∙ 1507335[164825084] ←
  1507335[164825098]             Параметр • Тип ДМП рассчитанный ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831866]               Уточняющий параметр ≡ Тип ДМП рассчитанный ∙ 1507335[164825085] ←
  1507335[164825099]             Параметр • Номер ДМП оригинал ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831867]               Уточняющий параметр ≡ Номер ДМП оригинал ∙ 1507335[164825086] ←
  1507335[164825100]             Параметр • Номер ДМП рассчитаный ≡ Номер ДМП ∙ 1507449[164824359] ←
  1507335[164825101]             Параметр • Третий револьвер ≡ СтрокиДокументаСЦО ∙ 12124205[164823089] ←
  1507494[164831868]               Уточняющий параметр ≡ Третий револьвер ∙ 1507335[164825087] ←
 12124222[164823543]           Order By   (Сортировка) ←
  1507465[164823204]             Блок (Сортировка с генерацией события) • ТТ ←
  1507559[164823208]               Сортировать по возрастанию ≡ ТТ наименование ∙ 1507335[164825092] ←
  1507464[164823647]             Сортировать по возрастанию ≡ Тип ДМП рассчитанный ∙ 1507335[164825098] ←
  1507464[164823648]             Сортировать по возрастанию ≡ Третий револьвер ∙ 1507335[164825101] ←
  1507464[164823676]             Сортировать по возрастанию ≡ Продукт Наименование ∙ 1507335[164825096] ←
  1507467[164823199]           Выполнить перед обработкой блока ≡ ТТ ∙ 1507465[164823204] ←
 11010080[164834639]             = ≡ ЦО ∙ 65545[164823905] ←
      404[164863061]               Результат ≡ ЦО ∙ 1507335[164825093] ←
 11010080[164834640]             = ≡ Список ТТ и ЦО для поиска заказов ∙ 65545[164826681] ←
      404[164863062]               Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823094]                 Список элементов ←
   327700[164839443]                   Выражение ≡ ЦО ∙ 65545[164823905] ←
   327700[164839444]                   Выражение ≡ Первый ТЗ/ПЦ для ЦО/ТТ/Узла (действ. магазины) ∙ 249[655294491] ←
 32505862[164828283]                     Значения формальных параметров при вызове ←
 32505860[164834278]                       Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[655298326] ←
   327700[164839445]                         Выражение ≡ ЦО ∙ 65545[164823905] ←
 11010080[164834641]             = ≡ Список заказов/приходов ∙ 65545[164826689] ←
  1638402[164824778]               NULL ←
 11010105[164823417]             Индикатор ←
      404[164863063]               Результат ⁼ 'Ищем приход ' ←
      404[164863064]               Результат ≡ ТТ наименование ∙ 1507335[164825092] ←
      404[164863065]               Результат ≡ CR+LF ∙ 117[1508547] ←
 30867470[164827014]             IF ←
  1638463[164827938]               Условие ←
      404[164863066]                 Результат ≡ Автоматически ∙ 65545[164823895] ←
 30867472[164826978]               THEN ←
 11010080[164834642]                 = ≡ Список типов ДМП для расшифровки ∙ 65545[164826714] ←
  1638402[164824779]                   NULL ←
 11010080[164834643]                 = ≡ Файл на ТТ ∙ 65545[164826803] ←
      404[164863067]                   Результат ⁼ 'C:\\Domino8\\HOME\\dmp_' ←
      404[164863068]                   Результат ≡ ЦО ∙ 65545[164823905] ←
      411[164836324]                     Уточняющий параметр ≡ ЦО ∙ 65545[164823905] ←
      411[164836325]                       Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
      404[164863069]                   Результат ⁼ '.htm' ←
 11010088[164826706]                 ВЫПОЛНИТЬ ≡ Отчет.Инициализация ∙ 249[12124171] ←
 39780367[164824448]                   Файл ≡ Файл на ТТ ∙ 65545[164826803] ←
 12124199[164823106]                   Ссылка на шаблон ≡ Револьвер ДМП ∙ 12124193[164823091] ←
  1507728[164823677]                 Начало многострочного комментария ←
 11010080[164834644]                 = ≡ Файл на ТТ ∙ 65545[164826803] ←
      404[164863070]                   Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[164823107]                     Ссылка на шаблон ≡ Револьвер ДМП ∙ 12124193[164823091] ←
  1507729[164823677]                 Конец многострочного комментария ←
 11010088[164826707]                 ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824449]                   Файл ≡ Файл на ТТ ∙ 65545[164826803] ←
 39780357[164823768]                   Ссылка на блок шаблона ≡ Заголовок ∙ 12124197[164823428] ←
 30867470[164827015]                 IF ←
  1638463[164827939]                   Условие ←
      404[164863071]                     Результат ≡ Товар ∙ 65545[164823898] ←
 30867472[164826979]                   THEN ←
 11010088[164826708]                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824450]                       Файл ≡ Файл на ТТ ∙ 65545[164826803] ←
 39780357[164823769]                       Ссылка на блок шаблона ≡ Шапка по SKU ∙ 12124197[164823431] ←
 11010088[164826709]                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824451]                       Файл ≡ Файл на ТТ ∙ 65545[164826803] ←
 39780357[164823770]                       Ссылка на блок шаблона ≡ Подразделение по SKU ∙ 12124197[164823433] ←
 30867473[164824563]                   ELSE ←
 30867470[164827016]                     IF ←
  1638463[164827940]                       Условие ←
      404[164863072]                         Результат ≡ Подразделения ∙ 65545[164823897] ←
 30867472[164826980]                       THEN ←
 11010088[164826710]                         ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824553]                           Файл ≡ Файл на ТТ ∙ 65545[164826803] ←
 39780357[164823771]                           Ссылка на блок шаблона ≡ Шапка по 1 ТТ ∙ 12124197[164823429] ←
 30867473[164824564]                       ELSE ←
 11010088[164826711]                         ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824554]                           Файл ≡ Файл на ТТ ∙ 65545[164826803] ←
 39780357[164823772]                           Ссылка на блок шаблона ≡ Шапка по сети ∙ 12124197[164823430] ←
 11010088[164826712]                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824555]                       Файл ≡ Файл на ТТ ∙ 65545[164826803] ←
 39780357[164823773]                       Ссылка на блок шаблона ≡ Подразделение ∙ 12124197[164823432] ←
 30867473[164824565]               ELSE ←
 30867470[164827017]                 IF ←
  1638463[164827941]                   Условие ←
      404[164863073]                     Результат ≡ Товар ∙ 65545[164823898] ←
 30867472[164826981]                   THEN ←
 11010088[164826713]                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824556]                       Файл ≡ Файл отчета ∙ 65545[164826814] ←
 39780357[164823774]                       Ссылка на блок шаблона ≡ Подразделение по SKU ∙ 12124197[164823433] ←
 30867473[164824566]                   ELSE ←
 11010088[164826714]                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824557]                       Файл ≡ Файл отчета ∙ 65545[164826814] ←
 39780357[164823775]                       Ссылка на блок шаблона ≡ Подразделение ∙ 12124197[164823432] ←
 30867466[164824868]           Выполнить после получения записи ←
 11010105[164823418]             Индикатор ←
      404[164863076]               Результат ⁼ Строки ←
      404[164863077]               Результат ≡ CR+LF ∙ 117[1508547] ←
      404[164863078]               Результат ≡ Документ ∙ 1507335[164825088] ←
      411[164836326]                 Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[164836327]                   Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[164834647]             = ≡ Продукт ∙ 65545[164826683] ←
      404[164863079]               Результат ≡ Продукт ∙ 1507335[164825095] ←
 11010080[164834648]             = ≡ ЦО ∙ 65545[164823905] ←
      404[164863080]               Результат ≡ ЦО ∙ 1507335[164825093] ←
 11010080[164834649]             = ≡ Документ промо ∙ 65545[164826688] ←
      404[164863081]               Результат ≡ Документ ∙ 1507335[164825088] ←
  1507728[164823678]             Начало многострочного комментария ←
 11010080[164834650]             = ≡ Номер ДМП ∙ 65545[164826682] ←
      404[164863082]               Результат ≡ Тип ДМП рассчитанный ∙ 1507335[164825098] ←
      411[164836328]                 Уточняющий параметр ≡ Значение ∙ 249[262147] ←
      404[164863083]               Результат ⁼ '_' ←
      404[164863084]               Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839467]                 Выражение ≡ Номер ДМП рассчитаный ∙ 1507335[164825100] ←
   131097[164825300]                 Формат ≡ Целое N19.0 ∙ 131096[1507329] ←
      404[164863085]               Результат ⁼ '_' ←
      404[164863086]               Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839468]                 Выражение ≡ Третий револьвер ∙ 1507335[164825101] ←
   131097[164825301]                 Формат ≡ Целое N19.0 ∙ 131096[1507329] ←
  1507729[164823678]             Конец многострочного комментария ←
 11010080[164834651]             = ≡ Номер ДМП ∙ 65545[164826682] ←
      404[164863087]               Результат ≡ Тип ДМП рассчитанный ∙ 1507335[164825098] ←
      411[164836329]                 Уточняющий параметр ≡ Значение ∙ 249[262147] ←
      404[164863088]               Результат ⁼ '_' ←
      404[164863089]               Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839469]                 Выражение ≡ Третий револьвер ∙ 1507335[164825101] ←
   131097[164825302]                 Формат ≡ Целое N19.0 ∙ 131096[1507329] ←
 11010080[164834652]             = ≡ Оборудование ДМП ∙ 65545[164826693] ←
      404[164863090]               Результат ≡ Строка документа ∙ 1507335[164825094] ←
      411[164836330]                 Уточняющий параметр ≡ Направить товар ∙ 359[15138820] ←
 11010080[164834653]             = ≡ Дата начала ∙ 65545[164826690] ←
      404[164863091]               Результат ≡ Документ промо ∙ 65545[164826688] ←
      411[164836331]                 Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
 11010080[164834654]             = ≡ Дата окончания ∙ 65545[164826691] ←
      404[164863092]               Результат ≡ Документ промо ∙ 65545[164826688] ←
      411[164836332]                 Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1507728[164823717]             Начало многострочного комментария ←
 11010080[164834655]             = ≡ Остаток ∙ 65545[164826798] ←
      404[164863093]               Результат ≡ Актуальные остатки Базового товара (ШТ) @_STOCK ∙ 249[58392584] ←
 32505862[164828288]                 Значения формальных параметров при вызове ←
 32505860[164834290]                   Значение параметра при вызове процедуры/функции ≡ фп Товарные склады/секции ∙ 65545[58392793] ←
   327700[164839470]                     Выражение ≡ Первый ТЗ/ПЦ для ЦО/ТТ/Узла (действ. магазины) ∙ 249[655294491] ←
 32505862[164828289]                       Значения формальных параметров при вызове ←
 32505860[164834291]                         Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[655298326] ←
   327700[164839471]                           Выражение ≡ ЦО ∙ 65545[164823905] ←
 32505860[164834292]                   Значение параметра при вызове процедуры/функции ≡ фп Базовый продукт ∙ 65545[58392796] ←
   327700[164839472]                     Выражение ≡ Продукт ∙ 65545[164826683] ←
  1507729[164823717]             Конец многострочного комментария ←
 11010080[164834656]             = ≡ Распеденное значение на ПРОМО ∙ 65545[164826686] ←
  1638402[164824848]               NULL ←
 11010080[164834659]             = ≡ Наименование документа ПРОМО ∙ 65545[164826685] ←
      404[164863095]               Результат ≡ Документ промо ∙ 65545[164826688] ←
      411[164836336]                 Уточняющий параметр ≡ Комментарий ∙ 331[11] ←
      404[164863096]               Результат ⁼ ' (' ←
      404[164863097]               Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839481]                 Выражение ≡ Документ промо ∙ 65545[164826688] ←
      411[164836337]                   Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
   131097[164825303]                 Формат ≡ Дата без времени ∙ 131096[131073] ←
      404[164863098]               Результат ⁼ ' - ' ←
      404[164863099]               Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839482]                 Выражение ≡ Документ промо ∙ 65545[164826688] ←
      411[164836338]                   Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
   131097[164825304]                 Формат ≡ Дата без времени ∙ 131096[131073] ←
      404[164863100]               Результат ⁼ ')' ←
 11010080[164834660]             = ≡ Тип оборудования ∙ 65545[164826687] ←
      404[164863101]               Результат ≡ Документ промо ∙ 65545[164826688] ←
      411[164836339]                 Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
      411[164836340]                   Уточняющий параметр ≡ Имя ∙ 249[262146] ←
 30867470[164827018]             IF ←
  1638463[164827942]               Условие ←
      116[164828077]                 Выражение ←
  1638460[164824277]                   НЕ ←
      404[164863102]                   Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[164828293]                     Значения формальных параметров при вызове ←
 32505860[164834301]                       Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[164839483]                         Выражение ≡ Список типов ДМП для расшифровки ∙ 65545[164826714] ←
 32505860[164834302]                       Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[164839484]                         Выражение ≡ Тип ДМП рассчитанный ∙ 1507335[164825098] ←
      412[164824012]                 ИЛИ ←
      116[164828078]                 Выражение ←
  1638460[164824374]                   НЕ ←
      404[164863103]                   Результат ≡ Список типов ДМП для расшифровки ∙ 65545[164826714] ←
 30867472[164826982]               THEN ←
 11010080[164834661]                 = ≡ Список типов ДМП для расшифровки ∙ 65545[164826714] ←
      404[164863104]                   Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823601]                     Список элементов ←
   327700[164839485]                       Выражение ≡ Список типов ДМП для расшифровки ∙ 65545[164826714] ←
   327700[164839486]                       Выражение ≡ Тип ДМП рассчитанный ∙ 1507335[164825098] ←
 11010079[164823388]             CASE ←
  1572877[164823425]               Условие ←
      404[164863105]                 Результат ≡ Строка документа ∙ 1507335[164825094] ←
      411[164836341]                   Уточняющий параметр ≡ Способ оплаты ∙ 359[6684673] ←
      411[164836342]                     Уточняющий параметр ≡ Значение ∙ 249[262147] ←
 11010081[164824340]               OF ⁼ 1 ←
 11010080[164834662]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863106]                   Результат ⁼ 'Просто цены ниже' ←
 11010081[164824341]               OF ⁼ 2 ←
 11010080[164834663]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863107]                   Результат ⁼ 'Просто цены ниже' ←
 11010081[164824342]               OF ⁼ 3 ←
 11010080[164834664]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863108]                   Результат ⁼ 'Просто цены ниже' ←
 11010081[164824343]               OF ⁼ 4 ←
 11010080[164834665]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863109]                   Результат ⁼ 'Просто цены ниже' ←
 11010081[164824352]               OF ⁼ 5 ←
 11010080[164834666]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863110]                   Результат ⁼ 'Просто цены ниже' ←
 11010081[164824353]               OF ⁼ 10 ←
 11010080[164834667]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863111]                   Результат ⁼ 'Только сегодня' ←
 11010081[164824354]               OF ⁼ 11 ←
 11010080[164834668]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863112]                   Результат ⁼ 'Премия' ←
 11010081[164824355]               OF ⁼ 12 ←
 11010080[164834669]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863113]                   Результат ⁼ 'Премия' ←
 11010081[164824356]               OF ⁼ 13 ←
 11010080[164834670]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863114]                   Результат ⁼ 'Все по' ←
 11010081[164824357]               OF ⁼ 14 ←
 11010080[164834671]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863115]                   Результат ⁼ 'Регулярный ценник' ←
 11010081[164824358]               OF ⁼ 15 ←
 11010080[164834672]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863116]                   Результат ⁼ 'Премия' ←
 11010081[164824359]               OF ⁼ 16 ←
 11010080[164834673]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863117]                   Результат ⁼ 'Тематическая акция' ←
 11010081[164824438]               OF ⁼ 17 ←
 11010080[164834674]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863118]                   Результат ⁼ 'Премия' ←
 11010081[164824439]               OF ⁼ 19 ←
 11010080[164834675]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863119]                   Результат ⁼ 'Просто цены ниже' ←
 11010081[164824440]               OF ⁼ 20 ←
 11010080[164834676]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863120]                   Результат ⁼ 'Тематическая акция' ←
 11010081[164824441]               OF ⁼ 201 ←
 11010080[164834677]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863121]                   Результат ⁼ 'Тематическая акция' ←
 11010081[164824442]               OF ⁼ 202 ←
 11010080[164834678]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863122]                   Результат ⁼ 'Тематическая акция' ←
 11010081[164824443]               OF ⁼ 203 ←
 11010080[164834679]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863123]                   Результат ⁼ 'Тематическая акция' ←
 11010081[164824444]               OF ⁼ 204 ←
 11010080[164834680]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863124]                   Результат ⁼ 'Тематическая акция' ←
 11010081[164824445]               OF ⁼ 205 ←
 11010080[164834681]                 = ≡ Спецценник ∙ 65545[164826684] ←
      404[164863125]                   Результат ⁼ 'Тематическая акция' ←
 30867470[164827019]             IF ←
  1638463[164827943]               Условие ←
      404[164863127]                 Результат ≡ Показывать текущее промо ∙ 65545[164823899] ←
  1638473[164829135]                 Равно ←
      404[164863128]                 Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[164826983]               THEN ←
 11010080[164834658]                 = ≡ Движение ∙ 65545[164826799] ←
  1638402[164824849]                   NULL ←
 11010080[164834683]                 = ≡ Дата акционного прихода ∙ 65545[164828192] ←
  1638402[164824850]                   NULL ←
 11010080[164834828]                 = ≡ Количество продаж до ДМП ∙ 65545[164828193] ←
      404[164863622]                   Результат ⁼ 0 ←
 11010080[164834836]                 = ≡ Количество продаж на ДМП ∙ 65545[164828194] ←
      404[164863651]                   Результат ⁼ 0 ←
  1507360[164824740]                 Отбор данных (по запросу) ≡ Приход ∙ 12124205[164823183] ←
 30867466[164824865]                   Выполнить после получения записи ←
 30867470[164827029]                     IF ←
  1638463[164827953]                       Условие ←
      404[164863164]                         Результат ≡ Партия ∙ 1507335[164825132] ←
      411[164836347]                           Уточняющий параметр ≡ Допустимые типы скидки ∙ 305[34996227] ←
      413[164827773]                         И ←
      116[164828133]                         Выражение ←
  1638460[164824388]                           НЕ ←
      404[164863166]                           Результат ≡ Дата акционного прихода ∙ 65545[164828192] ←
 30867472[164826993]                       THEN ←
 11010080[164834688]                         = ≡ Дата акционного прихода ∙ 65545[164828192] ←
      404[164863165]                           Результат ≡ Дата, начало дня ∙ 249[30867471] ←
 32505862[164828336]                             Значения формальных параметров при вызове ←
 32505860[164834383]                               Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867497] ←
   327700[164839616]                                 Выражение ≡ Дата ∙ 1507335[164825127] ←
 30867470[164827025]                     IF ←
  1638463[164827949]                       Условие ←
      404[164863074]                         Результат ≡ Движение ∙ 65545[164826799] ←
 30867472[164826989]                       THEN ←
 11010080[164834645]                         = ≡ Движение ∙ 65545[164826799] ←
      404[164863075]                           Результат ≡ Движение ∙ 65545[164826799] ←
      404[164863094]                           Результат ≡ CR+LF ∙ 117[1508547] ←
      404[164863134]                           Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839435]                             Выражение ≡ Кол-во ∙ 1507335[164825130] ←
   131097[164825305]                             Формат ≡ Количество N19.3 ∙ 131096[30867458] ←
      404[164863135]                           Результат ⁼ ' - ' ←
      404[164863136]                           Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839436]                             Выражение ≡ Строка ∙ 1507335[164825129] ←
      411[164836334]                               Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164836333]                                 Уточняющий параметр ≡ Дата поставки ∙ 331[14352402] ←
   131097[164825306]                             Формат ≡ Дата без времени ∙ 131096[131073] ←
      404[164863140]                           Результат ⁼ ' - ' ←
      404[164863141]                           Результат ≡ Партия ∙ 1507335[164825132] ←
      404[164863137]                           Результат ⁼ ' - ' ←
      404[164863138]                           Результат ≡ Строка ∙ 1507335[164825129] ←
      411[164836335]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164836343]                               Уточняющий параметр ≡ UID типа ∙ 249[1507737] ←
      411[164836346]                                 Уточняющий параметр ≡ Имя ∙ 249[262146] ←
 30867473[164824572]                       ELSE ←
 11010080[164834657]                         = ≡ Движение ∙ 65545[164826799] ←
      404[164863608]                           Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839439]                             Выражение ≡ Кол-во ∙ 1507335[164825130] ←
   131097[164825331]                             Формат ≡ Количество N19.3 ∙ 131096[30867458] ←
      404[164863609]                           Результат ⁼ ' - ' ←
      404[164863610]                           Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839440]                             Выражение ≡ Строка ∙ 1507335[164825129] ←
      411[164836344]                               Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164836345]                                 Уточняющий параметр ≡ Дата поставки ∙ 331[14352402] ←
   131097[164825332]                             Формат ≡ Дата без времени ∙ 131096[131073] ←
      404[164863611]                           Результат ⁼ ' - ' ←
      404[164863612]                           Результат ≡ Партия ∙ 1507335[164825132] ←
      404[164863142]                           Результат ⁼ ' - ' ←
      404[164863139]                           Результат ≡ Строка ∙ 1507335[164825129] ←
      411[164836434]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164836435]                               Уточняющий параметр ≡ UID типа ∙ 249[1507737] ←
      411[164836436]                                 Уточняющий параметр ≡ Имя ∙ 249[262146] ←
 30867470[164827027]                 IF ←
  1638463[164827951]                   Условие ←
  1638460[164824387]                     НЕ ←
      404[164863152]                     Результат ≡ Дата акционного прихода ∙ 65545[164828192] ←
 30867472[164826991]                   THEN ←
 11010080[164834685]                     = ≡ Дата акционного прихода ∙ 65545[164828192] ←
      404[164863153]                       Результат ≡ Дата минус количество дней ∙ 249[164364372] ←
 32505862[164828281]                         Значения формальных параметров при вызове ←
 32505860[164834273]                           Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164368988] ←
   327700[164839451]                             Выражение ≡ Дата начала ∙ 65545[164826690] ←
 32505860[164834274]                           Значение параметра при вызове процедуры/функции ≡ Количество дней ∙ 65545[164368989] ←
   327700[164839452]                             Выражение ⁼ 7 ←
 30867470[164827028]                 IF ←
  1638463[164827952]                   Условие ←
      404[164863154]                     Результат ≡ Движение ∙ 65545[164826799] ←
 30867472[164826992]                   THEN ←
 11010080[164834686]                     = ≡ Движение ∙ 65545[164826799] ←
      404[164863160]                       Результат ≡ Движение ∙ 65545[164826799] ←
      404[164863161]                       Результат ≡ CR+LF ∙ 117[1508547] ←
      404[164863162]                       Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839453]                         Выражение ≡ Дата акционного прихода ∙ 65545[164828192] ←
   131097[164825334]                         Формат ≡ Дата без времени ∙ 131096[131073] ←
      404[164863163]                       Результат ⁼ ' - дата акционной поставки' ←
 30867473[164824573]                   ELSE ←
 11010080[164834687]                     = ≡ Движение ∙ 65545[164826799] ←
      404[164863167]                       Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839455]                         Выражение ≡ Количество продаж до ДМП ∙ 65545[164828193] ←
   131097[164825337]                         Формат ≡ Количество N19.3 ∙ 131096[30867458] ←
      404[164863168]                       Результат ⁼ ' - до ДМП' ←
      404[164863169]                       Результат ≡ CR+LF ∙ 117[1508547] ←
      404[164863170]                       Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839456]                         Выражение ≡ Количество продаж на ДМП ∙ 65545[164828194] ←
   131097[164825338]                         Формат ≡ Количество N19.3 ∙ 131096[30867458] ←
      404[164863171]                       Результат ⁼ ' - после ДМП' ←
  1507360[164824741]                 Отбор данных (по запросу) ≡ Расход ∙ 12124205[164823184] ←
 30867466[164824867]                   Выполнить после получения записи ←
 30867470[164827061]                     IF ←
  1638463[164827989]                       Условие ←
      404[164863648]                         Результат ≡ Дата ∙ 1507335[164825128] ←
  1638475[164823391]                         Меньше или равно ←
      404[164863649]                         Результат ≡ Дата акционного прихода ∙ 65545[164828192] ←
 30867472[164827026]                       THEN ←
 48431132[164823752]                         += ≡ Количество продаж до ДМП ∙ 65545[164828193] ←
  1638464[164863623]                           Ноль (0.0), если NULL ≡ Кол-во ∙ 1507335[164825134] ←
 30867473[164824591]                       ELSE ←
 48431132[164823751]                         += ≡ Количество продаж на ДМП ∙ 65545[164828194] ←
  1638464[164863650]                           Ноль (0.0), если NULL ≡ Кол-во ∙ 1507335[164825134] ←
 30867470[164827030]                     IF ←
  1638463[164827954]                       Условие ←
      404[164863617]                         Результат ≡ Движение ∙ 65545[164826799] ←
 30867472[164826994]                       THEN ←
 11010080[164834689]                         = ≡ Движение ∙ 65545[164826799] ←
      404[164863620]                           Результат ≡ Движение ∙ 65545[164826799] ←
      404[164863621]                           Результат ≡ CR+LF ∙ 117[1508547] ←
      404[164863623]                           Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839454]                             Выражение ≡ Кол-во ∙ 1507335[164825134] ←
   131097[164825336]                             Формат ≡ Количество N19.3 ∙ 131096[30867458] ←
      404[164863624]                           Результат ⁼ ' - ' ←
      404[164863625]                           Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839457]                             Выражение ≡ Строка ∙ 1507335[164825133] ←
      411[164836348]                               Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164836349]                                 Уточняющий параметр ≡ Дата ∙ 331[8] ←
   131097[164825339]                             Формат ≡ Дата без времени ∙ 131096[131073] ←
      404[164863626]                           Результат ⁼ ' - ' ←
      404[164863627]                           Результат ≡ Партия ∙ 1507335[164825136] ←
      404[164863628]                           Результат ⁼ ' - ' ←
      404[164863629]                           Результат ≡ Строка ∙ 1507335[164825133] ←
      411[164836350]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164836351]                               Уточняющий параметр ≡ UID типа ∙ 249[1507737] ←
      411[164836437]                                 Уточняющий параметр ≡ Имя ∙ 249[262146] ←
 30867473[164824574]                       ELSE ←
 11010080[164834690]                         = ≡ Движение ∙ 65545[164826799] ←
      404[164863632]                           Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839458]                             Выражение ≡ Кол-во ∙ 1507335[164825134] ←
   131097[164825340]                             Формат ≡ Количество N19.3 ∙ 131096[30867458] ←
      404[164863633]                           Результат ⁼ ' - ' ←
      404[164863634]                           Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839459]                             Выражение ≡ Строка ∙ 1507335[164825133] ←
      411[164836438]                               Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164836439]                                 Уточняющий параметр ≡ Дата ∙ 331[8] ←
   131097[164825341]                             Формат ≡ Дата без времени ∙ 131096[131073] ←
      404[164863635]                           Результат ⁼ ' - ' ←
      404[164863636]                           Результат ≡ Партия ∙ 1507335[164825136] ←
      404[164863637]                           Результат ⁼ ' - ' ←
      404[164863638]                           Результат ≡ Строка ∙ 1507335[164825133] ←
      411[164836440]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164836441]                               Уточняющий параметр ≡ UID типа ∙ 249[1507737] ←
      411[164836442]                                 Уточняющий параметр ≡ Имя ∙ 249[262146] ←
 30867470[164827165]                 IF ←
  1638463[164828137]                   Условие ←
      404[164865129]                     Результат ≡ Количество продаж до ДМП ∙ 65545[164828193] ←
  1638473[164829334]                     Равно ←
      404[164865159]                     Результат ⁼ 0 ←
 30867472[164827129]                   THEN ←
 11010080[164835190]                     = ≡ Количество продаж на ДМП ∙ 65545[164828194] ←
      404[164865161]                       Результат ⁼ 0 ←
 11010080[164834901]                 = ≡ Количество дней до ДМП ∙ 65545[164828222] ←
      116[164828173]                   Выражение ←
      116[164828175]                     Выражение ←
      404[164863855]                       Результат ≡ Дата акционного прихода ∙ 65545[164828192] ←
      406[164823888]                       Вычесть ←
      404[164863858]                       Результат ≡ Дата минус количество дней ∙ 249[164364372] ←
 32505862[164828334]                         Значения формальных параметров при вызове ←
 32505860[164834380]                           Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164368988] ←
   327700[164839613]                             Выражение ≡ Дата начала ∙ 65545[164826690] ←
 32505860[164834381]                           Значение параметра при вызове процедуры/функции ≡ Количество дней ∙ 65545[164368989] ←
   327700[164839614]                             Выражение ⁼ 21 ←
      402[164823696]                     Делить ←
      404[164863859]                     Результат ⁼ 86400 ←
 11010080[164834902]                 = ≡ Количество дней на ДМП ∙ 65545[164828223] ←
      116[164828178]                   Выражение ←
      116[164828186]                     Выражение ←
      404[164863860]                       Результат ≡ Дата, начало дня ∙ 249[30867471] ←
 32505862[164828335]                         Значения формальных параметров при вызове ←
 32505860[164834382]                           Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867497] ←
   327700[164839615]                             Выражение ≡ Дата начала ∙ 65545[164826690] ←
      406[164823895]                       Вычесть ←
      404[164863861]                       Результат ≡ Дата акционного прихода ∙ 65545[164828192] ←
      402[164823697]                     Делить ←
      404[164863869]                     Результат ⁼ 86400 ←
  1507360[164824812]                 Отбор данных (по запросу) ≡ ПРОВОДКИ ∙ 12124205[48431274] ←
 32505862[164828296]                   Значения формальных параметров при вызове ←
 32505860[164834308]                     Значение параметра при вызове процедуры/функции ≡ Список ЦФО ∙ 65545[48433455] ←
   327700[164839496]                       Выражение ≡ Центр финанс. ответственности для ТОВАРНЫХ ПЛАНОВ ∙ 117[45613057] ←
 32505860[164834309]                     Значение параметра при вызове процедуры/функции ≡ Счета по дебету ∙ 65545[48433459] ←
   327700[164839497]                       Выражение ≡ Акции ∙ 131[655294465] ←
 32505860[164834310]                     Значение параметра при вызове процедуры/функции ≡ Дт [1] ∙ 65545[48433462] ←
   327700[164839498]                       Выражение ≡ ЦО ∙ 65545[164823905] ←
 32505860[164834311]                     Значение параметра при вызове процедуры/функции ≡ Дт [2] ∙ 65545[48433463] ←
   327700[164839499]                       Выражение ≡ Продукт ∙ 65545[164826683] ←
 32505860[164834312]                     Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[48433456] ←
   327700[164839500]                       Выражение ≡ Дата минус количество дней ∙ 249[164364372] ←
 32505862[164828297]                         Значения формальных параметров при вызове ←
 32505860[164834313]                           Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164368988] ←
   327700[164839501]                             Выражение ≡ Дата начала ∙ 65545[164826690] ←
 32505860[164834410]                           Значение параметра при вызове процедуры/функции ≡ Количество дней ∙ 65545[164368989] ←
   327700[164839503]                             Выражение ⁼ 21 ←
 32505860[164834314]                     Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[48433457] ←
   327700[164839502]                       Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164824235]                         Выполнить действия ←
 39780366[164824787]                           RETURN ←
      116[164828082]                             Выражение ←
      404[164863176]                               Результат ≡ Дата начала ∙ 65545[164826690] ←
      406[164823897]                               Вычесть ←
      404[164863177]                               Результат ⁼ 1 ←
 30867466[164824943]                   Выполнить после получения записи ←
 30867470[164827040]                     IF ←
  1638463[164827964]                       Условие ←
      404[164863175]                         Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      411[164836353]                           Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638477[164823709]                         Больше или равно ←
      404[164863178]                         Результат ≡ Дата акционного прихода ∙ 65545[164828192] ←
 30867472[164827004]                       THEN ←
 11010088[164826733]                         ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164824312]                           Выражение ←
      404[164863181]                             Результат ≡ Продукт ∙ 65545[164826683] ←
      411[164836354]                               Уточняющий параметр ≡ Наименование ∙ 305[6] ←
      404[164863182]                             Результат ⁼ ; ←
      404[164863183]                             Результат ≡ Дата начала ∙ 65545[164826690] ←
      404[164863184]                             Результат ⁼ ; ←
      404[164863185]                             Результат ≡ Документ промо ∙ 65545[164826688] ←
      411[164836509]                               Уточняющий параметр ≡ Комментарий ∙ 331[11] ←
      404[164864038]                             Результат ⁼ ;Новое;После ДМП; ←
      404[164864039]                             Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      411[164836545]                               Уточняющий параметр ≡ Комментарий ∙ 331[11] ←
      404[164864037]                             Результат ⁼ ; ←
      404[164864040]                             Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      411[164836546]                               Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
      404[164864042]                             Результат ⁼ ; ←
      404[164864041]                             Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      411[164836547]                               Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 11010080[164834695]                         = ≡ Количество продаж на ДМП ∙ 65545[164828194] ←
      404[164863179]                           Результат ⁼ 0 ←
 30867470[164827041]                     IF ←
  1638463[164827965]                       Условие ←
      404[164864054]                         Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      411[164836553]                           Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638476[164823317]                         Меньше ←
      404[164864055]                         Результат ≡ Дата акционного прихода ∙ 65545[164828192] ←
 30867472[164827005]                       THEN ←
 11010088[164826734]                         ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164824313]                           Выражение ←
      404[164864043]                             Результат ≡ Продукт ∙ 65545[164826683] ←
      411[164836548]                               Уточняющий параметр ≡ Наименование ∙ 305[6] ←
      404[164864044]                             Результат ⁼ ; ←
      404[164864045]                             Результат ≡ Дата начала ∙ 65545[164826690] ←
      404[164864046]                             Результат ⁼ ; ←
      404[164864047]                             Результат ≡ Документ промо ∙ 65545[164826688] ←
      411[164836549]                               Уточняющий параметр ≡ Комментарий ∙ 331[11] ←
      404[164864048]                             Результат ⁼ ;Новое;До ДМП; ←
      404[164864049]                             Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      411[164836550]                               Уточняющий параметр ≡ Комментарий ∙ 331[11] ←
      404[164864050]                             Результат ⁼ ; ←
      404[164864051]                             Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      411[164836551]                               Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
      404[164864052]                             Результат ⁼ ; ←
      404[164864053]                             Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      411[164836552]                               Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 11010080[164834980]                         = ≡ Количество продаж до ДМП ∙ 65545[164828193] ←
      404[164863180]                           Результат ⁼ 0 ←
 11010080[164834833]                 = ≡ Ср. Количество продаж до ДМП ∙ 65545[164828196] ←
      404[164863618]                   Результат ≡ Количество продаж до ДМП ∙ 65545[164828193] ←
      402[164823663]                   Делить ←
      116[164828079]                   Выражение ←
      116[164828132]                     Выражение ←
      404[164863126]                       Результат ≡ Дата акционного прихода ∙ 65545[164828192] ←
      406[164823551]                       Вычесть ←
      404[164863619]                       Результат ≡ Дата минус количество дней ∙ 249[164364372] ←
 32505862[164828279]                         Значения формальных параметров при вызове ←
 32505860[164834270]                           Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164368988] ←
   327700[164839448]                             Выражение ≡ Дата начала ∙ 65545[164826690] ←
 32505860[164834271]                           Значение параметра при вызове процедуры/функции ≡ Количество дней ∙ 65545[164368989] ←
   327700[164839449]                             Выражение ⁼ 21 ←
      402[164823664]                     Делить ←
      404[164863144]                     Результат ⁼ 86400 ←
 11010080[164834684]                 = ≡ Ср. Количество продаж на ДМП ∙ 65545[164828197] ←
      404[164863148]                   Результат ≡ Количество продаж на ДМП ∙ 65545[164828194] ←
      402[164823665]                   Делить ←
      116[164828080]                   Выражение ←
      116[164828081]                     Выражение ←
      404[164863149]                       Результат ≡ Дата, начало дня ∙ 249[30867471] ←
 32505862[164828280]                         Значения формальных параметров при вызове ←
 32505860[164834272]                           Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867497] ←
   327700[164839438]                             Выражение ≡ Дата начала ∙ 65545[164826690] ←
      406[164823678]                       Вычесть ←
      404[164863150]                       Результат ≡ Дата акционного прихода ∙ 65545[164828192] ←
      402[164823666]                     Делить ←
      404[164863151]                     Результат ⁼ 86400 ←
 30867470[164827026]                 IF ←
  1638463[164827950]                   Условие ←
      404[164863143]                     Результат ≡ Движение ∙ 65545[164826799] ←
 30867472[164826990]                   THEN ←
 11010080[164834646]                     = ≡ Движение ∙ 65545[164826799] ←
      404[164863613]                       Результат ≡ Движение ∙ 65545[164826799] ←
      404[164863614]                       Результат ≡ CR+LF ∙ 117[1508547] ←
      404[164863615]                       Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839437]                         Выражение ≡ Количество продаж до ДМП ∙ 65545[164828193] ←
   131097[164825307]                         Формат ≡ Количество N19.3 ∙ 131096[30867458] ←
      404[164863616]                       Результат ⁼ ' - до ДМП' ←
      404[164863145]                       Результат ≡ CR+LF ∙ 117[1508547] ←
      404[164863147]                       Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839450]                         Выражение ≡ Количество продаж на ДМП ∙ 65545[164828194] ←
   131097[164825335]                         Формат ≡ Количество N19.3 ∙ 131096[30867458] ←
      404[164863146]                       Результат ⁼ ' - после ДМП' ←
 30867473[164824590]                   ELSE ←
 11010080[164834682]                     = ≡ Движение ∙ 65545[164826799] ←
      404[164863155]                       Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839441]                         Выражение ≡ Количество продаж до ДМП ∙ 65545[164828193] ←
   131097[164825308]                         Формат ≡ Количество N19.3 ∙ 131096[30867458] ←
      404[164863156]                       Результат ⁼ ' - до ДМП' ←
      404[164863157]                       Результат ≡ CR+LF ∙ 117[1508547] ←
      404[164863158]                       Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164839442]                         Выражение ≡ Количество продаж на ДМП ∙ 65545[164828194] ←
   131097[164825333]                         Формат ≡ Количество N19.3 ∙ 131096[30867458] ←
      404[164863159]                       Результат ⁼ ' - после ДМП' ←
 30867470[164827031]                 IF ←
  1638463[164827955]                   Условие ←
  1638460[164824389]                     НЕ ←
      116[164828134]                     Выражение ←
      404[164863630]                       Результат ≡ Показывать движение ∙ 65545[164828198] ←
  1638473[164829137]                       Равно ←
      404[164863631]                       Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[164826995]                   THEN ←
 11010080[164834691]                     = ≡ Движение ∙ 65545[164826799] ←
  1638402[164824852]                       NULL ←
 30867470[164827020]                 IF ←
  1638463[164827944]                   Условие ←
      404[164863129]                     Результат ≡ Автоматически ∙ 65545[164823895] ←
 30867472[164826984]                   THEN ←
 30867470[164827021]                     IF ←
  1638463[164827945]                       Условие ←
      404[164863130]                         Результат ≡ Товар ∙ 65545[164823898] ←
 30867472[164826985]                       THEN ←
 11010088[164826715]                         ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824558]                           Файл ≡ Файл на ТТ ∙ 65545[164826803] ←
 39780357[164823776]                           Ссылка на блок шаблона ≡ Строка по SKU ∙ 12124197[164823436] ←
 30867473[164824567]                       ELSE ←
 30867470[164827022]                         IF ←
  1638463[164827946]                           Условие ←
      404[164863131]                             Результат ≡ Подразделения ∙ 65545[164823897] ←
 30867472[164826986]                           THEN ←
 11010088[164826716]                             ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824559]                               Файл ≡ Файл на ТТ ∙ 65545[164826803] ←
 39780357[164823777]                               Ссылка на блок шаблона ≡ Строка по 1 ТТ ∙ 12124197[164823434] ←
 30867473[164824568]                           ELSE ←
 11010088[164826717]                             ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824560]                               Файл ≡ Файл на ТТ ∙ 65545[164826803] ←
 39780357[164823778]                               Ссылка на блок шаблона ≡ Строка по сети ∙ 12124197[164823435] ←
 30867473[164824569]                   ELSE ←
 30867470[164827023]                     IF ←
  1638463[164827947]                       Условие ←
      404[164863132]                         Результат ≡ Товар ∙ 65545[164823898] ←
 30867472[164826987]                       THEN ←
 11010088[164826718]                         ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824561]                           Файл ≡ Файл отчета ∙ 65545[164826814] ←
 39780357[164823779]                           Ссылка на блок шаблона ≡ Строка по SKU ∙ 12124197[164823436] ←
 30867473[164824570]                       ELSE ←
 30867470[164827024]                         IF ←
  1638463[164827948]                           Условие ←
      404[164863133]                             Результат ≡ Подразделения ∙ 65545[164823897] ←
 30867472[164826988]                           THEN ←
 11010088[164826719]                             ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824562]                               Файл ≡ Файл отчета ∙ 65545[164826814] ←
 39780357[164823780]                               Ссылка на блок шаблона ≡ Строка по 1 ТТ ∙ 12124197[164823434] ←
 30867473[164824571]                           ELSE ←
 11010088[164826720]                             ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824563]                               Файл ≡ Файл отчета ∙ 65545[164826814] ←
 39780357[164823781]                               Ссылка на блок шаблона ≡ Строка по сети ∙ 12124197[164823435] ←
  1507468[164823129]           Выполнить после обработки блока ≡ ТТ ∙ 1507465[164823204] ←
 30867470[164827042]         IF ←
  1638463[164827967]           Условие ←
  1638460[164824375]             НЕ ←
      404[164863186]             Результат ≡ Автоматически ∙ 65545[164823895] ←
 30867472[164827006]           THEN ←
 11010088[164826739]             ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824581]               Файл ≡ Файл отчета ∙ 65545[164826814] ←
 39780357[164823797]               Ссылка на блок шаблона ≡ Закрыть таблицу ∙ 12124197[164823437] ←
 11010080[164834696]             = ≡ i ∙ 65545[164826796] ←
      404[164863187]               Результат ⁼ 0 ←
 12124162[164823140]             WHILE ←
  1638463[164827968]               Условие ←
      404[164863188]                 Результат ≡ Множество.Элемент (первый элемент имеет нулевой индекс) ∙ 387[1507488] ←
   327700[164839506]                   Выражение ≡ Список типов ДМП для расшифровки ∙ 65545[164826714] ←
  1507670[164823126]                   Индекс ≡ i ∙ 65545[164826796] ←
 30867469[164823275]               БЛОК ←
 11010080[164834697]                 = ≡ Расшифровка ДМП ∙ 65545[164826694] ←
      404[164863189]                   Результат ≡ Множество.Элемент (первый элемент имеет нулевой индекс) ∙ 387[1507488] ←
      411[164836355]                     Уточняющий параметр ≡ Значение ∙ 249[262147] ←
   327700[164839507]                     Выражение ≡ Список типов ДМП для расшифровки ∙ 65545[164826714] ←
  1507670[164823127]                     Индекс ≡ i ∙ 65545[164826796] ←
      404[164863190]                   Результат ⁼ ' - ' ←
      404[164863191]                   Результат ≡ Множество.Элемент (первый элемент имеет нулевой индекс) ∙ 387[1507488] ←
      411[164836356]                     Уточняющий параметр ≡ Имя ∙ 249[262146] ←
   327700[164839508]                     Выражение ≡ Список типов ДМП для расшифровки ∙ 65545[164826714] ←
  1507670[164823128]                     Индекс ≡ i ∙ 65545[164826796] ←
 11010088[164826740]                 ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824582]                   Файл ≡ Файл отчета ∙ 65545[164826814] ←
 39780357[164823798]                   Ссылка на блок шаблона ≡ Строка расшифровки ДМП ∙ 12124197[164823438] ←
 48431134[164823202]                 ++ ≡ i ∙ 65545[164826796] ←
 11010088[164826741]             ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164824583]               Файл ≡ Файл отчета ∙ 65545[164826814] ←
 39780357[164823799]               Ссылка на блок шаблона ≡ Конец файла ∙ 12124197[164823439] ←
  1507412[164823115]       Закрыть индикатор ←
 30867470[164827043]       IF ←
  1638463[164827969]         Условие ←
  1638460[164824376]           НЕ ←
      404[164863192]           Результат ≡ Автоматически ∙ 65545[164823895] ←
 30867472[164827007]         THEN ←
 11010088[164826742]           ВЫПОЛНИТЬ ≡ Отчет.Показать ∙ 220[12124164] ←
 39780367[164824584]             Файл ≡ Файл отчета ∙ 65545[164826814] ←
  1507334[164823096]             Интерфейс ≡ HTML ∙ 486[3342337] ←
 12124189[164823120]     Выполнить при завершении ←
 30867470[164827044]       IF ←
  1638463[164827970]         Условие ←
  1638460[164824377]           НЕ ←
      404[164863193]           Результат ≡ Автоматически ∙ 65545[164823895] ←
 30867472[164827008]         THEN ←
 11010088[164826743]           ВЫПОЛНИТЬ ≡ Файл.Закрыть ∙ 249[1507341] ←
 39780367[164824585]             Файл ≡ Файл отчета ∙ 65545[164826814] ←
 11010088[164826744]           ВЫПОЛНИТЬ ≡ Файл.Удалить ∙ 249[1507333] ←
 39780367[164824586]             Файл ≡ Файл отчета ∙ 65545[164826814] ←
