ETK\Admin

      127[164298755]   Процедура • Печать ценника А4 (КЯ) ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[164298808]     Локальные переменные ←
    65545[170919342]       Локальная переменная • ШК ≡ Строка (30) ∙ 107[28835850] ←
    65545[170919887]       Локальная переменная • Строка для печати ШК ≡ Длинная строка (512) ∙ 107[61669379] ←
      249[170917917]       Функция • фШК ≡ { ... скрипт ... } ∙ 249[39780357] ←
 32505863[170918038]         Локальные переменные ←
 30867463[170918174]         Выполнить действия ←
 39780366[170917891]           RETURN ≡ ШК ∙ 65545[170919342] ←
    65545[170919293]       Локальная переменная • Сколько купить для получения фишки ≡ Целое без знака ∙ 107[262146] ←
    65545[170918940]       Локальная переменная • Строка с кодом акции ≡ Длинная строка (512) ∙ 107[61669379] ←
    65545[170918941]       Локальная переменная • Строка с БЗМЖ ≡ Длинная строка (512) ∙ 107[61669379] ←
 30867495[170917925]       Группа локальных переменных • Для ку на ценнике ←
    65545[170918921]         Локальная переменная • Рекомендации ≡ Длинная строка (250) ∙ 107[28835851] ←
    65545[170918924]         Локальная переменная • Температура ≡ Длинная строка (250) ∙ 107[28835851] ←
    65545[170918926]         Локальная переменная • Годен до: ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[170918927]         Локальная переменная • Изготовитель_имя ≡ Длинная строка (250) ∙ 107[28835851] ←
    65545[170918928]         Локальная переменная • Изготовитель_страна ≡ Длинная строка (250) ∙ 107[28835851] ←
    65545[170918929]         Локальная переменная • Изготовитель_регион ≡ Длинная строка (250) ∙ 107[28835851] ←
    65545[170918930]         Локальная переменная • Изготовитель_город ≡ Длинная строка (250) ∙ 107[28835851] ←
    65545[170918931]         Локальная переменная • Изготовитель_улица ≡ Длинная строка (250) ∙ 107[28835851] ←
    65545[170918932]         Локальная переменная • Изготовитель_дом ≡ Короткая строка (15 символов) ∙ 107[48431107] ←
    65545[170918925]         Локальная переменная • Импортер_имя ≡ Длинная строка (250) ∙ 107[28835851] ←
    65545[170918935]         Локальная переменная • Импортер_страна ≡ Длинная строка (250) ∙ 107[28835851] ←
    65545[170918936]         Локальная переменная • Импортер_регион ≡ Длинная строка (250) ∙ 107[28835851] ←
    65545[170918937]         Локальная переменная • Импортер_город ≡ Длинная строка (250) ∙ 107[28835851] ←
    65545[170918938]         Локальная переменная • Импортер_улица ≡ Длинная строка (250) ∙ 107[28835851] ←
    65545[170918939]         Локальная переменная • Импортер_дом ≡ Короткая строка (15 символов) ∙ 107[48431107] ←
    65545[170918933]         Локальная переменная • Последняя партия ≡ Продукт ∙ 107[7] ←
    65545[170918934]         Локальная переменная • ТЗ ≡ Партнер ∙ 107[5] ←
    65545[170918841]         Локальная переменная • Строка КУ ≡ Строка для примечания (4000 знаков) ∙ 107[30867457] ←
    65545[170918674]       Локальная переменная • Код акции в шаблон ≡ Строка (40) ∙ 107[1] ←
    65545[170918653]       Локальная переменная • Максимальное количество по этой цене в сутки ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[170918664]       Локальная переменная • Максимальное количество по акции в сутки ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[170918065]       Локальная переменная • len ≡ Целое без знака ∙ 107[262146] ←
    65545[170918067]       Локальная переменная • Строка отладки ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[170918066]       Локальная переменная • Последние 2 символа ≡ Короткая строка (12 символов) ∙ 107[2293761] ←
    65545[165350425]       Локальная переменная • Строка ограничения ≡ Длинная строка (512) ∙ 107[61669379] ←
    65545[165350426]       Локальная переменная • Строка дата действия ≡ Длинная строка (512) ∙ 107[61669379] ←
    65545[165349839]       Локальная переменная • БЗМЖ ≡ Длинная строка (512) ∙ 107[61669379] ←
      355[165348070]         Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[170918832]       Локальная переменная • Енисейский стандарт ≡ Длинная строка (512) ∙ 107[61669379] ←
      355[170918270]         Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[165349841]       Локальная переменная • border ≡ Короткая строка (15 символов) ∙ 107[48431107] ←
      355[165348069]         Начальное значение ⁼ 0 ←
    65545[165347551]       Локальная переменная • Количество ценников ≡ Целое ∙ 107[2] ←
      355[170918271]         Начальное значение ⁼ 1 ←
    65545[170918833]       Локальная переменная • Количество ценников temp ≡ Целое ∙ 107[2] ←
 30867495[164298791]       Группа локальных переменных • Премия ←
    65545[164301599]         Локальная переменная • Строка премия ≡ Строка (объект БД) ∙ 107[10] ←
    65545[164304032]         Локальная переменная • Строка неделя ≡ Строка (объект БД) ∙ 107[10] ←
    65545[164304145]         Локальная переменная • Строка спецназ ≡ Строка (объект БД) ∙ 107[10] ←
    65545[164301603]         Локальная переменная • Целое ≡ Целое ∙ 107[2] ←
    65545[164301601]         Локальная переменная • Проц ≡ Короткая строка (15 символов) ∙ 107[48431107] ←
    65545[164301602]         Локальная переменная • Колво ≡ Короткая строка (15 символов) ∙ 107[48431107] ←
    65545[164303637]         Локальная переменная • Стр до ≡ Строка (30) ∙ 107[28835850] ←
    65545[164304146]         Локальная переменная • Уже определен шаблон ≡ Целое ∙ 107[2] ←
    65545[164301604]       Локальная переменная • Тип ≡ Целое ∙ 107[2] ←
    65545[164299288]       Локальная переменная • ДокументИд ≡ Документ ∙ 107[8] ←
      355[656082072]         Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164299290]       Локальная переменная • Продукт Ид ≡ Продукт ∙ 107[7] ←
      355[656082073]         Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164299291]       Локальная переменная • Подразделение ком.отд. ≡ Партнер ∙ 107[5] ←
    65545[656085782]       Локальная переменная • Номер тридцатки ≡ Целое без знака ∙ 107[262146] ←
    65545[164299286]       Локальная переменная • Рез ≡ Целое ∙ 107[2] ←
    65545[164299292]       Локальная переменная • Наименование ≡ Наименование объекта (80) ∙ 107[262147] ←
    65545[164299944]       Локальная переменная • Наименование 2 ≡ Наименование объекта (80) ∙ 107[262147] ←
    65545[164299293]       Локальная переменная • Цена ≡ Цена ∙ 107[16] ←
    65545[165021740]       Локальная переменная • Цена целая часть ≡ Короткая строка (12 символов) ∙ 107[2293761] ←
    65545[165021741]       Локальная переменная • Цена дробная часть ≡ Короткая строка (12 символов) ∙ 107[2293761] ←
    65545[164299277]       Локальная переменная • Цена 2 ≡ Цена ∙ 107[16] ←
    65545[165021742]       Локальная переменная • Цена 2 целая часть ≡ Короткая строка (12 символов) ∙ 107[2293761] ←
    65545[165021743]       Локальная переменная • Цена 2 дробная часть ≡ Короткая строка (12 символов) ∙ 107[2293761] ←
    65545[164299298]       Локальная переменная • Файл отчета ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[164299299]       Локальная переменная • Файл ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[656085785]       Локальная переменная • Кол-во товаров ≡ Целое ∙ 107[2] ←
    65545[164299302]       Локальная переменная • Кол-во листов ≡ Целое ∙ 107[2] ←
    65545[164299280]       Локальная переменная • Линия 1 ≡ Целое ∙ 107[2] ←
    65545[164299281]       Локальная переменная • Линия 2 ≡ Целое ∙ 107[2] ←
    65545[164299305]       Локальная переменная • Шрифт 1 ≡ Целое ∙ 107[2] ←
    65545[164299635]       Локальная переменная • По продукту есть акция ≡ bool ∙ 107[1507344] ←
    65545[656085781]       Локальная переменная • Строка - текст ошибки ≡ Длинная строка (250) ∙ 107[28835851] ←
    65545[164302701]       Локальная переменная • Акция по ценовой акции ≡ Объект ∙ 107[19] ←
      355[164299364]         Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164302702]       Локальная переменная • Новая цена по ценовой акции ≡ Цена ∙ 107[16] ←
      355[164299365]         Начальное значение ⁼ 0 ←
    65545[164304033]       Локальная переменная • Код акции ≡ Целое ∙ 107[2] ←
    65545[164304987]       Локальная переменная • Строка 1 ≡ Наименование объекта (80) ∙ 107[262147] ←
      355[164299794]         Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164304276]       Локальная переменная • Строка 2 ≡ Наименование объекта (80) ∙ 107[262147] ←
      355[164299596]         Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164303882]       Локальная переменная • Код для весов ≡ Целое ∙ 107[2] ←
    65545[164303883]       Локальная переменная • Код для весов стр ≡ Длинная строка (1000) ∙ 107[48431111] ←
    65545[164304986]       Локальная переменная • Док Ид промо ≡ Документ ∙ 107[8] ←
    65545[164303326]       Локальная переменная • Строка промо ≡ Строка (объект БД) ∙ 107[10] ←
      117[164299120]       Выражение • Стр инфо ≡ Строка (40) ∙ 107[1] ←
      404[164334342]         Результат ≡ Док Ид промо ∙ 65545[164304986] ←
      404[164334343]         Результат ⁼ ' ' ←
      404[164334344]         Результат ≡ Код акции ∙ 65545[164304033] ←
    65545[171835582]       Локальная переменная • Вывести на экран ≡ Признак (Да/Нет) ∙ 107[131203074] ←
      355[171835430]         Начальное значение ≡ Нет ∙ 131203075[131203073] ←
    65545[171835583]       Локальная переменная • Печатать за 100г ≡ Признак (Да/Нет) ∙ 107[131203074] ←
      355[171835436]         Начальное значение ≡ Нет ∙ 131203075[131203073] ←
    65545[171118107]       Локальная переменная • Печатать КУ ≡ Признак (Да/Нет) ∙ 107[131203074] ←
      355[171115533]         Начальное значение ≡ NULL ∙ 117[30670850] ←
      117[171114747]       Выражение • Показывать параметр печати КУ ≡ bool ∙ 107[1507344] ←
      116[171116569]         Выражение ←
      116[171116556]           Выражение ←
  1638460[171115285]             НЕ ←
      404[171136610]             Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[171117520]               Значения формальных параметров при вызове ←
 32505860[171120399]                 Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[171122301]                   Выражение ≡ Группы ФРОВ + Зелень ∙ 117[656081721] ←
 32505860[171120400]                 Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[171122302]                   Выражение ≡ Продукт Ид ∙ 65545[164299290] ←
      411[171117511]                     Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[171117512]                       Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      413[171115181]           И ←
      116[171116557]           Выражение ←
      116[171116568]             Выражение ←
      404[171136614]               Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[171117517]                 Уточняющий параметр ≡ Тип измерения ∙ 305[14745610] ←
  1638473[171118876]               Равно ←
      404[171136615]               Результат ≡ Весовой ∙ 131203073[17301506] ←
      412[171115106]             ИЛИ ←
      116[171116558]             Выражение ←
      404[171136611]               Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[171117513]                 Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[171117514]                   Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[171117515]                     Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[171117516]                       Уточняющий параметр ≡ Родитель ∙ 296[2] ←
  1638473[171118875]               Равно ←
      404[171136612]               Результат ≡ NonFood ∙ 117[165806295] ←
      413[171115217]           И ←
      404[171136803]           Результат ≡ Текущий пользователь - Шубин ∙ 117[165806084] ←
 12124192[164298756]     Шаблоны отчетов ←
 12124193[165347356]       Шаблон отчета • ===============базовые=============== ←
 12124193[164298768]       Шаблон отчета • Шаблон ⁼ [[Заголовок]]
<html>

<head>
  <meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
  <title>Список отправленных реестров документов на [Дата]</title>
  <style>
    td{border-left:solid 1px; border-top:solid 1px; border-bottom:solid 1px}
    td.noborder{border-left:none;border-top:none;border-bottom:none;border-right:none}
  </style>
</head>

<body>

<table style="height:242pt"><tr><td class=noborder>&nbsp</td></tr></table>

<table style="font-family:Calibri; font-weight:bold; table-layout:fixed; border-right:solid 1px"
       width="100%" cellspacing=0 cellpadding=4>

[[Строка]]
<tr style="height:252pt">
  <td class=noborder style="width:2.5%;"></td>
  <td align=left  style="width:46.5%;font-size:28pt;">[Имя товара]</br></br>
  <span style="font-size:20pt;font-weight:normal;">[Properties]</span></td>
  <td align=right style="width:51%;font-size:80pt;">[Цена товара]</td>
</tr>

[[Итого]]
</table>

</body>
</html>

 ←
  1507334[164298764]         Интерфейс ≡ HTML ∙ 486[3342337] ←
 12124195[164298767]         Блоки шаблона ←
 12124197[164298770]           Блок шаблона • Заголовок ←
 12124197[164298771]           Блок шаблона • Строка ←
 12124197[164298772]           Блок шаблона • Итого ←
 12124197[164298822]           Блок шаблона • Прем ←
 12124194[164298767]         Поля шаблона ←
 12124196[170918186]           Поле шаблона • ШК ≡ ШК ∙ 65545[170919342] ←
 12124196[170918185]           Поле шаблона • Строка для печати ШК ≡ Строка для печати ШК ∙ 65545[170919887] ←
 12124196[170918045]           Поле шаблона • Код акции (401....405) ≡ Код акции в шаблон ∙ 65545[170918674] ←
 12124196[170918043]           Поле шаблона • Макс колво по этой цене в сутки ≡ Максимальное количество по этой цене в сутки ∙ 65545[170918653] ←
 12124196[170918046]           Поле шаблона • Строка с кодом акцииъ ≡ Строка с кодом акции ∙ 65545[170918940] ←
 12124196[170918103]           Поле шаблона • Строка бзмж ≡ Строка с БЗМЖ ∙ 65545[170918941] ←
 12124196[170918104]           Поле шаблона • Строка с КУ ≡ Строка КУ ∙ 65545[170918841] ←
 12124196[170918044]           Поле шаблона • Макс колво по акции в сутки ≡ Максимальное количество по акции в сутки ∙ 65545[170918664] ←
 12124196[165348831]           Поле шаблона • действие акции ≡ Строка дата действия ∙ 65545[165350426] ←
 12124196[165348830]           Поле шаблона • ограничение ≡ Строка ограничения ∙ 65545[165350425] ←
 12124196[165348415]           Поле шаблона • БЗМЖ ≡ БЗМЖ ∙ 65545[165349839] ←
 12124196[170918102]           Поле шаблона • Енисей стандарт ≡ Енисейский стандарт ∙ 65545[170918832] ←
 12124196[165348416]           Поле шаблона • border ≡ border ∙ 65545[165349841] ←
 12124196[164298903]           Поле шаблона • Имя товара ≡ Наименование ∙ 65545[164299292] ←
 12124196[165347456]           Поле шаблона • Properties ≡ Продукт Ид ∙ 65545[164299290] ←
      411[165348209]             Уточняющий параметр ≡ Инструкция по применению ∙ 305[3342338] ←
 12124196[164298904]           Поле шаблона • Цена товара ≡ Цена ∙ 65545[164299293] ←
 12124196[165019889]           Поле шаблона • Цена целая ≡ Цена целая часть ∙ 65545[165021740] ←
 12124196[165019890]           Поле шаблона • Цена дробная ≡ Цена дробная часть ∙ 65545[165021741] ←
 12124196[164298761]           Поле шаблона • Цена старая ≡ Цена 2 ∙ 65545[164299277] ←
 12124196[165019891]           Поле шаблона • Цена2 целая ≡ Цена 2 целая часть ∙ 65545[165021742] ←
 12124196[165019892]           Поле шаблона • Цена2 дробная ≡ Цена 2 дробная часть ∙ 65545[165021743] ←
 12124196[164300326]           Поле шаблона • Весы 1 ≡ Код для весов стр ∙ 65545[164303883] ←
 12124196[164300585]           Поле шаблона • Ид ≡ Стр инфо ∙ 117[164299120] ←
 37158946[164298760]         Метка поля ←
 37158944[164298765]           Открывающие символы ⁼ [ ←
 37158945[164298765]           Закрывающие символы ⁼ ] ←
 37158947[164298759]         Метка блока ←
 37158944[164298766]           Открывающие символы ⁼ [[ ←
 37158945[164298766]           Закрывающие символы ⁼ ]] ←
 12124193[165347423]       Шаблон отчета • ===============Юрины шаблоны одиночные (тип ценника 2)=============== ←
 12124193[164298756]       Шаблон отчета • Шаблон без акций ≡ Шаблон ∙ 12124193[164298768] ⁼ [[Заголовок]]
<html>

<head>
  <meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
  <title>Палетный ценник 1</title>
  <style>
    @page { margin-left: 1cm; margin-right: 1cm; margin-top: 0.5cm; margin-bottom: 0.5cm; padding: 0 0 0 0;}
    
  </style>
</head>

<body>
<!-- [ИД] -->

[[Итого]]
<table width="100%" cellspacing=0 cellpadding=0 border=0>
<tr>
  <td width="50%" height="300">&nbsp</td>
  <td width="35%">&nbsp</td>
  <td width="15%">&nbsp</td>
</tr>

<tr>
  <td height="280" colspan=2 align=center style="font-size:[Шрифт 1]pt;line-height:85%">
    <font face="Calibri">
      <span style="font-weight:bold;">[Имя товара]</span></br></br>
      <span style="font-weight:normal;">[Properties]</span>
    </font>
  </td>
  <td align=center valign=center>&nbsp
     [Весы 1]
[Строка для печати ШК]
  </td>
</tr>

<tr>
  <td colspan=3 align=center valign=top style="font-size:200pt;line-height:75%">
    <font face="Impact">
    <b><span>[Цена целая]</span><span style="font-size:100pt">[Цена дробная]</span></b>
    </font>
  </td>
</tr>
[Строка с КУ]
[Строка бзмж]
[Енисей стандарт]
[Строка ограничения]
<tr>
  <td colspan=3 align=center valign=top style="font-size:16pt;line-height:75%">
    <font face="Calibri">
    <b>[До]</b>
    </font>
  </td>
</tr>
[Строка с кодом акцииъ]


</table>

</body>
</html>
 ←
 12124194[164298756]         Поля шаблона ←
  1507367[164298755]           <Наследуемые поля> ←
 12124196[170917965]           Поле шаблона • Строка ограничения ≡ Строка ограничения ∙ 65545[165350425] ←
 12124196[170917932]           Поле шаблона • До ≡ Стр до ∙ 65545[164303637] ←
 12124196[164298764]           Поле шаблона • Линия 1 ≡ Линия 1 ∙ 65545[164299280] ←
 12124196[164298905]           Поле шаблона • Линия 2 ≡ Линия 2 ∙ 65545[164299281] ←
 12124196[164299210]           Поле шаблона • Шрифт 1 ≡ Шрифт 1 ∙ 65545[164299305] ←
 12124196[164300168]           Поле шаблона • Дата ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
 32505862[164299037]             Значения формальных параметров при вызове ←
 32505860[164299352]               Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[164300061]                 Выражение ≡ Сегодня, начало дня ∙ 249[2293761] ←
 32505860[164299710]               Значение параметра при вызове процедуры/функции ≡ Формат ∙ 65545[30868172] ←
   327700[164300062]                 Выражение ≡ Формат DD.MM.YYYY ∙ 117[164299129] ←
 12124193[165347409]       Шаблон отчета • Шаблон премия ≡ Шаблон ∙ 12124193[164298768] ⁼ 
[[Заголовок]]
<html>

<head>
  <meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
  <title>Палетный ценник 2</title>
  <style>
    @page { margin-left: 1cm; margin-right: 1cm; margin-top: 0.5cm; margin-bottom: 0.5cm; padding: 0 0 0 0;}
  </style>
</head>

<body>


[[Итого]]
<table width="100%" cellspacing=0 cellpadding=0 border=0>
<tr>
  <td width="55%" height="340">&nbsp</td>
  <td width="30%">&nbsp</td>
  <td width="15%">&nbsp</td>
</tr>

<tr>
  <td height="170" colspan=3 align=center style="font-size:32pt;line-height:75%">
    <font face="Calibri">
      <span style="font-weight:bold;">[Имя товара]</span></br>
      <span style="font-weight:normal;font-size:28pt;">[Properties]</span>
    </font>
  </td>
  <td align=center valign=center>&nbsp
     [Весы 1]
  </td>
</tr>

<tr>
  <td colspan=3 align=center style="font-size:30pt; font-family:Calibri;"><b>ЦЕНА: &nbsp</b>
    <font face="Impact"><b><span>[Цена целая]</span><span style="font-size:15pt">[Цена дробная]</span></b>
    </font>
  </td>
</tr>

<tr>
<td colspan=3 align=center style="font-size:30pt; font-family:Calibri;line-height:75%"><b>ПРЕМИЯ:</b></td>
</tr>

<tr>
    <td height="180" colspan=3 align=center style="line-height:75%">
    <font face="Impact" style="font-size:200pt"><b>[Проц]</b></font>
  </td>
</tr>

<tr>
  <td colspan=3>[БЗМЖ][Макс колво по акции в сутки]</td>
  <td align=right valign=bottom style="font-size:40pt;line-height:75%">
    <font face="Calibri">
    <b>[Колво]&nbsp</b>
    </font>
  </td>
</tr>

<tr>
  <td colspan=3 align=center valign=top style="font-size:16pt;line-height:75%">
    <font face="Calibri">
    <b>[До]</b>
    </font>
  </td>
</tr>
[Енисей стандарт]
[Строка с кодом акцииъ]
</table>

</body>
</html>
 ←
 12124194[165347408]         Поля шаблона ←
  1507367[165347374]           <Наследуемые поля> ←
 12124196[165348897]           Поле шаблона • Линия 1 ≡ Линия 1 ∙ 65545[164299280] ←
 12124196[165348898]           Поле шаблона • Линия 2 ≡ Линия 2 ∙ 65545[164299281] ←
 12124196[165348899]           Поле шаблона • Шрифт 1 ≡ Шрифт 1 ∙ 65545[164299305] ←
 12124196[165348900]           Поле шаблона • Проц ≡ Проц ∙ 65545[164301601] ←
 12124196[165348901]           Поле шаблона • Колво ≡ Колво ∙ 65545[164301602] ←
 12124196[165348902]           Поле шаблона • До ≡ Стр до ∙ 65545[164303637] ←
 12124196[165348904]           Поле шаблона • Дата ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
 32505862[165350211]             Значения формальных параметров при вызове ←
 32505860[165353017]               Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[165354892]                 Выражение ≡ Сегодня, начало дня ∙ 249[2293761] ←
 32505860[165353018]               Значение параметра при вызове процедуры/функции ≡ Формат ∙ 65545[30868172] ←
   327700[165354893]                 Выражение ≡ Формат DD.MM.YYYY ∙ 117[164299129] ←
 12124193[165347408]       Шаблон отчета • Шаблон скидка ≡ Шаблон ∙ 12124193[164298768] ⁼ [[Заголовок]]
<html>

<head>
  <meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
  <title>Палетный ценник акция</title>
  <style>
    @page { margin-left: 1cm; margin-right: 1cm; margin-top: 0.5cm; margin-bottom: 0.5cm; padding: 0 0 0 0;}
  </style>
</head>

<body>

[[Итого]]
<table width="100%" cellspacing=0 cellpadding=0 border=0>
<tr>
  <td width="55%" height="330">&nbsp</td>
  <td width="30%">&nbsp</td>
  <td width="15%">&nbsp</td>
</tr>

<tr>
  <td height="180" colspan=3 align=center style="font-size:32pt;line-height:75%">
    <font face="Calibri">
      <span style="font-weight:bold;">[Имя товара]</span></br>
      <span style="font-weight:normal;font-size:26pt;">[Properties]</span>
    </font>
  </td>
  <td align=center valign=center>&nbsp
     [Весы 1]
[Строка для печати ШК]
  </td>
</tr>

<tr>
  <td colspan=3 align=center style="font-size:14pt; font-family:Calibri;">[Строка 1]&nbsp
    <font face="Impact" style="font-size:30pt;"><b><span>[Цена2 целая]</span><span style="font-size:15pt">[Цена2 дробная]</span></b>
    </font>
  </td>
</tr>

<tr>
  <td colspan=3 align=center style="font-size:24pt;">
    <font face="Calibri">
    <b>[Строка 2]</b>
    </font>
  </td>
  <td>&nbsp</td>
</tr>

<tr>
  <td height="210" colspan=3 align=center valign=bottom style="font-size:170pt;line-height:75%">
    <font face="Impact">
    <b><span>[Цена целая]</span><span style="font-size:100pt">[Цена дробная]</span></b>
    </font>
  </td>
</tr>
 [Строка с КУ]
<tr height="10">
  <td colspan=3>[БЗМЖ][Макс колво по этой цене в сутки]</td>
  <td align=right valign=bottom style="font-size:34pt;line-height:75%">
    <font face="Calibri">
    <b>[Колво]</b>
    </font>
  </td>
</tr>

<tr>
  <td colspan=3 align=center valign=top style="font-size:14pt;line-height:75%">
    <font face="Calibri">
    <b>[До]</b>
    </font>
  </td>
</tr>

[Енисей стандарт]

[Строка с кодом акцииъ]

</table>
</body>
</html>
 ←
 12124194[165347407]         Поля шаблона ←
  1507367[165347336]           <Наследуемые поля> ←
 12124196[165348886]           Поле шаблона • Линия 1 ≡ Линия 1 ∙ 65545[164299280] ←
 12124196[165348887]           Поле шаблона • Линия 2 ≡ Линия 2 ∙ 65545[164299281] ←
 12124196[165348888]           Поле шаблона • Шрифт 1 ≡ Шрифт 1 ∙ 65545[164299305] ←
 12124196[165348889]           Поле шаблона • Проц ≡ Проц ∙ 65545[164301601] ←
 12124196[165348890]           Поле шаблона • Колво ≡ Колво ∙ 65545[164301602] ←
 12124196[165348891]           Поле шаблона • До ≡ Стр до ∙ 65545[164303637] ←
 12124196[165348893]           Поле шаблона • Дата ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
 32505862[165349511]             Значения формальных параметров при вызове ←
 32505860[165347641]               Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[165347808]                 Выражение ≡ Сегодня, начало дня ∙ 249[2293761] ←
 32505860[165352460]               Значение параметра при вызове процедуры/функции ≡ Формат ∙ 65545[30868172] ←
   327700[165354157]                 Выражение ≡ Формат DD.MM.YYYY ∙ 117[164299129] ←
 12124196[165348894]           Поле шаблона • Строка 1 ≡ Строка 1 ∙ 65545[164304987] ←
 12124196[165348895]           Поле шаблона • Строка 2 ≡ Строка 2 ∙ 65545[164304276] ←
 32505861[164298781]     Формальные параметры ←
    65545[656085780]       Локальная переменная • ~Автоматическая ≡ Целое ∙ 107[2] ←
      355[656082071]         Начальное значение ⁼ 0 ←
    65545[164299270]       Локальная переменная • ~Тип ценника (1-сборный ценник / 2 - одиночный ценник) ≡ Целое ∙ 107[2] ←
      355[656082070]         Начальное значение ⁼ 2 ←
    65545[164299297]       Локальная переменная • ~Список выбранных продуктов ≡ Список продуктов ∙ 107[1507334] ←
      355[656082069]         Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164299634]       Локальная переменная • ~ДокументИд ≡ Документ ∙ 107[8] ←
      355[164298898]         Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164303325]       Локальная переменная • ~Колво дней до акции ≡ Целое ∙ 107[2] ←
      355[164299793]         Начальное значение ⁼ 0 ←
 30867483[164298761]     Локальные таблицы ←
 30867458[164298763]       Локальная таблица • Список товаров ←
 11010090[164298763]         Структура (Поля, сортировка, генерируемые события) ←
 30867481[656081144]           Блок (при отборе данных будет генерироваться это событие) • Группа по 30 ←
 30867475[656082246]             Параметр ≡ Номер тридцатки ∙ 65545[656085782] ←
 30867476[656081445]               Сортировать по возрастанию ←
 30867475[164298797]           Параметр ≡ Наименование ∙ 65545[164299292] ←
 30867476[164298763]             Сортировать по возрастанию ←
 30867475[170917989]           Параметр ≡ Количество ценников ∙ 65545[165347551] ←
 30867475[164298798]           Параметр ≡ Цена ∙ 65545[164299293] ←
 30867475[164823074]           Параметр ≡ Продукт Ид ∙ 65545[164299290] ←
  1507413[656080959]     Блоки действий ←
 30867469[656082351]       БЛОК • Ок-месседж на экран и выход ←
 39780361[656081352]         ЗАВЕРШИТЬ БЛОК ≡ ~Автоматическая ∙ 65545[656085780] ←
 11010088[656083562]         ВЫПОЛНИТЬ ≡ ShowOkMsg ∙ 127[39780363] ←
 11010095[656082314]           Выражение ←
      404[656104076]             Результат ≡ Строка - текст ошибки ∙ 65545[656085781] ←
 11010100[164298782]         BREAK ←
 30867469[656082352]       БЛОК • Ок-месседж на экран ←
 39780361[656081353]         ЗАВЕРШИТЬ БЛОК ≡ ~Автоматическая ∙ 65545[656085780] ←
 11010088[656083563]         ВЫПОЛНИТЬ ≡ ShowOkMsg ∙ 127[39780363] ←
 11010095[656082315]           Выражение ←
      404[656104103]             Результат ≡ Строка - текст ошибки ∙ 65545[656085781] ←
 30867469[164299698]       БЛОК • Файл ←
 11010080[164308320]         = ≡ Файл ∙ 65545[164299299] ←
      404[164323534]           Результат ⁼ c:\domino8\home\palet ←
      404[164323537]           Результат ≡ Случайное число (7 знаков) ∙ 117[1507630] ←
      404[164323538]           Результат ⁼ '_' ←
      404[164323535]           Результат ≡ Кол-во листов ∙ 65545[164299302] ←
      404[164323536]           Результат ⁼ .doc ←
 30867469[164299688]       БЛОК • строки по премии ←
 11010080[164312229]         = ≡ Строка 1 ∙ 65545[164304987] ←
      404[164333950]           Результат ⁼ 'ЦЕНА БЕЗ КАРТЫ ПРЕМИЯ:' ←
 11010080[164312230]         = ≡ Строка 2 ∙ 65545[164304276] ←
      404[164333951]           Результат ⁼ 'ЦЕНА ПО КАРТЕ ПРЕМИЯ:' ←
 30867469[164299542]       БЛОК • премия ←
 30867470[164302085]         IF ←
  1638463[164302837]           Условие ←
      404[164311928]             Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164305085]               Уточняющий параметр ≡ Сумма ∙ 359[33619978] ←
  1638479[164299736]             Не равно ←
  1638402[164301271]             NULL ←
 30867472[164302065]           THEN ←
 11010080[164312242]             = ≡ Целое ∙ 65545[164301603] ←
      404[164312105]               Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164305091]                 Уточняющий параметр ≡ Сумма ∙ 359[33619978] ←
 11010080[164312243]             = ≡ Проц ∙ 65545[164301601] ←
      404[164319657]               Результат ≡ Целое ∙ 65545[164301603] ←
  1638487[164299082]               Конкатенировать строки ←
      404[164319658]               Результат ⁼ '%' ←
 30867470[164302086]         IF ←
  1638463[164302838]           Условие ←
      404[164319668]             Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164305092]               Уточняющий параметр ≡ Сумма по цене по накладной поставщика ∙ 359[14286862] ←
  1638479[164299737]             Не равно ←
  1638402[164301272]             NULL ←
 30867472[164302066]           THEN ←
 11010080[164312244]             = ≡ Целое ∙ 65545[164301603] ←
      404[164319669]               Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164305093]                 Уточняющий параметр ≡ Сумма по цене по накладной поставщика ∙ 359[14286862] ←
 11010080[164312245]             = ≡ Проц ∙ 65545[164301601] ←
      404[164325912]               Результат ≡ Целое ∙ 65545[164301603] ←
  1638487[164299083]               Конкатенировать строки ←
      404[164325913]               Результат ⁼ 'p' ←
 30867469[164300152]       БЛОК • цена 2 ←
 11010080[164306591]         = ≡ Цена 2 ∙ 65545[164299277] ←
      404[164320184]           Результат ≡ Цена ∙ 65545[164299293] ←
 11010080[164307166]         = ≡ Цена ∙ 65545[164299293] ←
      404[164320195]           Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 30867469[164300151]       БЛОК • колво по акции ←
 11010093[170918025]         Комментарий • Проверим для фишечной акции параметры, если есть - используем их ←
 11010080[170919494]         = ≡ Сколько купить для получения фишки ∙ 65545[170919293] ←
  1638402[170918810]           NULL ←
 39780361[170918051]         ЗАВЕРШИТЬ БЛОК ←
      116[170919901]           Выражение ←
      404[170925398]             Результат ≡ Сколько купить для получения фишки ∙ 65545[170919293] ←
  1638479[170918224]             Не равно ←
  1638402[170918811]             NULL ←
 30867470[164299039]         IF ←
  1638463[164299140]           Условие ←
      404[164302969]             Результат ≡ Целое ∙ 65545[164301603] ←
  1638473[164299463]             Равно ←
  1638402[164299022]             NULL ←
 30867472[164299036]           THEN ←
 11010080[164312240]             = ≡ Колво ∙ 65545[164301602] ←
      404[164302970]               Результат ≡ NULL ∙ 117[30670850] ←
 11010080[170920830]             = ≡ Максимальное количество по этой цене в сутки ∙ 65545[170918653] ←
  1638402[170918439]               NULL ←
 11010080[170920530]             = ≡ Максимальное количество по акции в сутки ∙ 65545[170918664] ←
  1638402[170918440]               NULL ←
 30867473[164298864]           ELSE ←
 11010080[170920832]             = ≡ Максимальное количество по этой цене в сутки ∙ 65545[170918653] ←
      404[170925790]               Результат ⁼ МАКСИМАЛЬНОЕ КОЛИЧЕСТВО ПО ЭТОЙ ЦЕНЕ В СУТКИ ←
 30867470[170919010]             IF ←
  1638463[170919312]               Условие ←
      116[170919900]                 Выражение ←
      404[170931183]                   Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[170920439]                   Равно ←
      404[170931184]                   Результат ⁼ 22 ←
 30867472[170919004]               THEN ←
 11010080[170922296]                 = ≡ Максимальное количество по этой цене в сутки ∙ 65545[170918653] ←
      404[170931187]                   Результат ⁼ ЦЕНА ДЕЙСТВУЕТ ПРИ ПОКУПКЕ ОТ  ←
 11010080[170920833]             = ≡ Максимальное количество по акции в сутки ∙ 65545[170918664] ←
      404[170925029]               Результат ⁼ МАКСИМАЛЬНОЕ КОЛИЧЕСТВО ПО АКЦИИ В СУТКИ ←
 30867470[164301778]             IF ←
  1638463[164302484]               Условие ←
      404[164302903]                 Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[164304771]                   Уточняющий параметр ≡ ЕИ ∙ 305[14745607] ←
  1638473[164306522]                 Равно ←
      404[164325635]                 Результат ≡ Штука ∙ 131108[28049409] ←
 30867472[164301755]               THEN ←
 11010080[164307165]                 = ≡ Колво ∙ 65545[164301602] ←
      404[164331002]                   Результат ≡ Целое ∙ 65545[164301603] ←
  1638487[164299084]                   Конкатенировать строки ←
      404[164331003]                   Результат ⁼ шт ←
 30867470[170918485]                 IF ←
  1638463[170918638]                   Условие ←
      116[170919009]                     Выражение ←
      404[170925809]                       Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[170919297]                       Равно ←
      404[170925813]                       Результат ⁼ 401 ←
      412[170918280]                     ИЛИ ←
      116[170919010]                     Выражение ←
      404[170925814]                       Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[170919298]                       Равно ←
      404[170925815]                       Результат ⁼ 402 ←
      412[170918281]                     ИЛИ ←
      116[170919011]                     Выражение ←
      404[170925816]                       Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[170919299]                       Равно ←
      404[170925817]                       Результат ⁼ 403 ←
      412[170918282]                     ИЛИ ←
      116[170918738]                     Выражение ←
      404[170926688]                       Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[170918895]                       Равно ←
      404[170926689]                       Результат ⁼ 407 ←
      412[170918225]                     ИЛИ ←
      116[170919012]                     Выражение ←
      404[170925818]                       Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[170919300]                       Равно ←
      404[170925819]                       Результат ⁼ 404 ←
      412[170918283]                     ИЛИ ←
      116[170919013]                     Выражение ←
      404[170925820]                       Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[170919301]                       Равно ←
      404[170925821]                       Результат ⁼ 405 ←
 30867472[170918479]                   THEN ←
 11010080[170920856]                     = ≡ Строка ограничения ∙ 65545[165350425] ←
      404[170925822]                       Результат ⁼ '<tr><td colspan=3 align=center>МАКСИМАЛЬНОЕ КОЛИЧЕСТВО ПО АКЦИИ В СУТКИ ' ←
      404[170925823]                       Результат ⁼ <span style="font-size:40pt"> ←
      404[170925824]                       Результат ≡ Колво ∙ 65545[164301602] ←
      404[170925825]                       Результат ⁼ <span> ←
      404[170925826]                       Результат ⁼ </td></tr> ←
 30867473[164299831]               ELSE ←
 11010080[164307167]                 = ≡ Колво ∙ 65545[164301602] ←
      404[164331017]                   Результат ≡ Целое ∙ 65545[164301603] ←
  1638487[164299085]                   Конкатенировать строки ←
      404[164331018]                   Результат ⁼ кг ←
 30867470[170918564]                 IF ←
  1638463[170918739]                   Условие ←
      116[170919014]                     Выражение ←
      404[170925827]                       Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[170919302]                       Равно ←
      404[170925828]                       Результат ⁼ 401 ←
      412[170918284]                     ИЛИ ←
      116[170919015]                     Выражение ←
      404[170925829]                       Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[170919303]                       Равно ←
      404[170925830]                       Результат ⁼ 402 ←
      412[170918285]                     ИЛИ ←
      116[170919016]                     Выражение ←
      404[170925831]                       Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[170919304]                       Равно ←
      404[170925832]                       Результат ⁼ 403 ←
      412[170918286]                     ИЛИ ←
      116[170918739]                     Выражение ←
      404[170926704]                       Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[170918896]                       Равно ←
      404[170926706]                       Результат ⁼ 407 ←
      412[170918406]                     ИЛИ ←
      116[170919017]                     Выражение ←
      404[170925833]                       Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[170919305]                       Равно ←
      404[170925834]                       Результат ⁼ 404 ←
      412[170918287]                     ИЛИ ←
      116[170919018]                     Выражение ←
      404[170925835]                       Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[170919306]                       Равно ←
      404[170925836]                       Результат ⁼ 405 ←
 30867472[170918558]                   THEN ←
 11010080[170920863]                     = ≡ Строка ограничения ∙ 65545[165350425] ←
      404[170925837]                       Результат ⁼ '<tr><td colspan=3 align=center>МАКСИМАЛЬНОЕ КОЛИЧЕСТВО ПО АКЦИИ В СУТКИ ' ←
      404[170925838]                       Результат ⁼ <span style="font-size:40pt"> ←
      404[170925839]                       Результат ≡ Колво ∙ 65545[164301602] ←
      404[170925840]                       Результат ⁼ <span> ←
      404[170925841]                       Результат ⁼ </td></tr> ←
 30867469[164300028]       БЛОК • дейстует до ←
 11010080[164308073]         = ≡ Стр до ∙ 65545[164303637] ←
      404[164331007]           Результат ⁼ 'Действует: ' ←
 30867470[164301777]         IF ←
  1638463[164302483]           Условие ←
      404[164331008]             Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164304748]               Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164304761]                 Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638479[164299764]             Не равно ←
      404[164331009]             Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164304762]               Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164304764]                 Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 30867472[164301754]           THEN ←
 11010080[164308074]             = ≡ Стр до ∙ 65545[164303637] ←
      404[164331010]               Результат ≡ Стр до ∙ 65545[164303637] ←
      404[164331011]               Результат ⁼ 'с ' ←
      404[164331012]               Результат ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
 32505862[164301476]                 Значения формальных параметров при вызове ←
 32505860[164304694]                   Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[164308166]                     Выражение ≡ Строка промо ∙ 65545[164303326] ←
      411[164304765]                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164304766]                         Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
 32505860[164304702]                   Значение параметра при вызове процедуры/функции ≡ Формат ∙ 65545[30868172] ←
   327700[164308174]                     Выражение ⁼ D!DD.MM.YY ←
      404[164331013]               Результат ⁼ ' по ' ←
      404[164331014]               Результат ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
 32505862[164301477]                 Значения формальных параметров при вызове ←
 32505860[164304703]                   Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[164308175]                     Выражение ≡ Строка промо ∙ 65545[164303326] ←
      411[164304767]                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164304768]                         Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 32505860[164304704]                   Значение параметра при вызове процедуры/функции ≡ Формат ∙ 65545[30868172] ←
   327700[164308176]                     Выражение ⁼ D!DD.MM.YY ←
 30867473[164299469]           ELSE ←
 11010080[164308075]             = ≡ Стр до ∙ 65545[164303637] ←
      404[164331015]               Результат ≡ Стр до ∙ 65545[164303637] ←
      404[164331016]               Результат ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
 32505862[164301478]                 Значения формальных параметров при вызове ←
 32505860[164304705]                   Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[164308177]                     Выражение ≡ Строка промо ∙ 65545[164303326] ←
      411[164304769]                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164304770]                         Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 32505860[164304706]                   Значение параметра при вызове процедуры/функции ≡ Формат ∙ 65545[30868172] ←
   327700[164308178]                     Выражение ⁼ D!DD.MM.YY ←
 30867469[165020003]       БЛОК • разбить цены ←
 11010088[165021209]         ВЫПОЛНИТЬ ≡ Выделить целую и дробную части ∙ 249[165019662] ←
 32505862[165021000]           Значения формальных параметров при вызове ←
 32505860[165022715]             Значение параметра при вызове процедуры/функции ≡ Число на вход ∙ 65545[165021712] ←
   327700[165024006]               Выражение ≡ Цена ∙ 65545[164299293] ←
 32505860[165022716]             Значение параметра при вызове процедуры/функции ≡ Целая часть (возврат) ∙ 65545[165021713] ←
   327700[165024007]               Выражение ≡ Цена целая часть ∙ 65545[165021740] ←
 32505860[165022717]             Значение параметра при вызове процедуры/функции ≡ Дробная часть (возврат) ∙ 65545[165021714] ←
   327700[165024008]               Выражение ≡ Цена дробная часть ∙ 65545[165021741] ←
 11010088[165021210]         ВЫПОЛНИТЬ ≡ Выделить целую и дробную части ∙ 249[165019662] ←
 32505862[165021001]           Значения формальных параметров при вызове ←
 32505860[165022718]             Значение параметра при вызове процедуры/функции ≡ Число на вход ∙ 65545[165021712] ←
   327700[165024009]               Выражение ≡ Цена 2 ∙ 65545[164299277] ←
 32505860[165022719]             Значение параметра при вызове процедуры/функции ≡ Целая часть (возврат) ∙ 65545[165021713] ←
   327700[165024010]               Выражение ≡ Цена 2 целая часть ∙ 65545[165021742] ←
 32505860[165022720]             Значение параметра при вызове процедуры/функции ≡ Дробная часть (возврат) ∙ 65545[165021714] ←
   327700[165024011]               Выражение ≡ Цена 2 дробная часть ∙ 65545[165021743] ←
 30867470[165020556]         IF ←
  1638463[165020931]           Условие ←
      404[165033800]             Результат ≡ Цена ∙ 65545[164299293] ←
 30867472[165020556]           THEN ←
 11010080[165023536]             = ≡ Цена дробная часть ∙ 65545[165021741] ←
      404[165033801]               Результат ⁼ '.' ←
      404[165033802]               Результат ≡ Цена дробная часть ∙ 65545[165021741] ←
 30867470[165020557]         IF ←
  1638463[165020932]           Условие ←
      404[165033803]             Результат ≡ Цена 2 ∙ 65545[164299277] ←
 30867472[165020557]           THEN ←
 11010080[165023537]             = ≡ Цена 2 дробная часть ∙ 65545[165021743] ←
      404[165033804]               Результат ⁼ '.' ←
      404[165033805]               Результат ≡ Цена 2 дробная часть ∙ 65545[165021743] ←
 30867470[165348964]         IF ←
  1638463[165349437]           Условие ←
      116[165349867]             Выражение ←
      404[165370969]               Результат ≡ Цена ∙ 65545[164299293] ←
  1638477[165347638]               Больше или равно ←
      404[165370968]               Результат ≡ Цена 2 ∙ 65545[164299277] ←
      413[165347905]             И ←
      404[165352586]             Результат ≡ По продукту есть акция ∙ 65545[164299635] ←
      413[165347907]             И ←
      116[165349869]             Выражение ←
      116[165349870]               Выражение ←
      404[165371195]                 Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[165348385]                 Равно ←
      404[165371196]                 Результат ⁼ 1 ←
      412[165347474]               ИЛИ ←
      116[165349871]               Выражение ←
      404[165371197]                 Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[165350048]                 Равно ←
      404[165371198]                 Результат ⁼ 8 ←
      412[165347895]               ИЛИ ←
      116[165349872]               Выражение ←
      404[165371199]                 Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[165350049]                 Равно ←
      404[165371200]                 Результат ⁼ 10 ←
      412[165347897]               ИЛИ ←
      116[165349873]               Выражение ←
      404[165371201]                 Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[165350050]                 Равно ←
      404[165371202]                 Результат ⁼ 19 ←
      412[165347898]               ИЛИ ←
      116[165349874]               Выражение ←
      404[165371203]                 Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[165350051]                 Равно ←
      404[165371204]                 Результат ⁼ 20 ←
      412[165347899]               ИЛИ ←
      116[165349875]               Выражение ←
      404[165371205]                 Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[165350052]                 Равно ←
      404[165371206]                 Результат ⁼ 21 ←
      412[165347900]               ИЛИ ←
      116[165349876]               Выражение ←
      404[165371207]                 Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[165350053]                 Равно ←
      404[165371208]                 Результат ⁼ 31 ←
      412[171311147]               ИЛИ ←
      116[171311226]               Выражение ←
      404[171312024]                 Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[171311367]                 Равно ←
      404[171312025]                 Результат ≡ NULL ∙ 117[30670850] ←
 30867472[165348958]           THEN ←
 11010088[171311232]             ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
 11010095[171311159]               Выражение ←
      404[171312042]                 Результат ⁼ Обратитесь в отдел маркетинга! Акционная цена больше или равна обычной цене. ←
 11010101[171311105]             EXIT ←
 30867469[171311175]       БЛОК • Сообщение, что цены по акции равны или больше текущих ←
 11010088[171311233]         ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[171311160]           Выражение ←
      404[171312043]             Результат ⁼ 'Обратитесь в отдел маркетинга! Акционная цена больше или равна обычной цене. ' ←
      404[171312044]             Результат ≡ Наименование ∙ 65545[164299292] ←
 30867469[170917895]       БЛОК • выводим сообщение об окончании, если не автоматом ←
 30867470[171311183]         IF ←
  1638463[171311214]           Условие ←
      404[171312045]             Результат ≡ Количество ценников temp ∙ 65545[170918833] ←
  1638476[171311110]             Меньше ←
      404[171312046]             Результат ⁼ 1 ←
 30867472[171311184]           THEN • ни одного ценника ←
 11010080[170917912]             = ≡ Строка - текст ошибки ∙ 65545[656085781] ←
      404[170918051]               Результат ⁼ 'Ценники напечатаны не будут! |Возможно, цены по акции больше или равны регулярным.' ←
 30867473[171311135]           ELSE • есть ценники ←
 11010080[171311370]             = ≡ Строка - текст ошибки ∙ 65545[656085781] ←
      404[171312047]               Результат ⁼ Напечатано: ←
      404[171312048]               Результат ≡ Количество ценников temp ∙ 65545[170918833] ←
      404[171312049]               Результат ⁼ ' страниц, ' ←
      404[171312050]               Результат ≡ Множество.Количество элементов ∙ 387[1507487] ←
   327700[171311428]                 Выражение ≡ ~Список выбранных продуктов ∙ 65545[164299297] ←
      404[171312051]               Результат ⁼  товар(ов) ←
  1507410[170918025]         ВЫПОЛНИТЬ БЛОК ≡ Ок-месседж на экран ∙ 30867469[656082352] ←
 30867463[164298790]     Выполнить действия ←
 30867469[165347370]       БЛОК • Инициализация ←
 39780361[656081351]         ЗАВЕРШИТЬ БЛОК ←
      116[656082489]           Выражение ←
      116[656082494]             Выражение ←
  1638460[656081408]               НЕ ←
      404[656104064]               Результат ≡ ~Список выбранных продуктов ∙ 65545[164299297] ←
      413[656083020]             И ←
      116[656082495]             Выражение ←
  1638460[656081409]               НЕ ←
      404[656104074]               Результат ≡ ~ДокументИд ∙ 65545[164299634] ←
 11010080[656089418]         = ≡ ДокументИд ∙ 65545[164299288] ←
      404[656104221]           Результат ≡ ~ДокументИд ∙ 65545[164299634] ←
 11010093[656082559]         Комментарий • ---------------  если список товаров пуст, взять из документа ←
 30867470[656082849]         IF ←
  1638463[656083222]           Условие ←
      116[656082498]             Выражение ←
      404[656104085]               Результат ≡ ~Список выбранных продуктов ∙ 65545[164299297] ←
  1638473[656083707]               Равно ←
  1638402[656081810]               NULL ←
      413[656083022]             И ←
      116[656082499]             Выражение ←
      404[656104086]               Результат ≡ ~ДокументИд ∙ 65545[164299634] ←
  1638479[656081367]               Не равно ←
  1638402[656081811]               NULL ←
 30867472[656082840]           THEN • составим список товаров по документу ←
 11010080[164299846]             = ≡ ДокументИд ∙ 65545[164299288] ←
      404[164301220]               Результат ≡ ~ДокументИд ∙ 65545[164299634] ←
  1507360[656081666]             Отбор данных (по запросу) • Строки документа ←
 12124213[656081238]               Параметры ←
  1507335[656081599]                 Параметр • товар ∙ 12124204[656081434] ←
  1507494[656084147]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1507673[656081107]               Ключи оптимизации ←
  1507675[656081136]                 Использовать индекс ∙ 12124204[656081434] ←
  1507676[656081142]                   Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
 12124200[656081226]               From         (Таблицы) ←
 12124204[656081434]                 Таблица ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[656081410]               Where      (Ограничения на отбор данных) ←
  1507376[656083186]                 Выражение ←
  1507455[656083456]                   Результат ∙ 12124204[656081434] ←
  1507494[656084144]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638473[656083708]                   Равно ←
  1507452[656081970]                   Константа ≡ ДокументИд ∙ 65545[164299288] ←
  1507376[656083187]                 Выражение ←
  1507455[656083457]                   Результат ∙ 12124204[656081434] ←
  1507494[656084146]                     Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[656083709]                   Равно ←
  1638402[656081812]                   NULL ←
 30867466[656081920]               Выполнить после получения записи ←
 11010080[656089374]                 = ≡ Продукт Ид ∙ 65545[164299290] ←
      404[656104089]                   Результат ≡ товар ∙ 1507335[656081599] ←
 11010080[656089372]                 = ≡ ~Список выбранных продуктов ∙ 65545[164299297] ←
      404[656104087]                   Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[656081046]                     Список элементов ←
   327700[656087730]                       Выражение ≡ ~Список выбранных продуктов ∙ 65545[164299297] ←
   327700[656087731]                       Выражение ≡ Продукт Ид ∙ 65545[164299290] ←
 11010093[656082555]         Комментарий • ---------------  если список товаров не пуст, обработаем его ←
 30867470[656082846]         IF ←
  1638463[656083219]           Условие ←
      404[656104075]             Результат ≡ ~Список выбранных продуктов ∙ 65545[164299297] ←
 30867472[656082837]           THEN • обработка списка товаров ←
 11010080[164299808]             = ≡ Кол-во товаров ∙ 65545[656085785] ←
      404[164301145]               Результат ≡ Множество.Количество элементов ∙ 387[1507487] ←
   327700[164299482]                 Выражение ≡ ~Список выбранных продуктов ∙ 65545[164299297] ←
 11010093[656082556]             Комментарий • ----  если список пуст (в данном случае такого не бывает) или список больше 30 товаров - прерваться ←
 30867470[164298940]             IF ←
  1638463[164299001]               Условие ←
      404[164301086]                 Результат ≡ Кол-во товаров ∙ 65545[656085785] ←
  1638476[164298782]                 Меньше ←
      404[164301114]                 Результат ⁼ 1 ←
 30867472[164298939]               THEN ←
 11010080[656089367]                 = ≡ Строка - текст ошибки ∙ 65545[656085781] ←
      404[656104077]                   Результат ⁼ 'Товар не выбран!' ←
  1507410[656081412]                 ВЫПОЛНИТЬ БЛОК ≡ Ок-месседж на экран и выход ∙ 30867469[656082351] ←
 30867473[656081417]           ELSE • не выбраны товары ←
 11010080[656089373]             = ≡ Строка - текст ошибки ∙ 65545[656085781] ←
      404[656104088]               Результат ⁼ 'Товар не выбран!' ←
  1507410[656081417]             ВЫПОЛНИТЬ БЛОК ≡ Ок-месседж на экран и выход ∙ 30867469[656082351] ←
 11010093[656082557]         Комментарий • ---------------  определим коммерческий отдел ←
 11010080[656089370]         = ≡ Подразделение ком.отд. ∙ 65545[164299291] ←
  1638402[656081809]           NULL ←
 30867470[164298957]         IF ←
  1638463[164299020]           Условие ←
      116[656082496]             Выражение ←
      404[656104079]               Результат ≡ ДокументИд ∙ 65545[164299288] ←
      412[656081146]             ИЛИ ←
      116[656082497]             Выражение ←
      404[656104080]               Результат ≡ ~Автоматическая ∙ 65545[656085780] ←
 30867472[164298956]           THEN ←
 30867470[656082847]             IF ←
  1638463[656083220]               Условие ←
      404[656104081]                 Результат ≡ ДокументИд ∙ 65545[164299288] ←
 30867472[656082838]               THEN • есть документ - определим по подразделению ←
 11010080[164299847]                 = ≡ Подразделение ком.отд. ∙ 65545[164299291] ←
      404[164301221]                   Результат ≡ Получить подразделение для цены по документу ∙ 249[164298767] ←
 32505862[164299013]                     Значения формальных параметров при вызове ←
 32505860[164299283]                       Значение параметра при вызове процедуры/функции ≡ ~ДокументИд _фун ∙ 65545[164298787] ←
   327700[164299507]                         Выражение ≡ ДокументИд ∙ 65545[164299288] ←
 30867473[656081418]               ELSE • автоматический и без документа - определим по узлу ←
 11010080[656089369]                 = ≡ Подразделение ком.отд. ∙ 65545[164299291] ←
      404[656104082]                   Результат ≡ Первое коммерческое подразделение для назначения цен для данного узла сети (действ. магазины, не алкоголь) ∙ 249[655294474] ←
 30867473[164298838]           ELSE ←
 30867470[164824148]             IF ←
  1638463[164824348]               Условие ←
      404[164836849]                 Результат ≡ Текущий узел является консолидированной базой ∙ 249[1507768] ←
 30867472[164824132]               THEN ←
 11010080[164828286]                 = ≡ Коммерческое подразделение (глоб.перем.) ∙ 381[30670857] ←
      404[164836850]                   Результат ≡ Получить значение переменной из профиля ∙ 249[1507538] ←
  1507716[164823050]                     Переменная ≡ Коммерческое подразделение (глоб.перем.) ∙ 381[30670857] ←
 30867473[164823398]               ELSE ←
 11010080[164300429]                 = ≡ Коммерческое подразделение (глоб.перем.) ∙ 381[30670857] ←
      404[164302923]                   Результат ≡ Получить коммерческое подразделение по узлу ∙ 249[164823049] ←
 32505862[164824357]                     Значения формальных параметров при вызове ←
 32505860[164825823]                       Значение параметра при вызове процедуры/функции ≡ Узел ∙ 65545[164825421] ←
   327700[164826753]                         Выражение ≡ Текущий узел распределенной сети ∙ 381[1507340] ←
 30867470[171116528]             IF ←
  1638463[171117054]               Условие ←
      404[171136538]                 Результат ≡ Кол-во товаров ∙ 65545[656085785] ←
  1638473[171118874]                 Равно ←
      404[171136539]                 Результат ⁼ 1 ←
 30867472[171116521]               THEN ←
 11010080[171121290]                 = ≡ Продукт Ид ∙ 65545[164299290] ←
      404[171136613]                   Результат ≡ ~Список выбранных продуктов ∙ 65545[164299297] ←
 11010080[171121288]                 = ≡ Печатать за 100г ∙ 65545[171835583] ←
      404[171136540]                   Результат ≡ Признак из подгруппы/товара "Печатать за 100г" (да/нет) ∙ 249[164298821] ←
 32505862[171117519]                     Значения формальных параметров при вызове ←
 32505860[171120398]                       Значение параметра при вызове процедуры/функции ≡ фп Продукт in ∙ 65545[164301354] ←
   327700[171122300]                         Выражение ≡ Продукт Ид ∙ 65545[164299290] ←
 30867470[171116533]                 IF ←
  1638463[171117059]                   Условие ←
  1638460[171115286]                     НЕ ←
      404[171136652]                     Результат ≡ Показывать параметр печати КУ ∙ 117[171114747] ←
 30867472[171116526]                   THEN ←
 11010080[171121303]                     = ≡ Печатать КУ ∙ 65545[171118107] ←
      404[171136651]                       Результат ≡ Нет ∙ 131203075[131203073] ←
  1507728[171115000]                 Начало многострочного комментария ←
 11010080[171121302]                 = ≡ Печатать КУ ∙ 65545[171118107] ←
      404[171136549]                   Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[171117519]                     Уточняющий параметр ≡ Продавать без рецепта ∙ 305[28835881] ←
  1507729[171115000]                 Конец многострочного комментария ←
 12124190[164298785]             Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164298785]               Список полей формы ←
      598[165347382]                 Поле (колонка) для ввода данных ≡ Количество ценников ∙ 65545[165347551] ←
      355[165347408]                   Начальное значение ⁼ 1 ←
      323[165347341]                   Обязательное для ввода поле ≡ Да ∙ 534[40566785] ←
      598[164298885]                 Поле (колонка) для ввода данных ≡ Коммерческое подразделение (глоб.перем.) ∙ 381[30670857] ←
      355[164298899]                   Начальное значение ≡ Коммерческое подразделение (глоб.перем.) ∙ 381[30670857] ←
      323[164298814]                   Обязательное для ввода поле ←
 29163536[656081252]                   Отображаемый текст для объектов БД ≡ Наименование ∙ 283[5] ←
      209[164298798]                   Выбор из списка ≡ Выбор Коммерческого подразделения ∙ 371[24379396] ←
   262164[656080950]                     Выбор одного объекта из списка ≡ Да ∙ 534[40566785] ←
      598[171835445]                 Поле (колонка) для ввода данных • Печатать за 100г ≡ Печатать за 100г ∙ 65545[171835583] ←
      355[171115535]                   Начальное значение ≡ Печатать за 100г ∙ 65545[171835583] ←
      598[171835444]                 Поле (колонка) для ввода данных • Вывести на экран - "Да"/Продолжить печать - "Нет" ≡ Вывести на экран ∙ 65545[171835582] ←
      598[171115101]                 Поле (колонка) для ввода данных ≡ Печатать КУ ∙ 65545[171118107] ←
      355[171115536]                   Начальное значение ≡ Печатать КУ ∙ 65545[171118107] ←
  2621481[171114587]                   Доступно (видимо), если: ≡ Показывать параметр печати КУ ∙ 117[171114747] ←
      598[656082859]                 Поле (колонка) для ввода данных ≡ Надпись ряда ∙ 381[1966086] ←
  1638401[656080982]                   Скрытое поле ←
      209[656081652]                   Выбор из списка ≡ Установленные принтеры ∙ 371[1507685] ←
 11010080[164300430]             = ≡ Подразделение ком.отд. ∙ 65545[164299291] ←
      404[164302924]               Результат ≡ Коммерческое подразделение (глоб.перем.) ∙ 381[30670857] ←
 30867470[656082848]         IF ←
  1638463[656083221]           Условие ←
  1638460[656081410]             НЕ ←
      404[656104083]             Результат ≡ Подразделение ком.отд. ∙ 65545[164299291] ←
 30867472[656082839]           THEN • ошибка - не определен комм.отдел ←
 11010080[656089371]             = ≡ Строка - текст ошибки ∙ 65545[656085781] ←
      404[656104084]               Результат ⁼ 'Не найден коммерческий отдел!' ←
  1507410[656081414]             ВЫПОЛНИТЬ БЛОК ≡ Ок-месседж на экран и выход ∙ 30867469[656082351] ←
 30867469[165347902]       БЛОК • Заполнение временной таблицы ←
 11010104[164298760]         Очистить локальную таблицу ≡ Список товаров ∙ 30867458[164298763] ←
 11010080[164299807]         = ≡ Рез ∙ 65545[164299286] ←
      404[164301144]           Результат ⁼ 0 ←
 11010080[656089375]         = ≡ Номер тридцатки ∙ 65545[656085782] ←
      404[656104090]           Результат ⁼ 1 ←
 12124162[164298772]         WHILE ←
  1638463[164299021]           Условие ←
      404[164301156]             Результат ≡ Рез ∙ 65545[164299286] ←
  1638476[164298781]             Меньше ←
      404[164301157]             Результат ≡ Кол-во товаров ∙ 65545[656085785] ←
 30867469[164298823]           БЛОК • запишем список товаров в лок.таблицу ←
 11010080[164299809]             = ≡ Продукт Ид ∙ 65545[164299290] ←
      404[164301222]               Результат ≡ Множество.Элемент (первый элемент имеет нулевой индекс) ∙ 387[1507488] ←
   327700[164299483]                 Выражение ≡ ~Список выбранных продуктов ∙ 65545[164299297] ←
  1507670[164298758]                 Индекс ≡ Рез ∙ 65545[164299286] ←
 11010080[164299810]             = ≡ Наименование ∙ 65545[164299292] ←
      404[164301223]               Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[164299240]                 Уточняющий параметр ≡ Наименование ∙ 305[6] ←
 30867470[170919143]             IF ←
  1638463[170919473]               Условие ←
      404[170932906]                 Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170920160]                   Уточняющий параметр ≡ Список размеров ∙ 305[3342345] ←
  1638479[170918397]                 Не равно ←
  1638402[170918972]                 NULL ←
 30867472[170919138]               THEN • Алкоголь - добавим в конец наименования страну изготовителя ←
 11010080[170922795]                 = ≡ Наименование ∙ 65545[164299292] ←
      404[170932911]                   Результат ≡ Наименование ∙ 65545[164299292] ←
      404[170932912]                   Результат ⁼ ' (' ←
      404[170932913]                   Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170920162]                     Уточняющий параметр ≡ Страна производства ∙ 305[14745604] ←
      411[170920163]                       Уточняющий параметр ≡ Имя ∙ 249[262146] ←
      404[170932916]                   Результат ⁼ ')' ←
 30867470[164298958]             IF ←
  1638463[164299022]               Условие ←
      116[164301237]                 Выражение ←
      404[164301224]                   Результат ≡ SubString ∙ 249[1507580] ←
 32505862[164299003]                     Значения формальных параметров при вызове ←
 32505860[164299262]                       Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[164299484]                         Выражение ≡ Наименование ∙ 65545[164299292] ←
 32505860[164299265]                       Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[164299485]                         Выражение ⁼ 1 ←
 32505860[164299266]                       Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[164299486]                         Выражение ⁼ 2 ←
  1638473[164299121]                   Равно ←
      404[164301225]                   Результат ⁼ 'яя' ←
      412[164299358]                 ИЛИ ←
      116[164301238]                 Выражение ←
      404[164325753]                   Результат ≡ SubString ∙ 249[1507580] ←
 32505862[164300717]                     Значения формальных параметров при вызове ←
 32505860[164302985]                       Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[164305366]                         Выражение ≡ Наименование ∙ 65545[164299292] ←
 32505860[164303527]                       Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[164306387]                         Выражение ⁼ 1 ←
 32505860[164303528]                       Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[164306444]                         Выражение ⁼ 2 ←
  1638473[164305486]                   Равно ←
      404[164325754]                   Результат ⁼ 'ЯЯ' ←
 30867472[164298957]               THEN ←
 11010080[164299811]                 = ≡ Наименование ∙ 65545[164299292] ←
      404[164301226]                   Результат ≡ SubString ∙ 249[1507580] ←
 32505862[164299004]                     Значения формальных параметров при вызове ←
 32505860[164299267]                       Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[164299508]                         Выражение ≡ Наименование ∙ 65545[164299292] ←
 32505860[164299284]                       Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[164299509]                         Выражение ⁼ 3 ←
 32505860[164299285]                       Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[164299510]                         Выражение ⁼ 80 ←
 11010080[164299812]             = ≡ Цена ∙ 65545[164299293] ←
      404[164301227]               Результат ≡ Цена из реестра цен на дату по партнеру (через параметр) ∙ 249[40370272] ←
 32505862[164299014]                 Значения формальных параметров при вызове ←
 32505860[164299286]                   Значение параметра при вызове процедуры/функции ≡ фп Продукт ∙ 65545[40375122] ←
   327700[164299511]                     Выражение ≡ Продукт Ид ∙ 65545[164299290] ←
 32505860[164299287]                   Значение параметра при вызове процедуры/функции ≡ фп Партнер (Коммерческий отдел) ∙ 65545[40375123] ←
   327700[164299512]                     Выражение ≡ Подразделение ком.отд. ∙ 65545[164299291] ←
 32505860[164299288]                   Значение параметра при вызове процедуры/функции ≡ фп Дата ∙ 65545[40375125] ←
   327700[164299513]                     Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 11010080[164303631]             = ≡ Цена ∙ 65545[164299293] ←
      404[164318473]               Результат ≡ Цена ∙ 65545[164299293] ←
      403[164298926]               Умножить ←
      404[164311978]               Результат ≡ Цена за упаковку ∙ 249[164298854] ←
 32505862[164301382]                 Значения формальных параметров при вызове ←
 32505860[164302979]                   Значение параметра при вызове процедуры/функции ≡ Продукт Ид ∙ 65545[164304990] ←
   327700[164305442]                     Выражение ≡ Продукт Ид ∙ 65545[164299290] ←
 11010092[164298765]             Добавить в локальную таблицу ≡ Список товаров ∙ 30867458[164298763] ←
 11010093[656082558]             Комментарий • ----  если товаров 30, то наичнаем новый список из 30 ←
 48431134[164298774]             ++ ≡ Рез ∙ 65545[164299286] ←
 30867470[656082850]             IF ←
  1638463[656083223]               Условие ←
      404[656104091]                 Результат ≡ Рез ∙ 65545[164299286] ←
  1638473[656083710]                 Равно ←
      404[170921539]                 Результат ⁼ 24 ←
 30867472[656082841]               THEN • прибавим к номеру 30-ки ++1 ←
 48431134[656081000]                 ++ ≡ Номер тридцатки ∙ 65545[656085782] ←
 11010080[164299849]       = ≡ Кол-во листов ∙ 65545[164299302] ←
      404[164301229]         Результат ⁼ 0 ←
 11010080[164309060]       = ≡ Код для весов стр ∙ 65545[164303883] ←
      404[164315951]         Результат ⁼ '' ←
 30867477[164298769]       Отбор данных из локальной таблицы ≡ Список товаров ∙ 30867458[164298763] ←
 30867466[164298842]         Выполнить после получения записи ←
 30867469[165347369]           БЛОК • Обнуление ←
 11010080[170921340]             = ≡ Строка для печати ШК ∙ 65545[170919887] ←
  1638402[170918402]               NULL ←
 11010080[170921322]             = ≡ ШК ∙ 65545[170919342] ←
  1638402[170918401]               NULL ←
 11010080[164825212]             = ≡ Строка премия ∙ 65545[164301599] ←
  1638402[164823396]               NULL ←
 11010080[164825213]             = ≡ Строка неделя ∙ 65545[164304032] ←
  1638402[164823397]               NULL ←
 11010080[164825214]             = ≡ Строка спецназ ∙ 65545[164304145] ←
  1638402[164823398]               NULL ←
 11010080[164825215]             = ≡ Акция по ценовой акции ∙ 65545[164302701] ←
  1638402[164823399]               NULL ←
 11010080[164825216]             = ≡ Код акции ∙ 65545[164304033] ←
  1638402[164823400]               NULL ←
 11010080[170921678]             = ≡ Код акции в шаблон ∙ 65545[170918674] ←
  1638402[170918772]               NULL ←
 11010080[164825217]             = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
  1638402[164823415]               NULL ←
 11010080[164301033]             = ≡ Наименование 2 ∙ 65545[164299944] ←
  1638402[164299112]               NULL ←
 11010080[170920835]             = ≡ Целое ∙ 65545[164301603] ←
  1638402[170918442]               NULL ←
 11010080[164303988]             = ≡ Строка премия ∙ 65545[164301599] ←
  1638402[164300379]               NULL ←
 11010080[170921337]             = ≡ Строка КУ ∙ 65545[170918841] ←
  1638402[170918691]               NULL ←
 11010080[170921338]             = ≡ Строка с БЗМЖ ∙ 65545[170918941] ←
  1638402[170918692]               NULL ←
 11010080[170921334]             = ≡ Строка с кодом акции ∙ 65545[170918940] ←
  1638402[170918690]               NULL ←
 11010080[170921344]             = ≡ По продукту есть акция ∙ 65545[164299635] ←
  1638402[170918668]               NULL ←
 30867469[170918299]             БЛОК • Обнулим все переменные для ку ←
 11010080[170921290]               = ≡ Последняя партия ∙ 65545[170918933] ←
  1638402[170918679]                 NULL ←
 11010080[170921292]               = ≡ Рекомендации ∙ 65545[170918921] ←
  1638402[170918680]                 NULL ←
 11010080[170921295]               = ≡ Температура ∙ 65545[170918924] ←
  1638402[170918681]                 NULL ←
 11010080[170921298]               = ≡ Годен до: ∙ 65545[170918926] ←
  1638402[170918683]                 NULL ←
 11010080[170921299]               = ≡ Изготовитель_имя ∙ 65545[170918927] ←
  1638402[170918684]                 NULL ←
 11010080[170921300]               = ≡ Изготовитель_страна ∙ 65545[170918928] ←
  1638402[170918685]                 NULL ←
 11010080[170921301]               = ≡ Изготовитель_регион ∙ 65545[170918929] ←
  1638402[170918686]                 NULL ←
 11010080[170921302]               = ≡ Изготовитель_город ∙ 65545[170918930] ←
  1638402[170918687]                 NULL ←
 11010080[170921303]               = ≡ Изготовитель_улица ∙ 65545[170918931] ←
  1638402[170918688]                 NULL ←
 11010080[170921304]               = ≡ Изготовитель_дом ∙ 65545[170918932] ←
  1638402[170918689]                 NULL ←
 48431134[164298773]           ++ ≡ Кол-во листов ∙ 65545[164299302] ←
 30867470[164299037]           IF ←
  1638463[164299138]             Условие ←
      116[656082487]               Выражение ←
      404[164302925]                 Результат ≡ ДокументИд ∙ 65545[164299288] ←
  1638473[164299447]                 Равно ←
  1638402[164299015]                 NULL ←
      412[656081111]               ИЛИ ←
      116[656082488]               Выражение ←
      404[656104059]                 Результат ≡ ДокументИд ∙ 65545[164299288] ←
      411[656087613]                   Уточняющий параметр ≡ UID типа ∙ 249[2621444] ←
  1638479[656081366]                 Не равно ←
      404[656104060]                 Результат ≡ Перечень товаров для акции ∙ 332[3342383] ←
 30867472[164299034]             THEN ←
 11010080[164300431]               = ≡ По продукту есть акция ∙ 65545[164299635] ←
      404[164302926]                 Результат ≡ По товару есть акция ∙ 117[655295201] ←
 32505862[164299215]                   Значения формальных параметров при вызове ←
 32505860[164299661]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[655299212] ←
   327700[164299955]                       Выражение ≡ Продукт Ид ∙ 65545[164299290] ←
 32505860[164299662]                     Значение параметра при вызове процедуры/функции ≡ Торговая точка ∙ 65545[655299213] ←
   327700[164299956]                       Выражение ≡ Подразделение ком.отд. ∙ 65545[164299291] ←
      411[164299447]                         Уточняющий параметр ≡ Родитель ∙ 283[2] ←
 32505860[164299663]                     Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[655299214] ←
   327700[164299958]                       Выражение ≡ Сегодня, начало дня ∙ 249[2293761] ←
 32505860[164303716]                     Значение параметра при вызове процедуры/функции ≡ Кроме акций ∙ 65545[655299243] ←
   327700[164306666]                       Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164298918]                         Список элементов ←
   327700[164306667]                           Выражение ≡ Индикаторы ∙ 117[164888735] ←
   327700[164306668]                           Выражение ≡ Дополнительные места продаж ∙ 117[164888731] ←
 32505860[164299665]                     Значение параметра при вызове процедуры/функции ≡ ФП_out Старая цена ∙ 65545[655299191] ←
   327700[164300148]                       Выражение ≡ Цена 2 ∙ 65545[164299277] ←
 32505860[164299902]                     Значение параметра при вызове процедуры/функции ≡ ФП_out Наименование товара ПРОМО ∙ 65545[58392622] ←
   327700[164300331]                       Выражение ≡ Наименование 2 ∙ 65545[164299944] ←
 32505860[164302518]                     Значение параметра при вызове процедуры/функции ≡ ФП_out Акция конкретно ∙ 65545[164302650] ←
   327700[164304465]                       Выражение ≡ Акция по ценовой акции ∙ 65545[164302701] ←
 32505860[164302521]                     Значение параметра при вызове процедуры/функции ≡ ФП_out Новая цена  ∙ 65545[164302648] ←
   327700[164304468]                       Выражение ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 32505860[164300599]                     Значение параметра при вызове процедуры/функции ≡ ФП_out Строка премия ∙ 65545[164301593] ←
   327700[164302980]                       Выражение ≡ Строка премия ∙ 65545[164301599] ←
 32505860[164301039]                     Значение параметра при вызове процедуры/функции ≡ ФП_out Строка неделя ∙ 65545[164303945] ←
   327700[164301907]                       Выражение ≡ Строка неделя ∙ 65545[164304032] ←
 32505860[164303891]                     Значение параметра при вызове процедуры/функции ≡ ФП_out Строка спецназ ∙ 65545[164303978] ←
   327700[164306947]                       Выражение ≡ Строка спецназ ∙ 65545[164304145] ←
 32505860[164300606]                     Значение параметра при вызове процедуры/функции ≡ Минус дней ∙ 65545[164303242] ←
   327700[164302988]                       Выражение ≡ ~Колво дней до акции ∙ 65545[164303325] ←
 32505860[164303777]                     Значение параметра при вызове процедуры/функции ≡ ФП_out Номер спец.ценника ∙ 65545[58392623] ←
   327700[164306644]                       Выражение ≡ Код акции ∙ 65545[164304033] ←
 32505860[164304487]                     Значение параметра при вызове процедуры/функции ≡ ФП_out Док ∙ 65545[655299215] ←
   327700[164307907]                       Выражение ≡ Док Ид промо ∙ 65545[164304986] ←
 32505860[164302971]                     Значение параметра при вызове процедуры/функции ≡ ФП_out Строка ∙ 65545[164302997] ←
   327700[164305343]                       Выражение ≡ Строка промо ∙ 65545[164303326] ←
 32505860[170919509]                     Значение параметра при вызове процедуры/функции ≡ ФП_out Ограничение ∙ 65545[165348931] ←
   327700[170919919]                       Выражение ≡ Целое ∙ 65545[164301603] ←
  1507410[170918710]               ВЫПОЛНИТЬ БЛОК ≡ колво по акции ∙ 30867469[164300151] ←
 30867470[164300402]               IF ←
  1638463[164300775]                 Условие ←
      116[164300917]                   Выражение ←
      116[164300309]                     Выражение ←
      116[170919898]                       Выражение ←
      404[164316352]                         Результат ≡ Акция по ценовой акции ∙ 65545[164302701] ←
  1638473[164303074]                         Равно ←
      404[164317107]                         Результат ≡ Бери больше - плати меньше ∙ 117[164888732] ←
      413[170918307]                       И ←
      116[170919899]                       Выражение ←
      404[170931189]                         Результат ≡ Код акции ∙ 65545[164304033] ←
  1638479[170918221]                         Не равно ←
      404[170931190]                         Результат ⁼ 22 ←
      412[164298890]                     ИЛИ ←
      116[164301086]                     Выражение ←
      404[164324666]                       Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[164304844]                       Равно ←
      404[164324667]                       Результат ⁼ 8 ←
      412[164299263]                     ИЛИ ←
      116[164301141]                     Выражение ←
      404[164324554]                       Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[164304909]                       Равно ←
      404[164324555]                       Результат ⁼ 5 ←
      413[164301757]                   И ←
      116[164300310]                   Выражение ←
      404[164317108]                     Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
  1638478[164299050]                     Больше ←
      404[164317109]                     Результат ⁼ 0 ←
 30867472[164300389]                 THEN ←
 11010080[164306158]                   = ≡ Цена 2 ∙ 65545[164299277] ←
      404[164317193]                     Результат ≡ Цена ∙ 65545[164299293] ←
 11010080[164306159]                   = ≡ Цена ∙ 65545[164299293] ←
      404[164317194]                     Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 11010080[164308469]                   = ≡ Строка неделя ∙ 65545[164304032] ←
  1638402[164300622]                     NULL ←
 30867473[164298862]             ELSE ←
  1507360[164298937]               Отбор данных (по запросу) • Запрос цена и наименование ←
  1507673[164298852]                 Ключи оптимизации ←
  1507675[164298847]                   Использовать индекс ∙ 12124204[164299040] ←
  1507676[164298851]                     Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
 12124213[164298953]                 Параметры ←
  1507335[164301292]                   Параметр • строка_ид ∙ 12124204[164299040] ←
  1507494[164306753]                     Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507335[164299257]                   Параметр • строка_цена ∙ 12124204[164299040] ←
  1507494[164300418]                     Уточняющий параметр ≡ Цена старая розничная ∙ 359[15007765] ←
  1507335[164299308]                   Параметр • строка_наименование ∙ 12124204[164299040] ←
  1507494[164300419]                     Уточняющий параметр ≡ Сервер ТЕКУЩИЙ ∙ 359[1507343] ←
  1507335[164301293]                   Параметр • строка_тип ∙ 12124204[164299040] ←
  1507494[164306754]                     Уточняющий параметр ≡ Способ оплаты ∙ 359[6684673] ←
  1507335[164301296]                   Параметр • строка_премия1 ∙ 12124204[164299040] ←
  1507494[164306760]                     Уточняющий параметр ≡ Сумма ∙ 359[33619978] ←
  1507335[164301297]                   Параметр • строка_премия2 ∙ 12124204[164299040] ←
  1507494[164306761]                     Уточняющий параметр ≡ Сумма по цене по накладной поставщика ∙ 359[14286862] ←
  1507335[164300183]                   Параметр • строка_акция ∙ 12124204[164299040] ←
  1507494[164303572]                     Уточняющий параметр ≡ Объем продукции ∙ 359[14483469] ←
 12124200[164298943]                 From         (Таблицы) ←
 12124204[164299040]                   Таблица ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[164298979]                 Where      (Ограничения на отбор данных) ←
  1507376[164299757]                   Выражение ←
  1507455[164300019]                     Результат ∙ 12124204[164299040] ←
  1507494[164300415]                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638473[164299836]                     Равно ←
  1507452[164299325]                     Константа ≡ <<Документ>> ∙ 367[5] ←
  1507376[164299758]                   Выражение ←
  1507455[164300020]                     Результат ∙ 12124204[164299040] ←
  1507494[164300416]                       Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[164299837]                     Равно ←
  1638402[164299111]                     NULL ←
  1507376[164299759]                   Выражение ←
  1507455[164300021]                     Результат ∙ 12124204[164299040] ←
  1507494[164300417]                       Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[164299838]                     Равно ←
  1507452[164299369]                     Константа ≡ Продукт Ид ∙ 65545[164299290] ←
 30867466[164298978]                 Выполнить после получения записи ←
 11010080[164301031]                   = ≡ Цена 2 ∙ 65545[164299277] ←
      404[164304563]                     Результат ≡ строка_цена ∙ 1507335[164299257] ←
 11010080[164301032]                   = ≡ Наименование 2 ∙ 65545[164299944] ←
      404[164304572]                     Результат ≡ строка_наименование ∙ 1507335[164299308] ←
 30867470[164300738]                   IF ←
  1638463[164300159]                     Условие ←
      116[164299475]                       Выражение ←
      116[165348690]                         Выражение ←
      404[165359703]                           Результат ≡ строка_тип ∙ 1507335[164301293] ←
  1638473[165348760]                           Равно ←
      404[165359704]                           Результат ≡ Ромашка ∙ 117[165347519] ←
      412[165347692]                         ИЛИ ←
      116[165350279]                         Выражение ←
      404[165373806]                           Результат ≡ строка_тип ∙ 1507335[164301293] ←
  1638473[165350540]                           Равно ←
      404[165373807]                           Результат ≡ ВСЕГДА ∙ 117[165347595] ←
      412[165348094]                         ИЛИ ←
      116[170918261]                         Выражение ←
      404[170918830]                           Результат ≡ строка_тип ∙ 1507335[164301293] ←
  1638473[170918343]                           Равно ←
      404[170918831]                           Результат ≡ ЛИКВИДАЦИЯ ∙ 117[170917890] ←
      412[170918091]                         ИЛИ ←
      116[170919092]                         Выражение ←
      404[170926401]                           Результат ≡ строка_тип ∙ 1507335[164301293] ←
  1638473[170919522]                           Равно ←
      404[170926402]                           Результат ≡ ВЫВЕДЕННЫЙ АССОРТИМЕНТ (скидка+кэшбэк) ∙ 117[170918006] ←
      412[170918320]                         ИЛИ ←
      116[164299467]                         Выражение ←
      404[164312123]                           Результат ≡ строка_тип ∙ 1507335[164301293] ←
  1638473[164304029]                           Равно ←
      404[164312124]                           Результат ≡ ЛИСТОВКА ∙ 117[164888741] ←
      412[165347461]                         ИЛИ ←
      116[165347644]                         Выражение ←
      404[165349498]                           Результат ≡ строка_тип ∙ 1507335[164301293] ←
  1638473[165348106]                           Равно ←
      404[165349499]                           Результат ≡ ЛИСТОВКА статус 2 - не актуально ∙ 117[165347448] ←
      412[164299134]                         ИЛИ ←
      116[165347645]                         Выражение ←
      404[165349500]                           Результат ≡ строка_тип ∙ 1507335[164301293] ←
  1638473[165348108]                           Равно ←
      404[165349501]                           Результат ≡ ЛИСТОВКА статус 3 - не актуально ∙ 117[165347449] ←
      412[165347460]                         ИЛИ ←
      116[656086084]                         Выражение ←
      404[656088364]                           Результат ≡ строка_тип ∙ 1507335[164301293] ←
  1638473[656081942]                           Равно ←
      404[656088365]                           Результат ≡ Тематическая акция ∙ 117[164888749] ←
      412[656081600]                         ИЛИ ←
      116[164299468]                         Выражение ←
      404[164312125]                           Результат ≡ строка_тип ∙ 1507335[164301293] ←
  1638473[164304030]                           Равно ←
      404[164312126]                           Результат ≡ ТОЛЬКО СЕГОДНЯ ∙ 117[164888742] ←
      412[164299135]                         ИЛИ ←
      116[164299469]                         Выражение ←
      404[164312135]                           Результат ≡ строка_тип ∙ 1507335[164301293] ←
  1638473[164304031]                           Равно ←
      404[164312136]                           Результат ≡ ЛИСТОВКА ПРЕМИЯ ∙ 117[164888743] ←
      412[165347514]                         ИЛИ ←
      116[170919474]                         Выражение ←
      404[170927926]                           Результат ≡ строка_тип ∙ 1507335[164301293] ←
  1638473[170919887]                           Равно ←
      404[170927927]                           Результат ≡ ФРЕШБЭК ∙ 117[170918024] ←
      412[170918495]                         ИЛИ ←
      116[170919620]                         Выражение ←
      404[170928701]                           Результат ≡ строка_тип ∙ 1507335[164301293] ←
  1638473[170920061]                           Равно ←
      404[170928702]                           Результат ≡ ПЕРСОНАЛЬНЫЕ ПРЕДЛОЖЕНИЯ ∙ 117[170918047] ←
      412[170918547]                         ИЛИ ←
      116[165348199]                         Выражение ←
      404[165355679]                           Результат ≡ строка_тип ∙ 1507335[164301293] ←
  1638473[165348202]                           Равно ←
      404[165355680]                           Результат ≡ ЛИСТОВКА ПРЕМИЯ статус 2 - не актуально ∙ 117[165347454] ←
      412[165347515]                         ИЛИ ←
      116[165348198]                         Выражение ←
      404[165355677]                           Результат ≡ строка_тип ∙ 1507335[164301293] ←
  1638473[165348201]                           Равно ←
      404[165355678]                           Результат ≡ ЛИСТОВКА ПРЕМИЯ статус 3 - не актуально ∙ 117[165347455] ←
      412[164299136]                         ИЛИ ←
      116[164299470]                         Выражение ←
      404[164312137]                           Результат ≡ строка_тип ∙ 1507335[164301293] ←
  1638473[164304032]                           Равно ←
      404[164312138]                           Результат ≡ ТОЛЬКО СЕГОДНЯ ПРЕМИЯ ∙ 117[164888744] ←
      412[164299143]                         ИЛИ ←
      116[164299489]                         Выражение ←
      404[164321551]                           Результат ≡ строка_тип ∙ 1507335[164301293] ←
  1638473[164304120]                           Равно ←
      404[164321552]                           Результат ≡ ПРЕМИЯ БЕЗ ЛИСТОВКИ ∙ 117[164888745] ←
      413[164302407]                       И ←
      116[164299477]                       Выражение ←
      116[164299478]                         Выражение ←
      404[164312199]                           Результат ≡ строка_премия1 ∙ 1507335[164301296] ←
  1638479[164298964]                           Не равно ←
  1638402[164300392]                           NULL ←
      412[164299137]                         ИЛИ ←
      116[164299479]                         Выражение ←
      404[164312200]                           Результат ≡ строка_премия2 ∙ 1507335[164301297] ←
  1638479[164299160]                           Не равно ←
  1638402[164300393]                           NULL ←
 30867472[164300723]                     THEN ←
 11010080[164304019]                       = ≡ Строка премия ∙ 65545[164301599] ←
      404[164312106]                         Результат ≡ строка_ид ∙ 1507335[164301292] ←
 30867470[171114958]           IF ←
  1638463[171115107]             Условие ←
      116[171116205]               Выражение ←
      404[171131690]                 Результат ≡ По продукту есть акция ∙ 65545[164299635] ←
      412[171114944]                 ИЛИ ←
      404[171131691]                 Результат ≡ Строка премия ∙ 65545[164301599] ←
 30867472[171114956]             THEN • Акционный ценник ←
 11010093[171114586]               Комментарий • 20.01.2023. Акционный паллетный ценник (1, 10, 19) печатается из картинки ←
 30867470[171116471]               IF ←
  1638463[171116981]                 Условие ←
      116[171115729]                   Выражение ←
      404[171138266]                     Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[171119240]                     Равно ←
      404[171138289]                     Результат ⁼ 1 ←
      412[171115217]                   ИЛИ ←
      116[171116664]                   Выражение ←
      404[171137561]                     Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[171119712]                     Равно ←
      404[171137562]                     Результат ⁼ 6 ←
      412[171115161]                   ИЛИ ←
      116[171115730]                   Выражение ←
      404[171138265]                     Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[171119241]                     Равно ←
      404[171138304]                     Результат ⁼ 10 ←
      412[171115162]                   ИЛИ ←
      116[171115731]                   Выражение ←
      404[171138313]                     Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[171119242]                     Равно ←
      404[171138314]                     Результат ⁼ 19 ←
      412[171115202]                   ИЛИ ←
      116[171116840]                   Выражение ←
      404[171139241]                     Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[171119452]                     Равно ←
      404[171139242]                     Результат ⁼ 88 ←
 30867472[171116465]                 THEN • Новый шаблон (из картинки) ←
 11010088[171114776]                   ВЫПОЛНИТЬ ≡ Печать паллетного ценника КЯ ∙ 127[171114961] ←
 32505862[171116432]                     Значения формальных параметров при вызове ←
 32505860[171118069]                       Значение параметра при вызове процедуры/функции ≡ ~Товары ∙ 65545[171117574] ←
   327700[171119459]                         Выражение ≡ Продукт Ид ∙ 65545[164299290] ←
 32505860[171118070]                       Значение параметра при вызове процедуры/функции ≡ ~Кол-во ценников (def = 1) ∙ 65545[171117582] ←
   327700[171119460]                         Выражение ≡ Количество ценников ∙ 65545[165347551] ←
 32505860[171118071]                       Значение параметра при вызове процедуры/функции ≡ ~Показать на экран (def = Нет) ∙ 65545[171117583] ←
   327700[171119461]                         Выражение ≡ Вывести на экран ∙ 65545[171835582] ←
 32505860[171118072]                       Значение параметра при вызове процедуры/функции ≡ ~Печатать цену за 100г ∙ 65545[171118054] ←
   327700[171119462]                         Выражение ≡ Печатать за 100г ∙ 65545[171835583] ←
 32505860[171118073]                       Значение параметра при вызове процедуры/функции ≡ ~Печатать КУ на ценнике (для не ФРОВ и NonFood) ∙ 65545[171118108] ←
   327700[171119463]                         Выражение ≡ Печатать КУ ∙ 65545[171118107] ←
 32505860[171118074]                       Значение параметра при вызове процедуры/функции ≡ ~Кол-во дней до акции ∙ 65545[171118159] ←
   327700[171119464]                         Выражение ≡ ~Колво дней до акции ∙ 65545[164303325] ←
 11010080[171118167]                   = ≡ Количество ценников temp ∙ 65545[170918833] ←
      404[171126888]                     Результат ≡ Количество ценников ∙ 65545[165347551] ←
 30867473[171115174]                 ELSE ←
 30867469[164299678]                   БЛОК • для весов ←
 11010080[164308295]                     = ≡ Код для весов ∙ 65545[164303882] ←
  1638402[164300754]                       NULL ←
 11010080[164308772]                     = ≡ Код для весов стр ∙ 65545[164303883] ←
      404[164323083]                       Результат ⁼ '' ←
 11010080[164306979]                     = ≡ Кассовый аппарат ∙ 381[1966081] ←
  1638402[164300758]                       NULL ←
  1507360[164299629]                     Отбор данных (по запросу) • Запрос весы ←
 12124213[164299971]                       Параметры ←
  1507335[164301546]                         Параметр • весы_ид ∙ 12124204[164300430] ←
  1507494[164307794]                           Уточняющий параметр ≡ Партнер ∙ 283[1] ←
 12124200[164299998]                       From         (Таблицы) ←
 12124204[164300430]                         Таблица ≡ Партнер ∙ 108[4] ←
 12124215[164300104]                       Where      (Ограничения на отбор данных) ←
  1507376[164304579]                         Выражение ←
  1507455[164305267]                           Результат ∙ 12124204[164300430] ←
  1507494[164307790]                             Уточняющий параметр ≡ Класс ∙ 283[3] ←
  1638473[164304979]                           Равно ←
  1507488[164300045]                           Константа (Ограничение по классу, типу, плану счетов) ≡ ВЕСЫ ∙ 539[14745611] ←
  1507376[164304580]                         Выражение ←
  1507455[164305269]                           Результат ∙ 12124204[164300430] ←
  1507494[164307791]                             Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[164304980]                           Равно ←
  1507488[164300046]                           Константа (Ограничение по классу, типу, плану счетов) ≡ Торговые Весы ∙ 284[14745616] ←
  1507376[164304581]                         Выражение ←
  1507455[164305270]                           Результат ∙ 12124204[164300430] ←
  1507494[164307792]                             Уточняющий параметр ≡ Запрет поставщика ∙ 283[2818052] ←
  1638473[164305378]                           Равно ←
  1507452[164301972]                           Константа ≡ Да ∙ 131203075[131203074] ←
  1507376[164304582]                         Выражение ←
  1507455[164305271]                           Результат ∙ 12124204[164300430] ←
  1507494[164307793]                             Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[164305379]                           Равно ←
  1507452[164301973]                           Константа ≡ Подразделение ком.отд. ∙ 65545[164299291] ←
      411[164302371]                             Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1507376[165480682]                         Выражение ←
  1507376[164304583]                           Выражение ←
  1507455[164305272]                             Результат ∙ 12124204[164300430] ←
  1507494[164307795]                               Уточняющий параметр ≡ Протокол обмена с весами ∙ 283[14286849] ←
  1638473[164305382]                             Равно ←
  1507452[164301974]                             Константа ≡ Штрих Принт Тач ∙ 2621490[58392577] ←
      412[165347366]                           ИЛИ ←
  1507376[165347430]                           Выражение ←
  1507455[165347441]                             Результат ∙ 12124204[164300430] ←
  1507494[165347478]                               Уточняющий параметр ≡ Протокол обмена с весами ∙ 283[14286849] ←
  1638473[165347623]                             Равно ←
  1507452[165347399]                             Константа ≡ Maple Touch ∙ 2621490[165281798] ←
      412[170918924]                           ИЛИ ←
  1507376[170919271]                           Выражение ←
  1507455[170919018]                             Результат ∙ 12124204[164300430] ←
  1507494[170919253]                               Уточняющий параметр ≡ Протокол обмена с весами ∙ 283[14286849] ←
  1638473[170919738]                             Равно ←
  1507452[170918562]                             Константа ≡ DP Falcon ∙ 2621490[171638785] ←
 30867466[164299781]                       Выполнить после получения записи ←
 11010080[164306978]                         = ≡ Кассовый аппарат ∙ 381[1966081] ←
      404[164319621]                           Результат ≡ весы_ид ∙ 1507335[164301546] ←
 39780361[164298975]                     ЗАВЕРШИТЬ БЛОК ←
      116[164300730]                       Выражение ←
      404[164319622]                         Результат ≡ Кассовый аппарат ∙ 381[1966081] ←
  1638473[164305381]                         Равно ←
  1638402[164300769]                         NULL ←
 11010080[170921355]                     = ≡ Код для весов ∙ 65545[164303882] ←
      404[170927438]                       Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170920102]                         Уточняющий параметр ≡ Сумма НДС GAAP ∙ 305[42401854] ←
  1507728[170917978]                     Начало многострочного комментария ←
  1507360[164299890]                     Отбор данных (по запросу) • Запрос код для весов ←
 12124213[164299891]                       Параметры ←
  1507335[164301542]                         Параметр • строка_код ∙ 12124204[164300428] ←
  1507494[164307782]                           Уточняющий параметр ≡ Скидка ∙ 359[14286851] ←
  1507673[164298893]                       Ключи оптимизации ←
  1507675[164298891]                         Использовать индекс ∙ 12124204[164300428] ←
  1507676[164298895]                           Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
 12124200[164299913]                       From         (Таблицы) ←
 12124204[164300427]                         Таблица ≡ Документ ∙ 108[5] ←
 12124204[164300428]                         Таблица ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[164300022]                       Where      (Ограничения на отбор данных) ←
  1507376[164304565]                         Выражение ←
  1507455[164305253]                           Результат ∙ 12124204[164300427] ←
  1507494[164307772]                             Уточняющий параметр ≡ Класс ∙ 331[3] ←
  1638473[164304967]                           Равно ←
  1507488[164300041]                           Константа (Ограничение по классу, типу, плану счетов) ≡ ТОВАРНЫЙ ДОКУМЕНТ ∙ 541[42401806] ←
      413[164303052]                         И ←
  1507376[164304566]                         Выражение ←
  1507455[164305254]                           Результат ∙ 12124204[164300427] ←
  1507494[164307773]                             Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[164304968]                           Равно ←
  1507488[164300042]                           Константа (Ограничение по классу, типу, плану счетов) ≡ Документ для выгрузки на весы/кассы самообслуживания ∙ 332[164364294] ←
      413[164303053]                         И ←
  1507376[164304567]                         Выражение ←
  1507455[164305255]                           Результат ∙ 12124204[164300427] ←
  1507494[164307774]                             Уточняющий параметр ≡ Состояние документа ∙ 331[14] ←
  1638473[164304969]                           Равно ←
  1507452[164301962]                           Константа ⁼ 1 ←
      413[164303054]                         И ←
  1507376[164304568]                         Выражение ←
  1507455[164305256]                           Результат ∙ 12124204[164300427] ←
  1507494[164307775]                             Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638477[164299107]                           Больше или равно ←
  1507452[164301964]                           Константа ⁼ 01.01.2013 ←
      413[164303055]                         И ←
  1507376[164304570]                         Выражение ←
  1507455[164305257]                           Результат ∙ 12124204[164300427] ←
  1507494[164307776]                             Уточняющий параметр ≡ Причина ∙ 331[1966098] ←
  1638473[164304970]                           Равно ←
  1507452[164301965]                           Константа ≡ Весы СО сенсорные ∙ 164364296[58589185] ←
      413[164303056]                         И ←
  1507376[164304571]                         Выражение ←
  1507455[164305258]                           Результат ∙ 12124204[164300427] ←
  1507494[164307777]                             Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[164298904]                           Меньше или равно ←
  1507452[164301966]                           Константа ≡ Текущие дата-время ∙ 249[42467332] ←
      413[164303057]                         И ←
  1507376[164304572]                         Выражение ←
  1507455[164305259]                           Результат ∙ 12124204[164300427] ←
  1507494[164307778]                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638477[164299108]                           Больше или равно ←
  1507452[164301967]                           Константа ≡ Текущие дата-время ∙ 249[42467332] ←
      413[164303058]                         И ←
  1507376[164304569]                         Выражение ←
  1507455[164305260]                           Результат ∙ 12124204[164300427] ←
  1507494[164307779]                             Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638473[164304971]                           Равно ←
  1507455[164305261]                           Результат ∙ 12124204[164300428] ←
  1507494[164307780]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
      413[164303059]                         И ←
  1507376[164304573]                         Выражение ←
  1507455[164305262]                           Результат ∙ 12124204[164300428] ←
  1507494[164307781]                             Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[164304972]                           Равно ←
  1507452[164301968]                           Константа ≡ Продукт Ид ∙ 65545[164299290] ←
 30867466[164300060]                       Выполнить после получения записи ←
 11010080[164308296]                         = ≡ Код для весов ∙ 65545[164303882] ←
      404[164323080]                           Результат ≡ строка_код ∙ 1507335[164301542] ←
  1507729[170917978]                     Конец многострочного комментария ←
 30867470[164301139]                     IF ←
  1638463[164301699]                       Условие ←
      404[164323081]                         Результат ≡ Код для весов ∙ 65545[164303882] ←
  1638479[164299529]                         Не равно ←
  1638402[164300755]                         NULL ←
 30867472[164301122]                       THEN ←
 11010080[164308297]                         = ≡ Код для весов стр ∙ 65545[164303883] ←
      404[164323082]                           Результат ⁼ '<table border=2 height="120px"><tr><td><font face="Calibri" size="5">НОМЕР<br>НА ВЕСАХ</font><br><font face="Calibri" size="7"><b>' ←
      404[164323084]                           Результат ≡ Код для весов ∙ 65545[164303882] ←
      404[164323356]                           Результат ⁼ '</b></font></td></tr></table>' ←
 30867469[164299606]                   БЛОК • Определение шаблонов по типу ценника ←
 11010080[164308621]                     = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[164324649]                       Результат ⁼ 0 ←
 11010080[164308070]                     = ≡ Строка 1 ∙ 65545[164304987] ←
      404[164331004]                       Результат ⁼ '' ←
 11010080[164308071]                     = ≡ Строка 2 ∙ 65545[164304276] ←
      404[164331005]                       Результат ⁼ '' ←
 11010080[164300453]                     = ≡ Цена 2 ∙ 65545[164299277] ←
  1638402[164300550]                       NULL ←
 11010088[170983923]                     ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[170984148]                       Значения формальных параметров при вызове ←
      117[170983738]                         Выражение • Сообщение ≡ Длинная строка (512) ∙ 107[61669379] ←
      404[170986838]                           Результат ⁼ 'Код акции : "' ←
      404[170986839]                           Результат ≡ Код акции ∙ 65545[164304033] ←
      404[170986840]                           Результат ⁼ '"' ←
 32505860[170984597]                         Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[170984851]                           Выражение ≡ Сообщение ∙ 117[170983738] ←
 30867470[170918810]                     IF ←
  1638463[170919049]                       Условие ←
      404[170928442]                         Результат ≡ Код акции ∙ 65545[164304033] ←
 30867472[170918807]                       THEN ←
 11010080[170921680]                         = ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170928443]                           Результат ≡ Код акции ∙ 65545[164304033] ←
 11010080[170921681]                         = ≡ Строка с кодом акции ∙ 65545[170918940] ←
      404[170928444]                           Результат ⁼ <tr><td colspan=3 align=left valign=top style="font-size:12pt;font-family:calibri; line-height:75%;"> ←
      404[170928452]                           Результат ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170928453]                           Результат ⁼ </td></tr> ←
 11010079[164299058]                     CASE ←
  1572877[164299072]                       Условие ←
      404[164320182]                         Результат ≡ Код акции ∙ 65545[164304033] ←
 11010081[164300037]                       OF ⁼ 2 ←
 11010080[164311781]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[164332780]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164304996]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 30867470[164301981]                         IF ←
  1638463[164302732]                           Условие ←
      404[164332782]                             Результат ≡ Цена ∙ 65545[164299293] ←
  1638475[164299020]                             Меньше или равно ←
      404[164332783]                             Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 30867472[171311193]                           THEN ←
  1507410[171311128]                             ВЫПОЛНИТЬ БЛОК ≡ Сообщение, что цены по акции равны или больше текущих ∙ 30867469[171311175] ←
 11010099[171311126]                             CONTINUE ←
 11010080[165355705]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374734]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347501]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
 11010079[164299112]                         CASE ←
  1572877[164299005]                           Условие ←
      404[164332797]                             Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164304998]                               Уточняющий параметр ≡ Способ оплаты ∙ 359[6684673] ←
 11010081[164300038]                           OF ≡ 2 ПО ЦЕНЕ 1 ∙ 656080899[656080903] ←
 11010080[164311785]                             = ≡ Строка 2 ∙ 65545[164304276] ←
      404[164332796]                               Результат ⁼ 'Цена за 1шт при покупке 2шт' ←
 30867473[164299873]                           ELSE ←
 39780361[164299170]                             ЗАВЕРШИТЬ БЛОК ←
  1507410[164299403]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
  1507410[164299411]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[164311784]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[164332785]                           Результат ⁼ 1 ←
 11010081[165348397]                       OF ⁼ 3 ←
 11010080[165355093]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[165373193]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[165353697]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 30867470[165349124]                         IF ←
  1638463[165349650]                           Условие ←
      404[165373194]                             Результат ≡ Цена ∙ 65545[164299293] ←
  1638475[165347648]                             Меньше или равно ←
      404[165373195]                             Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 30867472[171311192]                           THEN ←
  1507410[171311127]                             ВЫПОЛНИТЬ БЛОК ≡ Сообщение, что цены по акции равны или больше текущих ∙ 30867469[171311175] ←
 11010099[171311125]                             CONTINUE ←
 11010080[165355704]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374732]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347500]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
 11010079[165347567]                         CASE ←
  1572877[165347588]                           Условие ←
      404[165373197]                             Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[165353698]                               Уточняющий параметр ≡ Способ оплаты ∙ 359[6684673] ←
 11010081[165348398]                           OF ≡ 3 ПО ЦЕНЕ 2 ∙ 656080899[656080901] ←
 11010080[165355095]                             = ≡ Строка 2 ∙ 65545[164304276] ←
      404[165373198]                               Результат ⁼ 'Цена за 1шт при покупке 3шт' ←
 30867473[165348065]                           ELSE ←
 39780361[165347506]                             ЗАВЕРШИТЬ БЛОК ←
  1507410[165348288]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
  1507410[165348291]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[165355096]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[165373199]                           Результат ⁼ 1 ←
 11010081[170917908]                       OF ⁼ 4 ←
 11010080[170920529]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[170920158]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[170918562]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 30867470[170918463]                         IF ←
  1638463[170918562]                           Условие ←
      404[170920904]                             Результат ≡ Цена ∙ 65545[164299293] ←
  1638475[170917985]                             Меньше или равно ←
      404[170925025]                             Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 30867472[171311191]                           THEN ←
  1507410[171311126]                             ВЫПОЛНИТЬ БЛОК ≡ Сообщение, что цены по акции равны или больше текущих ∙ 30867469[171311175] ←
 11010099[171311124]                             CONTINUE ←
 11010080[170920531]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[170925031]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[170917909]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
 11010079[170917910]                         CASE ←
  1572877[170917912]                           Условие ←
      404[170925032]                             Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[170918873]                               Уточняющий параметр ≡ Способ оплаты ∙ 359[6684673] ←
 11010081[170917916]                           OF ≡ 4 ПО ЦЕНЕ 3 ∙ 656080899[656080898] ←
 11010080[170920532]                             = ≡ Строка 2 ∙ 65545[164304276] ←
      404[170925033]                               Результат ⁼ 'Цена за 1шт при покупке 4шт' ←
 30867473[170918057]                           ELSE ←
 39780361[170917969]                             ЗАВЕРШИТЬ БЛОК ←
  1507410[170918017]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
  1507410[170918019]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[170920533]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[170925034]                           Результат ⁼ 1 ←
 11010081[164300043]                       OF • шок ⁼ 6 ←
 11010080[164312596]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[164312639]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164303773]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 30867470[164302183]                         IF ←
  1638463[164302930]                           Условие ←
      404[164312640]                             Результат ≡ Цена ∙ 65545[164299293] ←
  1638475[164299030]                             Меньше или равно ←
      404[164334669]                             Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 30867472[171311190]                           THEN ←
  1507410[171311125]                             ВЫПОЛНИТЬ БЛОК ≡ Сообщение, что цены по акции равны или больше текущих ∙ 30867469[171311175] ←
 11010099[171311123]                             CONTINUE ←
 11010080[165355703]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374730]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347499]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
  1507410[164299416]                         ВЫПОЛНИТЬ БЛОК ≡ строки по премии ∙ 30867469[164299688] ←
  1507410[164299417]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
  1507410[164299419]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[164312598]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[164334671]                           Результат ⁼ 1 ←
 11010081[164299646]                       OF ⁼ 7 ←
 11010080[164306593]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[164320188]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164301995]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 30867470[164300471]                         IF ←
  1638463[164300862]                           Условие ←
      404[164320181]                             Результат ≡ Цена ∙ 65545[164299293] ←
  1638475[164298934]                             Меньше или равно ←
      404[164320187]                             Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 30867472[171311189]                           THEN ←
  1507410[171311124]                             ВЫПОЛНИТЬ БЛОК ≡ Сообщение, что цены по акции равны или больше текущих ∙ 30867469[171311175] ←
 11010099[171311122]                             CONTINUE ←
 11010080[165355702]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374728]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347498]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
 11010080[164308877]                         = ≡ Строка 2 ∙ 65545[164304276] ←
      404[164325633]                           Результат ⁼ 'Цена за 2-й товар' ←
  1507410[164299381]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
 11010080[164306404]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[164320183]                           Результат ⁼ 1 ←
 11010081[164299930]                       OF ⁼ 10 ←
 11010080[164306602]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[164320189]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164301996]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 30867470[164300523]                         IF ←
  1638463[164300927]                           Условие ←
      404[164320190]                             Результат ≡ Цена ∙ 65545[164299293] ←
  1638475[164298936]                             Меньше или равно ←
      404[164320191]                             Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 30867472[171311188]                           THEN ←
  1507410[171311123]                             ВЫПОЛНИТЬ БЛОК ≡ Сообщение, что цены по акции равны или больше текущих ∙ 30867469[171311175] ←
 11010099[171311121]                             CONTINUE ←
 11010080[165355701]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374726]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347497]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
  1507410[164299378]                         ВЫПОЛНИТЬ БЛОК ≡ строки по премии ∙ 30867469[164299688] ←
  1507410[164299382]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
  1507410[164299380]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[164307168]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[164320197]                           Результат ⁼ 1 ←
 11010081[164300035]                       OF • премия ⁼ 11 ←
 11010080[165355066]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165373119]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347453]                             Ссылка на шаблон ≡ Шаблон премия ∙ 12124193[165347409] ←
  1507410[164299402]                         ВЫПОЛНИТЬ БЛОК ≡ премия ∙ 30867469[164299542] ←
  1507410[164299404]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[164311230]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[164331681]                           Результат ⁼ 1 ←
 11010081[165347475]                       OF • премия ⁼ 211 ←
 11010080[165355067]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165373121]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347454]                             Ссылка на шаблон ≡ Шаблон премия ∙ 12124193[165347409] ←
  1507410[165347687]                         ВЫПОЛНИТЬ БЛОК ≡ премия ∙ 30867469[164299542] ←
  1507410[165347688]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[165347988]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[165355764]                           Результат ⁼ 1 ←
 11010081[165347510]                       OF • премия ⁼ 311 ←
 11010080[165355069]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165373123]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347455]                             Ссылка на шаблон ≡ Шаблон премия ∙ 12124193[165347409] ←
  1507410[165347689]                         ВЫПОЛНИТЬ БЛОК ≡ премия ∙ 30867469[164299542] ←
  1507410[165347690]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[165347990]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[165355789]                           Результат ⁼ 1 ←
 11010081[164299931]                       OF ⁼ 12 ←
 30867470[164300654]                         IF ←
  1638463[164301071]                           Условие ←
      116[164300398]                             Выражение ←
      404[164320203]                               Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164301997]                                 Уточняющий параметр ≡ Сумма ∙ 359[33619978] ←
  1638479[164299713]                               Не равно ←
  1638402[164299727]                               NULL ←
      412[164299093]                             ИЛИ ←
      116[164300460]                             Выражение ←
      404[164320204]                               Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164301998]                                 Уточняющий параметр ≡ Сумма по цене по накладной поставщика ∙ 359[14286862] ←
  1638479[164299714]                               Не равно ←
  1638402[164300160]                               NULL ←
 30867472[164300638]                           THEN ←
 11010080[165355070]                             = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165373125]                               Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347456]                                 Ссылка на шаблон ≡ Шаблон премия ∙ 12124193[165347409] ←
 30867470[164301651]                             IF ←
  1638463[164301113]                               Условие ←
      404[164320210]                                 Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164302000]                                   Уточняющий параметр ≡ Сумма ∙ 359[33619978] ←
  1638479[164299715]                                 Не равно ←
  1638402[164300301]                                 NULL ←
 30867472[164301630]                               THEN ←
 11010080[164310788]                                 = ≡ Целое ∙ 65545[164301603] ←
      404[164320211]                                   Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164302155]                                     Уточняющий параметр ≡ Сумма ∙ 359[33619978] ←
 11010080[164310789]                                 = ≡ Проц ∙ 65545[164301601] ←
      404[164320212]                                   Результат ≡ Целое ∙ 65545[164301603] ←
  1638487[164299079]                                   Конкатенировать строки ←
      404[164320213]                                   Результат ⁼ '%' ←
 30867470[164301652]                             IF ←
  1638463[164301114]                               Условие ←
      404[164320214]                                 Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164302452]                                   Уточняющий параметр ≡ Сумма по цене по накладной поставщика ∙ 359[14286862] ←
  1638479[164299716]                                 Не равно ←
  1638402[164300302]                                 NULL ←
 30867472[164301631]                               THEN ←
 11010080[164310790]                                 = ≡ Целое ∙ 65545[164301603] ←
      404[164320215]                                   Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164302558]                                     Уточняющий параметр ≡ Сумма по цене по накладной поставщика ∙ 359[14286862] ←
 11010080[164310791]                                 = ≡ Проц ∙ 65545[164301601] ←
      404[164320216]                                   Результат ≡ Целое ∙ 65545[164301603] ←
  1638487[164299080]                                   Конкатенировать строки ←
      404[164320217]                                   Результат ⁼ 'p' ←
 11010080[164310792]                             = ≡ Стр до ∙ 65545[164303637] ←
      404[164320218]                               Результат ⁼ 'Действует: ' ←
 30867470[164301653]                             IF ←
  1638463[164302317]                               Условие ←
      404[164320219]                                 Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164302559]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164304507]                                     Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638479[164299717]                                 Не равно ←
      404[164320220]                                 Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164304508]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164304509]                                     Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 30867472[164301632]                               THEN ←
 11010080[164310793]                                 = ≡ Стр до ∙ 65545[164303637] ←
      404[164320221]                                   Результат ≡ Стр до ∙ 65545[164303637] ←
      404[164320222]                                   Результат ⁼ 'с ' ←
      404[164320223]                                   Результат ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
 32505862[164300712]                                     Значения формальных параметров при вызове ←
 32505860[164302972]                                       Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[164305344]                                         Выражение ≡ Строка промо ∙ 65545[164303326] ←
      411[164304510]                                           Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164304511]                                             Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
 32505860[164302973]                                       Значение параметра при вызове процедуры/функции ≡ Формат ∙ 65545[30868172] ←
   327700[164305345]                                         Выражение ⁼ D!DD.MM.YY ←
      404[164320224]                                   Результат ⁼ ' по ' ←
      404[164320225]                                   Результат ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
 32505862[164300713]                                     Значения формальных параметров при вызове ←
 32505860[164302974]                                       Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[164305346]                                         Выражение ≡ Строка промо ∙ 65545[164303326] ←
      411[164304512]                                           Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164304513]                                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 32505860[164302975]                                       Значение параметра при вызове процедуры/функции ≡ Формат ∙ 65545[30868172] ←
   327700[164305347]                                         Выражение ⁼ D!DD.MM.YY ←
 30867473[164299791]                               ELSE ←
 11010080[164310794]                                 = ≡ Стр до ∙ 65545[164303637] ←
      404[164320226]                                   Результат ≡ Стр до ∙ 65545[164303637] ←
      404[164320227]                                   Результат ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
 32505862[164300714]                                     Значения формальных параметров при вызове ←
 32505860[164302976]                                       Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[164305348]                                         Выражение ≡ Строка промо ∙ 65545[164303326] ←
      411[164304514]                                           Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164304515]                                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 32505860[164302977]                                       Значение параметра при вызове процедуры/функции ≡ Формат ∙ 65545[30868172] ←
   327700[164305349]                                         Выражение ⁼ D!DD.MM.YY ←
 11010080[164310795]                             = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[164320228]                               Результат ⁼ 1 ←
 11010081[164300005]                       OF • одна цена ⁼ 16 ←
 11010080[165355700]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374724]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347496]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
  1507410[164299088]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[164312237]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[164333960]                           Результат ⁼ 1 ←
 11010081[165348435]                       OF • без скидки ⁼ 111 ←
 11010080[165355251]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165373624]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347451]                             Ссылка на шаблон ≡ Шаблон без акций ∙ 12124193[164298756] ←
 11010080[165355252]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[165373625]                           Результат ⁼ 1 ←
 11010081[170918304]                       OF • фрешбэк - обычный шаблон ⁼ 60 ←
 11010080[170921531]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[170928107]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[170917938]                             Ссылка на шаблон ≡ Шаблон без акций ∙ 12124193[164298756] ←
 11010080[170921532]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[170928108]                           Результат ⁼ 1 ←
 11010081[170918325]                       OF • Персональные предложения - обычный шалон ⁼ 61 ←
 11010080[170918720]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[170928706]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[170917926]                             Ссылка на шаблон ≡ Шаблон без акций ∙ 12124193[164298756] ←
 11010080[170918823]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[170928707]                           Результат ⁼ 1 ←
 11010081[164300006]                       OF • премия ⁼ 17 ←
 11010080[165355071]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165373127]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347477]                             Ссылка на шаблон ≡ Шаблон премия ∙ 12124193[165347409] ←
  1507410[164299398]                         ВЫПОЛНИТЬ БЛОК ≡ премия ∙ 30867469[164299542] ←
  1507410[164299397]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[164312238]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[164302905]                           Результат ⁼ 1 ←
 11010081[164300036]                       OF ⁼ 18 ←
 11010080[164311430]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[164331684]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164304842]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 30867470[164301916]                         IF ←
  1638463[164302653]                           Условие ←
      404[164331685]                             Результат ≡ Цена ∙ 65545[164299293] ←
  1638475[164299016]                             Меньше или равно ←
      404[164331688]                             Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 30867472[164301895]                           THEN ←
 11010088[170983924]                             ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[170984149]                               Значения формальных параметров при вызове ←
      117[170983739]                                 Выражение • Сообщение ≡ Длинная строка (512) ∙ 107[61669379] ←
      404[170986841]                                   Результат ⁼ 'Цена : "' ←
      404[170986844]                                   Результат ≡ Цена ∙ 65545[164299293] ←
      404[170986842]                                   Результат ⁼ '" < Новой цены : "' ←
      404[170986845]                                   Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[170986843]                                   Результат ⁼ '" - Прервать отчет ценника' ←
 32505860[170984598]                                 Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[170984852]                                   Выражение ≡ Сообщение ∙ 117[170983739] ←
 11010099[171311120]                             CONTINUE ←
 11010080[165355699]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374722]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347495]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
  1507410[164299406]                         ВЫПОЛНИТЬ БЛОК ≡ строки по премии ∙ 30867469[164299688] ←
  1507410[164299407]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
  1507410[164299409]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[164311435]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[164332207]                           Результат ⁼ 1 ←
 11010081[164299952]                       OF ⁼ 19 ←
 11010080[164311427]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[164331667]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164304836]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 30867470[164301848]                         IF ←
  1638463[164302565]                           Условие ←
      404[164331668]                             Результат ≡ Цена ∙ 65545[164299293] ←
  1638475[164298996]                             Меньше или равно ←
      404[164331669]                             Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 30867472[171311187]                           THEN ←
  1507410[171311122]                             ВЫПОЛНИТЬ БЛОК ≡ Сообщение, что цены по акции равны или больше текущих ∙ 30867469[171311175] ←
 11010099[171311119]                             CONTINUE ←
 11010080[165355698]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374720]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347494]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
  1507410[164299383]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
  1507410[164299395]                         ВЫПОЛНИТЬ БЛОК ≡ строки по премии ∙ 30867469[164299688] ←
  1507410[164299351]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[164311433]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[164331675]                           Результат ⁼ 1 ←
 11010081[164299605]                       OF ⁼ 20 ←
 11010080[164308066]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[164330998]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164304747]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 11010080[165355697]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374718]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347493]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
  1507410[164299384]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
  1507410[164299394]                         ВЫПОЛНИТЬ БЛОК ≡ строки по премии ∙ 30867469[164299688] ←
  1507410[164299349]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[164308072]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[164331006]                           Результат ⁼ 1 ←
 11010081[170918334]                       OF ⁼ 22 ←
 11010080[170922293]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[170931180]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[170919921]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 30867470[170919009]                         IF ←
  1638463[170919311]                           Условие ←
      404[170931185]                             Результат ≡ Цена ∙ 65545[164299293] ←
  1638475[170918054]                             Меньше или равно ←
      404[170931186]                             Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 30867472[170919003]                           THEN ←
  1507410[170918848]                             ВЫПОЛНИТЬ БЛОК ≡ Сообщение, что цены по акции равны или больше текущих ∙ 30867469[171311175] ←
 11010099[170917991]                             CONTINUE ←
  1507728[170918154]                         Начало многострочного комментария ←
  1507729[170918154]                         Конец многострочного комментария ←
 11010080[170922294]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[170931181]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[170917934]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
  1507410[170918845]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
  1507410[170918846]                         ВЫПОЛНИТЬ БЛОК ≡ строки по премии ∙ 30867469[164299688] ←
  1507410[170918847]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[170922295]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[170931182]                           Результат ⁼ 1 ←
 11010081[164299969]                       OF ⁼ 201 ←
 11010080[164311599]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[164332196]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164304911]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 11010080[165355696]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374716]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347492]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
  1507410[164299375]                         ВЫПОЛНИТЬ БЛОК ≡ строки по премии ∙ 30867469[164299688] ←
  1507410[164299385]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
  1507410[164299359]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[164311608]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[164332213]                           Результат ⁼ 1 ←
 11010081[164299988]                       OF ⁼ 202 ←
 11010080[164311789]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[164332787]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164304995]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 11010080[165355695]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374714]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347491]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
 11010080[164311796]                         = ≡ Цена 2 ∙ 65545[164299277] ←
  1638402[164301211]                           NULL ←
  1507410[164299372]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[164311798]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[164332813]                           Результат ⁼ 1 ←
 11010081[164299986]                       OF ⁼ 203 ←
 11010080[164311601]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[164332205]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164304989]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 11010080[165355694]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374712]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347490]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
  1507410[164299376]                         ВЫПОЛНИТЬ БЛОК ≡ строки по премии ∙ 30867469[164299688] ←
  1507410[164299386]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
  1507410[164299370]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[164311778]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[164332759]                           Результат ⁼ 1 ←
 11010081[164299987]                       OF ⁼ 204 ←
 11010080[164311779]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[164332760]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164304993]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 11010080[165355693]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374710]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347489]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
  1507410[164299377]                         ВЫПОЛНИТЬ БЛОК ≡ строки по премии ∙ 30867469[164299688] ←
  1507410[164299390]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
  1507410[164299371]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[164311788]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[164332786]                           Результат ⁼ 1 ←
 11010081[164299989]                       OF ⁼ 205 ←
 11010080[164311799]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[164332802]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[164304997]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 11010080[165355692]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374708]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347488]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
  1507410[164299373]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[164311808]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[164332838]                           Результат ⁼ 1 ←
 11010081[165348446]                       OF ⁼ 88 ←
 11010080[165355278]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[165370918]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[165353732]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 11010080[165355279]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165370935]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347452]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
  1507410[170918039]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
  1507410[165348316]                         ВЫПОЛНИТЬ БЛОК ≡ строки по премии ∙ 30867469[164299688] ←
  1507410[165348315]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
 11010080[165355280]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[165370936]                           Результат ⁼ 1 ←
 11010081[170917901]                       OF • Премия со статусами ⁼ 401 ←
 11010080[170918170]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[170918614]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[170917900]                             Ссылка на шаблон ≡ Шаблон без акций ∙ 12124193[164298756] ←
 11010080[170920840]                         = ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170925845]                           Результат ⁼ 401 (100,50,25%) ←
 11010080[170921326]                         = ≡ Строка с кодом акции ∙ 65545[170918940] ←
      404[170927344]                           Результат ⁼ <tr><td colspan=3 align=left valign=top style="font-size:16pt;font-family:calibri; line-height:75%;"> ←
      404[170927345]                           Результат ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170927346]                           Результат ⁼ </td></tr> ←
 11010080[170918173]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[170918615]                           Результат ⁼ 1 ←
  1507410[170918144]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
  1507410[170918178]                         ВЫПОЛНИТЬ БЛОК ≡ премия ∙ 30867469[164299542] ←
 11010081[170917902]                       OF • Премия со статусами ⁼ 402 ←
 11010080[170918174]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[170918616]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[170917901]                             Ссылка на шаблон ≡ Шаблон без акций ∙ 12124193[164298756] ←
 11010080[170918175]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[170918617]                           Результат ⁼ 1 ←
 11010080[170920841]                         = ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170925846]                           Результат ⁼ 402 (80,40,20%) ←
 11010080[170921327]                         = ≡ Строка с кодом акции ∙ 65545[170918940] ←
      404[170927347]                           Результат ⁼ <tr><td colspan=3 align=left valign=top style="font-size:16pt;font-family:calibri; line-height:75%;"> ←
      404[170927348]                           Результат ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170927349]                           Результат ⁼ </td></tr> ←
  1507410[170918145]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
  1507410[170918182]                         ВЫПОЛНИТЬ БЛОК ≡ премия ∙ 30867469[164299542] ←
 11010081[170917903]                       OF • Премия со статусами ⁼ 403 ←
 11010080[170918176]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[170918618]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[170917902]                             Ссылка на шаблон ≡ Шаблон без акций ∙ 12124193[164298756] ←
 11010080[170918177]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[170918619]                           Результат ⁼ 1 ←
 11010080[170920842]                         = ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170925847]                           Результат ⁼ 403 (40,20,10%) ←
 11010080[170921328]                         = ≡ Строка с кодом акции ∙ 65545[170918940] ←
      404[170927350]                           Результат ⁼ <tr><td colspan=3 align=left valign=top style="font-size:16pt;font-family:calibri; line-height:75%;"> ←
      404[170927351]                           Результат ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170927352]                           Результат ⁼ </td></tr> ←
  1507410[170918146]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
  1507410[170918183]                         ВЫПОЛНИТЬ БЛОК ≡ премия ∙ 30867469[164299542] ←
 11010081[170918293]                       OF • Премия со статусами ⁼ 407 ←
 11010080[170921457]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[170923237]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[170917936]                             Ссылка на шаблон ≡ Шаблон без акций ∙ 12124193[164298756] ←
 11010080[170921458]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[170923238]                           Результат ⁼ 1 ←
 11010080[170921459]                         = ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170923239]                           Результат ⁼ 407 (40,20,10%) ←
 11010080[170921460]                         = ≡ Строка с кодом акции ∙ 65545[170918940] ←
      404[170923240]                           Результат ⁼ <tr><td colspan=3 align=left valign=top style="font-size:16pt;font-family:calibri; line-height:75%;"> ←
      404[170924895]                           Результат ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170924896]                           Результат ⁼ </td></tr> ←
  1507410[170918736]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
  1507410[170918737]                         ВЫПОЛНИТЬ БЛОК ≡ премия ∙ 30867469[164299542] ←
 11010081[170917904]                       OF • Премия со статусами ⁼ 404 ←
 11010080[170918178]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[170918620]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[170917903]                             Ссылка на шаблон ≡ Шаблон без акций ∙ 12124193[164298756] ←
 11010080[170918179]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[170918621]                           Результат ⁼ 1 ←
 11010080[170920843]                         = ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170925848]                           Результат ⁼ 404 (10,5,0%) ←
 11010080[170921329]                         = ≡ Строка с кодом акции ∙ 65545[170918940] ←
      404[170927353]                           Результат ⁼ <tr><td colspan=3 align=left valign=top style="font-size:16pt;font-family:calibri; line-height:75%;"> ←
      404[170927354]                           Результат ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170927355]                           Результат ⁼ </td></tr> ←
  1507410[170918147]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
  1507410[170918184]                         ВЫПОЛНИТЬ БЛОК ≡ премия ∙ 30867469[164299542] ←
 11010081[170918159]                       OF • Премия со статусами ⁼ 405 ←
 11010080[170920152]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[170924977]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[170917904]                             Ссылка на шаблон ≡ Шаблон без акций ∙ 12124193[164298756] ←
 11010080[170920153]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[170924978]                           Результат ⁼ 1 ←
 11010080[170920844]                         = ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170925849]                           Результат ⁼ 405 (15,10,5%) ←
 11010080[170921330]                         = ≡ Строка с кодом акции ∙ 65545[170918940] ←
      404[170927356]                           Результат ⁼ <tr><td colspan=3 align=left valign=top style="font-size:16pt;font-family:calibri; line-height:75%;"> ←
      404[170927357]                           Результат ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170927358]                           Результат ⁼ </td></tr> ←
  1507410[170918682]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
  1507410[170918683]                         ВЫПОЛНИТЬ БЛОК ≡ премия ∙ 30867469[164299542] ←
 11010081[170918041]                       OF ⁼ 48 ←
 11010080[170921056]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[170926450]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[170919120]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 30867470[170918616]                         IF ←
  1638463[170918812]                           Условие ←
      404[170926451]                             Результат ≡ Цена ∙ 65545[164299293] ←
  1638475[170918006]                             Меньше или равно ←
      404[170926452]                             Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 30867472[171311186]                           THEN ←
  1507410[171311121]                             ВЫПОЛНИТЬ БЛОК ≡ Сообщение, что цены по акции равны или больше текущих ∙ 30867469[171311175] ←
 11010099[171311118]                             CONTINUE ←
 11010080[170921057]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[170926453]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[170917912]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
  1507410[170918221]                         ВЫПОЛНИТЬ БЛОК ≡ строки по премии ∙ 30867469[164299688] ←
  1507410[170918222]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
  1507410[170918223]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[170921058]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[170926454]                           Результат ⁼ 1 ←
 11010081[170918222]                       OF • Скидка + премия по статусам ⁼ 4012 ←
 11010080[170921324]                         = ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170927341]                           Результат ⁼ 4012 (25,50,100%) ←
 11010080[170921331]                         = ≡ Строка с кодом акции ∙ 65545[170918940] ←
      404[170927359]                           Результат ⁼ <tr><td colspan=3 align=left valign=top style="font-size:16pt;font-family:calibri; line-height:75%;"> ←
      404[170927360]                           Результат ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170927361]                           Результат ⁼ </td></tr> ←
 11010080[170919770]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[170918847]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[170919140]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 30867470[170918284]                         IF ←
  1638463[170918385]                           Условие ←
      404[170922940]                             Результат ≡ Цена ∙ 65545[164299293] ←
  1638475[170918007]                             Меньше или равно ←
      404[170923225]                             Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 30867472[171311185]                           THEN ←
  1507410[171311120]                             ВЫПОЛНИТЬ БЛОК ≡ Сообщение, что цены по акции равны или больше текущих ∙ 30867469[171311175] ←
 11010099[171311117]                             CONTINUE ←
 11010080[170919771]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[170923226]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[170917915]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
  1507410[170918433]                         ВЫПОЛНИТЬ БЛОК ≡ строки по премии ∙ 30867469[164299688] ←
  1507410[170918434]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
  1507410[170918435]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[170919772]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[170923227]                           Результат ⁼ 1 ←
 11010081[170918223]                       OF • Скидка + премия по статусам ⁼ 4022 ←
 11010080[170921325]                         = ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170927342]                           Результат ⁼ 4022 (20,40,80%) ←
 11010080[170921332]                         = ≡ Строка с кодом акции ∙ 65545[170918940] ←
      404[170927362]                           Результат ⁼ <tr><td colspan=3 align=left valign=top style="font-size:16pt;font-family:calibri; line-height:75%;"> ←
      404[170927363]                           Результат ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170927364]                           Результат ⁼ </td></tr> ←
 11010080[170919773]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[170923228]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[170919141]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 30867470[170918623]                         IF ←
  1638463[170918816]                           Условие ←
      404[170923231]                             Результат ≡ Цена ∙ 65545[164299293] ←
  1638475[170918008]                             Меньше или равно ←
      404[170923232]                             Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 30867472[170918617]                           THEN ←
  1507410[171311119]                             ВЫПОЛНИТЬ БЛОК ≡ Сообщение, что цены по акции равны или больше текущих ∙ 30867469[171311175] ←
 11010099[171311116]                             CONTINUE ←
 11010080[170921072]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[170924177]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[170917916]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
  1507410[170918437]                         ВЫПОЛНИТЬ БЛОК ≡ строки по премии ∙ 30867469[164299688] ←
  1507410[170918438]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
  1507410[170918439]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[170921073]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[170924855]                           Результат ⁼ 1 ←
 11010081[170918340]                       OF • Скидка + премия по статусам ⁼ 4032 ←
 11010080[170922446]                         = ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170931775]                           Результат ⁼ 4032 (10,20,40%) ←
 11010080[170922447]                         = ≡ Строка с кодом акции ∙ 65545[170918940] ←
      404[170931776]                           Результат ⁼ <tr><td colspan=3 align=left valign=top style="font-size:16pt;font-family:calibri; line-height:75%;"> ←
      404[170931777]                           Результат ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170931778]                           Результат ⁼ </td></tr> ←
 11010080[170922448]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[170931779]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[170920077]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 30867470[170919049]                         IF ←
  1638463[170919365]                           Условие ←
      404[170931780]                             Результат ≡ Цена ∙ 65545[164299293] ←
  1638475[170918060]                             Меньше или равно ←
      404[170931781]                             Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 30867472[170919043]                           THEN ←
  1507410[170918804]                             ВЫПОЛНИТЬ БЛОК ≡ Сообщение, что цены по акции равны или больше текущих ∙ 30867469[171311175] ←
 11010099[170917998]                             CONTINUE ←
 11010080[170922449]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[170931782]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[170917939]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
  1507410[170918805]                         ВЫПОЛНИТЬ БЛОК ≡ строки по премии ∙ 30867469[164299688] ←
  1507410[170918849]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
  1507410[170918850]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[170922450]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[170931783]                           Результат ⁼ 1 ←
 11010081[170918224]                       OF • Скидка + премия по статусам ⁼ 406 ←
 11010080[170921323]                         = ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170927340]                           Результат ⁼ 406 (0,5,5%) ←
 11010080[170921333]                         = ≡ Строка с кодом акции ∙ 65545[170918940] ←
      404[170927365]                           Результат ⁼ <tr><td colspan=3 align=left valign=top style="font-size:16pt;font-family:calibri; line-height:75%;"> ←
      404[170927366]                           Результат ≡ Код акции в шаблон ∙ 65545[170918674] ←
      404[170927367]                           Результат ⁼ </td></tr> ←
 11010080[170921074]                         = ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
      404[170926426]                           Результат ≡ Строка промо ∙ 65545[164303326] ←
      411[170919142]                             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 30867470[170918624]                         IF ←
  1638463[170918817]                           Условие ←
      404[170926437]                             Результат ≡ Цена ∙ 65545[164299293] ←
  1638475[170918009]                             Меньше или равно ←
      404[170926439]                             Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 30867472[170918618]                           THEN ←
  1507410[171311129]                             ВЫПОЛНИТЬ БЛОК ≡ Сообщение, что цены по акции равны или больше текущих ∙ 30867469[171311175] ←
 11010099[171311127]                             CONTINUE ←
 11010080[170921075]                         = ≡ Файл отчета ∙ 65545[164299298] ←
      404[170926473]                           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[170917917]                             Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
  1507410[170918460]                         ВЫПОЛНИТЬ БЛОК ≡ строки по премии ∙ 30867469[164299688] ←
  1507410[170918464]                         ВЫПОЛНИТЬ БЛОК ≡ цена 2 ∙ 30867469[164300152] ←
  1507410[170918466]                         ВЫПОЛНИТЬ БЛОК ≡ дейстует до ∙ 30867469[164300028] ←
 11010080[170921076]                         = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[170926474]                           Результат ⁼ 1 ←
 30867470[164300469]                     IF ←
  1638463[164300736]                       Условие ←
      404[164320186]                         Результат ≡ Уже определен шаблон ∙ 65545[164304146] ←
  1638473[164301850]                         Равно ←
      404[164320202]                         Результат ⁼ 0 ←
 30867472[164300456]                       THEN ←
 11010080[164306592]                         = ≡ Строка 1 ∙ 65545[164304987] ←
      404[164320185]                           Результат ⁼ 'ЦЕНА БЕЗ КАРТЫ ПРЕМИЯ:' ←
 11010080[164303936]                         = ≡ Строка 2 ∙ 65545[164304276] ←
      404[164318726]                           Результат ⁼ 'ЦЕНА ПО КАРТЕ ПРЕМИЯ:' ←
 30867470[164301105]                         IF ←
  1638463[164301651]                           Условие ←
      404[164324647]                             Результат ≡ Строка спецназ ∙ 65545[164304145] ←
  1638479[164299600]                             Не равно ←
  1638402[164300665]                             NULL ←
 30867472[164301088]                           THEN ←
 11010080[164308622]                             = ≡ Уже определен шаблон ∙ 65545[164304146] ←
      404[164324650]                               Результат ⁼ 1 ←
 30867470[164758347]                             IF ←
  1638463[164758619]                               Условие ←
      404[164762098]                                 Результат ≡ Строка неделя ∙ 65545[164304032] ←
      411[164758781]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164758782]                                     Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[164760051]                                       Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
      411[164760052]                                         Уточняющий параметр ≡ Основной сотрудник (Да/Нет) ∙ 283[14811156] ←
  1638479[164757740]                                 Не равно ←
      404[164762099]                                 Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[164758332]                               THEN ←
 11010079[164298962]                                 CASE ←
  1572877[164298967]                                   Условие ←
      404[164311155]                                     Результат ≡ Код акции ∙ 65545[164304033] ←
 11010081[164299764]                                   OF ⁼ 1 ←
 11010080[164309360]                                     = ≡ Цена 2 ∙ 65545[164299277] ←
      404[164325744]                                       Результат ≡ Цена ∙ 65545[164299293] ←
 11010080[164309361]                                     = ≡ Цена ∙ 65545[164299293] ←
      404[164325745]                                       Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 11010080[165355690]                                     = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374287]                                       Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347486]                                         Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
 11010081[165347511]                                   OF ⁼ 21 ←
 11010080[165347991]                                     = ≡ Цена 2 ∙ 65545[164299277] ←
      404[165355790]                                       Результат ≡ Цена ∙ 65545[164299293] ←
 11010080[165347992]                                     = ≡ Цена ∙ 65545[164299293] ←
      404[165355791]                                       Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 11010080[165355689]                                     = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374284]                                       Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347485]                                         Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
 11010081[165347512]                                   OF ⁼ 31 ←
 11010080[165348232]                                     = ≡ Цена 2 ∙ 65545[164299277] ←
      404[165355793]                                       Результат ≡ Цена ∙ 65545[164299293] ←
 11010080[165348237]                                     = ≡ Цена ∙ 65545[164299293] ←
      404[165355794]                                       Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 11010080[165355688]                                     = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374279]                                       Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347484]                                         Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
 11010081[164299907]                                   OF ⁼ 10 ←
 11010080[164310768]                                     = ≡ Цена 2 ∙ 65545[164299277] ←
      404[164329656]                                       Результат ≡ Цена ∙ 65545[164299293] ←
 11010080[164310769]                                     = ≡ Цена ∙ 65545[164299293] ←
      404[164329657]                                       Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 11010080[165355687]                                     = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374277]                                       Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347483]                                         Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
 11010081[164299226]                                   OF ⁼ 18 ←
 11010080[165355686]                                     = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374230]                                       Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347482]                                         Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
 30867473[164299120]                                   ELSE ←
 11010080[164758887]                                     = ≡ Цена ∙ 65545[164299293] ←
      404[164762103]                                       Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 11010080[165355570]                                     = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374228]                                       Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347481]                                         Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
 30867473[164757808]                               ELSE ←
 11010080[164758886]                                 = ≡ Цена ∙ 65545[164299293] ←
      404[164762101]                                   Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
 11010080[165355543]                                 = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374223]                                   Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347480]                                     Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
 11010080[164308626]                             = ≡ Стр до ∙ 65545[164303637] ←
      404[164324656]                               Результат ⁼ 'Действует: ' ←
 30867470[164301107]                             IF ←
  1638463[164301653]                               Условие ←
      404[164324657]                                 Результат ≡ Строка спецназ ∙ 65545[164304145] ←
      411[164303739]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164303740]                                     Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638479[164299601]                                 Не равно ←
      404[164324658]                                 Результат ≡ Строка спецназ ∙ 65545[164304145] ←
      411[164303741]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164303742]                                     Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 30867472[164301090]                               THEN ←
 11010080[164308627]                                 = ≡ Стр до ∙ 65545[164303637] ←
      404[164324659]                                   Результат ≡ Стр до ∙ 65545[164303637] ←
      404[164324660]                                   Результат ⁼ 'с ' ←
      404[164324661]                                   Результат ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
 32505862[164301145]                                     Значения формальных параметров при вызове ←
 32505860[164303897]                                       Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[164306953]                                         Выражение ≡ Строка спецназ ∙ 65545[164304145] ←
      411[164303743]                                           Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164303744]                                             Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
 32505860[164303898]                                       Значение параметра при вызове процедуры/функции ≡ Формат ∙ 65545[30868172] ←
   327700[164306954]                                         Выражение ⁼ D!DD.MM.YY ←
      404[164324662]                                   Результат ⁼ ' по ' ←
      404[164324663]                                   Результат ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
 32505862[164301146]                                     Значения формальных параметров при вызове ←
 32505860[164303899]                                       Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[164306955]                                         Выражение ≡ Строка спецназ ∙ 65545[164304145] ←
      411[164303745]                                           Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164303746]                                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 32505860[164303900]                                       Значение параметра при вызове процедуры/функции ≡ Формат ∙ 65545[30868172] ←
   327700[164306956]                                         Выражение ⁼ D!DD.MM.YY ←
 30867473[164299528]                               ELSE ←
 11010080[164308628]                                 = ≡ Стр до ∙ 65545[164303637] ←
      404[164324664]                                   Результат ≡ Стр до ∙ 65545[164303637] ←
      404[164324665]                                   Результат ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
 32505862[164301147]                                     Значения формальных параметров при вызове ←
 32505860[164303901]                                       Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[164306957]                                         Выражение ≡ Строка спецназ ∙ 65545[164304145] ←
      411[164303747]                                           Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164303748]                                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 32505860[164303902]                                       Значение параметра при вызове процедуры/функции ≡ Формат ∙ 65545[30868172] ←
   327700[164306958]                                         Выражение ⁼ D!DD.MM.YY ←
 30867470[164301030]                         IF ←
  1638463[164301562]                           Условие ←
      404[164308708]                             Результат ≡ Строка неделя ∙ 65545[164304032] ←
  1638479[164299022]                             Не равно ←
  1638402[164299400]                             NULL ←
 30867472[164301015]                           THEN ←
 11010080[164308460]                             = ≡ Тип ∙ 65545[164301604] ←
      404[164308712]                               Результат ⁼ 1 ←
 30867470[164757954]                             IF ←
  1638463[164758079]                               Условие ←
      404[164762088]                                 Результат ≡ Строка неделя ∙ 65545[164304032] ←
      411[164758754]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164758756]                                     Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[164758757]                                       Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
      411[164758758]                                         Уточняющий параметр ≡ Основной сотрудник (Да/Нет) ∙ 283[14811156] ←
  1638479[164757738]                                 Не равно ←
      404[164762089]                                 Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[164757942]                               THEN ←
 11010079[164298983]                                 CASE ←
  1572877[164298989]                                   Условие ←
      404[164319670]                                     Результат ≡ Код акции ∙ 65545[164304033] ←
 11010081[164299639]                                   OF ⁼ 1 ←
 11010080[164308737]                                     = ≡ Файл отчета ∙ 65545[164299298] ←
      404[164319671]                                       Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[164298861]                                         Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
 11010081[165347513]                                   OF ⁼ 21 ←
 11010080[165348395]                                     = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165355796]                                       Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347335]                                         Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
 11010081[165347514]                                   OF ⁼ 31 ←
 11010080[165348396]                                     = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165355797]                                       Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347336]                                         Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
 11010081[164299640]                                   OF ⁼ 10 ←
 11010080[164308739]                                     = ≡ Файл отчета ∙ 65545[164299298] ←
      404[164319673]                                       Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[164298863]                                         Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
 30867473[164299538]                                   ELSE ←
 11010080[165355072]                                     = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374203]                                       Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347478]                                         Ссылка на шаблон ≡ Шаблон премия ∙ 12124193[165347409] ←
 11010080[164304326]                             = ≡ Проц ∙ 65545[164301601] ←
      404[164308714]                               Результат ⁼ '' ←
 11010080[164308466]                             = ≡ Стр до ∙ 65545[164303637] ←
      404[164308724]                               Результат ⁼ 'Действует: ' ←
 30867470[164301032]                             IF ←
  1638463[164301564]                               Условие ←
      404[164308766]                                 Результат ≡ Строка неделя ∙ 65545[164304032] ←
      411[164303519]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164303520]                                     Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638479[164299048]                                 Не равно ←
      404[164308767]                                 Результат ≡ Строка неделя ∙ 65545[164304032] ←
      411[164303523]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164303524]                                     Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 30867472[164301014]                               THEN ←
 11010080[164308467]                                 = ≡ Стр до ∙ 65545[164303637] ←
      404[164308769]                                   Результат ≡ Стр до ∙ 65545[164303637] ←
      404[164309241]                                   Результат ⁼ 'с ' ←
      404[164309242]                                   Результат ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
 32505862[164299782]                                     Значения формальных параметров при вызове ←
 32505860[164302047]                                       Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[164301942]                                         Выражение ≡ Строка неделя ∙ 65545[164304032] ←
      411[164303525]                                           Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164303526]                                             Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
 32505860[164303696]                                       Значение параметра при вызове процедуры/функции ≡ Формат ∙ 65545[30868172] ←
   327700[164301945]                                         Выражение ⁼ D!DD.MM.YY ←
      404[164309243]                                   Результат ⁼ ' по ' ←
      404[164309244]                                   Результат ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
 32505862[164300308]                                     Значения формальных параметров при вызове ←
 32505860[164303772]                                       Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[164301950]                                         Выражение ≡ Строка неделя ∙ 65545[164304032] ←
      411[164303527]                                           Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164303528]                                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 32505860[164303773]                                       Значение параметра при вызове процедуры/функции ≡ Формат ∙ 65545[30868172] ←
   327700[164301951]                                         Выражение ⁼ D!DD.MM.YY ←
 30867473[164299519]                               ELSE ←
 11010080[164308468]                                 = ≡ Стр до ∙ 65545[164303637] ←
      404[164309245]                                   Результат ≡ Стр до ∙ 65545[164303637] ←
      404[164309246]                                   Результат ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
 32505862[164301050]                                     Значения формальных параметров при вызове ←
 32505860[164303774]                                       Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[164302394]                                         Выражение ≡ Строка неделя ∙ 65545[164304032] ←
      411[164303529]                                           Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164303530]                                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 32505860[164303775]                                       Значение параметра при вызове процедуры/функции ≡ Формат ∙ 65545[30868172] ←
   327700[164302575]                                         Выражение ⁼ D!DD.MM.YY ←
 30867470[164300732]                         IF ←
  1638463[164300152]                           Условие ←
      404[164310877]                             Результат ≡ Строка премия ∙ 65545[164301599] ←
  1638479[164298959]                             Не равно ←
  1638402[164300380]                             NULL ←
 30867472[164300717]                           THEN ←
 11010080[164303997]                             = ≡ Тип ∙ 65545[164301604] ←
      404[164311027]                               Результат ⁼ 1 ←
 11010080[165355098]                             = ≡ Файл отчета ∙ 65545[164299298] ←
      404[165374219]                               Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[165347479]                                 Ссылка на шаблон ≡ Шаблон премия ∙ 12124193[165347409] ←
 30867470[164300733]                             IF ←
  1638463[164300153]                               Условие ←
      404[164311029]                                 Результат ≡ Строка премия ∙ 65545[164301599] ←
      411[164302789]                                   Уточняющий параметр ≡ Сумма ∙ 359[33619978] ←
  1638479[164298960]                                 Не равно ←
  1638402[164300383]                                 NULL ←
 30867472[164300718]                               THEN ←
 11010080[164303995]                                 = ≡ Целое ∙ 65545[164301603] ←
      404[164311100]                                   Результат ≡ Строка премия ∙ 65545[164301599] ←
      411[164302790]                                     Уточняющий параметр ≡ Сумма ∙ 359[33619978] ←
 11010080[164303996]                                 = ≡ Проц ∙ 65545[164301601] ←
      404[164311101]                                   Результат ≡ Целое ∙ 65545[164301603] ←
  1638487[164298755]                                   Конкатенировать строки ←
      404[164312001]                                   Результат ⁼ '%' ←
 30867470[164300734]                             IF ←
  1638463[164300154]                               Условие ←
      404[164311966]                                 Результат ≡ Строка премия ∙ 65545[164301599] ←
      411[164302791]                                   Уточняющий параметр ≡ Сумма по цене по накладной поставщика ∙ 359[14286862] ←
  1638479[164298961]                                 Не равно ←
  1638402[164300384]                                 NULL ←
 30867472[164300719]                               THEN ←
 11010080[164303998]                                 = ≡ Целое ∙ 65545[164301603] ←
      404[164311967]                                   Результат ≡ Строка премия ∙ 65545[164301599] ←
      411[164302792]                                     Уточняющий параметр ≡ Сумма по цене по накладной поставщика ∙ 359[14286862] ←
 11010080[164303999]                                 = ≡ Проц ∙ 65545[164301601] ←
      404[164311968]                                   Результат ≡ Целое ∙ 65545[164301603] ←
  1638487[164298756]                                   Конкатенировать строки ←
      404[164311283]                                   Результат ⁼ 'p' ←
 11010080[164307684]                             = ≡ Стр до ∙ 65545[164303637] ←
      404[164321653]                               Результат ⁼ 'Действует: ' ←
 30867470[164300794]                             IF ←
  1638463[164301250]                               Условие ←
      404[164321654]                                 Результат ≡ Строка премия ∙ 65545[164301599] ←
      411[164302649]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164302918]                                     Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638479[164299477]                                 Не равно ←
      404[164321655]                                 Результат ≡ Строка премия ∙ 65545[164301599] ←
      411[164302919]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164302920]                                     Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 30867472[164300779]                               THEN ←
 11010080[164307685]                                 = ≡ Стр до ∙ 65545[164303637] ←
      404[164321658]                                   Результат ≡ Стр до ∙ 65545[164303637] ←
      404[164321659]                                   Результат ⁼ 'с ' ←
      404[164308715]                                   Результат ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
 32505862[164299769]                                     Значения формальных параметров при вызове ←
 32505860[164301040]                                       Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[164301908]                                         Выражение ≡ Строка премия ∙ 65545[164301599] ←
      411[164303516]                                           Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164303517]                                             Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
 32505860[164301290]                                       Значение параметра при вызове процедуры/функции ≡ Формат ∙ 65545[30868172] ←
   327700[164301909]                                         Выражение ⁼ D!DD.MM.YY ←
      404[164308716]                                   Результат ⁼ ' по ' ←
      404[164321657]                                   Результат ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
 32505862[164300809]                                     Значения формальных параметров при вызове ←
 32505860[164299305]                                       Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[164302979]                                         Выражение ≡ Строка премия ∙ 65545[164301599] ←
      411[164302921]                                           Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164302922]                                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 32505860[164299306]                                       Значение параметра при вызове процедуры/функции ≡ Формат ∙ 65545[30868172] ←
   327700[164302986]                                         Выражение ⁼ D!DD.MM.YY ←
 30867473[164299517]                               ELSE ←
 11010080[164308465]                                 = ≡ Стр до ∙ 65545[164303637] ←
      404[164308713]                                   Результат ≡ Стр до ∙ 65545[164303637] ←
      404[164308768]                                   Результат ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
 32505862[164299919]                                     Значения формальных параметров при вызове ←
 32505860[164303697]                                       Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[164301948]                                         Выражение ≡ Строка премия ∙ 65545[164301599] ←
      411[164303521]                                           Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164303522]                                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 32505860[164303711]                                       Значение параметра при вызове процедуры/функции ≡ Формат ∙ 65545[30868172] ←
   327700[164301949]                                         Выражение ⁼ D!DD.MM.YY ←
 30867470[164301031]                         IF ←
  1638463[164301563]                           Условие ←
      116[164299551]                             Выражение ←
      404[164308709]                               Результат ≡ Строка премия ∙ 65545[164301599] ←
  1638473[164301003]                               Равно ←
  1638402[164299428]                               NULL ←
      413[164300292]                             И ←
      116[164299552]                             Выражение ←
      404[164308711]                               Результат ≡ Строка неделя ∙ 65545[164304032] ←
  1638473[164301004]                               Равно ←
  1638402[164299432]                               NULL ←
      413[164302962]                             И ←
      116[164301085]                             Выражение ←
      404[164324651]                               Результат ≡ Строка спецназ ∙ 65545[164304145] ←
  1638473[164304842]                               Равно ←
  1638402[164300666]                               NULL ←
 30867472[164301013]                           THEN ←
 30867470[164300441]                             IF ←
  1638463[164300818]                               Условие ←
      116[164301455]                                 Выражение ←
      116[164301456]                                   Выражение ←
      404[164329542]                                     Результат ≡ Код акции ∙ 65545[164304033] ←
  1638473[164306153]                                     Равно ←
      404[164329543]                                     Результат ⁼ 3 ←
      412[164299467]                                   ИЛИ ←
      116[164301457]                                   Выражение ←
      404[164329544]                                     Результат ≡ Акция по ценовой акции ∙ 65545[164302701] ←
  1638473[164306154]                                     Равно ←
      404[164329545]                                     Результат ≡ Бери больше - плати меньше ∙ 117[164888732] ←
      413[164301796]                                 И ←
      116[164300355]                                 Выражение ←
      404[164317626]                                   Результат ≡ Новая цена по ценовой акции ∙ 65545[164302702] ←
  1638478[164299061]                                   Больше ←
      404[164317627]                                   Результат ⁼ 0 ←
 30867472[164300428]                               THEN ←
 11010080[164304000]                                 = ≡ Тип ∙ 65545[164301604] ←
      404[164312002]                                   Результат ⁼ 2 ←
 11010080[164299819]                                 = ≡ Файл отчета ∙ 65545[164299298] ←
      404[164301177]                                   Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[164298769]                                     Ссылка на шаблон ≡ Шаблон скидка ∙ 12124193[165347408] ←
 30867473[164299298]                               ELSE ←
 11010080[164304001]                                 = ≡ Тип ∙ 65545[164301604] ←
      404[164312003]                                   Результат ⁼ 3 ←
 11010080[164306316]                                 = ≡ Файл отчета ∙ 65545[164299298] ←
      404[164317628]                                   Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[164298837]                                     Ссылка на шаблон ≡ Шаблон без акций ∙ 12124193[164298756] ←
 11010088[171311231]                         ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[171311217]                           Значения формальных параметров при вызове ←
      117[171311119]                             Выражение • Сообщение ≡ Длинная строка (512) ∙ 107[61669379] ←
      404[171312039]                               Результат ⁼ 'Изначальный файл ценника : "' ←
      404[171312040]                               Результат ≡ Файл отчета ∙ 65545[164299298] ←
      404[171312041]                               Результат ⁼ '"' ←
 32505860[171311342]                             Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[171311427]                               Выражение ≡ Сообщение ∙ 117[171311119] ←
 11010093[171835418]                   Комментарий • 1047314 печать за 100г ←
 30867469[170917984]                   БЛОК • Замена наименования если цена за 100гр ←
 30867470[170918086]                     IF ←
  1638463[170918138]                       Условие ←
      116[170918167]                         Выражение ←
      116[171116575]                           Выражение ←
      116[171116574]                             Выражение ←
      404[171136646]                               Результат ≡ Кол-во товаров ∙ 65545[656085785] ←
  1638478[171114805]                               Больше ←
      404[171136647]                               Результат ⁼ 1 ←
      413[171115208]                             И ←
      116[171835433]                             Выражение ←
      404[171836262]                               Результат ≡ Признак из подгруппы/товара "Печатать за 100г" (да/нет) ∙ 249[164298821] ←
 32505862[171835508]                                 Значения формальных параметров при вызове ←
 32505860[171835642]                                   Значение параметра при вызове процедуры/функции ≡ фп Продукт in ∙ 65545[164301354] ←
   327700[171835679]                                     Выражение ≡ Продукт Ид ∙ 65545[164299290] ←
  1638473[171835600]                               Равно ←
      404[171836263]                               Результат ≡ Да ∙ 131203075[131203074] ←
      412[171835415]                           ИЛИ ←
      116[171835434]                           Выражение ←
      404[171836264]                             Результат ≡ Печатать за 100г ∙ 65545[171835583] ←
  1638473[171835601]                             Равно ←
      404[171836265]                             Результат ≡ Да ∙ 131203075[131203074] ←
      413[170917941]                         И ←
      116[170918168]                         Выражение ←
      404[170920235]                           Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170918203]                             Уточняющий параметр ≡ Тип измерения ∙ 305[14745610] ←
  1638473[170918322]                           Равно ←
      404[170920236]                           Результат ≡ Весовой ∙ 131203073[17301506] ←
 30867472[170918083]                       THEN • Меняем в наименовании КГ на 100гр и делим цены ←
 11010093[170917947]                         Комментарий • возьмем последние 2 символа ←
 11010080[170918653]                         = ≡ Строка отладки ∙ 65545[170918067] ←
      404[170920231]                           Результат ⁼ 'Наименование ' ←
      404[170920232]                           Результат ≡ Наименование ∙ 65545[164299292] ←
 11010088[170918130]                         ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[170918179]                           Значения формальных параметров при вызове ←
 32505860[170918478]                             Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[170918685]                               Выражение ≡ Строка отладки ∙ 65545[170918067] ←
 11010080[170918642]                         = ≡ len ∙ 65545[170918065] ←
      404[170920217]                           Результат ≡ Len ∙ 249[48431563] ←
 32505862[170918172]                             Значения формальных параметров при вызове ←
 32505860[170918459]                               Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[48436871] ←
   327700[170918666]                                 Выражение ≡ Наименование ∙ 65545[164299292] ←
 48431133[170917892]                         -= ≡ len ∙ 65545[170918065] ←
      404[170920219]                           Результат ⁼ 2 ←
 11010080[170918643]                         = ≡ Последние 2 символа ∙ 65545[170918066] ←
      404[170920218]                           Результат ≡ SubString ∙ 249[1507580] ←
 32505862[170918173]                             Значения формальных параметров при вызове ←
 32505860[170918460]                               Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[170918667]                                 Выражение ≡ Наименование ∙ 65545[164299292] ←
 32505860[170918461]                               Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[170918668]                                 Выражение ≡ len ∙ 65545[170918065] ←
 32505860[170918462]                               Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[170918669]                                 Выражение ⁼ 3 ←
 11010080[170918654]                         = ≡ Строка отладки ∙ 65545[170918067] ←
      404[170920221]                           Результат ⁼ 'последние 2 символа' ←
      404[170920220]                           Результат ≡ Последние 2 символа ∙ 65545[170918066] ←
 11010088[170918128]                         ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[170918180]                           Значения формальных параметров при вызове ←
 32505860[170918479]                             Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[170918686]                               Выражение ≡ Строка отладки ∙ 65545[170918067] ←
 30867470[170918087]                         IF ←
  1638463[170918139]                           Условие ←
      404[170920222]                             Результат ≡ Pos ∙ 249[48431562] ←
 32505862[170918174]                               Значения формальных параметров при вызове ←
 32505860[170918463]                                 Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[48436867] ←
   327700[170918670]                                   Выражение ≡ Последние 2 символа ∙ 65545[170918066] ←
 32505860[170918464]                                 Значение параметра при вызове процедуры/функции ≡ Искомая подстрока ∙ 65545[48436868] ←
   327700[170918671]                                   Выражение ⁼ 'КГ' ←
 32505860[170918472]                                 Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[48436869] ←
   327700[170918679]                                   Выражение ⁼ 1 ←
      412[170918039]                             ИЛИ ←
      404[170920225]                             Результат ≡ Pos ∙ 249[48431562] ←
 32505862[170918176]                               Значения формальных параметров при вызове ←
 32505860[170918465]                                 Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[48436867] ←
   327700[170918672]                                   Выражение ≡ Последние 2 символа ∙ 65545[170918066] ←
 32505860[170918469]                                 Значение параметра при вызове процедуры/функции ≡ Искомая подстрока ∙ 65545[48436868] ←
   327700[170918676]                                   Выражение ⁼ 'КГ ' ←
 32505860[170918473]                                 Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[48436869] ←
   327700[170918680]                                   Выражение ⁼ 1 ←
      412[170918040]                             ИЛИ ←
      404[170920226]                             Результат ≡ Pos ∙ 249[48431562] ←
 32505862[170918177]                               Значения формальных параметров при вызове ←
 32505860[170918470]                                 Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[48436867] ←
   327700[170918677]                                   Выражение ≡ Последние 2 символа ∙ 65545[170918066] ←
 32505860[170918471]                                 Значение параметра при вызове процедуры/функции ≡ Искомая подстрока ∙ 65545[48436868] ←
   327700[170918678]                                   Выражение ⁼ ' КГ' ←
 32505860[170918474]                                 Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[48436869] ←
   327700[170918681]                                   Выражение ⁼ 1 ←
 30867472[170918084]                           THEN • Меняем в наименованиии КГ на 100гр ←
 11010080[170918644]                             = ≡ Последние 2 символа ∙ 65545[170918066] ←
      404[170920227]                               Результат ≡ Replace ∙ 249[61669438] ←
 32505862[170918175]                                 Значения формальных параметров при вызове ←
 32505860[170918466]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[61670997] ←
   327700[170918673]                                     Выражение ≡ Последние 2 символа ∙ 65545[170918066] ←
 32505860[170918467]                                   Значение параметра при вызове процедуры/функции ≡ Заменяемая подстрока ∙ 65545[61670998] ←
   327700[170918674]                                     Выражение ⁼ 'КГ' ←
 32505860[170918468]                                   Значение параметра при вызове процедуры/функции ≡ Заменяющая подстрока ∙ 65545[61670999] ←
   327700[170918675]                                     Выражение ⁼ (100 гр.) ←
 11010080[170918655]                             = ≡ Строка отладки ∙ 65545[170918067] ←
      404[170920223]                               Результат ⁼ 'после замены' ←
      404[170920224]                               Результат ≡ Последние 2 символа ∙ 65545[170918066] ←
 11010088[170918125]                             ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[170918181]                               Значения формальных параметров при вызове ←
 32505860[170918480]                                 Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[170918687]                                   Выражение ≡ Строка отладки ∙ 65545[170918067] ←
 11010080[170918649]                             = ≡ Наименование ∙ 65545[164299292] ←
      404[170920228]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[170918178]                                 Значения формальных параметров при вызове ←
 32505860[170918475]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[170918682]                                     Выражение ≡ Наименование ∙ 65545[164299292] ←
 32505860[170918476]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[170918683]                                     Выражение ⁼ 1 ←
 32505860[170918477]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[170918684]                                     Выражение ≡ len ∙ 65545[170918065] ←
 11010080[170918656]                             = ≡ Строка отладки ∙ 65545[170918067] ←
      404[170920229]                               Результат ⁼ 'Наименование ' ←
      404[170920230]                               Результат ≡ Наименование ∙ 65545[164299292] ←
 11010088[170918126]                             ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[170918182]                               Значения формальных параметров при вызове ←
 32505860[170918481]                                 Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[170918688]                                   Выражение ≡ Строка отладки ∙ 65545[170918067] ←
 11010080[170918650]                             = ≡ Наименование ∙ 65545[164299292] ←
      404[170920233]                               Результат ≡ Наименование ∙ 65545[164299292] ←
      404[170920234]                               Результат ≡ Последние 2 символа ∙ 65545[170918066] ←
 11010080[170918657]                             = ≡ Строка отладки ∙ 65545[170918067] ←
      404[170920242]                               Результат ⁼ 'Наименование после замены ' ←
      404[170920243]                               Результат ≡ Наименование ∙ 65545[164299292] ←
 11010088[170918127]                             ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[170918183]                               Значения формальных параметров при вызове ←
 32505860[170918482]                                 Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[170918689]                                   Выражение ≡ Строка отладки ∙ 65545[170918067] ←
 11010080[170918652]                             = ≡ Цена ∙ 65545[164299293] ←
      404[170920237]                               Результат ≡ Цена ∙ 65545[164299293] ←
      402[170917890]                               Делить ←
      404[170920238]                               Результат ⁼ 10 ←
 11010080[170918651]                             = ≡ Цена 2 ∙ 65545[164299277] ←
      404[170920239]                               Результат ≡ Цена 2 ∙ 65545[164299277] ←
      402[170917891]                               Делить ←
      404[170920240]                               Результат ⁼ 10 ←
  1507728[171114998]                     Начало многострочного комментария ←
 30867470[171116529]                     IF ←
  1638463[171117055]                       Условие ←
      116[171116570]                         Выражение ←
      116[171116571]                           Выражение ←
      404[171136616]                             Результат ≡ Признак из подгруппы/товара "Печатать за 100г" (да/нет) ∙ 249[164298821] ←
 32505862[171117521]                               Значения формальных параметров при вызове ←
 32505860[171120401]                                 Значение параметра при вызове процедуры/функции ≡ фп Продукт in ∙ 65545[164301354] ←
   327700[171122303]                                   Выражение ≡ Продукт Ид ∙ 65545[164299290] ←
  1638473[171118877]                             Равно ←
      404[171136617]                             Результат ≡ Да ∙ 131203075[131203074] ←
      412[171115111]                           ИЛИ ←
      116[171116572]                           Выражение ←
      404[171136618]                             Результат ≡ Печатать за 100г ∙ 65545[171835583] ←
  1638473[171118878]                             Равно ←
      404[171136619]                             Результат ≡ Да ∙ 131203075[131203074] ←
      413[171115207]                         И ←
      116[171116573]                         Выражение ←
      404[171136620]                           Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[171117518]                             Уточняющий параметр ≡ Тип измерения ∙ 305[14745610] ←
  1638473[171118879]                           Равно ←
      404[171136621]                           Результат ≡ Весовой ∙ 131203073[17301506] ←
 30867472[171116522]                       THEN • Меняем в наименовании КГ на 100гр и делим цены ←
 11010093[171114916]                         Комментарий • возьмем последние 2 символа ←
 11010080[171121289]                         = ≡ Строка отладки ∙ 65545[170918067] ←
      404[171136622]                           Результат ⁼ 'Наименование ' ←
      404[171136623]                           Результат ≡ Наименование ∙ 65545[164299292] ←
 11010088[171117144]                         ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[171117522]                           Значения формальных параметров при вызове ←
 32505860[171120402]                             Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[171122304]                               Выражение ≡ Строка отладки ∙ 65545[170918067] ←
 11010080[171121291]                         = ≡ len ∙ 65545[170918065] ←
      404[171136624]                           Результат ≡ Len ∙ 249[48431563] ←
 32505862[171117523]                             Значения формальных параметров при вызове ←
 32505860[171120403]                               Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[48436871] ←
   327700[171122315]                                 Выражение ≡ Наименование ∙ 65545[164299292] ←
 48431133[171114515]                         -= ≡ len ∙ 65545[170918065] ←
      404[171136625]                           Результат ⁼ 2 ←
 11010080[171121292]                         = ≡ Последние 2 символа ∙ 65545[170918066] ←
      404[171136626]                           Результат ≡ SubString ∙ 249[1507580] ←
 32505862[171117524]                             Значения формальных параметров при вызове ←
 32505860[171120404]                               Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[171122316]                                 Выражение ≡ Наименование ∙ 65545[164299292] ←
 32505860[171120405]                               Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[171122317]                                 Выражение ≡ len ∙ 65545[170918065] ←
 32505860[171120406]                               Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[171122318]                                 Выражение ⁼ 3 ←
 11010080[171121293]                         = ≡ Строка отладки ∙ 65545[170918067] ←
      404[171136627]                           Результат ⁼ 'последние 2 символа' ←
      404[171136628]                           Результат ≡ Последние 2 символа ∙ 65545[170918066] ←
 11010088[171117145]                         ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[171117525]                           Значения формальных параметров при вызове ←
 32505860[171120407]                             Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[171122319]                               Выражение ≡ Строка отладки ∙ 65545[170918067] ←
 30867470[171116530]                         IF ←
  1638463[171117056]                           Условие ←
      404[171136629]                             Результат ≡ Pos ∙ 249[48431562] ←
 32505862[171117526]                               Значения формальных параметров при вызове ←
 32505860[171120408]                                 Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[48436867] ←
   327700[171122320]                                   Выражение ≡ Последние 2 символа ∙ 65545[170918066] ←
 32505860[171120409]                                 Значение параметра при вызове процедуры/функции ≡ Искомая подстрока ∙ 65545[48436868] ←
   327700[171122321]                                   Выражение ⁼ 'КГ' ←
 32505860[171120410]                                 Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[48436869] ←
   327700[171122322]                                   Выражение ⁼ 1 ←
      412[171115112]                             ИЛИ ←
      404[171136630]                             Результат ≡ Pos ∙ 249[48431562] ←
 32505862[171117527]                               Значения формальных параметров при вызове ←
 32505860[171120411]                                 Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[48436867] ←
   327700[171122323]                                   Выражение ≡ Последние 2 символа ∙ 65545[170918066] ←
 32505860[171120412]                                 Значение параметра при вызове процедуры/функции ≡ Искомая подстрока ∙ 65545[48436868] ←
   327700[171122324]                                   Выражение ⁼ 'КГ ' ←
 32505860[171120413]                                 Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[48436869] ←
   327700[171122325]                                   Выражение ⁼ 1 ←
      412[171115113]                             ИЛИ ←
      404[171136631]                             Результат ≡ Pos ∙ 249[48431562] ←
 32505862[171117528]                               Значения формальных параметров при вызове ←
 32505860[171120414]                                 Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[48436867] ←
   327700[171122326]                                   Выражение ≡ Последние 2 символа ∙ 65545[170918066] ←
 32505860[171120415]                                 Значение параметра при вызове процедуры/функции ≡ Искомая подстрока ∙ 65545[48436868] ←
   327700[171122327]                                   Выражение ⁼ ' КГ' ←
 32505860[171120416]                                 Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[48436869] ←
   327700[171122328]                                   Выражение ⁼ 1 ←
 30867472[171116523]                           THEN • Меняем в наименованиии КГ на 100гр ←
 11010080[171121294]                             = ≡ Последние 2 символа ∙ 65545[170918066] ←
      404[171136632]                               Результат ≡ Replace ∙ 249[61669438] ←
 32505862[171117529]                                 Значения формальных параметров при вызове ←
 32505860[171120417]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[61670997] ←
   327700[171122329]                                     Выражение ≡ Последние 2 символа ∙ 65545[170918066] ←
 32505860[171120418]                                   Значение параметра при вызове процедуры/функции ≡ Заменяемая подстрока ∙ 65545[61670998] ←
   327700[171122330]                                     Выражение ⁼ 'КГ' ←
 32505860[171120419]                                   Значение параметра при вызове процедуры/функции ≡ Заменяющая подстрока ∙ 65545[61670999] ←
   327700[171122331]                                     Выражение ⁼ (100 гр.) ←
 11010080[171121295]                             = ≡ Строка отладки ∙ 65545[170918067] ←
      404[171136633]                               Результат ⁼ 'после замены' ←
      404[171136634]                               Результат ≡ Последние 2 символа ∙ 65545[170918066] ←
 11010088[171117146]                             ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[171117530]                               Значения формальных параметров при вызове ←
 32505860[171120420]                                 Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[171122332]                                   Выражение ≡ Строка отладки ∙ 65545[170918067] ←
 11010080[171121296]                             = ≡ Наименование ∙ 65545[164299292] ←
      404[171136635]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[171117531]                                 Значения формальных параметров при вызове ←
 32505860[171120421]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[171122333]                                     Выражение ≡ Наименование ∙ 65545[164299292] ←
 32505860[171120422]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[171122334]                                     Выражение ⁼ 1 ←
 32505860[171120423]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[171122335]                                     Выражение ≡ len ∙ 65545[170918065] ←
 11010080[171121297]                             = ≡ Строка отладки ∙ 65545[170918067] ←
      404[171136636]                               Результат ⁼ 'Наименование ' ←
      404[171136637]                               Результат ≡ Наименование ∙ 65545[164299292] ←
 11010088[171117147]                             ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[171117532]                               Значения формальных параметров при вызове ←
 32505860[171120424]                                 Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[171122336]                                   Выражение ≡ Строка отладки ∙ 65545[170918067] ←
 11010080[171121298]                             = ≡ Наименование ∙ 65545[164299292] ←
      404[171136638]                               Результат ≡ Наименование ∙ 65545[164299292] ←
      404[171136639]                               Результат ≡ Последние 2 символа ∙ 65545[170918066] ←
 11010080[171121299]                             = ≡ Строка отладки ∙ 65545[170918067] ←
      404[171136640]                               Результат ⁼ 'Наименование после замены ' ←
      404[171136641]                               Результат ≡ Наименование ∙ 65545[164299292] ←
 11010088[171117148]                             ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[171117533]                               Значения формальных параметров при вызове ←
 32505860[171120425]                                 Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[171122337]                                   Выражение ≡ Строка отладки ∙ 65545[170918067] ←
 11010080[171121300]                             = ≡ Цена ∙ 65545[164299293] ←
      404[171136642]                               Результат ≡ Цена ∙ 65545[164299293] ←
      402[171114632]                               Делить ←
      404[171136643]                               Результат ⁼ 10 ←
 11010080[171121301]                             = ≡ Цена 2 ∙ 65545[164299277] ←
      404[171136644]                               Результат ≡ Цена 2 ∙ 65545[164299277] ←
      402[171114633]                               Делить ←
      404[171136645]                               Результат ⁼ 10 ←
  1507729[171114998]                     Конец многострочного комментария ←
  1507410[165020004]                   ВЫПОЛНИТЬ БЛОК ≡ разбить цены ∙ 30867469[165020003] ←
 30867470[170918649]                   IF ←
  1638463[170918863]                     Условие ←
      116[170920183]                       Выражение ←
      404[170927436]                         Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170920073]                           Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[170920081]                             Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      403[170918030]                         Умножить ←
      404[170927437]                         Результат ≡ Группы ФРОВ ∙ 117[656082606] ←
      413[170918223]                       И ←
      116[170919199]                       Выражение ←
      404[170926920]                         Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919922]                           Уточняющий параметр ≡ ЕИ ∙ 305[14745607] ←
  1638473[170918403]                         Равно ←
      404[170926923]                         Результат ≡ Килограмм ∙ 131108[28049411] ←
 30867472[170918646]                     THEN ←
  1507360[170917946]                       Отбор данных (по запросу) • Найдем весовой шк ←
 12124213[170917922]                         Параметры ←
  1507335[170917933]                           Параметр • селект весовой шк ∙ 12124204[170917929] ←
  1507494[170918198]                             Уточняющий параметр ≡ Код ∙ 305[5] ←
 12124200[170917921]                         From         (Таблицы) ←
 12124204[170917929]                           Таблица ≡ Продукт ∙ 108[3] ←
 12124215[170917930]                         Where      (Ограничения на отбор данных) ←
  1507376[170918146]                           Выражение ←
  1507455[170918157]                             Результат ∙ 12124204[170917929] ←
  1507494[170918199]                               Уточняющий параметр ≡ Родитель ∙ 305[2] ←
  1638473[170918404]                             Равно ←
  1507452[170918047]                             Константа ≡ Продукт Ид ∙ 65545[164299290] ←
  1507376[170918149]                           Выражение ←
  1507455[170918158]                             Результат ∙ 12124204[170917929] ←
  1507494[170918200]                               Уточняющий параметр ≡ Тип ∙ 305[4] ←
  1638473[170918407]                             Равно ←
  1507488[170918143]                             Константа (Ограничение по классу, типу, плану счетов) ≡ Весовой штриховой код ∙ 306[28835842] ←
  1507376[170918502]                           Выражение ←
  1507376[170918631]                             Выражение ←
  1507455[170918159]                               Результат ∙ 12124204[170917929] ←
  1507494[170918201]                                 Уточняющий параметр ≡ Запретить ввод в документы ∙ 305[28835850] ←
  1638473[170918422]                               Равно ←
  1507452[170918048]                               Константа ≡ Нет ∙ 131203075[131203073] ←
      412[170918753]                             ИЛИ ←
  1507376[170918632]                             Выражение ←
  1507455[170918162]                               Результат ∙ 12124204[170917929] ←
  1507494[170918202]                                 Уточняющий параметр ≡ Запретить ввод в документы ∙ 305[28835850] ←
  1638473[170919111]                               Равно ←
  1507452[170918270]                               Константа ≡ NULL ∙ 117[30670850] ←
  1507376[170918633]                           Выражение ←
  1507376[170918634]                             Выражение ←
  1507455[170918692]                               Результат ∙ 12124204[170917929] ←
  1507494[170918877]                                 Уточняющий параметр ≡ Партия расходуется целиком ∙ 305[42401819] ←
  1638473[170919121]                               Равно ←
  1638402[170918400]                               NULL ←
      412[170918754]                             ИЛИ ←
  1507376[170918817]                             Выражение ←
  1507455[170918693]                               Результат ∙ 12124204[170917929] ←
  1507494[170918878]                                 Уточняющий параметр ≡ Партия расходуется целиком ∙ 305[42401819] ←
  1638473[170919352]                               Равно ←
  1507452[170918385]                               Константа ≡ Нет ∙ 131203075[131203073] ←
 30867466[170917948]                         Выполнить после получения записи ←
 11010080[170920542]                           = ≡ ШК ∙ 65545[170919342] ←
      404[170927429]                             Результат ≡ селект весовой шк ∙ 1507335[170917933] ←
 11010080[170920543]                           = ≡ ШК ∙ 65545[170919342] ←
      404[170927431]                             Результат ≡ Дополнить символами справа ∙ 387[1507469] ←
 32505862[170918712]                               Значения формальных параметров при вызове ←
 32505860[170918417]                                 Значение параметра при вызове процедуры/функции ≡ Выражение ∙ 65545[1511658] ←
   327700[170920040]                                   Выражение ≡ ШК ∙ 65545[170919342] ←
 32505860[170918418]                                 Значение параметра при вызове процедуры/функции ≡ Дополнить до длины ∙ 65545[1511659] ←
   327700[170920041]                                   Выражение ⁼ 12 ←
 32505860[170919520]                                 Значение параметра при вызове процедуры/функции ≡ Cимвол-заполнитель ∙ 65545[1511660] ←
   327700[170920045]                                   Выражение ⁼ '0' ←
 11010080[170921275]                           = ≡ ШК ∙ 65545[170919342] ←
      404[170927434]                             Результат ≡ Контрольная цифра для штрихкода EAN13 ∙ 249[164298792] ←
 32505862[170918950]                               Значения формальных параметров при вызове ←
 32505860[170919521]                                 Значение параметра при вызове процедуры/функции ≡ Код (12 цифр) ∙ 65545[164300069] ←
   327700[170920046]                                   Выражение ≡ ШК ∙ 65545[170919342] ←
 11010080[170921277]                           = ≡ ШК ∙ 65545[170919342] ←
      404[170927435]                             Результат ≡ EAN13 для печати ∙ 249[164298791] ←
 32505862[170918965]                               Значения формальных параметров при вызове ←
 32505860[170919525]                                 Значение параметра при вызове процедуры/функции ≡ Строка ean13 ∙ 65545[164299067] ←
   327700[170920047]                                   Выражение ≡ ШК ∙ 65545[170919342] ←
 11010080[170921339]                           = ≡ Строка для печати ШК ∙ 65545[170919887] ←
      404[170927439]                             Результат ⁼ <div align="right" style = "font-family:EanBwrP36Tt;font-size:20pt;"> ←
      404[170927440]                             Результат ≡ ШК ∙ 65545[170919342] ←
      404[170927441]                             Результат ⁼ </div> ←
 11010100[170917897]                           BREAK ←
 11010088[164299106]                   ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164298949]                     Файл ≡ Файл отчета ∙ 65545[164299298] ←
 39780357[164298803]                     Ссылка на блок шаблона ≡ Заголовок ∙ 12124197[164298770] ←
 30867470[164300735]                   IF ←
  1638463[164300155]                     Условие ←
      404[164312004]                       Результат ≡ Тип ∙ 65545[164301604] ←
  1638473[164304023]                       Равно ←
      404[164312031]                       Результат ⁼ 1 ←
 30867472[164300720]                     THEN ←
 30867470[164299874]                       IF ←
  1638463[164300126]                         Условие ←
      404[164311712]                           Результат ≡ Наименование 2 ∙ 65545[164299944] ←
  1638473[164301952]                           Равно ←
  1638402[164299594]                           NULL ←
 30867472[164299862]                         THEN ←
 11010080[164304010]                           = ≡ Шрифт 1 ∙ 65545[164299305] ←
      404[164312032]                             Результат ⁼ 36 ←
 30867473[164299118]                         ELSE ←
 11010080[164303821]                           = ≡ Шрифт 1 ∙ 65545[164299305] ←
      404[164311713]                             Результат ⁼ 40 ←
 11010080[164303820]                           = ≡ Наименование ∙ 65545[164299292] ←
      404[164311711]                             Результат ≡ Наименование 2 ∙ 65545[164299944] ←
 30867473[164299389]                     ELSE ←
 30867470[164299266]                       IF ←
  1638463[164299404]                         Условие ←
      404[164304573]                           Результат ≡ Наименование 2 ∙ 65545[164299944] ←
  1638473[164299839]                           Равно ←
  1638402[164299113]                           NULL ←
 30867472[164299263]                         THEN ←
 11010080[164301034]                           = ≡ Шрифт 1 ∙ 65545[164299305] ←
      404[164304574]                             Результат ⁼ 38 ←
 30867473[164298906]                         ELSE ←
 11010080[164301035]                           = ≡ Шрифт 1 ∙ 65545[164299305] ←
      404[164304575]                             Результат ⁼ 54 ←
 11010080[164301036]                           = ≡ Наименование ∙ 65545[164299292] ←
      404[164304576]                             Результат ≡ Наименование 2 ∙ 65545[164299944] ←
 30867469[165347900]                   БЛОК • БЗМЖ ←
 30867470[165348639]                     IF ←
  1638463[165349040]                       Условие ←
      404[165365919]                         Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[165352005]                           Уточняющий параметр ≡ Норма отходов ∙ 305[14745620] ←
  1638473[165349555]                         Равно ←
      404[165365920]                         Результат ≡ Нет ∙ 131203075[131203073] ←
 30867472[165348633]                       THEN ←
 11010080[165353047]                         = ≡ border ∙ 65545[165349841] ←
      404[165365921]                           Результат ⁼ 'border: 1px solid black' ←
 11010080[165353658]                         = ≡ БЗМЖ ∙ 65545[165349839] ←
      404[165374202]                           Результат ⁼ <div style="<float:left; width:25%;border: 1px solid black;text-align:center;">Без заменителя<br>молочного жира</div> ←
 11010080[170921335]                         = ≡ Строка с БЗМЖ ∙ 65545[170918941] ←
      404[170927343]                           Результат ⁼ <tr><td colspan=3> ←
      404[170927370]                           Результат ≡ БЗМЖ ∙ 65545[165349839] ←
      404[170927371]                           Результат ⁼ </td></tr> ←
 30867473[165347554]                       ELSE ←
 11010080[165353049]                         = ≡ border ∙ 65545[165349841] ←
      404[165365923]                           Результат ≡ NULL ∙ 117[30670850] ←
 11010080[165353050]                         = ≡ БЗМЖ ∙ 65545[165349839] ←
      404[165365924]                           Результат ≡ NULL ∙ 117[30670850] ←
 30867469[170918296]                   БЛОК • Енисейский стандарт ←
 30867470[170918687]                     IF ←
  1638463[170918907]                       Условие ←
      116[170918731]                         Выражение ←
      404[170927305]                           Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919254]                             Уточняющий параметр ≡ Карта не действительна ∙ 305[42401806] ←
  1638473[170919765]                           Равно ←
      404[170927306]                           Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[170918684]                       THEN ←
 11010080[170921291]                         = ≡ border ∙ 65545[165349841] ←
      404[170927307]                           Результат ⁼ 'border: 1px solid black' ←
 11010080[170921293]                         = ≡ Енисейский стандарт ∙ 65545[170918832] ←
      404[170927368]                           Результат ⁼ <tr><td colspan=3> ←
      404[170927309]                           Результат ⁼ <div style="<float:left; width:25%;border: 1px solid black;text-align:center;">Енисейский<br>стандарт</div> ←
      404[170927369]                           Результат ⁼ </td></tr> ←
 30867473[170918067]                       ELSE ←
 11010080[170921294]                         = ≡ border ∙ 65545[165349841] ←
      404[170927310]                           Результат ≡ NULL ∙ 117[30670850] ←
 11010080[170921296]                         = ≡ Енисейский стандарт ∙ 65545[170918832] ←
      404[170927312]                           Результат ≡ NULL ∙ 117[30670850] ←
 30867469[170918320]                   БЛОК • КУ ФРОВ ←
 11010093[171114919]                     Комментарий • 1 - новый вариант с учётом параметра печати КУ ←
 11010093[171114920]                     Комментарий • 2 - старый вариант ←
 30867470[170918665]                     IF ←
  1638463[170918892]                       Условие ←
      116[171116325]                         Выражение ←
      116[171116324]                           Выражение ←
      116[171116587]                             Выражение ←
      116[171116592]                               Выражение ←
      116[171116593]                                 Выражение ←
      404[171136697]                                   Результат ≡ Печатать КУ ∙ 65545[171118107] ←
  1638473[171118892]                                   Равно ←
  1638402[171115631]                                   NULL ←
      412[171115117]                                 ИЛИ ←
      116[171116594]                                 Выражение ←
      404[171136701]                                   Результат ≡ Печатать КУ ∙ 65545[171118107] ←
  1638479[171115000]                                   Не равно ←
      404[171136702]                                   Результат ≡ Нет ∙ 131203075[131203073] ←
      413[171115212]                               И ←
      116[170919327]                               Выражение ←
      404[170927214]                                 Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[170918160]                                   Значения формальных параметров при вызове ←
 32505860[170918437]                                     Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[170918639]                                       Выражение ≡ Группы ФРОВ + Зелень ∙ 117[656081721] ←
 32505860[170918438]                                     Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[170918640]                                       Выражение ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919258]                                         Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[170919259]                                           Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      413[170918053]                               И ←
      116[170919329]                               Выражение ←
      116[170919330]                                 Выражение ←
      404[170927316]                                   Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919262]                                     Уточняющий параметр ≡ Продавать без рецепта ∙ 305[28835881] ←
  1638473[170919771]                                   Равно ←
      404[170927317]                                   Результат ≡ Да ∙ 131203075[131203074] ←
      412[171115115]                             ИЛИ ←
      116[171116588]                             Выражение ←
      404[171136679]                               Результат ≡ Печатать КУ ∙ 65545[171118107] ←
  1638473[171118890]                               Равно ←
      404[171136682]                               Результат ≡ Да ∙ 131203075[131203074] ←
      413[171115118]                           И ←
      404[171133626]                           Результат ≡ Текущий пользователь - Шубин ∙ 117[165806084] ←
      412[171115118]                         ИЛИ ←
      116[171116578]                         Выражение ←
      116[171116579]                           Выражение ←
      404[171133627]                             Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[171114854]                               Значения формальных параметров при вызове ←
 32505860[171119672]                                 Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[171121079]                                   Выражение ≡ Группы ФРОВ + Зелень ∙ 117[656081721] ←
 32505860[171119673]                                 Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[171121162]                                   Выражение ≡ Продукт Ид ∙ 65545[164299290] ←
      411[171117231]                                     Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[171117232]                                       Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      413[171115210]                           И ←
      116[171116580]                           Выражение ←
      116[171116581]                             Выражение ←
      404[171133628]                               Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[171117233]                                 Уточняющий параметр ≡ Продавать без рецепта ∙ 305[28835881] ←
  1638473[171118883]                               Равно ←
      404[171133629]                               Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[170918662]                       THEN • заполняем КУ на ценнике ←
  1507728[172359736]                         Начало многострочного комментария ←
 30867470[171116532]                         IF ←
  1638463[171117058]                           Условие ←
      404[171136680]                             Результат ≡ Продукт ∙ 65545[171117105] ←
      411[171117526]                               Уточняющий параметр ≡ Контролировать срок годности ∙ 305[28835855] ←
  1638473[171118889]                             Равно ←
      404[171136681]                             Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[171116525]                           THEN ←
 11010080[170919169]                             = ≡ ТЗ ∙ 65545[170918934] ←
      404[170921543]                               Результат ≡ Первый ТЗ/ПЦ для ЦО/ТТ/Узла (действ. магазины) ∙ 249[655294491] ←
 32505862[170918991]                                 Значения формальных параметров при вызове ←
 32505860[170918440]                                   Значение параметра при вызове процедуры/функции ≡ ~ТТ ∙ 65545[58392606] ←
   327700[170918642]                                     Выражение ≡ Подразделение ком.отд. ∙ 65545[164299291] ←
      411[170919284]                                       Уточняющий параметр ≡ Родитель ∙ 283[2] ←
 11010080[170921306]                             = ≡ Последняя партия ∙ 65545[170918933] ←
      404[170927219]                               Результат ≡ Последняя партия по подразделению (Дата текущая) (вер 1) ∙ 249[40370222] ←
 32505862[170918992]                                 Значения формальных параметров при вызове ←
 32505860[170920083]                                   Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[40373179] ←
   327700[170920792]                                     Выражение ≡ Продукт Ид ∙ 65545[164299290] ←
 32505860[170920091]                                   Значение параметра при вызове процедуры/функции ≡ Подразделения ∙ 65545[40373180] ←
   327700[170920800]                                     Выражение ≡ ТЗ ∙ 65545[170918934] ←
 39780361[170918018]                             ЗАВЕРШИТЬ БЛОК ←
      116[170918404]                               Выражение ←
      404[170927337]                                 Результат ≡ Сегодня, конец дня ∙ 249[30867476] ←
  1638478[170917967]                                 Больше ←
      404[170927338]                                 Результат ≡ Дата, конец дня ∙ 249[30867475] ←
 32505862[170918993]                                   Значения формальных параметров при вызове ←
 32505860[170918441]                                     Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
   327700[170918643]                                       Выражение ≡ Последняя партия ∙ 65545[170918933] ←
      411[170919299]                                         Уточняющий параметр ≡ Срок годности ∙ 305[14745619] ←
 11010080[170921309]                             = ≡ Годен до: ∙ 65545[170918926] ←
      404[170927321]                               Результат ≡ Годен до: ∙ 65545[165347425] ←
      404[170927318]                               Результат ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
   131097[170918037]                                 Формат ≡ Дата без времени ∙ 131096[131073] ←
 32505862[170918990]                                 Значения формальных параметров при вызове ←
 32505860[170918439]                                   Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[170918641]                                     Выражение ≡ Последняя партия ∙ 65545[170918933] ←
      411[170919260]                                       Уточняющий параметр ≡ Срок годности ∙ 305[14745619] ←
  1507729[172359736]                         Конец многострочного комментария ←
 11010080[172360286]                         = ≡ ТЗ ∙ 65545[170918934] ←
      404[172362265]                           Результат ≡ Первый ТЗ/ПЦ для ЦО/ТТ/Узла (действ. магазины) ∙ 249[655294491] ←
 32505862[172359902]                             Значения формальных параметров при вызове ←
 32505860[172360015]                               Значение параметра при вызове процедуры/функции ≡ ~ТТ ∙ 65545[58392606] ←
   327700[172359956]                                 Выражение ≡ Подразделение ком.отд. ∙ 65545[164299291] ←
      411[172360236]                                   Уточняющий параметр ≡ Родитель ∙ 283[2] ←
 11010080[172360287]                         = ≡ Последняя партия ∙ 65545[170918933] ←
      404[172362266]                           Результат ≡ Последняя партия по подразделению (Дата текущая) (вер 1) ∙ 249[40370222] ←
 32505862[172359903]                             Значения формальных параметров при вызове ←
 32505860[172360019]                               Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[40373179] ←
   327700[172360134]                                 Выражение ≡ Продукт Ид ∙ 65545[164299290] ←
 32505860[172360020]                               Значение параметра при вызове процедуры/функции ≡ Подразделения ∙ 65545[40373180] ←
   327700[172360135]                                 Выражение ≡ ТЗ ∙ 65545[170918934] ←
 39780361[172359700]                         ЗАВЕРШИТЬ БЛОК ←
      116[172359913]                           Выражение ←
      404[172362267]                             Результат ≡ Сегодня, конец дня ∙ 249[30867476] ←
  1638478[172359716]                             Больше ←
      404[172362268]                             Результат ≡ Дата, конец дня ∙ 249[30867475] ←
 32505862[172359904]                               Значения формальных параметров при вызове ←
 32505860[172360021]                                 Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
   327700[172360136]                                   Выражение ≡ Последняя партия ∙ 65545[170918933] ←
      411[172360237]                                     Уточняющий параметр ≡ Срок годности ∙ 305[14745619] ←
  1507728[172359737]                         Начало многострочного комментария ←
 11010080[172360288]                         = ≡ Годен до: ∙ 65545[170918926] ←
      404[172362269]                           Результат ≡ Годен до: ∙ 65545[165347425] ←
      404[172362270]                           Результат ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
   131097[172359750]                             Формат ≡ Дата без времени ∙ 131096[131073] ←
 32505862[172359905]                             Значения формальных параметров при вызове ←
 32505860[172360022]                               Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[172360137]                                 Выражение ≡ Последняя партия ∙ 65545[170918933] ←
      411[172360238]                                   Уточняющий параметр ≡ Срок годности ∙ 305[14745619] ←
  1507729[172359737]                         Конец многострочного комментария ←
 11010080[172360289]                         = ≡ Годен до: ∙ 65545[170918926] ←
      404[172362263]                           Результат ⁼ 'Годен до: ' ←
      404[172362264]                           Результат ≡ Формат, с передачей значения через параметры ∙ 249[30867463] ←
   131097[172359751]                             Формат ≡ Дата без времени ∙ 131096[131073] ←
 32505862[172359906]                             Значения формальных параметров при вызове ←
 32505860[172360023]                               Значение параметра при вызове процедуры/функции ≡ Значение ∙ 65545[30867477] ←
   327700[172360138]                                 Выражение ≡ Последняя партия ∙ 65545[170918933] ←
      411[172360235]                                   Уточняющий параметр ≡ Срок годности ∙ 305[14745619] ←
 11010080[170921307]                         = ≡ Рекомендации ∙ 65545[170918921] ←
      404[170927319]                           Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919263]                             Уточняющий параметр ≡ Рекомендации по использованию ∙ 305[28835918] ←
 11010080[170921308]                         = ≡ Температура ∙ 65545[170918924] ←
      404[170927320]                           Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919264]                             Уточняющий параметр ≡ Рекомендованная температура хранения ∙ 305[28835890] ←
 11010080[170921311]                         = ≡ Изготовитель_имя ∙ 65545[170918927] ←
      404[170927323]                           Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919266]                             Уточняющий параметр ≡ Изготовитель ∙ 305[12] ←
      411[170919261]                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921297]                         = ≡ Импортер_имя ∙ 65545[170918925] ←
      404[170921555]                           Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919285]                             Уточняющий параметр ≡ Импортер ∙ 305[55508993] ←
      411[170919286]                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921312]                         = ≡ Изготовитель_страна ∙ 65545[170918928] ←
      404[170927324]                           Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919267]                             Уточняющий параметр ≡ Изготовитель ∙ 305[12] ←
      411[170919268]                               Уточняющий параметр ≡ Страна ∙ 283[14745625] ←
      411[170919265]                                 Уточняющий параметр ≡ Имя ∙ 249[262146] ←
      404[170927325]                           Результат ⁼ , ←
 11010080[170921305]                         = ≡ Импортер_страна ∙ 65545[170918935] ←
      404[170921556]                           Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919287]                             Уточняющий параметр ≡ Импортер ∙ 305[55508993] ←
      411[170919288]                               Уточняющий параметр ≡ Страна ∙ 283[14745625] ←
      411[170919289]                                 Уточняющий параметр ≡ Имя ∙ 249[262146] ←
      404[170921557]                           Результат ⁼ , ←
 11010080[170921313]                         = ≡ Изготовитель_регион ∙ 65545[170918929] ←
      404[170927326]                           Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919269]                             Уточняющий параметр ≡ Изготовитель ∙ 305[12] ←
      411[170919270]                               Уточняющий параметр ≡ Регион ∙ 283[42401869] ←
      411[170919283]                                 Уточняющий параметр ≡ Наименование ∙ 296[6] ←
      404[170927327]                           Результат ⁼ , ←
 11010080[170921310]                         = ≡ Импортер_регион ∙ 65545[170918936] ←
      404[170921558]                           Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919290]                             Уточняющий параметр ≡ Импортер ∙ 305[55508993] ←
      411[170919291]                               Уточняющий параметр ≡ Регион ∙ 283[42401869] ←
      411[170919292]                                 Уточняющий параметр ≡ Наименование ∙ 296[6] ←
      404[170921559]                           Результат ⁼ , ←
 11010080[170921314]                         = ≡ Изготовитель_город ∙ 65545[170918930] ←
      404[170927328]                           Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919271]                             Уточняющий параметр ≡ Изготовитель ∙ 305[12] ←
      411[170919272]                               Уточняющий параметр ≡ Город ∙ 283[14745630] ←
      404[170927329]                           Результат ⁼ , ←
 11010080[170921318]                         = ≡ Импортер_город ∙ 65545[170918937] ←
      404[170923540]                           Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919293]                             Уточняющий параметр ≡ Импортер ∙ 305[55508993] ←
      411[170919294]                               Уточняющий параметр ≡ Город ∙ 283[14745630] ←
      404[170923541]                           Результат ⁼ , ←
 11010080[170921315]                         = ≡ Изготовитель_улица ∙ 65545[170918931] ←
      404[170927330]                           Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919273]                             Уточняющий параметр ≡ Изготовитель ∙ 305[12] ←
      411[170919274]                               Уточняющий параметр ≡ Улица ∙ 283[14745631] ←
 11010080[170921319]                         = ≡ Импортер_улица ∙ 65545[170918938] ←
      404[170923542]                           Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919295]                             Уточняющий параметр ≡ Импортер ∙ 305[55508993] ←
      411[170919296]                               Уточняющий параметр ≡ Улица ∙ 283[14745631] ←
 11010080[170921316]                         = ≡ Изготовитель_дом ∙ 65545[170918932] ←
      404[170927331]                           Результат ⁼ ', ' ←
      404[170927332]                           Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919275]                             Уточняющий параметр ≡ Изготовитель ∙ 305[12] ←
      411[170919276]                               Уточняющий параметр ≡ Дом ∙ 283[14745632] ←
 11010080[170921320]                         = ≡ Импортер_дом ∙ 65545[170918939] ←
      404[170923543]                           Результат ⁼ ', ' ←
      404[170923544]                           Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919297]                             Уточняющий параметр ≡ Импортер ∙ 305[55508993] ←
      411[170919298]                               Уточняющий параметр ≡ Дом ∙ 283[14745632] ←
 30867470[170918688]                         IF ←
  1638463[170918908]                           Условие ←
      404[170927333]                             Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919277]                               Уточняющий параметр ≡ Изготовитель ∙ 305[12] ←
      411[170919278]                                 Уточняющий параметр ≡ Дом ∙ 283[14745632] ←
      413[170918246]                             И ←
      404[170927334]                             Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919279]                               Уточняющий параметр ≡ Изготовитель ∙ 305[12] ←
      411[170919280]                                 Уточняющий параметр ≡ Улица ∙ 283[28835896] ←
 30867472[170918686]                           THEN ←
 11010080[170921317]                             = ≡ Изготовитель_дом ∙ 65545[170918932] ←
      404[170927335]                               Результат ⁼ ', ' ←
      404[170927336]                               Результат ≡ Продукт Ид ∙ 65545[164299290] ←
      411[170919281]                                 Уточняющий параметр ≡ Изготовитель ∙ 305[12] ←
      411[170919282]                                   Уточняющий параметр ≡ Дом ∙ 283[14745632] ←
 11010080[170920044]                         = ≡ Строка КУ ∙ 65545[170918841] ←
      404[170921542]                           Результат ≡ Рекомендации ∙ 65545[170918921] ←
      404[170921551]                           Результат ⁼ '; ' ←
      404[170921544]                           Результат ≡ Температура ∙ 65545[170918924] ←
      404[170921553]                           Результат ⁼ '; ' ←
      404[170921545]                           Результат ≡ Годен до: ∙ 65545[170918926] ←
      404[170921554]                           Результат ⁼ '; Изг.: ' ←
      404[170921546]                           Результат ≡ Изготовитель_имя ∙ 65545[170918927] ←
      404[170921547]                           Результат ≡ Изготовитель_страна ∙ 65545[170918928] ←
      404[170921548]                           Результат ≡ Изготовитель_регион ∙ 65545[170918929] ←
      404[170921549]                           Результат ≡ Изготовитель_город ∙ 65545[170918930] ←
      404[170921550]                           Результат ≡ Изготовитель_улица ∙ 65545[170918931] ←
      404[170921552]                           Результат ≡ Изготовитель_дом ∙ 65545[170918932] ←
  1638461[170918028]                           Условный оператор (IF) ←
  1638463[170918238]                             Условие ←
      404[170927387]                               Результат ≡ Импортер_имя ∙ 65545[170918925] ←
      105[170918028]                             То ←
      404[170923545]                               Результат ⁼ '; Имп.: ' ←
      404[170923546]                               Результат ≡ Импортер_имя ∙ 65545[170918925] ←
      404[170924990]                               Результат ≡ Импортер_страна ∙ 65545[170918935] ←
      404[170924991]                               Результат ≡ Импортер_регион ∙ 65545[170918936] ←
      404[170924992]                               Результат ≡ Импортер_город ∙ 65545[170918937] ←
      404[170924993]                               Результат ≡ Импортер_улица ∙ 65545[170918938] ←
      404[170927308]                               Результат ≡ Импортер_дом ∙ 65545[170918939] ←
 30867470[170917988]                         IF ←
  1638463[170918168]                           Условие ←
      404[170927382]                             Результат ≡ По продукту есть акция ∙ 65545[164299635] ←
 30867472[170917987]                           THEN ←
 11010080[170921345]                             = ≡ Строка КУ ∙ 65545[170918841] ←
      404[170927384]                               Результат ⁼ <tr><td colspan=4 style="font-size:8pt; "> ←
      404[170927385]                               Результат ≡ Строка КУ ∙ 65545[170918841] ←
      404[170927386]                               Результат ⁼ </td></tr> ←
 30867473[170918036]                           ELSE ←
 11010080[170921336]                             = ≡ Строка КУ ∙ 65545[170918841] ←
      404[170927372]                               Результат ⁼ <tr><td style="font-size:11pt; border:1px solid black"> ←
      404[170927373]                               Результат ≡ Строка КУ ∙ 65545[170918841] ←
      404[170927374]                               Результат ⁼ </td></tr> ←
 39780361[170917961]                     ЗАВЕРШИТЬ БЛОК ←
 11010088[164299100]                   ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[164298943]                     Файл ≡ Файл отчета ∙ 65545[164299298] ←
 39780357[164298800]                     Ссылка на блок шаблона ≡ Итого ∙ 12124197[164298772] ←
 11010088[164299107]                   ВЫПОЛНИТЬ ≡ Отчет.Закрыть ∙ 249[12124172] ←
 39780367[164298950]                     Файл ≡ Файл отчета ∙ 65545[164299298] ←
  1507410[164299282]                   ВЫПОЛНИТЬ БЛОК ≡ Файл ∙ 30867469[164299698] ←
 11010088[170983921]                   ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[170984146]                     Значения формальных параметров при вызове ←
      117[170983736]                       Выражение • Сообщение ≡ Длинная строка (512) ∙ 107[61669379] ←
      404[170986828]                         Результат ⁼ 'Удалить файл : "' ←
      404[170986829]                         Результат ≡ Файл ∙ 65545[164299299] ←
      404[170986832]                         Результат ⁼ '"' ←
 32505860[170984595]                       Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[170984849]                         Выражение ≡ Сообщение ∙ 117[170983736] ←
 11010080[164299813]                   = ≡ Рез ∙ 65545[164299286] ←
      404[164301164]                     Результат ≡ Файл.Удалить ∙ 249[1507333] ←
 39780367[164298951]                       Файл ≡ Файл ∙ 65545[164299299] ←
 11010088[170983922]                   ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[170984147]                     Значения формальных параметров при вызове ←
      117[170983737]                       Выражение • Сообщение ≡ Длинная строка (512) ∙ 107[61669379] ←
      404[170986833]                         Результат ⁼ 'Удалить файл : "' ←
      404[170986836]                         Результат ≡ Файл отчета ∙ 65545[164299298] ←
      404[170986837]                         Результат ⁼ '" -> "' ←
      404[170986834]                         Результат ≡ Файл ∙ 65545[164299299] ←
      404[170986835]                         Результат ⁼ '"' ←
 32505860[170984596]                       Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[170984850]                         Выражение ≡ Сообщение ∙ 117[170983737] ←
 11010088[164299108]                   ВЫПОЛНИТЬ ≡ Файл.Переименовать ∙ 249[1507528] ←
 39780367[164298952]                     Файл ≡ Файл отчета ∙ 65545[164299298] ←
  1507726[164298764]                     Новое наименование ≡ Файл ∙ 65545[164299299] ←
 11010080[170921289]                   = ≡ Количество ценников temp ∙ 65545[170918833] ←
      404[170927213]                     Результат ≡ Количество ценников ∙ 65545[165347551] ←
 11010093[171835417]                   Комментарий • 1046621 Вывести на экран ←
 30867470[171835469]                   IF ←
  1638463[171835487]                     Условие ←
      404[171836255]                       Результат ≡ Вывести на экран ∙ 65545[171835582] ←
  1638473[171835598]                       Равно ←
      404[171836256]                       Результат ≡ Нет ∙ 131203075[131203073] ←
 30867472[171835467]                     THEN ←
 12124162[171835397]                       WHILE ←
  1638463[171835488]                         Условие ←
      404[171836257]                           Результат ≡ Количество ценников ∙ 65545[165347551] ←
  1638477[171835401]                           Больше или равно ←
      404[171836258]                           Результат ⁼ 1 ←
 30867469[171835415]                         БЛОК ←
 11010088[171835472]                           ВЫПОЛНИТЬ ≡ Печать на определенный принтер документа Word & Pdf ∙ 127[164692041] ←
 32505862[171835507]                             Значения формальных параметров при вызове ←
 32505860[171835636]                               Значение параметра при вызове процедуры/функции ≡ фп Файл ∙ 65545[164692273] ←
   327700[171835673]                                 Выражение ≡ Файл ∙ 65545[164299299] ←
 32505860[171835637]                               Значение параметра при вызове процедуры/функции ≡ фп Количество копий ∙ 65545[164692478] ←
   327700[171835674]                                 Выражение ⁼ 1 ←
 32505860[171835638]                               Значение параметра при вызове процедуры/функции ≡ фп Имя файла скрипта ∙ 65545[164692480] ←
   327700[171835675]                                 Выражение ≡ Файл ∙ 65545[164299299] ←
 32505860[171835639]                               Значение параметра при вызове процедуры/функции ≡ фп Печатать через либру ∙ 65545[164824488] ←
   327700[171835676]                                 Выражение ≡ true ∙ 117[30867468] ←
 32505860[171835640]                               Значение параметра при вызове процедуры/функции ≡ фп Печатаем ценник ∙ 65545[170917889] ←
   327700[171835677]                                 Выражение ≡ true ∙ 117[30867468] ←
 32505860[171835641]                               Значение параметра при вызове процедуры/функции ≡ фп Автоматически? ∙ 65545[170918277] ←
   327700[171835678]                                 Выражение ≡ ~Автоматическая ∙ 65545[656085780] ←
 48431133[171835393]                           -= ≡ Количество ценников ∙ 65545[165347551] ←
      404[171836259]                             Результат ⁼ 1 ←
 30867473[171835422]                     ELSE ←
 11010088[171835473]                       ВЫПОЛНИТЬ ≡ ОТКРЫТЬ ФАЙЛ СРЕДСТВАМИ ОС ДЛЯ ПРОСМОТРА И РЕДАКТИРОВАНИЯ ∙ 126[30867461] ←
 39780375[171835398]                         Путь (каталог, папка) к файлам (как выражение) ≡ Файл ∙ 65545[164299299] ←
 30867473[171114957]             ELSE • Регулярный ценник ←
 11010088[171116686]               ВЫПОЛНИТЬ ≡ Печать паллетного ценника КЯ ∙ 127[171114961] ←
 32505862[171116989]                 Значения формальных параметров при вызове ←
 32505860[171119222]                   Значение параметра при вызове процедуры/функции ≡ ~Товары ∙ 65545[171117574] ←
   327700[171120954]                     Выражение ≡ Продукт Ид ∙ 65545[164299290] ←
 32505860[171119448]                   Значение параметра при вызове процедуры/функции ≡ ~Кол-во ценников (def = 1) ∙ 65545[171117582] ←
   327700[171121179]                     Выражение ≡ Количество ценников ∙ 65545[165347551] ←
 32505860[171119449]                   Значение параметра при вызове процедуры/функции ≡ ~Показать на экран (def = Нет) ∙ 65545[171117583] ←
   327700[171121180]                     Выражение ≡ Вывести на экран ∙ 65545[171835582] ←
 32505860[171120354]                   Значение параметра при вызове процедуры/функции ≡ ~Печатать цену за 100г ∙ 65545[171118054] ←
   327700[171122253]                     Выражение ≡ Печатать за 100г ∙ 65545[171835583] ←
 32505860[171120391]                   Значение параметра при вызове процедуры/функции ≡ ~Печатать КУ на ценнике (для не ФРОВ и NonFood) ∙ 65545[171118108] ←
   327700[171122291]                     Выражение ≡ Печатать КУ ∙ 65545[171118107] ←
 11010080[171119933]               = ≡ Количество ценников temp ∙ 65545[170918833] ←
      404[171132556]                 Результат ≡ Количество ценников ∙ 65545[165347551] ←
 30867470[171835470]       IF ←
  1638463[171835489]         Условие ←
      404[171836260]           Результат ≡ Вывести на экран ∙ 65545[171835582] ←
  1638473[171835599]           Равно ←
      404[171836261]           Результат ≡ Нет ∙ 131203075[131203073] ←
 30867472[171835468]         THEN ←
  1507410[171835408]           ВЫПОЛНИТЬ БЛОК ≡ выводим сообщение об окончании, если не автоматом ∙ 30867469[170917895] ←
 12124189[164298875]     Выполнить при завершении ←
 11010104[164298824]       Очистить локальную таблицу ≡ Список товаров ∙ 30867458[164298763] ←
