ETK\Admin

      127[165019749]   Процедура • Отчёты уценка (заявка 74055) ≡ БАЗОВЫЙ ОТЧЕТ С ВЫГРУЗКОЙ CSV ∙ 127[655295523] ←
 32505862[172752928]     Значения формальных параметров при вызове ←
 32505860[172752930]       Значение параметра при вызове процедуры/функции ≡ Использовать HOME директорий ∙ 65545[165483899] ←
   327700[172752930]         Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[172752927]           Выполнить действия ←
 39780366[172752917]             RETURN ←
      404[172753072]               Результат ⁼ 1 ←
 32505863[165019694]     Локальные переменные ←
    65545[173015259]       Локальная переменная • Отчет по дивизиону ≡ bool ∙ 107[1507344] ←
      355[173015126]         Начальное значение ≡ false ∙ 117[30867469] ←
    65545[173015257]       Локальная переменная • Текущая ТТ ≡ Партнер ∙ 107[5] ←
    65545[173015209]       Локальная переменная • Дивизионы ≡ Список партнеров ∙ 107[1507332] ←
      117[173015051]       Выражение • Дивизион тт ≡ Наименование объекта (80) ∙ 107[262147] ←
      404[173015882]         Результат ≡ Текущая ТТ ∙ 65545[173015257] ←
      411[173015158]           Уточняющий параметр ≡ Родитель ∙ 283[2] ←
      411[173015159]             Уточняющий параметр ≡ Родитель ∙ 283[2] ←
      411[173015160]               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
    65545[165481408]       Локальная переменная • ы ≡ Целое ∙ 107[2] ←
      355[170918332]         Начальное значение ⁼ 0 ←
    65545[170918948]       Локальная переменная • Списано бонусов ≡ Сумма ∙ 107[12] ←
 30867495[165019685]       Группа локальных переменных • ККЛ ←
    65545[165020581]         Локальная переменная • Продано ≡ Количество ∙ 107[15] ←
    65545[165020588]         Локальная переменная • Выставлено ≡ Количество ∙ 107[15] ←
    65545[171117666]         Локальная переменная • Продано (купонов, шт) ≡ Количество ∙ 107[15] ←
    65545[171117663]         Локальная переменная • Выставлено (купонов, шт) ≡ Количество ∙ 107[15] ←
    65545[165020589]         Локальная переменная • Цена (розн.) ≡ Цена ∙ 107[16] ←
    65545[165020591]         Локальная переменная • Сумма (розн.) ≡ Сумма ∙ 107[12] ←
    65545[165020590]         Локальная переменная • Цена (факт.) ≡ Цена ∙ 107[16] ←
    65545[165020593]         Локальная переменная • Скидка ≡ Сумма ∙ 107[12] ←
    65545[165020592]         Локальная переменная • Сумма (факт.) ≡ Сумма ∙ 107[12] ←
    65545[165806509]         Локальная переменная • Итого убытков ≡ Сумма ∙ 107[12] ←
    65545[165806510]         Локальная переменная • Итого по ТТ ≡ Сумма ∙ 107[12] ←
 30867495[165019686]       Группа локальных переменных • ЛТ ←
 30867495[165478631]         Группа локальных переменных • Приказы ←
    65545[165020574]           Локальная переменная • Приказы : ЦО ≡ Партнер ∙ 107[5] ←
    65545[165020606]           Локальная переменная • Приказы : Продукт (приказы) ≡ Продукт ∙ 107[7] ←
    65545[165020605]           Локальная переменная • Приказы : Строка приказа ≡ Строка (объект БД) ∙ 107[10] ←
    65545[165481409]           Локальная переменная • Приказы : Скидка ≡ Число, точность 6 знаков ∙ 107[42401800] ←
    65545[165481410]           Локальная переменная • Приказы : ТТ ≡ Партнер ∙ 107[5] ←
    65545[165481412]           Локальная переменная • Приказы : Код ≡ Наименование объекта (80) ∙ 107[262147] ←
 30867495[165478632]         Группа локальных переменных • Продажи ←
    65545[164824802]           Локальная переменная • Адрес ДД ≡ Длинная строка (1000) ∙ 107[48431111] ←
    65545[164824801]           Локальная переменная • Адрес КД ≡ Длинная строка (1000) ∙ 107[48431111] ←
    65545[165020587]           Локальная переменная • ТТ ≡ Партнер ∙ 107[5] ←
    65545[165020582]           Локальная переменная • Продукт из чека ≡ Продукт ∙ 107[7] ←
    65545[165020595]           Локальная переменная • ЛТ Продано ≡ Количество ∙ 107[15] ←
    65545[165020596]           Локальная переменная • ЛТ Выставлено ≡ Количество ∙ 107[15] ←
    65545[171117665]           Локальная переменная • ЛТ Продано (купонов, шт) ≡ Количество ∙ 107[15] ←
    65545[171117664]           Локальная переменная • ЛТ Выставлено (купонов, шт) ≡ Количество ∙ 107[15] ←
    65545[165020597]           Локальная переменная • ЛТ Цена (розн.) ≡ Цена ∙ 107[16] ←
    65545[165020598]           Локальная переменная • ЛТ Сумма (розн.) ≡ Сумма ∙ 107[12] ←
    65545[165020599]           Локальная переменная • ЛТ Цена (факт.) ≡ Цена ∙ 107[16] ←
    65545[165020600]           Локальная переменная • ЛТ Сумма (факт.) ≡ Сумма ∙ 107[12] ←
    65545[165020608]           Локальная переменная • ЛТ Убыток ≡ Сумма ∙ 107[12] ←
    65545[165020602]           Локальная переменная • Счётчик операций ≡ Целое без знака ∙ 107[262146] ←
    65545[165020603]         Локальная переменная • Приказ ≡ Документ ∙ 107[8] ←
    65545[165020571]       Локальная переменная • Подразделения ≡ Список партнеров ∙ 107[1507332] ←
    65545[165020607]       Локальная переменная • tmp ≡ Целое ∙ 107[2] ←
    65545[165020611]       Локальная переменная • tmpstr ≡ Короткая строка (12 символов) ∙ 107[2293761] ←
    65545[165020572]       Локальная переменная • Список касс ≡ Список партнеров ∙ 107[1507332] ←
    65545[165020573]       Локальная переменная • Не выбирать подразделение ≡ bool ∙ 107[1507344] ←
    65545[165020579]       Локальная переменная • КЯ или Д ≡ bool ∙ 107[1507344] ←
    65545[165020580]       Локальная переменная • Строка ККЛ ≡ Строка (объект БД) ∙ 107[10] ←
    65545[165020583]       Локальная переменная • Дата1 ≡ Дата ∙ 107[3] ←
    65545[165020584]       Локальная переменная • Дата2 ≡ Дата ∙ 107[3] ←
    65545[165020585]       Локальная переменная • Дата продажи ≡ Дата+Время ∙ 107[2621441] ←
    65545[165020586]       Локальная переменная • Список приказов ценовых схем ≡ Список документов ∙ 107[1507335] ←
    65545[165020604]       Локальная переменная • Список приказов ЦС (строка) ≡ Длинная строка (250) ∙ 107[28835851] ←
    65545[165020952]       Локальная переменная • Ценовая схема ≡ Короткая строка (12 символов) ∙ 107[2293761] ←
    65545[165020953]       Локальная переменная • Точный приказ ≡ Документ ∙ 107[8] ←
    65545[165020954]       Локальная переменная • Строка приказа на ценовую схему ≡ Строка (объект БД) ∙ 107[10] ←
    65545[165020594]       Локальная переменная • Список скидок ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[164824796]       Локальная переменная • Список поставщиков ≡ Строка для примечания (4000 знаков) ∙ 107[30867457] ←
    65545[165544278]       Локальная переменная • Поставщик ≡ Партнер ∙ 107[5] ←
    65545[165544277]       Локальная переменная • Список возвратный/невозвратный поставщик ≡ Строка для примечания (4000 знаков) ∙ 107[30867457] ←
    65545[165347415]       Локальная переменная • Адрес УД(ТД) ≡ Длинная строка (1000) ∙ 107[48431111] ←
      249[165019653]       Функция • avg ≡ { ... скрипт ... } ∙ 249[39780357] ←
      262[165019658]         Наследуемые атрибуты ≡ Значения формальных параметров при вызове ∙ 1[32505862] ←
 32505861[165019682]         Формальные параметры ←
    65545[165020610]           Локальная переменная • Кол-во ≡ Целое без знака ∙ 107[262146] ←
    65545[165020609]           Локальная переменная • Число ≡ Число, точность 4 знака ∙ 107[1507341] ←
 32505863[165019696]         Локальные переменные ←
    65545[165020612]           Локальная переменная • Частное ≡ Сумма ∙ 107[12] ←
 30867463[165019697]         Выполнить действия ←
 11010080[165021223]           = ≡ Частное ∙ 65545[165020612] ←
      116[165019996]             Выражение ←
      404[165024918]               Результат ≡ Число ∙ 65545[165020609] ←
      402[165019663]               Делить ←
      404[165024919]               Результат ≡ Кол-во ∙ 65545[165020610] ←
 39780366[165019685]           RETURN ←
      404[165024928]             Результат ≡ Округление ∙ 249[30867464] ←
 32505862[165020183]               Значения формальных параметров при вызове ←
 32505860[165020736]                 Значение параметра при вызове процедуры/функции ≡ Округляемое значение ∙ 65545[30867479] ←
   327700[165021326]                   Выражение ≡ Частное ∙ 65545[165020612] ←
 32505860[165020743]                 Значение параметра при вызове процедуры/функции ≡ Вид округления ∙ 65545[30867505] ←
   327700[165021325]                   Выражение ≡ До 0.01 ∙ 1638433[1638401] ←
 32505861[165347334]     Формальные параметры ←
    65545[165347414]       Локальная переменная • автодлябатонов ≡ Целое ∙ 107[2] ←
      355[165347413]         Начальное значение ≡ NULL ∙ 117[30670850] ←
 30867483[165019669]     Локальные таблицы ←
 30867458[165019675]       Локальная таблица • Продажи ←
 11010103[165019662]         Исключать дублирующиеся записи ←
 11010090[165019675]         Структура (Поля, сортировка, генерируемые события) ←
 30867481[164823065]           Блок (при отборе данных будет генерироваться это событие) • ДД ←
 30867475[164823197]             Параметр ≡ Адрес ДД ∙ 65545[164824802] ←
 30867476[164823090]               Сортировать по возрастанию ←
 30867481[164823063]           Блок (при отборе данных будет генерироваться это событие) • КД ←
 30867475[164823198]             Параметр ≡ Адрес КД ∙ 65545[164824801] ←
 30867476[164823091]               Сортировать по возрастанию ←
 30867481[165806082]           Блок (при отборе данных будет генерироваться это событие) • ТТ ←
 30867475[165019798]             Параметр ≡ ТТ ∙ 65545[165020587] ←
 30867476[165019700]               Сортировать по возрастанию ←
 30867475[165019788]           Параметр ≡ Продукт из чека ∙ 65545[165020582] ←
 30867476[165019695]             Сортировать по возрастанию ←
 30867475[165019787]           Параметр ≡ ЛТ Продано ∙ 65545[165020595] ←
 30867475[165019789]           Параметр ≡ ЛТ Выставлено ∙ 65545[165020596] ←
 30867475[171114844]           Параметр ≡ ЛТ Продано (купонов, шт) ∙ 65545[171117665] ←
 30867475[171114845]           Параметр ≡ ЛТ Выставлено (купонов, шт) ∙ 65545[171117664] ←
 30867475[165019790]           Параметр ≡ ЛТ Цена (розн.) ∙ 65545[165020597] ←
 30867475[165019791]           Параметр ≡ ЛТ Сумма (розн.) ∙ 65545[165020598] ←
 30867475[165019792]           Параметр ≡ ЛТ Цена (факт.) ∙ 65545[165020599] ←
 30867475[165019793]           Параметр ≡ ЛТ Сумма (факт.) ∙ 65545[165020600] ←
 30867475[170917953]           Параметр ≡ Списано бонусов ∙ 65545[170918948] ←
 30867475[165019799]           Параметр ≡ ЛТ Убыток ∙ 65545[165020608] ←
 30867475[165019794]           Параметр ≡ Счётчик операций ∙ 65545[165020602] ←
 30867458[165019676]       Локальная таблица • Приказы ←
 11010103[165019663]         Исключать дублирующиеся записи ←
 11010090[165019676]         Структура (Поля, сортировка, генерируемые события) ←
 30867475[165019795]           Параметр ≡ Приказы : ЦО ∙ 65545[165020574] ←
 30867476[165019696]             Сортировать по возрастанию ←
 30867475[165019796]           Параметр ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
 30867476[165019698]             Сортировать по возрастанию ←
 30867475[165019800]           Параметр ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
 30867476[165019701]             Сортировать по возрастанию ←
 30867475[165478900]           Параметр ≡ Приказы : Скидка ∙ 65545[165481409] ←
 30867476[165478546]             Сортировать по возрастанию ←
 30867475[165478903]           Параметр ≡ Приказы : ТТ ∙ 65545[165481410] ←
 30867476[165478547]             Сортировать по возрастанию ←
 30867475[165478906]           Параметр ≡ Приказы : Код ∙ 65545[165481412] ←
 30867476[165478548]             Сортировать по возрастанию ←
 12124203[164823054]     Запросы ←
 12124205[173015078]       Запрос • Торговые точки (магазины) дивизиона ←
 12124213[173015090]         Параметры ←
  1507335[173015205]           Параметр • з. уид ≡ Магазины ∙ 12124204[173015116] ←
  1507494[173015471]             Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1507335[173015206]           Параметр • з. Наименование ≡ Магазины ∙ 12124204[173015116] ←
  1507494[173015472]             Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 12124200[173015089]         From         (Таблицы) ←
 12124205[173015079]           Запрос • ЦО ←
 12124213[173015091]             Параметры ←
  1507335[173015207]               Параметр • з.ЦО ≡ ЦО ∙ 12124204[173015115] ←
  1507494[173015473]                 Уточняющий параметр ≡ Партнер ∙ 283[1] ←
 12124200[173015090]             From         (Таблицы) ←
 12124204[173015115]               Таблица • ЦО ≡ Партнер ∙ 108[4] ←
 12124215[173015101]             Where      (Ограничения на отбор данных) ←
  1507376[173015289]               Выражение ←
  1507455[173015323]                 Результат ≡ ЦО ∙ 12124204[173015115] ←
  1507494[173015474]                   Уточняющий параметр ≡ Класс ∙ 283[3] ←
  1638473[173015244]                 Равно ←
  1507488[173015106]                 Константа (Ограничение по классу, типу, плану счетов) ≡ ПОДРАЗДЕЛЕНИЕ ∙ 539[2] ←
  1507376[173015290]               Выражение ←
  1507455[173015324]                 Результат ≡ ЦО ∙ 12124204[173015115] ←
  1507494[173015475]                   Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[173015245]                 Равно ←
  1507488[173015107]                 Константа (Ограничение по классу, типу, плану счетов) ≡ Центр ответственности ∙ 284[40370180] ←
  1507376[173015291]               Выражение ←
  1507455[173015325]                 Результат ≡ ЦО ∙ 12124204[173015115] ←
  1507494[173015476]                   Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[173015246]                 Равно ←
  1507452[173015161]                 Константа ≡ Дивизионы ∙ 65545[173015209] ←
 12124204[173015116]           Таблица • Магазины ≡ Партнер ∙ 108[4] ←
 12124215[173015102]         Where      (Ограничения на отбор данных) ←
  1507376[173015292]           Выражение ←
  1507455[173015326]             Результат ≡ Магазины ∙ 12124204[173015116] ←
  1507494[173015477]               Уточняющий параметр ≡ Класс ∙ 283[3] ←
  1638473[173015247]             Равно ←
  1507488[173015108]             Константа (Ограничение по классу, типу, плану счетов) ≡ ПОДРАЗДЕЛЕНИЕ ∙ 539[2] ←
  1507376[173015293]           Выражение ←
  1507455[173015327]             Результат ≡ Магазины ∙ 12124204[173015116] ←
  1507494[173015478]               Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[173015248]             Равно ←
  1507488[173015109]             Константа (Ограничение по классу, типу, плану счетов) ≡ Торговая точка (Магазин) ∙ 284[40566786] ←
  1507376[173015294]           Выражение ←
  1507455[173015328]             Результат ≡ Магазины ∙ 12124204[173015116] ←
  1507494[173015479]               Уточняющий параметр ≡ Не рассчитывать скорость продаж ∙ 283[43122692] ←
  1638473[173015249]             Равно ←
  1507452[173015162]             Константа ≡ Да ∙ 131203075[131203074] ←
  1507376[173015295]           Выражение ←
  1507455[173015329]             Результат ≡ Магазины ∙ 12124204[173015116] ←
  1507494[173015480]               Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[173015250]             Равно ←
  1507455[173015330]             Результат ≡ ЦО ∙ 12124205[173015079] ←
  1507494[173015481]               Уточняющий параметр ≡ з.ЦО ∙ 1507335[173015207] ←
 12124205[164823118]       Запрос • Партии с остатком ←
 12124213[164823487]         Параметры ←
  1507335[164824631]           Параметр • Партия ∙ 12124204[164823320] ←
  1507494[164827975]             Уточняющий параметр ≡ Аналитика (3) ∙ 393[5] ←
  1507335[164824640]           Параметр • Остаток ≡ Остаток по партии ∙ 1507449[164823158] ←
  1507335[164824682]           Параметр • Дата партии ≡ Партия ∙ 12124204[164823321] ←
  1507494[164827986]             Уточняющий параметр ≡ Дата ∙ 305[9] ←
  1507447[164823235]         Выражения ←
  1507449[164823158]           Выражение • Остаток по партии ≡ Число ∙ 107[4] ←
  1507376[164824221]             Выражение ←
  1507455[164824284]               Результат ∙ 12124204[164823320] ←
  1507494[164827976]                 Уточняющий параметр ≡ Сумма дебет ∙ 393[9] ←
      406[164823261]               Вычесть ←
  1507455[164824285]               Результат ∙ 12124204[164823320] ←
  1507494[164827977]                 Уточняющий параметр ≡ Сумма кредит ∙ 393[10] ←
 12124200[164823626]         From         (Таблицы) ←
 12124204[164823320]           Таблица ≡ Сальдо ∙ 108[10] ←
 12124204[164823321]           Таблица • Партия ≡ Продукт ∙ 108[3] ←
 12124215[164823965]         Where      (Ограничения на отбор данных) ←
  1507376[164824222]           Выражение ←
  1507455[164824286]             Результат ∙ 12124204[164823320] ←
  1507494[164827978]               Уточняющий параметр ≡ ЦФО ∙ 393[1] ←
  1638473[164824623]             Равно ←
  1507452[164823890]             Константа ≡ Центр финанс. ответственности для ТОВАРНЫХ ПЛАНОВ ∙ 117[45613057] ←
      413[164824185]           И ←
  1507376[164824223]           Выражение ←
  1507455[164824287]             Результат ∙ 12124204[164823320] ←
  1507494[164827979]               Уточняющий параметр ≡ Счет ∙ 393[2] ←
  1638473[164824624]             Равно ←
  1507452[164823891]             Константа ≡ Количество по партиям (товарный запас) ∙ 131[14417935] ←
      413[164824186]           И ←
  1507376[164824224]           Выражение ←
  1507455[164824288]             Результат ∙ 12124204[164823320] ←
  1507494[164827980]               Уточняющий параметр ≡ Аналитика (1) ∙ 393[3] ←
  1638473[164824625]             Равно ←
  1507452[164823892]             Константа ≡ Первый ТЗ/ПЦ для ЦО/ТТ/Узла (действ. магазины) ∙ 249[655294491] ←
 32505862[164827318]               Значения формальных параметров при вызове ←
 32505860[164832340]                 Значение параметра при вызове процедуры/функции ≡ ~ТТ ∙ 65545[58392606] ←
   327700[164836042]                   Выражение ≡ ТТ ∙ 65545[165020587] ←
      413[164824187]           И ←
  1507376[164824225]           Выражение ←
  1507455[164824289]             Результат ∙ 12124204[164823320] ←
  1507494[164827981]               Уточняющий параметр ≡ Валюта ∙ 393[8] ←
  1638473[164824626]             Равно ←
  1507452[164823893]             Константа ≡ Штука ∙ 131108[28049409] ←
      413[164824188]           И ←
  1507376[164824227]           Выражение ←
  1507455[164824291]             Результат ∙ 12124204[164823320] ←
  1507494[164827983]               Уточняющий параметр ≡ Аналитика (2) ∙ 393[4] ←
  1638473[164824627]             Равно ←
  1507452[164823896]             Константа ≡ Продукт из чека ∙ 65545[165020582] ←
      413[164824190]           И ←
  1507376[164824228]           Выражение ←
  1507455[164824292]             Результат ∙ 12124204[164823320] ←
  1507494[164827984]               Уточняющий параметр ≡ Аналитика (3) ∙ 393[5] ←
  1638473[164824628]             Равно ←
  1507455[164824293]             Результат ≡ Партия ∙ 12124204[164823321] ←
  1507494[164827985]               Уточняющий параметр ≡ Продукт ∙ 305[1] ←
 12124222[164823462]         Order By   (Сортировка) ←
  1507532[164823319]           Сортировать по убыванию ≡ Дата партии ∙ 1507335[164824682] ←
 12124205[170983641]       Запрос • Партии с остатком (VPSTOCK) ←
  1507447[170983567]         Выражения ←
  1507449[170983916]           Выражение • Остаток по партии ≡ Число ∙ 107[4] ←
  1507455[170984544]             Результат ∙ 12124204[170983688] ←
  1507494[170984743]               Уточняющий параметр ≡ Остаток ∙ 1507443[48431233] ←
 12124213[170983746]         Параметры ←
  1507335[170984090]           Параметр • Партия ∙ 12124204[170983688] ←
  1507494[170984741]             Уточняющий параметр ≡ Партия ∙ 1507443[48431234] ←
  1507335[170984091]           Параметр • Остаток ≡ Остаток по партии ∙ 1507449[170983916] ←
  1507335[170984092]           Параметр • Дата партии ≡ Партия ∙ 12124204[170983689] ←
  1507494[170984742]             Уточняющий параметр ≡ Дата ∙ 305[9] ←
 12124200[170983697]         From         (Таблицы) ←
 12124204[170983688]           Таблица ≡ ОСТАТКИ ПАРТИОННЫХ ТОВАРОВ ∙ 1507696[48431116] ←
 12124204[170983689]           Таблица • Партия ≡ Продукт ∙ 108[3] ←
 12124215[170983740]         Where      (Ограничения на отбор данных) ←
  1507376[170984154]           Выражение ←
  1507455[170984675]             Результат ∙ 12124204[170983688] ←
  1507494[170984747]               Уточняющий параметр ≡ Подразделение ∙ 1507443[48431231] ←
  1638473[170984081]             Равно ←
  1507452[170983903]             Константа ≡ Первый ТЗ/ПЦ для ЦО/ТТ/Узла (действ. магазины) ∙ 249[655294491] ←
 32505862[170984392]               Значения формальных параметров при вызове ←
 32505860[170984995]                 Значение параметра при вызове процедуры/функции ≡ ~ТТ ∙ 65545[58392606] ←
   327700[170985363]                   Выражение ≡ ТТ ∙ 65545[165020587] ←
  1507376[170984156]           Выражение ←
  1507455[170984677]             Результат ∙ 12124204[170983688] ←
  1507494[170984749]               Уточняющий параметр ≡ Базовый продукт ∙ 1507443[48431232] ←
  1638473[170984083]             Равно ←
  1507452[170983905]             Константа ≡ Продукт из чека ∙ 65545[165020582] ←
  1507376[170984157]           Выражение ←
  1507455[170984678]             Результат ∙ 12124204[170983688] ←
  1507494[170984750]               Уточняющий параметр ≡ Партия ∙ 1507443[48431234] ←
  1638473[170984084]             Равно ←
  1507455[170984679]             Результат ≡ Партия ∙ 12124204[170983689] ←
  1507494[170984751]               Уточняющий параметр ≡ Продукт ∙ 305[1] ←
 12124222[170983461]         Order By   (Сортировка) ←
  1507532[170983441]           Сортировать по убыванию ≡ Дата партии ∙ 1507335[170984092] ←
  1507531[165019671]     Подстановки виртуальных блоков ←
 11010093[165543979]       Комментарий • Добавлен столбец Возврат 10.09.2018 Зарубина (241001) ←
 30867469[165019796]       БЛОК ≡ Инициализация ∙ 30867469[655295590] ←
 30867470[165020003]         IF ←
  1638463[165020090]           Условие ←
      404[165024707]             Результат ≡ Текущий узел является консолидированной базой ∙ 249[1507768] ←
 30867472[165020003]           THEN • общая база, ставим флаги на показ списка КЯ ←
  1507728[164823488]             Начало многострочного комментария ←
 11010088[165020333]             ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
 11010095[165019939]               Выражение ←
      404[165024741]                 Результат ⁼ Вы не в базе магазина. Сбор данных невозможен. Выходим. ←
 11010101[165019661]             EXIT ←
  1507729[164823485]             Конец многострочного комментария ←
 11010093[165019714]             Комментарий • флаг неблокировки поля выбора магазина ←
 11010080[165021166]             = ≡ Не выбирать подразделение ∙ 65545[165020573] ←
      404[165024708]               Результат ≡ false ∙ 117[30867469] ←
 11010093[165019715]             Комментарий • флаг выбора только КЯ ←
 11010080[165021177]             = ≡ КЯ или Д ∙ 65545[165020579] ←
      404[165024719]               Результат ≡ false ∙ 117[30867469] ←
 30867473[165019752]           ELSE ←
 11010080[165021167]             = ≡ Приказы : ЦО ∙ 65545[165020574] ←
      404[165024709]               Результат ≡ Первое ЦО для данного Узла сети ∙ 249[655294496] ←
 30867470[165020004]             IF ←
  1638463[165020091]               Условие ←
      404[165024710]                 Результат ≡ Приказы : ЦО ∙ 65545[165020574] ←
      411[165021080]                   Уточняющий параметр ≡ Ранг партнера ∙ 283[28835905] ←
  1638473[165020098]                 Равно ←
      404[165024711]                 Результат ≡ Дискаунтер ∙ 164364327[164364290] ←
 30867472[165020004]               THEN ←
 11010080[165021168]                 = ≡ Не выбирать подразделение ∙ 65545[165020573] ←
      404[165024712]                   Результат ≡ false ∙ 117[30867469] ←
 11010080[165021178]                 = ≡ КЯ или Д ∙ 65545[165020579] ←
      404[165024725]                   Результат ≡ true ∙ 117[30867468] ←
 30867473[165019753]               ELSE ←
 11010080[165021169]                 = ≡ Не выбирать подразделение ∙ 65545[165020573] ←
      404[165024713]                   Результат ≡ true ∙ 117[30867468] ←
 11010080[165021170]                 = ≡ Подразделения ∙ 65545[165020571] ←
      404[165024714]                   Результат ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[656082624]                     Значения формальных параметров при вызове ←
 32505860[656084332]                       Значение параметра при вызове процедуры/функции ≡ ~Узел сети ∙ 65545[655298657] ←
   327700[656086270]                         Выражение ≡ Текущий узел распределенной сети ∙ 381[1507340] ←
 30867470[165348054]                 IF ←
  1638463[165348378]                   Условие ←
      404[165358737]                     Результат ≡ Текущий узел - Ромашка ∙ 249[165347345] ←
 30867472[165348049]                   THEN ←
 11010080[165350621]                     = ≡ Подразделения ∙ 65545[165020571] ←
      404[165358738]                       Результат ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[165348593]                         Значения формальных параметров при вызове ←
 32505860[165349952]                           Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
   327700[165350871]                             Выражение ≡ ЦО для текущего узла (для дискаунтера и экспресса по ip адресу) ∙ 249[164298878] ←
 11010080[165021164]         = ≡ Имя ∙ 65545[655299190] ←
      404[165024703]           Результат ⁼ 'ucenka-' ←
      404[165024704]           Результат ≡ Случайное число (7 знаков) ∙ 117[1507630] ←
 30867469[165019797]       БЛОК ≡ Выбор данных ∙ 30867469[655295597] ←
 11010093[164823154]         Комментарий • Форма ввода ←
 30867470[164826126]         IF ←
  1638463[164826901]           Условие ←
      116[165347428]             Выражение ←
      404[164845674]               Результат ≡ Автоматически ∙ 65545[58393339] ←
      412[165347395]               ИЛИ ←
      404[165347746]               Результат ≡ автодлябатонов ∙ 65545[165347414] ←
 30867472[164826092]           THEN ←
 11010080[164827523]             = ≡ Дата начальная ∙ 381[131078] ←
      404[164845675]               Результат ≡ Вчера, начало дня ∙ 249[656080945] ←
 11010080[164827524]             = ≡ Дата конечная ∙ 381[131079] ←
      404[164845676]               Результат ≡ Вчера, конец дня ∙ 249[164823112] ←
 30867470[165347368]             IF ←
  1638463[165347376]               Условие ←
      404[165347739]                 Результат ≡ автодлябатонов ∙ 65545[165347414] ←
 30867472[165347368]               THEN ←
  1507360[165347349]                 Отбор данных (по запросу) • выберем все действующие ТТ батоны ←
 12124213[165347391]                   Параметры ←
  1507335[165347333]                     Параметр • селект.партнер.ид ∙ 12124204[165347331] ←
  1507494[165347351]                       Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1507673[165347372]                   Ключи оптимизации ←
  1507675[165347330]                     Использовать индекс ∙ 12124204[165347331] ←
  1507676[165347330]                       Уточняющий параметр ≡ Класс -- Тип ∙ 1507445[60424329] ←
 12124200[165347331]                   From         (Таблицы) ←
 12124204[165347331]                     Таблица ≡ Партнер ∙ 108[4] ←
 12124215[165347337]                   Where      (Ограничения на отбор данных) ←
  1507376[165347347]                     Выражение ←
  1507455[165347347]                       Результат ∙ 12124204[165347331] ←
  1507494[165347352]                         Уточняющий параметр ≡ Класс ∙ 283[3] ←
  1638473[165347373]                       Равно ←
  1507488[165347329]                       Константа (Ограничение по классу, типу, плану счетов) ≡ ПОДРАЗДЕЛЕНИЕ ∙ 539[2] ←
      413[165347353]                     И ←
  1507376[165347348]                     Выражение ←
  1507455[165347348]                       Результат ∙ 12124204[165347331] ←
  1507494[165347353]                         Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[165347374]                       Равно ←
  1507488[165347401]                       Константа (Ограничение по классу, типу, плану счетов) ≡ Торговая точка (Магазин) ∙ 284[40566786] ←
      413[165347354]                     И ←
  1507376[165347349]                     Выражение ←
  1507455[165347349]                       Результат ∙ 12124204[165347331] ←
  1507494[165347354]                         Уточняющий параметр ≡ Не рассчитывать скорость продаж ∙ 283[43122692] ←
  1638473[165347375]                       Равно ←
  1507452[165347343]                       Константа ≡ Да ∙ 131203075[131203074] ←
      413[165347355]                     И ←
  1507376[165347350]                     Выражение ←
  1507455[165347350]                       Результат ∙ 12124204[165347331] ←
  1507494[165347355]                         Уточняющий параметр ≡ Узел распределенной сети ∙ 283[42401811] ←
  1638473[165347376]                       Равно ←
  1507452[165347344]                       Константа ⁼ 5:0:0:36910976 ←
      413[165347356]                     И ←
  1507376[165347351]                     Выражение ←
  1507455[165347351]                       Результат ∙ 12124204[165347331] ←
  1507494[165347356]                         Уточняющий параметр ≡ Дата первого заказа ∙ 283[2818053] ←
  1638475[165347372]                       Меньше или равно ←
  1507452[165347345]                       Константа ≡ Текущие дата-время ∙ 249[42467332] ←
 30867466[165347389]                   Выполнить после получения записи ←
 11010080[165347413]                     = ≡ Подразделения ∙ 65545[165020571] ←
      404[165347740]                       Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[165347390]                         Список элементов ←
   327700[165347899]                           Выражение ≡ селект.партнер.ид ∙ 1507335[165347333] ←
   327700[165347898]                           Выражение ≡ Подразделения ∙ 65545[165020571] ←
 30867473[164824218]           ELSE ←
 12124190[165019672]             Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[165019674]               Список полей формы ←
      598[165019807]                 Поле (колонка) для ввода данных ≡ Дата начальная ∙ 381[131078] ←
      598[165019808]                 Поле (колонка) для ввода данных ≡ Дата конечная ∙ 381[131079] ←
      598[173015083]                 Поле (колонка) для ввода данных • Дивизионы ≡ Дивизионы ∙ 65545[173015209] ←
  2621482[173015045]                   Только для просмотра (недопустимо для изменения), если: ≡ Не выбирать подразделение ∙ 65545[165020573] ←
      209[173015056]                   Выбор из списка ≡ Дивизион (КЯ or Д) ∙ 371[173015045] ←
   262165[173015050]                     Выбор нескольких объектов из списка ≡ Да ∙ 534[40566785] ←
 32505862[173015076]                     Значения формальных параметров при вызове ←
 32505860[173015090]                       Значение параметра при вызове процедуры/функции ≡ КЯ или Д ∙ 65545[173015250] ←
   327700[173015130]                         Выражение ≡ КЯ или Д ∙ 65545[165020579] ←
      598[165019809]                 Поле (колонка) для ввода данных • Подразделения ≡ Подразделения ∙ 65545[165020571] ←
 29163536[170917932]                   Отображаемый текст для объектов БД ≡ Родитель ∙ 283[2] ←
      411[170919575]                     Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
  2621482[165019653]                   Только для просмотра (недопустимо для изменения), если: ≡ Не выбирать подразделение ∙ 65545[165020573] ←
  2621481[165347440]                   Доступно (видимо), если: ≡ Текущий узел не Ромашка ∙ 249[165347346] ←
      209[165019713]                   Выбор из списка ≡ ЦО (КЯ xor Д) ∙ 371[165019659] ←
   262165[165019677]                     Выбор нескольких объектов из списка ≡ Да ∙ 534[40566785] ←
 32505862[165020181]                     Значения формальных параметров при вызове ←
 32505860[165020730]                       Значение параметра при вызове процедуры/функции ≡ КЯ или Д? (false-true соответственно) ∙ 65545[165020575] ←
   327700[165021318]                         Выражение ≡ КЯ или Д ∙ 65545[165020579] ←
      598[165347643]                 Поле (колонка) для ввода данных • Подразделения ≡ Подразделения ∙ 65545[165020571] ←
 29163536[165347418]                   Отображаемый текст для объектов БД ≡ Родитель ∙ 283[2] ←
      411[165350161]                     Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
  2621481[165347441]                   Доступно (видимо), если: ≡ Текущий узел - Ромашка ∙ 249[165347345] ←
      209[165347453]                   Выбор из списка ≡ Торговые точки (Магазины) + РЦ + ПЦ ∙ 371[144310390] ←
  1638486[165347344]                     Ограничение на отбор данных ←
 41746472[165347344]                       Where ≡ Узел распределенной сети ∙ 283[42401811] ←
 41746478[165347344]                         Равно ⁼ 5:0:0:85778448 ←
 30867470[173015070]             IF ←
  1638463[173015078]               Условие ←
      116[173015062]                 Выражение ←
      404[173015877]                   Результат ≡ Множество.Количество элементов ∙ 387[1507487] ←
   327700[173015135]                     Выражение ≡ Дивизионы ∙ 65545[173015209] ←
  1638477[173015058]                   Больше или равно ←
      404[173015878]                   Результат ⁼ 1 ←
      413[173015064]                 И ←
      116[173015063]                 Выражение ←
  1638460[173015049]                   НЕ ←
      404[173015874]                   Результат ≡ Подразделения ∙ 65545[165020571] ←
 30867472[173015070]               THEN • Добавим ТТ из выбранных дивизионов ←
 11010080[173015280]                 = ≡ Отчет по дивизиону ∙ 65545[173015259] ←
      404[173016001]                   Результат ≡ true ∙ 117[30867468] ←
  1507360[173015082]                 Отбор данных (по запросу) ≡ Торговые точки (магазины) дивизиона ∙ 12124205[173015078] ←
 30867466[173015087]                   Выполнить после получения записи ←
 11010080[173015273]                     = ≡ Подразделения ∙ 65545[165020571] ←
      404[173015876]                       Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[173015051]                         Список элементов ←
   327700[173015133]                           Выражение ≡ Подразделения ∙ 65545[165020571] ←
   327700[173015134]                           Выражение ≡ з. уид ∙ 1507335[173015205] ←
 30867470[170983879]         IF ←
  1638463[170983985]           Условие ←
      404[170987945]             Результат ≡ Подразделения ∙ 65545[165020571] ←
 30867472[170983870]           THEN ←
 11010080[164831436]             = ≡ Дата конечная ∙ 381[131079] ←
      404[164846849]               Результат ≡ Дата, конец дня ∙ 249[30867475] ←
 32505862[164825692]                 Значения формальных параметров при вызове ←
 32505860[164828965]                   Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
   327700[164830440]                     Выражение ≡ Дата конечная ∙ 381[131079] ←
 11010080[165021180]             = ≡ Дата1 ∙ 65545[165020583] ←
      404[165024742]               Результат ≡ Дата начальная ∙ 381[131078] ←
      406[165019687]               Вычесть ←
      116[165019985]               Выражение ←
      404[165024743]                 Результат ≡ Сутки ∙ 117[16843851] ←
      403[165019717]                 Умножить ←
      404[165024744]                 Результат ⁼ 100 ←
 11010080[165021181]             = ≡ Дата2 ∙ 65545[165020584] ←
      404[165024756]               Результат ≡ Дата, конец дня ∙ 249[30867475] ←
 32505862[165020184]                 Значения формальных параметров при вызове ←
 32505860[165020737]                   Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
   327700[165021327]                     Выражение ≡ Дата конечная ∙ 381[131079] ←
  1507360[170918172]             Отбор данных (по запросу) • Документ+строки ←
  1507703[170721286]               Показать текст запроса ←
 12124213[170918103]               Параметры ←
  1507335[170918261]                 Параметр • Селект строка ∙ 12124204[170918192] ←
  1507494[170919782]                   Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507335[170918299]                 Параметр • Селект строка цена розн ∙ 12124204[170918192] ←
  1507494[170919877]                   Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
  1507335[170918300]                 Параметр • Селект строка цена фактическая ∙ 12124204[170918192] ←
  1507494[170919878]                   Уточняющий параметр ≡ Цена продажная (фактическая) ∙ 359[15007748] ←
  1507335[170918301]                 Параметр • Селект строка списано бонусов ∙ 12124204[170918192] ←
  1507494[170919879]                   Уточняющий параметр ≡ Пробег ∙ 359[14483468] ←
  1507335[170918296]                 Параметр • Селект строка дата продажи ∙ 12124204[170918192] ←
  1507494[170919874]                   Уточняющий параметр ≡ Дата окончания гарантии ∙ 359[14286866] ←
  1507335[170918297]                 Параметр • Селект строка продукт ∙ 12124204[170918192] ←
  1507494[170919875]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1507335[170918298]                 Параметр • Селект строка колво ∙ 12124204[170918192] ←
  1507494[170919876]                   Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  1507335[170918268]                 Параметр • Селект документ ≡ Документ+Касса ∙ 12124205[170917919] ←
  1507494[170919783]                   Уточняющий параметр ≡ селект документ ∙ 1507335[170918260] ←
  1507335[170918270]                 Параметр • Селект документ.подразделение ≡ Документ+Касса ∙ 12124205[170917919] ←
  1507494[170919785]                   Уточняющий параметр ≡ селект документ.подразделение ∙ 1507335[170918269] ←
  1507335[170721472]                 Параметр • з.Строка.СерверSMTP ∙ 12124204[170918192] ←
  1507494[170721755]                   Уточняющий параметр ≡ Сервер SMTP ∙ 359[48431122] ←
 12124200[170918093]               From         (Таблицы) ←
 12124204[170918192]                 Таблица ≡ Строка (объект БД) ∙ 108[6] ←
 12124205[170917919]                 Запрос • Документ+Касса ←
 12124213[170918102]                   Параметры ←
  1507335[170918260]                     Параметр • селект документ ∙ 12124204[170918193] ←
  1507494[170919757]                       Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1507335[170918269]                     Параметр • селект документ.подразделение ∙ 12124204[170918193] ←
  1507494[170919784]                       Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
 12124200[170918094]                   From         (Таблицы) ←
 12124204[170918193]                     Таблица ≡ Документ ∙ 108[5] ←
 12124204[170918198]                     Таблица • Кассовые аппараты ≡ Партнер ∙ 108[4] ←
 12124215[170918130]                   Where      (Ограничения на отбор данных) ←
  1507376[170919323]                     Выражение ←
  1507455[170919406]                       Результат ∙ 12124204[170918193] ←
  1507494[170919758]                         Уточняющий параметр ≡ Класс ∙ 331[3] ←
  1638473[170920087]                       Равно ←
  1507488[170917946]                       Константа (Ограничение по классу, типу, плану счетов) ≡ КОНТРОЛЬНАЯ ЛЕНТА ∙ 541[40304641] ←
  1507376[170919324]                     Выражение ←
  1507455[170919407]                       Результат ∙ 12124204[170918193] ←
  1507494[170919773]                         Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[170920089]                       Равно ←
  1507488[170918156]                       Константа (Ограничение по классу, типу, плану счетов) ≡ Контрольная лента ∙ 332[40304641] ←
  1507376[170919325]                     Выражение ←
  1507455[170919408]                       Результат ∙ 12124204[170918193] ←
  1507494[170919774]                         Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638477[170918013]                       Больше или равно ←
  1507452[170918800]                       Константа ≡ Дата начальная ∙ 381[131078] ←
  1507376[170919326]                     Выражение ←
  1507455[170919409]                       Результат ∙ 12124204[170918193] ←
  1507494[170919775]                         Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638475[170918038]                       Меньше или равно ←
  1507452[170918801]                       Константа ≡ Дата конечная ∙ 381[131079] ←
  1507376[170919327]                     Выражение ←
  1507455[170919410]                       Результат ∙ 12124204[170918193] ←
  1507494[170919776]                         Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1638473[170920090]                       Равно ←
  1507455[170919411]                       Результат ≡ Кассовые аппараты ∙ 12124204[170918198] ←
  1507494[170919777]                         Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1507376[170919328]                     Выражение ←
  1507455[170919412]                       Результат ≡ Кассовые аппараты ∙ 12124204[170918198] ←
  1507494[170919778]                         Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[170920092]                       Равно ←
  1507452[170918802]                       Константа ≡ Подразделения ∙ 65545[165020571] ←
  1507376[170919329]                     Выражение ←
  1507455[170919413]                       Результат ≡ Кассовые аппараты ∙ 12124204[170918198] ←
  1507494[170919779]                         Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[170920094]                       Равно ←
  1507488[170918161]                       Константа (Ограничение по классу, типу, плану счетов) ≡ Кассовый аппарат (внешняя касса) ∙ 284[14745620] ←
 12124215[170918131]               Where      (Ограничения на отбор данных) ←
  1507376[170919330]                 Выражение ←
  1507455[170919414]                   Результат ∙ 12124204[170918192] ←
  1507494[170919780]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638473[170920097]                   Равно ←
  1507455[170919415]                   Результат ≡ Документ+Касса ∙ 12124205[170917919] ←
  1507494[170919781]                     Уточняющий параметр ≡ селект документ ∙ 1507335[170918260] ←
  1507376[170919388]                 Выражение ←
  1507455[170919486]                   Результат ∙ 12124204[170918192] ←
  1507494[170919883]                     Уточняющий параметр ≡ Тип ∙ 359[4] ←
  1638473[170920171]                   Равно ←
  1507488[170918166]                   Константа (Ограничение по классу, типу, плану счетов) ≡ Товарная строка чека ∙ 360[40304641] ←
  1507376[170919390]                 Выражение ←
  1507455[170919483]                   Результат ∙ 12124204[170918192] ←
  1507494[170919880]                     Уточняющий параметр ≡ Сервер SMTP ∙ 359[48431122] ←
  1638478[170917997]                   Больше ←
  1507452[170918838]                   Константа ⁼ 100 ←
  1507376[170919391]                 Выражение ←
  1507376[170919393]                   Выражение ←
  1507455[170919484]                     Результат ∙ 12124204[170918192] ←
  1507494[170919881]                       Уточняющий параметр ≡ Сервер FTP ∙ 359[48431123] ←
  1638473[170920169]                     Равно ←
  1507452[170918839]                     Константа ⁼ 'N' ←
      412[170918556]                   ИЛИ ←
  1507376[170919394]                   Выражение ←
  1507455[170919485]                     Результат ∙ 12124204[170918192] ←
  1507494[170919882]                       Уточняющий параметр ≡ Сервер FTP ∙ 359[48431123] ←
  1638473[170920170]                     Равно ←
  1507452[170918840]                     Константа ⁼ 'C' ←
 30867466[170918189]               Выполнить после получения записи ←
 11010105[170917968]                 Индикатор ←
      116[170919684]                   Выражение ←
      404[170929816]                     Результат ⁼ 'Поиск документов ККЛ ' ←
      404[170929233]                     Результат ≡ Селект документ ∙ 1507335[170918268] ←
      404[170929812]                     Результат ⁼ ' - ' ←
      404[170929811]                     Результат ≡ Селект строка ∙ 1507335[170918261] ←
 11010080[170921869]                 = ≡ ТТ ∙ 65545[165020587] ←
      404[170929234]                   Результат ≡ Селект документ.подразделение ∙ 1507335[170918270] ←
      411[170919565]                     Уточняющий параметр ≡ Родитель ∙ 283[2] ←
 11010080[170921870]                 = ≡ Приказы : ЦО ∙ 65545[165020574] ←
      404[170929235]                   Результат ≡ ТТ ∙ 65545[165020587] ←
      411[170919566]                     Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
 11010080[170921871]                 = ≡ Адрес УД(ТД) ∙ 65545[165347415] ←
      404[170929236]                   Результат ≡ Приказы : ЦО ∙ 65545[165020574] ←
      411[170919567]                     Уточняющий параметр ≡ Электронный адрес ∙ 283[14745623] ←
 11010080[170921872]                 = ≡ Адрес КД ∙ 65545[164824801] ←
      404[170929245]                   Результат ≡ Приказы : ЦО ∙ 65545[165020574] ←
      411[170919568]                     Уточняющий параметр ≡ Пластиковая карта ∙ 283[42401872] ←
      411[170919569]                       Уточняющий параметр ≡ Управляющий ∙ 283[28835886] ←
      411[170919570]                         Уточняющий параметр ≡ Электронный адрес ∙ 283[14745623] ←
 11010080[170921873]                 = ≡ Адрес ДД ∙ 65545[164824802] ←
      404[170929246]                   Результат ≡ Приказы : ЦО ∙ 65545[165020574] ←
      411[170919571]                     Уточняющий параметр ≡ Пластиковая карта ∙ 283[42401872] ←
      411[170919572]                       Уточняющий параметр ≡ Родитель ∙ 283[2] ←
      411[170919573]                         Уточняющий параметр ≡ Управляющий ∙ 283[28835886] ←
      411[170919574]                           Уточняющий параметр ≡ Электронный адрес ∙ 283[14745623] ←
 11010080[170921874]                 = ≡ Строка ККЛ ∙ 65545[165020580] ←
      404[170929247]                   Результат ≡ Селект строка ∙ 1507335[170918261] ←
 11010080[170921875]                 = ≡ Дата продажи ∙ 65545[165020585] ←
      404[170929248]                   Результат ≡ Селект строка дата продажи ∙ 1507335[170918296] ←
 11010080[170921876]                 = ≡ Продукт из чека ∙ 65545[165020582] ←
      404[170929249]                   Результат ≡ Селект строка продукт ∙ 1507335[170918297] ←
 11010080[170921877]                 = ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
      404[170929250]                   Результат ≡ Селект строка продукт ∙ 1507335[170918297] ←
 11010091[170917889]                 Получить из локальной таблицы • Поиск по товару ≡ Продажи ∙ 30867458[165019675] ←
 11010080[170921878]                 = ≡ Продано ∙ 65545[165020581] ←
  1638464[170917937]                   Ноль (0.0), если NULL ≡ Селект строка колво ∙ 1507335[170918298] ←
 11010080[170921879]                 = ≡ Цена (розн.) ∙ 65545[165020589] ←
  1638464[170917938]                   Ноль (0.0), если NULL ≡ Селект строка цена розн ∙ 1507335[170918299] ←
 11010080[170921880]                 = ≡ Цена (факт.) ∙ 65545[165020590] ←
  1638464[170917939]                   Ноль (0.0), если NULL ≡ Селект строка цена фактическая ∙ 1507335[170918300] ←
 11010080[170921881]                 = ≡ Сумма (факт.) ∙ 65545[165020592] ←
  1638464[170917940]                   Ноль (0.0), если NULL ≡ Строка ККЛ ∙ 65545[165020580] ←
      411[170919581]                     Уточняющий параметр ≡ Сумма фактическая (точность 6 знаков) ∙ 117[21433337] ←
 11010080[170921882]                 = ≡ Списано бонусов ∙ 65545[170918948] ←
  1638464[170917941]                   Ноль (0.0), если NULL ≡ Селект строка списано бонусов ∙ 1507335[170918301] ←
 11010088[170919092]                 ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170918331]                   Выражение ←
      404[170929251]                     Результат ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
      411[170919583]                       Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
 30867470[170918881]                 IF ←
  1638463[170919150]                   Условие ←
      404[170929252]                     Результат ≡ з.Строка.СерверSMTP ∙ 1507335[170721472] ←
  1638479[170918170]                     Не равно ←
      404[170929253]                     Результат ⁼ 1001 ←
 30867472[170918878]                   THEN •    ищем ценовую схему ←
 11010080[170921883]                     = ≡ Список приказов ценовых схем ∙ 65545[165020586] ←
  1638402[170918780]                       NULL ←
 11010080[170921884]                     = ≡ Список скидок ∙ 65545[165020594] ←
      404[170929254]                       Результат ⁼ '' ←
 11010080[170921885]                     = ≡ Ценовая схема ∙ 65545[165020952] ←
      404[170929255]                       Результат ≡ з.Строка.СерверSMTP ∙ 1507335[170721472] ←
  1507360[170918179]                     Отбор данных (по запросу) • Поиск приказов на цен.схемы ←
  1507703[172621825]                       Показать текст запроса ←
  1507447[170917929]                       Выражения ←
  1507449[170917959]                         Выражение • Цена закупочная ≡ Число, точность 6 знаков ∙ 107[42401800] ←
  1507608[170917905]                           Результат (Ноль (0.0), если NULL) ≡ Строки ∙ 12124204[170918208] ←
  1507494[170919786]                             Уточняющий параметр ≡ Цена закупочная ∙ 359[15007745] ←
  1507449[170917960]                         Выражение • Номер сопутствующего документа ≡ Наименование объекта (80) ∙ 107[262147] ←
 12124205[170917920]                           Запрос ←
 12124213[170918104]                             Параметры ←
  1507335[170918271]                               Параметр • Номер сопутствующего документа ≡ Документы ∙ 12124204[170918199] ←
  1507494[170919787]                                 Уточняющий параметр ≡ Номер сопутствующего документа ∙ 331[9] ←
 12124200[170918095]                             From         (Таблицы) ←
 12124204[170918199]                               Таблица • Документы ≡ Документ ∙ 108[5] ←
 12124215[170918132]                             Where      (Ограничения на отбор данных) ←
  1507376[170919331]                               Выражение ←
  1507455[170919416]                                 Результат ≡ Документы ∙ 12124204[170918199] ←
  1507494[170919788]                                   Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638473[170920146]                                 Равно ←
  1507455[170919417]                                 Результат ≡ Строки ∙ 12124204[170918208] ←
  1507494[170919789]                                   Уточняющий параметр ≡ Реальная приходная накладная ∙ 359[15925249] ←
  1507449[170917961]                         Выражение • Подразделение документа ≡ Партнер ∙ 107[5] ←
 12124205[170917921]                           Запрос ←
 12124213[170918105]                             Параметры ←
  1507335[170918272]                               Параметр • Подразделение ≡ Документы ∙ 12124204[170918203] ←
  1507494[170919790]                                 Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
 12124200[170918096]                             From         (Таблицы) ←
 12124204[170918203]                               Таблица • Документы ≡ Документ ∙ 108[5] ←
 12124215[170918133]                             Where      (Ограничения на отбор данных) ←
  1507376[170919332]                               Выражение ←
  1507455[170919418]                                 Результат ≡ Документы ∙ 12124204[170918203] ←
  1507494[170919833]                                   Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638473[170920147]                                 Равно ←
  1507455[170919419]                                 Результат ≡ Строки ∙ 12124204[170918208] ←
  1507494[170919834]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1507449[170917962]                         Выражение • Подразделение документа.Родитель ≡ Партнер ∙ 107[5] ←
 12124205[170917924]                           Запрос ←
 12124213[170918110]                             Параметры ←
  1507335[170918273]                               Параметр • Родитель ≡ Подразделения ∙ 12124204[170918205] ←
  1507494[170919835]                                 Уточняющий параметр ≡ Родитель ∙ 283[2] ←
 12124200[170918101]                             From         (Таблицы) ←
 12124204[170918205]                               Таблица • Подразделения ≡ Партнер ∙ 108[4] ←
 12124215[170918145]                             Where      (Ограничения на отбор данных) ←
  1507376[170919359]                               Выражение ←
  1507455[170919420]                                 Результат ≡ Подразделения ∙ 12124204[170918205] ←
  1507494[170919836]                                   Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1638473[170920148]                                 Равно ←
  1507455[170919449]                                 Результат ≡ Подразделение документа ∙ 1507449[170917961] ←
  1507449[170917964]                         Выражение • Код документа ≡ Наименование объекта (80) ∙ 107[262147] ←
 12124205[170917925]                           Запрос ←
 12124213[170918111]                             Параметры ←
  1507335[170918274]                               Параметр • Код ≡ Документы ∙ 12124204[170918206] ←
  1507494[170919837]                                 Уточняющий параметр ≡ Код ∙ 331[6] ←
 12124200[170918102]                             From         (Таблицы) ←
 12124204[170918206]                               Таблица • Документы ≡ Документ ∙ 108[5] ←
 12124215[170918146]                             Where      (Ограничения на отбор данных) ←
  1507376[170919362]                               Выражение ←
  1507455[170919450]                                 Результат ≡ Документы ∙ 12124204[170918206] ←
  1507494[170919838]                                   Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638473[170920149]                                 Равно ←
  1507455[170919451]                                 Результат ≡ Строки ∙ 12124204[170918208] ←
  1507494[170919839]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1507449[171115175]                         Выражение • Кол-во дочерних строк ≡ Целое ∙ 107[2] ←
 12124205[171114731]                           Запрос • Count ←
  1507447[171114745]                             Выражения ←
  1507449[171115191]                               Выражение • Count ≡ Целое ∙ 107[2] ←
  1507455[171118298]                                 Результат ≡ COUNT (*) ∙ 1507471[1507331] ←
 12124213[171115175]                             Параметры ←
  1507335[171116448]                               Параметр • Кол-во ≡ Count ∙ 1507449[171115191] ←
 12124200[171115015]                             From         (Таблицы) ←
 12124204[171115340]                               Таблица • Дочерние строки ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[171115236]                             Where      (Ограничения на отбор данных) ←
  1507376[171117919]                               Выражение ←
  1507455[171118006]                                 Результат ≡ Дочерние строки ∙ 12124204[171115340] ←
  1507494[171120546]                                   Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[171117587]                                 Равно ←
  1507455[171118297]                                 Результат ≡ Строки ∙ 12124204[170918208] ←
  1507494[171120547]                                   Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507449[171115206]                         Выражение • Кол-во из строки ≡ Целое ∙ 107[2] ←
  1507455[171118300]                           Результат ≡ Строки ∙ 12124204[170918208] ←
  1507494[171120548]                             Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  1507449[171115205]                         Выражение • (Кол-во дочерних строк, кол-во из строки) ≡ Целое ∙ 107[2] ←
  1507631[171114514]                           IF ←
  1507591[171114520]                             Условие ←
  1507455[171118335]                               Результат ≡ Кол-во дочерних строк ∙ 1507449[171115175] ←
  1638478[171114748]                               Больше ←
  1507452[171116676]                               Константа ⁼ 0 ←
  1507633[171114514]                             THEN ←
  1507455[171118506]                               Результат ≡ Кол-во дочерних строк ∙ 1507449[171115175] ←
  1507593[171114517]                             ELSE ←
  1507455[171118383]                               Результат ≡ Кол-во из строки ∙ 1507449[171115206] ←
 12124213[170918112]                       Параметры ←
  1507335[170918284]                         Параметр • Приказ ≡ Документы ∙ 12124204[170918207] ←
  1507494[170919840]                           Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1507335[171116622]                         Параметр • Дата приказа ≡ Документы ∙ 12124204[170918207] ←
  1507494[171121457]                           Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1507335[170918285]                         Параметр • Строчка ≡ Строки ∙ 12124204[170918208] ←
  1507494[170919841]                           Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507335[170918286]                         Параметр • Размер скидки/Новая цена ≡ Цена закупочная ∙ 1507449[170917959] ←
  1507335[170918287]                         Параметр • Количество ≡ Кол-во из строки ∙ 1507449[171115206] ←
  1507335[171116557]                         Параметр • Количество (с фикс. ценой) ≡ (Кол-во дочерних строк, кол-во из строки) ∙ 1507449[171115205] ←
  1507335[170918288]                         Параметр • Номер сопутствующего документа ≡ Номер сопутствующего документа ∙ 1507449[170917960] ←
  1507335[170918289]                         Параметр • Реальная приходная накладная ≡ Строки ∙ 12124204[170918208] ←
  1507494[170919843]                           Уточняющий параметр ≡ Реальная приходная накладная ∙ 359[15925249] ←
  1507335[170918290]                         Параметр • Код документа ≡ Код документа ∙ 1507449[170917964] ←
  1507335[170918291]                         Параметр • Подразделение документа.Родитель ≡ Подразделение документа.Родитель ∙ 1507449[170917962] ←
  1507673[170917909]                       Ключи оптимизации ←
  1507675[170917914]                         Использовать индекс ≡ Документы ∙ 12124204[170918207] ←
  1507676[170917915]                           Уточняющий параметр ≡ Подразделение --> Класс --> Тип --> Дата --> ID ∙ 1507445[1507400] ←
  1507675[170917915]                         Использовать индекс ≡ Строки ∙ 12124204[170918208] ←
  1507676[170917916]                           Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
 12124200[170918103]                       From         (Таблицы) ←
 12124204[170918207]                         Таблица • Документы ≡ Документ ∙ 108[5] ←
 12124204[170918208]                         Таблица • Строки ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[170918147]                       Where      (Ограничения на отбор данных) ←
  1507376[170919363]                         Выражение ←
  1507455[170919456]                           Результат ≡ Документы ∙ 12124204[170918207] ←
  1507494[170919844]                             Уточняющий параметр ≡ Класс ∙ 331[3] ←
  1638473[170920150]                           Равно ←
  1507488[170918162]                           Константа (Ограничение по классу, типу, плану счетов) ≡ ПРИКАЗ ∙ 541[14417922] ←
  1507376[170919365]                         Выражение ←
  1507455[170919457]                           Результат ≡ Документы ∙ 12124204[170918207] ←
  1507494[170919845]                             Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[170920151]                           Равно ←
  1507488[170918163]                           Константа (Ограничение по классу, типу, плану счетов) ≡ Приказ на назначение ценовой схемы на товары ∙ 332[3342368] ←
  1507376[170919366]                         Выражение ←
  1507455[170919458]                           Результат ≡ Документы ∙ 12124204[170918207] ←
  1507494[170919846]                             Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1638473[170920152]                           Равно ←
  1507452[170918818]                           Константа ≡ ТТ ∙ 65545[165020587] ←
      411[170919586]                             Уточняющий параметр ≡ Подразделение для назначения цен ∙ 283[42401850] ←
  1507376[170919367]                         Выражение ←
  1507455[170919459]                           Результат ≡ Документы ∙ 12124204[170918207] ←
  1507494[170919847]                             Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638476[170917931]                           Меньше ←
  1507452[170918819]                           Константа ≡ Дата продажи ∙ 65545[165020585] ←
  1507376[170919368]                         Выражение ←
  1507455[170919460]                           Результат ≡ Документы ∙ 12124204[170918207] ←
  1507494[170919848]                             Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638477[170918014]                           Больше или равно ←
  1507452[170918821]                           Константа ≡ Дата1 ∙ 65545[165020583] ←
  1507376[170919369]                         Выражение ←
  1507455[170919461]                           Результат ≡ Документы ∙ 12124204[170918207] ←
  1507494[170919849]                             Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[170918039]                           Меньше или равно ←
  1507452[170918823]                           Константа ≡ Дата продажи ∙ 65545[165020585] ←
  1507376[172491246]                         Выражение ←
  1507455[172491392]                           Результат ≡ Строки ∙ 12124204[170918208] ←
  1507494[172491632]                             Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  1638475[172490793]                           Меньше или равно ←
  1507452[172491006]                           Константа ⁼ 1000000 ←
  1507376[170919370]                         Выражение ←
  1507455[170919462]                           Результат ≡ Документы ∙ 12124204[170918207] ←
  1507494[170919850]                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638477[170918015]                           Больше или равно ←
  1507452[170918824]                           Константа ≡ Дата, начало дня ∙ 249[30867471] ←
 32505862[170919234]                             Значения формальных параметров при вызове ←
 32505860[170920560]                               Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867497] ←
   327700[170921495]                                 Выражение ≡ Дата продажи ∙ 65545[165020585] ←
  1507376[170919371]                         Выражение ←
  1507455[170919463]                           Результат ≡ Документы ∙ 12124204[170918207] ←
  1507494[170919851]                             Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638473[170920153]                           Равно ←
  1507455[170919464]                           Результат ≡ Строки ∙ 12124204[170918208] ←
  1507494[170919852]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1507376[171117921]                         Выражение ←
  1507455[171118494]                           Результат ≡ Строки ∙ 12124204[170918208] ←
  1507494[171120841]                             Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[171117589]                           Равно ←
  1638402[171115355]                           NULL ←
  1507376[170919372]                         Выражение ←
  1507455[170919465]                           Результат ≡ Строки ∙ 12124204[170918208] ←
  1507494[170919853]                             Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[170920154]                           Равно ←
  1507452[170918825]                           Константа ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
 30867465[170917906]                       Выполнить при старте ←
 11010080[170921886]                         = ≡ Выставлено ∙ 65545[165020588] ←
      404[170929256]                           Результат ⁼ 0 ←
 11010080[171120231]                         = ≡ Выставлено (купонов, шт) ∙ 65545[171117663] ←
      404[171133436]                           Результат ⁼ 0 ←
 11010080[170921887]                         = ≡ Точный приказ ∙ 65545[165020953] ←
  1638402[170918804]                           NULL ←
 11010080[170921888]                         = ≡ Скидка ∙ 65545[165020593] ←
      404[170929257]                           Результат ⁼ 0 ←
 30867466[170918196]                       Выполнить после получения записи ←
 11010080[170921889]                         = ≡ Список приказов ценовых схем ∙ 65545[165020586] ←
      404[170929258]                           Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[170917942]                             Список элементов ←
   327700[170921496]                               Выражение ≡ Список приказов ценовых схем ∙ 65545[165020586] ←
   327700[170921497]                               Выражение ≡ Приказ ∙ 1507335[170918284] ←
 11010080[170921890]                         = ≡ Приказ ∙ 65545[165020603] ←
      404[170929259]                           Результат ≡ Приказ ∙ 1507335[170918284] ←
 11010080[170921891]                         = ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
      404[170929260]                           Результат ≡ Строчка ∙ 1507335[170918285] ←
 30867470[171116093]                         IF ←
  1638463[171116526]                           Условие ←
  1638460[171115147]                             НЕ ←
      404[171132403]                             Результат ≡ КЯ или Д ∙ 65545[165020579] ←
 30867472[171116088]                           THEN • КЯ - фикс цена ←
 11010080[171119858]                             = ≡ Скидка ∙ 65545[165020593] ←
  1638464[171114512]                               Ноль (0.0), если NULL ≡ Цена (розн.) ∙ 65545[165020589] ←
      406[171114689]                               Вычесть ←
  1638464[171114838]                               Ноль (0.0), если NULL ≡ Размер скидки/Новая цена ∙ 1507335[170918286] ←
 30867473[171114939]                           ELSE ←
 11010080[170921892]                             = ≡ Скидка ∙ 65545[165020593] ←
  1638464[170917942]                               Ноль (0.0), если NULL ≡ Размер скидки/Новая цена ∙ 1507335[170918286] ←
 11010080[170921893]                         = ≡ Строка приказа на ценовую схему ∙ 65545[165020954] ←
      404[170929261]                           Результат ≡ Строчка ∙ 1507335[170918285] ←
 30867470[170918882]                         IF ←
  1638463[170919151]                           Условие ←
      404[170929262]                             Результат ≡ Номер сопутствующего документа ∙ 1507335[170918288] ←
  1638473[170920155]                             Равно ←
      404[170929263]                             Результат ≡ Ценовая схема ∙ 65545[165020952] ←
 30867472[170918879]                           THEN •   точно нашли верный приказ, возьмём значение скидки ←
 30867470[171116094]                             IF ←
  1638463[171116527]                               Условие ←
  1638460[171115148]                                 НЕ ←
      404[171132404]                                 Результат ≡ КЯ или Д ∙ 65545[165020579] ←
 30867472[171116089]                               THEN • КЯ - фикс цена ←
 11010080[171119880]                                 = ≡ Скидка ∙ 65545[165020593] ←
      404[171132422]                                   Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      406[171114692]                                   Вычесть ←
      404[171132420]                                   Результат ≡ Размер скидки/Новая цена ∙ 1507335[170918286] ←
 30867473[171114940]                               ELSE ←
 11010080[171119881]                                 = ≡ Скидка ∙ 65545[165020593] ←
      404[171132421]                                   Результат ≡ Размер скидки/Новая цена ∙ 1507335[170918286] ←
 11010080[170921895]                             = ≡ Точный приказ ∙ 65545[165020953] ←
      404[170929265]                               Результат ≡ Реальная приходная накладная ∙ 1507335[170918289] ←
 11010080[170921896]                             = ≡ Строка приказа на ценовую схему ∙ 65545[165020954] ←
      404[170929266]                               Результат ≡ Строчка ∙ 1507335[170918285] ←
 11010080[170921897]                             = ≡ Приказ ∙ 65545[165020603] ←
      404[170929267]                               Результат ≡ Точный приказ ∙ 65545[165020953] ←
 48431132[171114747]                         += ≡ Выставлено ∙ 65545[165020588] ←
      404[171132187]                           Результат ≡ Количество ∙ 1507335[170918287] ←
 30867470[171116250]                         IF ←
  1638463[171116446]                           Условие ←
      116[171116336]                             Выражение ←
      404[171131811]                               Результат ≡ Дата приказа ∙ 1507335[171116622] ←
  1638477[171114694]                               Больше или равно ←
      404[171131812]                               Результат ≡ Дата начальная ∙ 381[131078] ←
      413[171115120]                             И ←
      116[171116337]                             Выражение ←
      404[171131813]                               Результат ≡ Дата приказа ∙ 1507335[171116622] ←
  1638475[171114678]                               Меньше или равно ←
      404[171131814]                               Результат ≡ Дата конечная ∙ 381[131079] ←
 30867472[171116244]                           THEN ←
 48431132[171114753]                             += ≡ Выставлено (купонов, шт) ∙ 65545[171117663] ←
      404[171133437]                               Результат ≡ Количество (с фикс. ценой) ∙ 1507335[171116557] ←
 11010080[170921898]                         = ≡ Список скидок ∙ 65545[165020594] ←
      404[170929273]                           Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[170929274]                           Результат ⁼ , ←
      404[170929275]                           Результат ≡ Скидка ∙ 65545[165020593] ←
 11010080[170921899]                         = ≡ Приказы : Скидка ∙ 65545[165481409] ←
  1638464[170917943]                           Ноль (0.0), если NULL ≡ Скидка ∙ 65545[165020593] ←
 11010080[170921900]                         = ≡ Приказы : ТТ ∙ 65545[165481410] ←
      404[170929277]                           Результат ≡ Подразделение документа.Родитель ∙ 1507335[170918291] ←
 11010080[170921901]                         = ≡ Приказы : Код ∙ 65545[165481412] ←
      404[170929278]                           Результат ≡ Код документа ∙ 1507335[170918290] ←
 11010092[170917928]                         Добавить в локальную таблицу ≡ Приказы ∙ 30867458[165019676] ←
 39780361[170918035]                         ЗАВЕРШИТЬ БЛОК ≡ Точный приказ ∙ 65545[165020953] ←
 11010088[171116738]                     ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[171115446]                       Выражение ←
      404[171131817]                         Результат ⁼ 1. Выпущено купонов =  ←
      404[171131815]                         Результат ≡ Выставлено (купонов, шт) ∙ 65545[171117663] ←
  1507360[170918180]                     Отбор данных (по запросу) • Поиск суммарного кол-ва по приказам на цен.схемы ←
  1507703[171114538]                       Показать текст запроса ←
 12124213[170918113]                       Параметры ←
  1507335[170918292]                         Параметр ≡ SUM(Количество из строки) ∙ 1507449[171115228] ←
  1507335[171116559]                         Параметр ≡ SUM(Количество весового товара) ∙ 1507449[170917965] ←
  1507447[170917930]                       Выражения ←
  1507449[171115207]                         Выражение • Кол-во дочерних строк ≡ Целое ∙ 107[2] ←
 12124205[171114732]                           Запрос • Count ←
  1507447[171114754]                             Выражения ←
  1507449[171115208]                               Выражение • Count ≡ Целое ∙ 107[2] ←
  1507455[171118301]                                 Результат ≡ COUNT (*) ∙ 1507471[1507331] ←
 12124213[171115192]                             Параметры ←
  1507335[171116449]                               Параметр • Кол-во ≡ Count ∙ 1507449[171115208] ←
 12124200[171115032]                             From         (Таблицы) ←
 12124204[171115341]                               Таблица • Дочерние строки ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[171115254]                             Where      (Ограничения на отбор данных) ←
  1507376[171117920]                               Выражение ←
  1507455[171118303]                                 Результат ≡ Дочерние строки ∙ 12124204[171115341] ←
  1507494[171120549]                                   Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[171117588]                                 Равно ←
  1507455[171118333]                                 Результат ≡ Строки доков ∙ 12124204[170918210] ←
  1507494[171120551]                                   Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507449[171115209]                         Выражение • Кол-во из строки ≡ Целое ∙ 107[2] ←
  1507455[171118334]                           Результат ≡ Строки доков ∙ 12124204[170918210] ←
  1507494[171120575]                             Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  1507449[171115210]                         Выражение • (Кол-во дочерних строк, кол-во из строки) ≡ Целое ∙ 107[2] ←
  1507631[171114513]                           IF ←
  1507591[171114519]                             Условие ←
  1507455[171118336]                               Результат ≡ Кол-во дочерних строк ∙ 1507449[171115207] ←
  1638478[171114747]                               Больше ←
  1507452[171116675]                               Константа ⁼ 0 ←
  1507633[171114513]                             THEN ←
  1507455[171118337]                               Результат ≡ Кол-во дочерних строк ∙ 1507449[171115207] ←
  1507593[171114516]                             ELSE ←
  1507455[171118338]                               Результат ≡ Кол-во из строки ∙ 1507449[171115209] ←
  1507449[170917965]                         Выражение • SUM(Количество весового товара) ≡ Число ∙ 107[4] ←
  1507455[170919466]                           Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[170917923]                             Значения параметров ←
  1507477[170917932]                               Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[170917932]                                 Выражение ≡ (Кол-во дочерних строк, кол-во из строки) ∙ 1507449[171115210] ←
  1507449[171115228]                         Выражение • SUM(Количество из строки) ≡ Число ∙ 107[4] ←
  1507455[171118771]                           Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[171114722]                             Значения параметров ←
  1507477[171114754]                               Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[171114754]                                 Выражение ≡ Кол-во из строки ∙ 1507449[171115209] ←
  1507673[170917910]                       Ключи оптимизации ←
  1507675[170917916]                         Использовать индекс ≡ Доки ∙ 12124204[170918209] ←
  1507676[170917917]                           Уточняющий параметр ≡ Подразделение --> Класс --> Тип --> Дата --> ID ∙ 1507445[1507400] ←
  1507675[170917917]                         Использовать индекс ≡ Строки доков ∙ 12124204[170918210] ←
  1507676[170917918]                           Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
 12124200[170918104]                       From         (Таблицы) ←
 12124204[170918209]                         Таблица • Доки ≡ Документ ∙ 108[5] ←
 12124204[170918210]                         Таблица • Строки доков ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[170918148]                       Where      (Ограничения на отбор данных) ←
  1507376[170919373]                         Выражение ←
  1507455[170919467]                           Результат ≡ Доки ∙ 12124204[170918209] ←
  1507494[170919855]                             Уточняющий параметр ≡ Класс ∙ 331[3] ←
  1638473[170920156]                           Равно ←
  1507488[170918164]                           Константа (Ограничение по классу, типу, плану счетов) ≡ ПРИКАЗ ∙ 541[14417922] ←
  1507376[170919374]                         Выражение ←
  1507455[170919468]                           Результат ≡ Доки ∙ 12124204[170918209] ←
  1507494[170919856]                             Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[170920157]                           Равно ←
  1507488[170918165]                           Константа (Ограничение по классу, типу, плану счетов) ≡ Приказ на назначение ценовой схемы на товары ∙ 332[3342368] ←
  1507376[170919375]                         Выражение ←
  1507455[170919469]                           Результат ≡ Доки ∙ 12124204[170918209] ←
  1507494[170919857]                             Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1638473[170920158]                           Равно ←
  1507452[170918826]                           Константа ≡ ТТ ∙ 65545[165020587] ←
      411[170919587]                             Уточняющий параметр ≡ Подразделение для назначения цен ∙ 283[42401850] ←
  1507376[170919376]                         Выражение ←
  1507455[170919470]                           Результат ≡ Доки ∙ 12124204[170918209] ←
  1507494[170919858]                             Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638477[170918016]                           Больше или равно ←
  1507452[170918827]                           Константа ≡ Дата1 ∙ 65545[165020583] ←
  1507376[170919377]                         Выражение ←
  1507455[170919471]                           Результат ≡ Доки ∙ 12124204[170918209] ←
  1507494[170919859]                             Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638475[170918040]                           Меньше или равно ←
  1507452[170918828]                           Константа ≡ Дата2 ∙ 65545[165020584] ←
  1507376[170919378]                         Выражение ←
  1507455[170919472]                           Результат ≡ Доки ∙ 12124204[170918209] ←
  1507494[170919860]                             Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[170918041]                           Меньше или равно ←
  1507452[170918829]                           Константа ≡ Дата2 ∙ 65545[165020584] ←
  1507376[170919379]                         Выражение ←
  1507455[170919473]                           Результат ≡ Доки ∙ 12124204[170918209] ←
  1507494[170919861]                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638478[170917996]                           Больше ←
  1507452[170918830]                           Константа ≡ Дата начальная ∙ 381[131078] ←
  1507376[170919380]                         Выражение ←
  1507455[170919474]                           Результат ≡ Строки доков ∙ 12124204[170918210] ←
  1507494[170919862]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638473[170920159]                           Равно ←
  1507455[170919475]                           Результат ≡ Доки ∙ 12124204[170918209] ←
  1507494[170919863]                             Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1507376[171117922]                         Выражение ←
  1507455[171118299]                           Результат ≡ Строки доков ∙ 12124204[170918210] ←
  1507494[171120584]                             Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[171117591]                           Равно ←
  1638402[171115370]                           NULL ←
  1507376[170919381]                         Выражение ←
  1507455[170919476]                           Результат ≡ Строки доков ∙ 12124204[170918210] ←
  1507494[170919864]                             Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[170920160]                           Равно ←
  1507452[170918831]                           Константа ≡ Продукт из чека ∙ 65545[165020582] ←
 30867466[170918197]                       Выполнить после получения записи ←
 11010080[170921902]                         = ≡ Выставлено ∙ 65545[165020588] ←
      404[170929279]                           Результат ∙ 1507335[170918292] ←
 11010080[171120232]                         = ≡ Выставлено (купонов, шт) ∙ 65545[171117663] ←
      404[171133438]                           Результат ∙ 1507335[171116559] ←
 11010088[171116739]                     ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[171115447]                       Выражение ←
      404[171131818]                         Результат ⁼ 2. Выпущено купонов =  ←
      404[171131819]                         Результат ≡ Выставлено (купонов, шт) ∙ 65545[171117663] ←
  1507728[171114918]                     Начало многострочного комментария ←
  1507360[171115213]                     Отбор данных (по запросу) • Поиск суммарного кол-ва по приказам на цен.схемы, созданных за период отчёта ←
  1507703[171114537]                       Показать текст запроса ←
 12124213[171115223]                       Параметры ←
  1507335[171116624]                         Параметр ≡ SUM(Количество весового товара) ∙ 1507449[171115257] ←
  1507447[171114767]                       Выражения ←
  1507449[171115253]                         Выражение • Кол-во дочерних строк ≡ Целое ∙ 107[2] ←
 12124205[171114744]                           Запрос • Count ←
  1507447[171114768]                             Выражения ←
  1507449[171115254]                               Выражение • Count ≡ Целое ∙ 107[2] ←
  1507455[171118867]                                 Результат ≡ COUNT (*) ∙ 1507471[1507331] ←
 12124213[171115224]                             Параметры ←
  1507335[171116625]                               Параметр • Кол-во ≡ Count ∙ 1507449[171115254] ←
 12124200[171115065]                             From         (Таблицы) ←
 12124204[171115500]                               Таблица • Дочерние строки ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[171115289]                             Where      (Ограничения на отбор данных) ←
  1507376[171118401]                               Выражение ←
  1507455[171118868]                                 Результат ≡ Дочерние строки ∙ 12124204[171115500] ←
  1507494[171121458]                                   Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[171117405]                                 Равно ←
  1507455[171118869]                                 Результат ≡ Строки доков ∙ 12124204[171115502] ←
  1507494[171121459]                                   Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507449[171115255]                         Выражение • Кол-во из строки ≡ Целое ∙ 107[2] ←
  1507455[171118870]                           Результат ≡ Строки доков ∙ 12124204[171115502] ←
  1507494[171121460]                             Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  1507449[171115256]                         Выражение • (Кол-во дочерних строк, кол-во из строки) ≡ Целое ∙ 107[2] ←
  1507631[171114525]                           IF ←
  1507591[171114531]                             Условие ←
  1507455[171118871]                               Результат ≡ Кол-во дочерних строк ∙ 1507449[171115253] ←
  1638478[171114765]                               Больше ←
  1507452[171116942]                               Константа ⁼ 0 ←
  1507633[171114525]                             THEN ←
  1507455[171118872]                               Результат ≡ Кол-во дочерних строк ∙ 1507449[171115253] ←
  1507593[171114528]                             ELSE ←
  1507455[171118873]                               Результат ≡ Кол-во из строки ∙ 1507449[171115255] ←
  1507449[171115257]                         Выражение • SUM(Количество весового товара) ≡ Число ∙ 107[4] ←
  1507455[171118874]                           Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[171114727]                             Значения параметров ←
  1507477[171114767]                               Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[171114767]                                 Выражение ≡ (Кол-во дочерних строк, кол-во из строки) ∙ 1507449[171115256] ←
  1507673[171114626]                       Ключи оптимизации ←
  1507675[171114730]                         Использовать индекс ≡ Доки ∙ 12124204[171115501] ←
  1507676[171114734]                           Уточняющий параметр ≡ Подразделение --> Класс --> Тип --> Дата --> ID ∙ 1507445[1507400] ←
  1507675[171114731]                         Использовать индекс ≡ Строки доков ∙ 12124204[171115502] ←
  1507676[171114735]                           Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
 12124200[171115066]                       From         (Таблицы) ←
 12124204[171115501]                         Таблица • Доки ≡ Документ ∙ 108[5] ←
 12124204[171115502]                         Таблица • Строки доков ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[171115290]                       Where      (Ограничения на отбор данных) ←
  1507376[171118402]                         Выражение ←
  1507455[171118876]                           Результат ≡ Доки ∙ 12124204[171115501] ←
  1507494[171121461]                             Уточняющий параметр ≡ Класс ∙ 331[3] ←
  1638473[171118047]                           Равно ←
  1507488[171115095]                           Константа (Ограничение по классу, типу, плану счетов) ≡ ПРИКАЗ ∙ 541[14417922] ←
  1507376[171118403]                         Выражение ←
  1507455[171118877]                           Результат ≡ Доки ∙ 12124204[171115501] ←
  1507494[171121462]                             Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[171118048]                           Равно ←
  1507488[171115096]                           Константа (Ограничение по классу, типу, плану счетов) ≡ Приказ на назначение ценовой схемы на товары ∙ 332[3342368] ←
  1507376[171118404]                         Выражение ←
  1507455[171118878]                           Результат ≡ Доки ∙ 12124204[171115501] ←
  1507494[171121463]                             Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1638473[171118049]                           Равно ←
  1507452[171116943]                           Константа ≡ ТТ ∙ 65545[165020587] ←
      411[171117097]                             Уточняющий параметр ≡ Подразделение для назначения цен ∙ 283[42401850] ←
  1507376[171118405]                         Выражение ←
  1507455[171118879]                           Результат ≡ Доки ∙ 12124204[171115501] ←
  1507494[171121464]                             Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638477[171114709]                           Больше или равно ←
  1507452[171116944]                           Константа ≡ Дата начальная ∙ 381[131078] ←
  1507376[171118406]                         Выражение ←
  1507455[171118880]                           Результат ≡ Доки ∙ 12124204[171115501] ←
  1507494[171121465]                             Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638475[171114679]                           Меньше или равно ←
  1507452[171116945]                           Константа ≡ Дата конечная ∙ 381[131079] ←
  1507376[171118407]                         Выражение ←
  1507455[171118881]                           Результат ≡ Доки ∙ 12124204[171115501] ←
  1507494[171121466]                             Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[171114680]                           Меньше или равно ←
  1507452[171116946]                           Константа ≡ Дата конечная ∙ 381[131079] ←
  1507376[171118408]                         Выражение ←
  1507455[171118882]                           Результат ≡ Доки ∙ 12124204[171115501] ←
  1507494[171121467]                             Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638478[171114766]                           Больше ←
  1507452[171116947]                           Константа ≡ Дата начальная ∙ 381[131078] ←
  1507376[171118409]                         Выражение ←
  1507455[171118883]                           Результат ≡ Строки доков ∙ 12124204[171115502] ←
  1507494[171121468]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638473[171118050]                           Равно ←
  1507455[171118884]                           Результат ≡ Доки ∙ 12124204[171115501] ←
  1507494[171121469]                             Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1507376[171118410]                         Выражение ←
  1507455[171118885]                           Результат ≡ Строки доков ∙ 12124204[171115502] ←
  1507494[171121470]                             Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[171118051]                           Равно ←
  1638402[171115313]                           NULL ←
  1507376[171118411]                         Выражение ←
  1507455[171118886]                           Результат ≡ Строки доков ∙ 12124204[171115502] ←
  1507494[171121471]                             Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[171118052]                           Равно ←
  1507452[171116948]                           Константа ≡ Продукт из чека ∙ 65545[165020582] ←
 30867466[171115258]                       Выполнить после получения записи ←
 11010080[171120000]                         = ≡ Выставлено (купонов, шт) ∙ 65545[171117663] ←
      404[171131816]                           Результат ∙ 1507335[171116624] ←
 11010088[171116742]                     ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[171115448]                       Выражение ←
      404[171131820]                         Результат ⁼ 3. Выпущено купонов =  ←
      404[171131821]                         Результат ≡ Выставлено (купонов, шт) ∙ 65545[171117663] ←
  1507729[171114918]                     Конец многострочного комментария ←
  1507728[170918084]                     Начало многострочного комментария ←
  1507729[170918084]                     Конец многострочного комментария ←
 11010088[170919094]                     ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170918333]                       Выражение ←
      404[170929280]                         Результат ⁼ ККЛ; ←
      404[170929281]                         Результат ≡ Строка ККЛ ∙ 65545[165020580] ←
      404[170929282]                         Результат ⁼ ; ←
      404[170929283]                         Результат ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
      411[170919588]                           Уточняющий параметр ≡ Код ∙ 305[5] ←
      404[170929284]                         Результат ⁼ ; ←
      404[170929285]                         Результат ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
      411[170919589]                           Уточняющий параметр ≡ Наименование ∙ 305[6] ←
      404[170929286]                         Результат ⁼ ; ←
      404[170929287]                         Результат ≡ Дата продажи ∙ 65545[165020585] ←
      404[170929288]                         Результат ⁼ ; ←
      404[170929289]                         Результат ≡ Скидка ∙ 65545[165020593] ←
      404[170929290]                         Результат ⁼ ; ←
      404[170929291]                         Результат ≡ Ценовая схема ∙ 65545[165020952] ←
      404[170929292]                         Результат ⁼ ; ←
      404[170929293]                         Результат ≡ Точный приказ ∙ 65545[165020953] ←
      404[170929294]                         Результат ⁼ ; ←
      404[170929295]                         Результат ≡ Множество.Количество элементов ∙ 387[1507487] ←
   327700[170921498]                           Выражение ≡ Список приказов ценовых схем ∙ 65545[165020586] ←
      404[170929296]                         Результат ⁼ ; ←
      404[170929297]                         Результат ≡ Строка приказа на ценовую схему ∙ 65545[165020954] ←
 11010093[170918018]                 Комментарий •  проверим сумму фактическую, из-за расчёта Премией, она может быть неадекватной, пересчитаем цифры ←
 30867470[170918883]                 IF ←
  1638463[170919152]                   Условие ←
  1638460[170918035]                     НЕ ←
      404[170929298]                     Результат ≡ КЯ или Д ∙ 65545[165020579] ←
 30867472[170918880]                   THEN • для КЯ проверим применимость Премии ←
 30867470[171116095]                     IF ←
  1638463[171116528]                       Условие ←
      404[171132423]                         Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
  1638479[171114867]                         Не равно ←
      116[171116159]                         Выражение ←
      404[171132424]                           Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      406[171114694]                           Вычесть ←
      404[171132425]                           Результат ≡ Скидка ∙ 65545[165020593] ←
 30867472[171116090]                       THEN ←
 11010080[171119882]                         = ≡ Цена (факт.) ∙ 65545[165020590] ←
      404[171132426]                           Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      406[171114698]                           Вычесть ←
      404[171132427]                           Результат ≡ Скидка ∙ 65545[165020593] ←
 11010080[171119883]                         = ≡ Сумма (факт.) ∙ 65545[165020592] ←
      404[171132431]                           Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      403[171114772]                           Умножить ←
      404[171132433]                           Результат ≡ Продано ∙ 65545[165020581] ←
  1507728[171114907]                     Начало многострочного комментария • 20.06.2022 - На КЯ уценка с фиксированной ценой ←
 30867470[170918884]                     IF ←
  1638463[170919153]                       Условие ←
      116[170919654]                         Выражение ←
      404[170929299]                           Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      402[170917919]                           Делить ←
      116[170919655]                           Выражение ←
      404[170929300]                             Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      406[170917947]                             Вычесть ←
      116[170919656]                             Выражение ←
      404[170929301]                               Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      403[170917995]                               Умножить ←
      404[170929302]                               Результат ≡ Скидка ∙ 65545[165020593] ←
      402[170917920]                               Делить ←
      404[170929303]                               Результат ⁼ 100 ←
  1638476[170917932]                         Меньше ←
      404[170929304]                         Результат ⁼ 0.8 ←
 30867472[170918881]                       THEN ←
  1507728[171114903]                         Начало многострочного комментария ←
 11010088[171116653]                         ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[171115390]                           Выражение ←
      404[171132405]                             Результат ⁼ Цена (факт) =  ←
      404[171132408]                             Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      404[171132406]                             Результат ⁼ ; Цена (факт) =  ←
      404[171132407]                             Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      404[171132409]                             Результат ⁼ ' - (' ←
      404[171132410]                             Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      404[171132411]                             Результат ⁼ ' * ' ←
      404[171132412]                             Результат ≡ Скидка ∙ 65545[165020593] ←
      404[171132413]                             Результат ⁼ ' / ' ←
      404[171132414]                             Результат ⁼ 100 ←
      404[171132415]                             Результат ⁼ ') = ' ←
      116[171116172]                             Выражение ←
      404[171132416]                               Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      406[171114691]                               Вычесть ←
      116[171116175]                               Выражение ←
      404[171132417]                                 Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      403[171114770]                                 Умножить ←
      404[171132418]                                 Результат ≡ Скидка ∙ 65545[165020593] ←
      402[171114601]                                 Делить ←
      404[171132419]                                 Результат ⁼ 100 ←
  1507729[171114903]                         Конец многострочного комментария ←
 11010080[170921903]                         = ≡ Цена (факт.) ∙ 65545[165020590] ←
      116[170919657]                           Выражение ←
      404[170929305]                             Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      406[170917948]                             Вычесть ←
      116[170919658]                             Выражение ←
      404[170929306]                               Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      403[170917996]                               Умножить ←
      404[170929307]                               Результат ≡ Скидка ∙ 65545[165020593] ←
      402[170917952]                               Делить ←
      404[170929308]                               Результат ⁼ 100 ←
 11010080[170921904]                         = ≡ Сумма (факт.) ∙ 65545[165020592] ←
      404[170929309]                           Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      403[170917997]                           Умножить ←
      404[170929310]                           Результат ≡ Продано ∙ 65545[165020581] ←
  1507728[170918085]                         Начало многострочного комментария ←
 11010088[170919095]                         ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170918334]                           Выражение ←
      404[170929311]                             Результат ⁼                             Похоже, рассчитались Премией. Цена фактическая не соответствует цене со скидкой: ←
      404[170929312]                             Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
 11010088[170919096]                         ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170918335]                           Выражение ←
      404[170929317]                             Результат ⁼                Коррекция: ←
      404[170929318]                             Результат ≡ Селект строка ∙ 1507335[170918261] ←
      404[170929319]                             Результат ⁼   | ←
      404[170929320]                             Результат ≡ Селект строка дата продажи ∙ 1507335[170918296] ←
      404[170929321]                             Результат ⁼   | ←
      404[170929322]                             Результат ≡ Селект строка продукт ∙ 1507335[170918297] ←
      411[170919591]                               Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
      404[170929323]                             Результат ⁼   | ←
      404[170929324]                             Результат ≡ з.Строка.СерверSMTP ∙ 1507335[170721472] ←
      404[170929325]                             Результат ⁼   | ←
      404[170929326]                             Результат ≡ Продано ∙ 65545[165020581] ←
      404[170929327]                             Результат ⁼   | ←
      404[170929328]                             Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      404[170929329]                             Результат ⁼   | ←
      404[170929330]                             Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      404[170929331]                             Результат ⁼   | ←
      404[170929332]                             Результат ≡ Сумма (факт.) ∙ 65545[165020592] ←
      404[170929333]                             Результат ⁼   | ←
      404[170929334]                             Результат ≡ Скидка ∙ 65545[165020593] ←
      404[170929335]                             Результат ⁼ % ←
  1507729[170918085]                         Конец многострочного комментария ←
  1507729[171114907]                     Конец многострочного комментария ←
 30867470[170918885]                 IF ←
  1638463[170919154]                   Условие ←
  1638460[170918036]                     НЕ ←
      404[170929336]                     Результат ≡ ЛТ Продано ∙ 65545[165020595] ←
 30867472[170918882]                   THEN • если продукта в таблице нет, то добавляем данные, иначе, аккумулируем ←
 11010080[170921905]                     = ≡ ЛТ Продано ∙ 65545[165020595] ←
      404[170929337]                       Результат ≡ Продано ∙ 65545[165020581] ←
 30867470[171116234]                     IF ←
  1638463[171116689]                       Условие ←
      404[171133449]                         Результат ≡ MOD (остаток от деления, дробные) ∙ 249[164364302] ←
 32505862[171114828]                           Значения формальных параметров при вызове ←
 32505860[171115075]                             Значение параметра при вызове процедуры/функции ≡ Делимое ∙ 65545[164365717] ←
   327700[171115544]                               Выражение ≡ Продано ∙ 65545[165020581] ←
 32505860[171115076]                             Значение параметра при вызове процедуры/функции ≡ Делитель ∙ 65545[164365721] ←
   327700[171115545]                               Выражение ⁼ 1 ←
  1638479[171114884]                         Не равно ←
      404[171133448]                         Результат ⁼ 0 ←
 30867472[171116228]                       THEN ←
 11010080[171120234]                         = ≡ ЛТ Продано (купонов, шт) ∙ 65545[171117665] ←
      404[171133446]                           Результат ⁼ 1 ←
 30867473[171115004]                       ELSE ←
 11010080[171120235]                         = ≡ ЛТ Продано (купонов, шт) ∙ 65545[171117665] ←
      404[171133451]                           Результат ≡ Продано ∙ 65545[165020581] ←
 11010080[170921906]                     = ≡ ЛТ Выставлено ∙ 65545[165020596] ←
      404[170929338]                       Результат ≡ Выставлено ∙ 65545[165020588] ←
 11010080[171120233]                     = ≡ ЛТ Выставлено (купонов, шт) ∙ 65545[171117664] ←
      404[171133439]                       Результат ≡ Выставлено (купонов, шт) ∙ 65545[171117663] ←
 11010080[170921907]                     = ≡ ЛТ Цена (розн.) ∙ 65545[165020597] ←
      404[170929339]                       Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
 11010080[170921908]                     = ≡ ЛТ Цена (факт.) ∙ 65545[165020599] ←
      404[170929340]                       Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
 11010080[170921909]                     = ≡ ЛТ Сумма (факт.) ∙ 65545[165020600] ←
      404[170929341]                       Результат ≡ Сумма (факт.) ∙ 65545[165020592] ←
 11010080[170921910]                     = ≡ ЛТ Убыток ∙ 65545[165020608] ←
      116[170919662]                       Выражение ←
      116[170919663]                         Выражение ←
      404[170929342]                           Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      406[170917950]                           Вычесть ←
      404[170929343]                           Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      403[170917999]                       Умножить ←
      404[170929344]                       Результат ≡ Продано ∙ 65545[165020581] ←
 11010088[170919097]                     ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[170919235]                       Значения формальных параметров при вызове ←
      117[170918054]                         Выражение • Сообщение ≡ Длинная строка (1024) ∙ 107[48431108] ←
      404[170929345]                           Результат ⁼ '1. Цена роз : ' ←
      404[170929346]                           Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      404[170929347]                           Результат ⁼ ', факт : ' ←
      404[170929348]                           Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      404[170929349]                           Результат ⁼ ', кол-во : ' ←
      404[170929350]                           Результат ≡ Продано ∙ 65545[165020581] ←
      404[170929351]                           Результат ⁼ ', убыток : ' ←
      404[170929352]                           Результат ≡ ЛТ Убыток ∙ 65545[165020608] ←
 32505860[170920561]                         Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[170921499]                           Выражение ≡ Сообщение ∙ 117[170918054] ←
 11010080[170921911]                     = ≡ Счётчик операций ∙ 65545[165020602] ←
      404[170929353]                       Результат ⁼ 1 ←
 11010092[170917929]                     Добавить в локальную таблицу ≡ Продажи ∙ 30867458[165019675] ←
 30867473[170918187]                   ELSE ←
 48431132[170917977]                     += ≡ ЛТ Продано ∙ 65545[165020595] ←
      404[170929354]                       Результат ≡ Продано ∙ 65545[165020581] ←
 30867470[171116235]                     IF ←
  1638463[171116690]                       Условие ←
      404[171133450]                         Результат ≡ MOD (остаток от деления, дробные) ∙ 249[164364302] ←
 32505862[171114829]                           Значения формальных параметров при вызове ←
 32505860[171115077]                             Значение параметра при вызове процедуры/функции ≡ Делимое ∙ 65545[164365717] ←
   327700[171115546]                               Выражение ≡ Продано ∙ 65545[165020581] ←
 32505860[171115078]                             Значение параметра при вызове процедуры/функции ≡ Делитель ∙ 65545[164365721] ←
   327700[171115547]                               Выражение ⁼ 1 ←
  1638479[171114893]                         Не равно ←
      404[171133452]                         Результат ⁼ 0 ←
 30867472[171116229]                       THEN ←
 48431132[171114755]                         += ≡ ЛТ Продано (купонов, шт) ∙ 65545[171117665] ←
      404[171133455]                           Результат ⁼ 1 ←
 30867473[171115005]                       ELSE ←
 48431132[171114756]                         += ≡ ЛТ Продано (купонов, шт) ∙ 65545[171117665] ←
      404[171133454]                           Результат ≡ Продано ∙ 65545[165020581] ←
 11010093[170918019]                     Комментарий • Выставлено не инкрементируется, так как ищется запросом через SUM за период отчёта ←
  1507728[170918086]                     Начало многострочного комментария ←
 11010080[170921912]                     = ≡ ЛТ Выставлено ∙ 65545[165020596] ←
      404[170929355]                       Результат ≡ Выставлено ∙ 65545[165020588] ←
  1507729[170918086]                     Конец многострочного комментария ←
 48431132[170917978]                     += ≡ ЛТ Цена (розн.) ∙ 65545[165020597] ←
      404[170929356]                       Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
 48431132[170917979]                     += ≡ ЛТ Цена (факт.) ∙ 65545[165020599] ←
      404[170929357]                       Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
 48431132[170917980]                     += ≡ ЛТ Сумма (факт.) ∙ 65545[165020600] ←
      404[170929358]                       Результат ≡ Сумма (факт.) ∙ 65545[165020592] ←
 48431132[170917981]                     += ≡ ЛТ Убыток ∙ 65545[165020608] ←
      116[170919664]                       Выражение ←
      116[170919665]                         Выражение ←
      404[170929359]                           Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      406[170917951]                           Вычесть ←
      404[170929360]                           Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      403[170918000]                       Умножить ←
      404[170929361]                       Результат ≡ Продано ∙ 65545[165020581] ←
 11010088[170919098]                     ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[170919236]                       Значения формальных параметров при вызове ←
      117[170918055]                         Выражение • Сообщение ≡ Длинная строка (1024) ∙ 107[48431108] ←
      404[170929362]                           Результат ⁼ '2. Цена роз : ' ←
      404[170929363]                           Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      404[170929364]                           Результат ⁼ ', факт : ' ←
      404[170929365]                           Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      404[170929366]                           Результат ⁼ ', кол-во : ' ←
      404[170929367]                           Результат ≡ Продано ∙ 65545[165020581] ←
      404[170929368]                           Результат ⁼ ', убыток : ' ←
      404[170929369]                           Результат ≡ ЛТ Убыток ∙ 65545[165020608] ←
 32505860[170920562]                         Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[170921500]                           Выражение ≡ Сообщение ∙ 117[170918055] ←
 48431132[170917982]                     += ≡ Счётчик операций ∙ 65545[165020602] ←
      404[170929370]                       Результат ⁼ 1 ←
  1507625[170917889]                     Изменить локальную таблицу ≡ Продажи ∙ 30867458[165019675] ←
 11010088[170919099]                 ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170918337]                   Выражение ←
      404[170929371]                     Результат ⁼          Стало: ←
      404[170929372]                     Результат ≡ ЛТ Выставлено ∙ 65545[165020596] ←
 11010080[170921913]                 = ≡ Строка ∙ 65545[655299188] ←
      404[170929373]                   Результат ≡ Дата продажи ∙ 65545[165020585] ←
      404[170929374]                   Результат ⁼ ; ←
      404[170929375]                   Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[170919593]                     Уточняющий параметр ≡ Код ∙ 305[5] ←
      404[170929376]                   Результат ⁼ ; ←
      404[170929377]                   Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[170919594]                     Уточняющий параметр ≡ Наименование ∙ 305[6] ←
      404[170929378]                   Результат ⁼ ; ←
      404[170929379]                   Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      404[170929380]                   Результат ⁼ ; ←
      404[170929381]                   Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      404[170929382]                   Результат ⁼ ; ←
      404[170929383]                   Результат ≡ Продано ∙ 65545[165020581] ←
      404[170929384]                   Результат ⁼ ; ←
      404[170929385]                   Результат ≡ Сумма (факт.) ∙ 65545[165020592] ←
      404[170929386]                   Результат ⁼ ; ←
 30867467[170917907]               Выполнить при завершении ←
 30867470[170918886]                 IF ←
  1638463[170919155]                   Условие ←
      404[170929387]                     Результат ≡ Автоматически ∙ 65545[58393339] ←
 30867472[170918883]                   THEN ←
 11010088[170919100]                     ВЫПОЛНИТЬ ≡ Файл.Закрыть ∙ 249[1507341] ←
 39780367[170918273]                       Файл ≡ Файл ∙ 65545[655299187] ←
 11010088[170919101]                     ВЫПОЛНИТЬ ≡ Файл.Удалить ∙ 249[1507333] ←
 39780367[170918274]                       Файл ≡ Файл ∙ 65545[655299187] ←
 30867477[170917907]                     Отбор данных из локальной таблицы • КД ≡ Продажи ∙ 30867458[165019675] ←
 30867484[170917900]                       Выполнить перед обработкой блока ≡ КД ∙ 30867481[164823063] ←
 11010105[170917969]                         Индикатор ⁼ Ученка. Рассылка КД ←
 11010080[170921914]                         = ≡ Имя ∙ 65545[655299190] ←
      404[170929388]                           Результат ⁼ 'ucenka-' ←
      404[170929389]                           Результат ≡ Случайное число (7 знаков) ∙ 117[1507630] ←
  1507410[170918791]                         ВЫПОЛНИТЬ БЛОК ≡ Создание файла ∙ 30867469[655295596] ←
 11010080[170921915]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170929390]                           Результат ⁼ ; ←
      404[170929391]                           Результат ⁼ Отчёт 20/30/50 за период с ; ←
      404[170929392]                           Результат ≡ Дата начальная ∙ 381[131078] ←
      404[170929393]                           Результат ⁼  по ; ←
      404[170929394]                           Результат ≡ Дата конечная ∙ 381[131079] ←
  1507410[170918792]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 11010080[170921916]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170929395]                           Результат ⁼ Код магазина; ←
      404[170929396]                           Результат ⁼ Магазин; ←
      404[170929397]                           Результат ⁼ Код; ←
      404[170929398]                           Результат ⁼ Продукт; ←
      404[170929399]                           Результат ⁼ Кол-во (факт.); ←
      404[170929400]                           Результат ⁼ Кол-во (приказ); ←
      404[170929401]                           Результат ⁼ Цена (розн); ←
      404[170929402]                           Результат ⁼ Цена (факт); ←
      404[170929403]                           Результат ⁼ Сумма (факт); ←
      404[170929404]                           Результат ⁼ Списано бонусов; ←
      404[170929405]                           Результат ⁼ Убыток; ←
      404[170929406]                           Результат ⁼ Чеков; ←
      404[170929407]                           Результат ⁼ Список приказов; ←
      404[170929408]                           Результат ⁼ Список скидок; ←
      404[170929409]                           Результат ⁼ Поставщик; ←
      404[170929410]                           Результат ⁼ Возврат; ←
      404[170929411]                           Результат ⁼ Группа; ←
  1507410[170918793]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 30867466[170918198]                       Выполнить после получения записи ←
 30867477[170917908]                         Отбор данных из локальной таблицы • собираем приказы  и скидки в строку ≡ Приказы ∙ 30867458[165019676] ←
 30867465[170917907]                           Выполнить при старте ←
 11010080[170921917]                             = ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[170929412]                               Результат ⁼ '' ←
 11010080[170921918]                             = ≡ Список скидок ∙ 65545[165020594] ←
      404[170929413]                               Результат ⁼ '' ←
 30867466[170918199]                           Выполнить после получения записи ←
 11010099[170917955]                             CONTINUE ←
      116[170919666]                               Выражение ←
      116[170919667]                                 Выражение ←
      404[170929414]                                   Результат ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
  1638479[170918171]                                   Не равно ←
      404[170929415]                                   Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      412[170918553]                                 ИЛИ ←
      116[170919668]                                 Выражение ←
      404[170929416]                                   Результат ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
      411[170919595]                                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[170919596]                                       Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[170919597]                                         Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638479[170918172]                                   Не равно ←
      404[170929417]                                   Результат ≡ ТТ ∙ 65545[165020587] ←
 11010080[171119884]                             = ≡ Скидка ∙ 65545[165020593] ←
      404[171132432]                               Результат ≡ Приказы : Скидка ∙ 65545[165481409] ←
 11010080[170921920]                             = ≡ tmpstr ∙ 65545[165020611] ←
      404[170929419]                               Результат ⁼ '' ←
      404[170929420]                               Результат ≡ Скидка ∙ 65545[165020593] ←
      404[170929421]                               Результат ⁼ '' ←
 48431138[170917900]                             &= ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[170929422]                               Результат ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
      411[170919599]                                 Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[170919600]                                   Уточняющий параметр ≡ Код ∙ 331[6] ←
      404[170929423]                               Результат ⁼ , ←
  1507728[170918087]                             Начало многострочного комментария ←
 11010088[170919102]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170918338]                               Выражение ←
      404[170929424]                                 Результат ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
      411[170919601]                                   Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
      404[170929425]                                 Результат ⁼ ; ←
      404[170929426]                                 Результат ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
      404[170929427]                                 Результат ⁼ :  Список скидок < ←
      404[170929428]                                 Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[170929429]                                 Результат ⁼ >    Скидка ←
      404[170929430]                                 Результат ≡ tmpstr ∙ 65545[165020611] ←
      404[170929431]                                 Результат ⁼ %,  POS: ←
      116[170919669]                                 Выражение ←
      404[170929432]                                   Результат ≡ POS ∙ 387[1507422] ←
 11010095[170918339]                                     Выражение ←
      404[170929433]                                       Результат ≡ Список скидок ∙ 65545[165020594] ←
  1507510[170917913]                                     Искомая подстрока ←
      404[170929434]                                       Результат ≡ tmpstr ∙ 65545[165020611] ←
 11010073[170917913]                                     Позиция ⁼ 1 ←
  1507729[170918087]                             Конец многострочного комментария ←
 11010099[170917956]                             CONTINUE ←
      116[170919670]                               Выражение ←
      404[170929435]                                 Результат ≡ POS ∙ 387[1507422] ←
 11010095[170918340]                                   Выражение ←
      404[170929436]                                     Результат ≡ Список скидок ∙ 65545[165020594] ←
  1507510[170917914]                                   Искомая подстрока ←
      404[170929437]                                     Результат ≡ tmpstr ∙ 65545[165020611] ←
 11010073[170917914]                                   Позиция ⁼ 1 ←
 48431138[170917901]                             &= ≡ Список скидок ∙ 65545[165020594] ←
      404[170929438]                               Результат ≡ tmpstr ∙ 65545[165020611] ←
  1638461[171114800]                               Условный оператор (IF) ←
  1638463[171116523]                                 Условие ←
  1638460[171115142]                                   НЕ ←
      404[171132391]                                   Результат ≡ КЯ или Д ∙ 65545[165020579] ←
      105[171114800]                                 То ←
      404[171132396]                                   Результат ⁼ 'р,' ←
      424[171114768]                                 Иначе ←
      404[170929439]                                   Результат ⁼ '%,' ←
  1507728[170918088]                             Начало многострочного комментария ←
 11010088[170919103]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170918341]                               Выражение ←
      404[170929440]                                 Результат ⁼          Список скидок < ←
      404[170929441]                                 Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[170929442]                                 Результат ⁼ > ←
  1507729[170918088]                             Конец многострочного комментария ←
 30867467[170917908]                           Выполнить при завершении ←
 11010093[170918020]                             Комментарий •  обрежем запятую на конце, переменная "Скидка" используется как целочисленный буфер ←
 11010080[170921921]                             = ≡ tmp ∙ 65545[165020607] ←
      404[170929443]                               Результат ≡ LEN ∙ 387[1507420] ←
 11010095[170918342]                                 Выражение ←
      404[170929444]                                   Результат ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      406[170917952]                               Вычесть ←
      404[170929445]                               Результат ⁼ 1 ←
 11010080[170921922]                             = ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[170929446]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[170919237]                                 Значения формальных параметров при вызове ←
 32505860[170920563]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[170921501]                                     Выражение ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
 32505860[170920564]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[170921502]                                     Выражение ⁼ 1 ←
 32505860[170920565]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[170921503]                                     Выражение ≡ tmp ∙ 65545[165020607] ←
 11010080[170921923]                             = ≡ tmp ∙ 65545[165020607] ←
      116[170919671]                               Выражение ←
      404[170929447]                                 Результат ≡ LEN ∙ 387[1507420] ←
 11010095[170918343]                                   Выражение ←
      404[170929448]                                     Результат ≡ Список скидок ∙ 65545[165020594] ←
      406[170917953]                                 Вычесть ←
      404[170929449]                                 Результат ⁼ 1 ←
 11010080[170921924]                             = ≡ Список скидок ∙ 65545[165020594] ←
      404[170929450]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[170919238]                                 Значения формальных параметров при вызове ←
 32505860[170920566]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[170921504]                                     Выражение ≡ Список скидок ∙ 65545[165020594] ←
 32505860[170920567]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[170921505]                                     Выражение ⁼ 1 ←
 32505860[170920568]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[170921506]                                     Выражение ≡ tmp ∙ 65545[165020607] ←
 11010080[170921925]                         = ≡ Список поставщиков ∙ 65545[164824796] ←
  1638402[170918805]                           NULL ←
 11010080[170921926]                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
  1638402[170918806]                           NULL ←
  1507360[170918181]                         Отбор данных (по запросу) • Поставщики ←
  1507673[170917911]                           Ключи оптимизации ←
  1507675[170917918]                             Использовать индекс ∙ 12124204[170918211] ←
  1507676[170917919]                               Уточняющий параметр ≡ ПРОДУКТ ∙ 1507445[54919247] ←
 12124200[170918105]                           From         (Таблицы) ←
 12124204[170918211]                             Таблица ≡ СПЕЦИФИКАЦИЯ ПОСТАВЩИКА ∙ 1507433[43122705] ←
 12124215[170918149]                           Where      (Ограничения на отбор данных) ←
  1507376[170919382]                             Выражение ←
  1507455[170919477]                               Результат ∙ 12124204[170918211] ←
  1507494[170919865]                                 Уточняющий параметр ≡ ПРОДУКТ ∙ 1507443[43122766] ←
  1638473[170920161]                               Равно ←
  1507452[170918832]                               Константа ≡ Продукт из чека ∙ 65545[165020582] ←
      413[170918291]                             И ←
  1507376[170919383]                             Выражение ←
  1507455[170919478]                               Результат ∙ 12124204[170918211] ←
  1507494[170919866]                                 Уточняющий параметр ≡ РЕГИОН ∙ 1507443[40043162] ←
  1638473[170920162]                               Равно ←
  1507452[170918833]                               Константа ≡ ТТ ∙ 65545[165020587] ←
      411[170919602]                                 Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
 12124213[170918114]                           Параметры ←
  1507335[170918293]                             Параметр • Поставщик ∙ 12124204[170918211] ←
  1507494[170919867]                               Уточняющий параметр ≡ ПОСТАВЩИК ∙ 1507443[43122765] ←
 12124224[170917924]                           Group By  (Группировка) ←
  1507533[170917935]                             Группировать по параметру ≡ Поставщик ∙ 1507335[170918293] ←
 30867466[170918200]                           Выполнить после получения записи ←
 11010080[170921927]                             = ≡ Поставщик ∙ 65545[165544278] ←
      404[170929451]                               Результат ≡ Поставщик ∙ 1507335[170918293] ←
 30867470[170918887]                             IF ←
  1638463[170919156]                               Условие ←
      404[170929452]                                 Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170918884]                               THEN ←
 11010080[170921928]                                 = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929453]                                   Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929454]                                   Результат ⁼ , ←
      404[170929455]                                   Результат ≡ Поставщик ∙ 1507335[170918293] ←
      411[170919603]                                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921929]                                 = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929456]                                   Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929457]                                   Результат ⁼ , ←
      404[170929458]                                   Результат ≡ Поставщик ∙ 65545[165544278] ←
      411[170919604]                                     Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919605]                                       Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170918188]                               ELSE ←
 11010080[170921930]                                 = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929459]                                   Результат ≡ Поставщик ∙ 1507335[170918293] ←
      411[170919606]                                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921931]                                 = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929460]                                   Результат ≡ Поставщик ∙ 65545[165544278] ←
      411[170919607]                                     Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919608]                                       Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867470[170918888]                         IF ←
  1638463[170919157]                           Условие ←
  1638460[170918037]                             НЕ ←
      404[170929461]                             Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170918885]                           THEN ←
 30867470[170918889]                             IF ←
  1638463[170919158]                               Условие ←
      404[170929462]                                 Результат ≡ Отладка (BUGS) ∙ 249[165478456] ←
 32505862[170919239]                                   Значения формальных параметров при вызове ←
 32505860[170920569]                                     Значение параметра при вызове процедуры/функции ≡ ID ∙ 65545[165480002] ←
   327700[170921507]                                       Выражение ⁼ #545807 ←
 30867472[170918886]                               THEN ←
  1507360[170918182]                                 Отбор данных (по запросу) ≡ Партии с остатком (VPSTOCK) ∙ 12124205[170983641] ←
 30867466[170918201]                                   Выполнить после получения записи ←
 30867470[170918890]                                     IF ←
  1638463[170919159]                                       Условие ←
      404[170929463]                                         Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170918887]                                       THEN ←
 11010080[170921932]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929464]                                           Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929465]                                           Результат ⁼ , ←
      404[170929466]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170919609]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919610]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921933]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929467]                                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929468]                                           Результат ⁼ , ←
      404[170929469]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170919611]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919612]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919613]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170918189]                                       ELSE ←
 11010080[170921934]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929470]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170919614]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919615]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921935]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929471]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170919616]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919617]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919618]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[170918042]                                     BREAK ←
 30867473[170918190]                               ELSE ←
  1507360[170918183]                                 Отбор данных (по запросу) ≡ Партии с остатком ∙ 12124205[164823118] ←
 30867466[170918202]                                   Выполнить после получения записи ←
 30867470[170918891]                                     IF ←
  1638463[170919160]                                       Условие ←
      404[170929472]                                         Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170918888]                                       THEN ←
 11010080[170921936]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929473]                                           Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929474]                                           Результат ⁼ , ←
      404[170929475]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170919619]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919620]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921937]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929476]                                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929477]                                           Результат ⁼ , ←
      404[170929478]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170919621]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919622]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919623]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170918191]                                       ELSE ←
 11010080[170921938]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929479]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170919624]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919625]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921939]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929480]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170919626]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919627]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919628]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[170918046]                                     BREAK ←
 11010080[170921940]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170929481]                           Результат ≡ ТТ ∙ 65545[165020587] ←
      411[170919629]                             Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
      411[170919630]                               Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
      404[170929482]                           Результат ⁼ ; ←
      404[170929483]                           Результат ≡ ТТ ∙ 65545[165020587] ←
      411[170919631]                             Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      404[170929484]                           Результат ⁼ ; ←
      404[170929485]                           Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[170919632]                             Уточняющий параметр ≡ Код ∙ 305[5] ←
      404[170929486]                           Результат ⁼ ; ←
      404[170929487]                           Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[170919633]                             Уточняющий параметр ≡ Наименование ∙ 305[6] ←
      404[170929488]                           Результат ⁼ ; ←
      404[170929489]                           Результат ≡ ЛТ Продано ∙ 65545[165020595] ←
      404[170929490]                           Результат ⁼ ; ←
      404[170929491]                           Результат ≡ ЛТ Выставлено ∙ 65545[165020596] ←
      404[170929492]                           Результат ⁼ ; ←
      404[170929493]                           Результат ≡ avg ∙ 249[165019653] ←
 32505862[170919240]                             Значения формальных параметров при вызове ←
 32505860[170920570]                               Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[165020609] ←
   327700[170921508]                                 Выражение ≡ ЛТ Цена (розн.) ∙ 65545[165020597] ←
 32505860[170920571]                               Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[165020610] ←
   327700[170921509]                                 Выражение ≡ Счётчик операций ∙ 65545[165020602] ←
      404[170929494]                           Результат ⁼ ; ←
      404[170929495]                           Результат ≡ avg ∙ 249[165019653] ←
 32505862[170919241]                             Значения формальных параметров при вызове ←
 32505860[170920572]                               Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[165020609] ←
   327700[170921510]                                 Выражение ≡ ЛТ Цена (факт.) ∙ 65545[165020599] ←
 32505860[170920573]                               Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[165020610] ←
   327700[170921511]                                 Выражение ≡ Счётчик операций ∙ 65545[165020602] ←
      404[170929496]                           Результат ⁼ ; ←
      404[170929497]                           Результат ≡ ЛТ Сумма (факт.) ∙ 65545[165020600] ←
      404[170929498]                           Результат ⁼ ; ←
      404[170929499]                           Результат ≡ Списано бонусов ∙ 65545[170918948] ←
      404[170929500]                           Результат ⁼ ; ←
      404[170929501]                           Результат ≡ ЛТ Убыток ∙ 65545[165020608] ←
      404[170929502]                           Результат ⁼ ; ←
      404[170929503]                           Результат ≡ Счётчик операций ∙ 65545[165020602] ←
      404[170929504]                           Результат ⁼ ; ←
      404[170929505]                           Результат ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[170929506]                           Результат ⁼ ; ←
      404[170929507]                           Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[170929508]                           Результат ⁼ ; ←
      404[170929509]                           Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929510]                           Результат ⁼ ; ←
      404[170929511]                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929512]                           Результат ⁼ ; ←
      404[170929513]                           Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[170919634]                             Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[170919635]                               Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[170919636]                                 Уточняющий параметр ≡ Наименование ∙ 296[6] ←
  1507410[170918794]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 11010107[170917898]                       Выполнить после обработки блока ≡ КД ∙ 30867481[164823063] ←
 11010088[170919104]                         ВЫПОЛНИТЬ ≡ Файл.Закрыть ∙ 249[1507341] ←
 39780367[170918275]                           Файл ≡ Файл ∙ 65545[655299187] ←
 30867470[170918892]                         IF ←
  1638463[170919161]                           Условие ←
      404[170929514]                             Результат ≡ Адрес КД ∙ 65545[164824801] ←
 30867472[170918889]                           THEN ←
 11010088[170919105]                             ВЫПОЛНИТЬ ≡ Передача файла на адреса эл.почты ∙ 127[656081354] ←
 32505862[170919242]                               Значения формальных параметров при вызове ←
 32505860[170920574]                                 Значение параметра при вызове процедуры/функции ≡ Файл имя (ф) ∙ 65545[656084450] ←
   327700[170921512]                                   Выражение ≡ Файл ∙ 65545[655299187] ←
 32505860[170920575]                                 Значение параметра при вызове процедуры/функции ≡ Менять кодировку ∙ 65545[656088207] ←
   327700[170921513]                                   Выражение ⁼ 1 ←
 32505860[170920576]                                 Значение параметра при вызове процедуры/функции ≡ Сообщение письма (ф) ∙ 65545[656084454] ←
   327700[170921514]                                   Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 32505860[170920577]                                 Значение параметра при вызове процедуры/функции ≡ Тема письма (ф) ∙ 65545[656084453] ←
   327700[170921515]                                   Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 12124189[170917914]                                     Выполнить при завершении ←
 39780366[170918160]                                       RETURN ←
      404[170929515]                                         Результат ⁼ 'Отчет уценка за ' ←
      404[170929516]                                         Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[170921516]                                           Выражение ≡ Дата начальная ∙ 381[131078] ←
   131097[170918050]                                           Формат ≡ Дата без времени ∙ 131096[131073] ←
 32505860[170920578]                                 Значение параметра при вызове процедуры/функции ≡ E-mail(ы) получателей  (ф) ∙ 65545[656084452] ←
   327700[170921517]                                   Выражение ≡ Адрес КД ∙ 65545[164824801] ←
 32505860[170920579]                                 Значение параметра при вызове процедуры/функции ≡ Отправлено ∙ 65545[656084440] ←
   327700[170921518]                                   Выражение ≡ Отправлено ∙ 65545[164825640] ←
 32505860[170920580]                                 Значение параметра при вызове процедуры/функции ≡ E-mail отправителя (ф) ∙ 65545[656084451] ←
   327700[170921519]                                   Выражение ⁼ 'd8office@krasyar.ru' ←
 11010088[170919106]                         ВЫПОЛНИТЬ ≡ Файл.Удалить ∙ 249[1507333] ←
 39780367[170918276]                           Файл ≡ Файл ∙ 65545[655299187] ←
 30867477[170917909]                     Отбор данных из локальной таблицы • ДД ≡ Продажи ∙ 30867458[165019675] ←
 30867484[170917901]                       Выполнить перед обработкой блока ≡ ДД ∙ 30867481[164823065] ←
 11010105[170917970]                         Индикатор ⁼ Ученка. Рассылка ДД ←
 11010080[170921941]                         = ≡ Имя ∙ 65545[655299190] ←
      404[170929517]                           Результат ⁼ 'ucenka-' ←
      404[170929518]                           Результат ≡ Случайное число (7 знаков) ∙ 117[1507630] ←
  1507410[170918795]                         ВЫПОЛНИТЬ БЛОК ≡ Создание файла ∙ 30867469[655295596] ←
 11010080[170921942]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170929519]                           Результат ⁼ ; ←
      404[170929520]                           Результат ⁼ Отчёт 20/30/50 за период с ; ←
      404[170929521]                           Результат ≡ Дата начальная ∙ 381[131078] ←
      404[170929522]                           Результат ⁼  по ; ←
      404[170929523]                           Результат ≡ Дата конечная ∙ 381[131079] ←
  1507410[170918796]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 11010080[170921943]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170929524]                           Результат ⁼ Код магазина; ←
      404[170929525]                           Результат ⁼ Магазин; ←
      404[170929526]                           Результат ⁼ Код; ←
      404[170929527]                           Результат ⁼ Продукт; ←
      404[170929528]                           Результат ⁼ Кол-во (факт.); ←
      404[170929529]                           Результат ⁼ Кол-во (приказ); ←
      404[170929530]                           Результат ⁼ Цена (розн); ←
      404[170929531]                           Результат ⁼ Цена (факт); ←
      404[170929532]                           Результат ⁼ Сумма (факт); ←
      404[170929533]                           Результат ⁼ Списано бонусов; ←
      404[170929534]                           Результат ⁼ Убыток; ←
      404[170929535]                           Результат ⁼ Чеков; ←
      404[170929536]                           Результат ⁼ Список приказов; ←
      404[170929537]                           Результат ⁼ Список скидок; ←
      404[170929538]                           Результат ⁼ Поставщик; ←
      404[170929539]                           Результат ⁼ Возврат; ←
      404[170929540]                           Результат ⁼ Группа; ←
  1507410[170918797]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 30867466[170918203]                       Выполнить после получения записи ←
 30867477[170917910]                         Отбор данных из локальной таблицы • собираем приказы  и скидки в строку ≡ Приказы ∙ 30867458[165019676] ←
 30867465[170917908]                           Выполнить при старте ←
 11010080[170921944]                             = ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[170929541]                               Результат ⁼ '' ←
 11010080[170921945]                             = ≡ Список скидок ∙ 65545[165020594] ←
      404[170929542]                               Результат ⁼ '' ←
 30867466[170918204]                           Выполнить после получения записи ←
 11010099[170917958]                             CONTINUE ←
      116[170919672]                               Выражение ←
      116[170919673]                                 Выражение ←
      404[170929543]                                   Результат ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
  1638479[170918173]                                   Не равно ←
      404[170929544]                                   Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      412[170918554]                                 ИЛИ ←
      116[170919674]                                 Выражение ←
      404[170929545]                                   Результат ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
      411[170919637]                                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[170919638]                                       Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[170919639]                                         Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638479[170918174]                                   Не равно ←
      404[170929546]                                   Результат ≡ ТТ ∙ 65545[165020587] ←
 11010080[171119885]                             = ≡ Скидка ∙ 65545[165020593] ←
      404[171132429]                               Результат ≡ Приказы : Скидка ∙ 65545[165481409] ←
 11010080[170921947]                             = ≡ tmpstr ∙ 65545[165020611] ←
      404[170929548]                               Результат ⁼ '' ←
      404[170929549]                               Результат ≡ Скидка ∙ 65545[165020593] ←
      404[170929550]                               Результат ⁼ '' ←
 48431138[170917902]                             &= ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[170929551]                               Результат ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
      411[170919641]                                 Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[170919642]                                   Уточняющий параметр ≡ Код ∙ 331[6] ←
      404[170929552]                               Результат ⁼ , ←
  1507728[170918089]                             Начало многострочного комментария ←
 11010088[170919107]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170918344]                               Выражение ←
      404[170929553]                                 Результат ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
      411[170919643]                                   Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
      404[170929554]                                 Результат ⁼ ; ←
      404[170929555]                                 Результат ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
      404[170929556]                                 Результат ⁼ :  Список скидок < ←
      404[170929557]                                 Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[170929558]                                 Результат ⁼ >    Скидка ←
      404[170929559]                                 Результат ≡ tmpstr ∙ 65545[165020611] ←
      404[170929560]                                 Результат ⁼ %,  POS: ←
      116[170919675]                                 Выражение ←
      404[170929561]                                   Результат ≡ POS ∙ 387[1507422] ←
 11010095[170918345]                                     Выражение ←
      404[170929562]                                       Результат ≡ Список скидок ∙ 65545[165020594] ←
  1507510[170917915]                                     Искомая подстрока ←
      404[170929563]                                       Результат ≡ tmpstr ∙ 65545[165020611] ←
 11010073[170917915]                                     Позиция ⁼ 1 ←
  1507729[170918089]                             Конец многострочного комментария ←
 11010099[170917963]                             CONTINUE ←
      116[170919676]                               Выражение ←
      404[170929564]                                 Результат ≡ POS ∙ 387[1507422] ←
 11010095[170918346]                                   Выражение ←
      404[170929565]                                     Результат ≡ Список скидок ∙ 65545[165020594] ←
  1507510[170917916]                                   Искомая подстрока ←
      404[170929566]                                     Результат ≡ tmpstr ∙ 65545[165020611] ←
 11010073[170917916]                                   Позиция ⁼ 1 ←
 48431138[170917903]                             &= ≡ Список скидок ∙ 65545[165020594] ←
      404[170929567]                               Результат ≡ tmpstr ∙ 65545[165020611] ←
  1638461[171114801]                               Условный оператор (IF) ←
  1638463[171116524]                                 Условие ←
  1638460[171115145]                                   НЕ ←
      404[171132397]                                   Результат ≡ КЯ или Д ∙ 65545[165020579] ←
      105[171114801]                                 То ←
      404[171132398]                                   Результат ⁼ 'р,' ←
      424[171114779]                                 Иначе ←
      404[171132399]                                   Результат ⁼ '%,' ←
  1507728[170918090]                             Начало многострочного комментария ←
 11010088[170919108]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170918347]                               Выражение ←
      404[170929569]                                 Результат ⁼          Список скидок < ←
      404[170929570]                                 Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[170929571]                                 Результат ⁼ > ←
  1507729[170918090]                             Конец многострочного комментария ←
 30867467[170917909]                           Выполнить при завершении ←
 11010093[170918021]                             Комментарий •  обрежем запятую на конце, переменная "Скидка" используется как целочисленный буфер ←
 11010080[170921948]                             = ≡ tmp ∙ 65545[165020607] ←
      404[170929572]                               Результат ≡ LEN ∙ 387[1507420] ←
 11010095[170918348]                                 Выражение ←
      404[170929573]                                   Результат ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      406[170917954]                               Вычесть ←
      404[170929574]                               Результат ⁼ 1 ←
 11010080[170921949]                             = ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[170929575]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[170919243]                                 Значения формальных параметров при вызове ←
 32505860[170920581]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[170921520]                                     Выражение ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
 32505860[170920582]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[170921521]                                     Выражение ⁼ 1 ←
 32505860[170920583]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[170921522]                                     Выражение ≡ tmp ∙ 65545[165020607] ←
 11010080[170921950]                             = ≡ tmp ∙ 65545[165020607] ←
      116[170919677]                               Выражение ←
      404[170929576]                                 Результат ≡ LEN ∙ 387[1507420] ←
 11010095[170918349]                                   Выражение ←
      404[170929577]                                     Результат ≡ Список скидок ∙ 65545[165020594] ←
      406[170917955]                                 Вычесть ←
      404[170929578]                                 Результат ⁼ 1 ←
 11010080[170921951]                             = ≡ Список скидок ∙ 65545[165020594] ←
      404[170929579]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[170919244]                                 Значения формальных параметров при вызове ←
 32505860[170920584]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[170921523]                                     Выражение ≡ Список скидок ∙ 65545[165020594] ←
 32505860[170920585]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[170921524]                                     Выражение ⁼ 1 ←
 32505860[170920586]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[170921525]                                     Выражение ≡ tmp ∙ 65545[165020607] ←
 11010080[170921952]                         = ≡ Список поставщиков ∙ 65545[164824796] ←
  1638402[170918807]                           NULL ←
  1507360[170918184]                         Отбор данных (по запросу) • Поставщики ←
  1507673[170917912]                           Ключи оптимизации ←
  1507675[170917919]                             Использовать индекс ∙ 12124204[170918212] ←
  1507676[170917920]                               Уточняющий параметр ≡ ПРОДУКТ ∙ 1507445[54919247] ←
 12124200[170918106]                           From         (Таблицы) ←
 12124204[170918212]                             Таблица ≡ СПЕЦИФИКАЦИЯ ПОСТАВЩИКА ∙ 1507433[43122705] ←
 12124215[170918150]                           Where      (Ограничения на отбор данных) ←
  1507376[170919384]                             Выражение ←
  1507455[170919479]                               Результат ∙ 12124204[170918212] ←
  1507494[170919868]                                 Уточняющий параметр ≡ ПРОДУКТ ∙ 1507443[43122766] ←
  1638473[170920165]                               Равно ←
  1507452[170918834]                               Константа ≡ Продукт из чека ∙ 65545[165020582] ←
      413[170918292]                             И ←
  1507376[170919385]                             Выражение ←
  1507455[170919480]                               Результат ∙ 12124204[170918212] ←
  1507494[170919869]                                 Уточняющий параметр ≡ РЕГИОН ∙ 1507443[40043162] ←
  1638473[170920166]                               Равно ←
  1507452[170918835]                               Константа ≡ ТТ ∙ 65545[165020587] ←
      411[170919644]                                 Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
 12124213[170918115]                           Параметры ←
  1507335[170918294]                             Параметр • Поставщик ∙ 12124204[170918212] ←
  1507494[170919870]                               Уточняющий параметр ≡ ПОСТАВЩИК ∙ 1507443[43122765] ←
 12124224[170917925]                           Group By  (Группировка) ←
  1507533[170917936]                             Группировать по параметру ≡ Поставщик ∙ 1507335[170918294] ←
 30867466[170918205]                           Выполнить после получения записи ←
 11010080[170921953]                             = ≡ Поставщик ∙ 65545[165544278] ←
      404[170929580]                               Результат ≡ Поставщик ∙ 1507335[170918294] ←
 30867470[170918893]                             IF ←
  1638463[170919162]                               Условие ←
      404[170929581]                                 Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170918890]                               THEN ←
 11010080[170921954]                                 = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929582]                                   Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929583]                                   Результат ⁼ , ←
      404[170929584]                                   Результат ≡ Поставщик ∙ 1507335[170918294] ←
      411[170919645]                                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921955]                                 = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929585]                                   Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929586]                                   Результат ⁼ , ←
      404[170929587]                                   Результат ≡ Поставщик ∙ 65545[165544278] ←
      411[170919646]                                     Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919647]                                       Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170918192]                               ELSE ←
 11010080[170921956]                                 = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929588]                                   Результат ≡ Поставщик ∙ 1507335[170918294] ←
      411[170919648]                                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921957]                                 = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929589]                                   Результат ≡ Поставщик ∙ 65545[165544278] ←
      411[170919649]                                     Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919650]                                       Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867470[170918894]                         IF ←
  1638463[170919163]                           Условие ←
  1638460[170918038]                             НЕ ←
      404[170929590]                             Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170918891]                           THEN ←
 30867470[170918895]                             IF ←
  1638463[170919164]                               Условие ←
      404[170929591]                                 Результат ≡ Отладка (BUGS) ∙ 249[165478456] ←
 32505862[170919245]                                   Значения формальных параметров при вызове ←
 32505860[170920587]                                     Значение параметра при вызове процедуры/функции ≡ ID ∙ 65545[165480002] ←
   327700[170921526]                                       Выражение ⁼ #545807 ←
 30867472[170918892]                               THEN ←
  1507360[170918185]                                 Отбор данных (по запросу) ≡ Партии с остатком (VPSTOCK) ∙ 12124205[170983641] ←
 30867466[170918206]                                   Выполнить после получения записи ←
 30867470[170918896]                                     IF ←
  1638463[170919165]                                       Условие ←
      404[170929592]                                         Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170918893]                                       THEN ←
 11010080[170921958]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929593]                                           Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929594]                                           Результат ⁼ , ←
      404[170929595]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170919651]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919652]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921959]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929596]                                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929597]                                           Результат ⁼ , ←
      404[170929598]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170919653]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919654]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919655]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170918193]                                       ELSE ←
 11010080[170921960]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929599]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170919656]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919657]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921961]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929600]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170919658]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919659]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919660]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[170918047]                                     BREAK ←
 30867473[170918194]                               ELSE ←
  1507360[170918186]                                 Отбор данных (по запросу) ≡ Партии с остатком ∙ 12124205[164823118] ←
 30867466[170918207]                                   Выполнить после получения записи ←
 30867470[170918897]                                     IF ←
  1638463[170919166]                                       Условие ←
      404[170929601]                                         Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170918894]                                       THEN ←
 11010080[170921962]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929602]                                           Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929603]                                           Результат ⁼ , ←
      404[170929604]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170919661]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919662]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921963]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929605]                                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929606]                                           Результат ⁼ , ←
      404[170929607]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170919663]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919664]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919665]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170918195]                                       ELSE ←
 11010080[170921964]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929608]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170919666]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919667]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921965]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929609]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170919668]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919669]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919670]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[170918048]                                     BREAK ←
 11010080[170921966]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170929610]                           Результат ≡ ТТ ∙ 65545[165020587] ←
      411[170919671]                             Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
      411[170919672]                               Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
      404[170929611]                           Результат ⁼ ; ←
      404[170929612]                           Результат ≡ ТТ ∙ 65545[165020587] ←
      411[170919673]                             Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      404[170929613]                           Результат ⁼ ; ←
      404[170929614]                           Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[170919674]                             Уточняющий параметр ≡ Код ∙ 305[5] ←
      404[170929615]                           Результат ⁼ ; ←
      404[170929616]                           Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[170919675]                             Уточняющий параметр ≡ Наименование ∙ 305[6] ←
      404[170929617]                           Результат ⁼ ; ←
      404[170929618]                           Результат ≡ ЛТ Продано ∙ 65545[165020595] ←
      404[170929619]                           Результат ⁼ ; ←
      404[170929620]                           Результат ≡ ЛТ Выставлено ∙ 65545[165020596] ←
      404[170929621]                           Результат ⁼ ; ←
      404[170929622]                           Результат ≡ avg ∙ 249[165019653] ←
 32505862[170919246]                             Значения формальных параметров при вызове ←
 32505860[170920588]                               Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[165020609] ←
   327700[170921527]                                 Выражение ≡ ЛТ Цена (розн.) ∙ 65545[165020597] ←
 32505860[170920589]                               Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[165020610] ←
   327700[170921528]                                 Выражение ≡ Счётчик операций ∙ 65545[165020602] ←
      404[170929623]                           Результат ⁼ ; ←
      404[170929624]                           Результат ≡ avg ∙ 249[165019653] ←
 32505862[170919247]                             Значения формальных параметров при вызове ←
 32505860[170920590]                               Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[165020609] ←
   327700[170921529]                                 Выражение ≡ ЛТ Цена (факт.) ∙ 65545[165020599] ←
 32505860[170920591]                               Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[165020610] ←
   327700[170921530]                                 Выражение ≡ Счётчик операций ∙ 65545[165020602] ←
      404[170929625]                           Результат ⁼ ; ←
      404[170929626]                           Результат ≡ ЛТ Сумма (факт.) ∙ 65545[165020600] ←
      404[170929627]                           Результат ⁼ ; ←
      404[170929628]                           Результат ≡ Списано бонусов ∙ 65545[170918948] ←
      404[170929629]                           Результат ⁼ ; ←
      404[170929630]                           Результат ≡ ЛТ Убыток ∙ 65545[165020608] ←
      404[170929631]                           Результат ⁼ ; ←
      404[170929632]                           Результат ≡ Счётчик операций ∙ 65545[165020602] ←
      404[170929633]                           Результат ⁼ ; ←
      404[170929634]                           Результат ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[170929635]                           Результат ⁼ ; ←
      404[170929636]                           Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[170929637]                           Результат ⁼ ; ←
      404[170929638]                           Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929639]                           Результат ⁼ ; ←
      404[170929640]                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929641]                           Результат ⁼ ; ←
      404[170929642]                           Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[170919676]                             Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[170919677]                               Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[170919678]                                 Уточняющий параметр ≡ Наименование ∙ 296[6] ←
  1507410[170918798]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 11010107[170917899]                       Выполнить после обработки блока ≡ ДД ∙ 30867481[164823065] ←
 11010088[170919109]                         ВЫПОЛНИТЬ ≡ Файл.Закрыть ∙ 249[1507341] ←
 39780367[170918277]                           Файл ≡ Файл ∙ 65545[655299187] ←
 30867470[170918898]                         IF ←
  1638463[170919167]                           Условие ←
      404[170929643]                             Результат ≡ Адрес ДД ∙ 65545[164824802] ←
 30867472[170918895]                           THEN ←
 11010088[170919110]                             ВЫПОЛНИТЬ ≡ Передача файла на адреса эл.почты ∙ 127[656081354] ←
 32505862[170919248]                               Значения формальных параметров при вызове ←
 32505860[170920592]                                 Значение параметра при вызове процедуры/функции ≡ Файл имя (ф) ∙ 65545[656084450] ←
   327700[170921531]                                   Выражение ≡ Файл ∙ 65545[655299187] ←
 32505860[170920593]                                 Значение параметра при вызове процедуры/функции ≡ Менять кодировку ∙ 65545[656088207] ←
   327700[170921532]                                   Выражение ⁼ 1 ←
 32505860[170920594]                                 Значение параметра при вызове процедуры/функции ≡ Сообщение письма (ф) ∙ 65545[656084454] ←
   327700[170921533]                                   Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 32505860[170920595]                                 Значение параметра при вызове процедуры/функции ≡ Тема письма (ф) ∙ 65545[656084453] ←
   327700[170921534]                                   Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 12124189[170917921]                                     Выполнить при завершении ←
 39780366[170918161]                                       RETURN ←
      404[170929644]                                         Результат ⁼ 'Отчет уценка за ' ←
      404[170929645]                                         Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[170921535]                                           Выражение ≡ Дата начальная ∙ 381[131078] ←
   131097[170918051]                                           Формат ≡ Дата без времени ∙ 131096[131073] ←
 32505860[170920596]                                 Значение параметра при вызове процедуры/функции ≡ E-mail(ы) получателей  (ф) ∙ 65545[656084452] ←
   327700[170921536]                                   Выражение ≡ Адрес ДД ∙ 65545[164824802] ←
 32505860[170920597]                                 Значение параметра при вызове процедуры/функции ≡ Отправлено ∙ 65545[656084440] ←
   327700[170921537]                                   Выражение ≡ Отправлено ∙ 65545[164825640] ←
 32505860[170920598]                                 Значение параметра при вызове процедуры/функции ≡ E-mail отправителя (ф) ∙ 65545[656084451] ←
   327700[170921538]                                   Выражение ⁼ 'd8office@krasyar.ru' ←
 11010088[170919111]                         ВЫПОЛНИТЬ ≡ Файл.Удалить ∙ 249[1507333] ←
 39780367[170918278]                           Файл ≡ Файл ∙ 65545[655299187] ←
 30867473[170918196]                   ELSE ←
 30867477[170917911]                     Отбор данных из локальной таблицы ≡ Продажи ∙ 30867458[165019675] ←
 30867465[170917909]                       Выполнить при старте ←
 11010080[170921967]                         = ≡ Итого убытков ∙ 65545[165806509] ←
      404[170929646]                           Результат ⁼ 0 ←
 11010080[170921968]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170929647]                           Результат ⁼ ; ←
      404[170929648]                           Результат ⁼ Отчёт 20/30/50 за период с ; ←
      404[170929649]                           Результат ≡ Дата начальная ∙ 381[131078] ←
      404[170929650]                           Результат ⁼  по ; ←
      404[170929651]                           Результат ≡ Дата конечная ∙ 381[131079] ←
  1507410[170918799]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 30867470[173015071]                         IF ←
  1638463[173015079]                           Условие ←
      404[173015883]                             Результат ≡ Отчет по дивизиону ∙ 65545[173015259] ←
 30867472[173015071]                           THEN • Добавляем в отчет столбец с дивизионом ←
 11010080[173015275]                             = ≡ Строка ∙ 65545[655299188] ←
      404[173015903]                               Результат ⁼ Дивизион; ←
      404[173015884]                               Результат ⁼ Код магазина; ←
      404[173015885]                               Результат ⁼ Магазин; ←
      404[173015886]                               Результат ⁼ Код; ←
      404[173015887]                               Результат ⁼ Продукт; ←
      404[173015888]                               Результат ⁼ Кол-во (факт.); ←
      404[173015889]                               Результат ⁼ Кол-во (приказ); ←
      404[173015890]                               Результат ⁼ Кол-во (факт купонов, шт); ←
      404[173015891]                               Результат ⁼ Кол-во (приказ купонов, шт); ←
      404[173015892]                               Результат ⁼ Цена (розн); ←
      404[173015893]                               Результат ⁼ Цена (факт); ←
      404[173015894]                               Результат ⁼ Сумма (факт); ←
      404[173015895]                               Результат ⁼ Списано бонусов; ←
      404[173015896]                               Результат ⁼ Убыток; ←
      404[173015897]                               Результат ⁼ Чеков; ←
      404[173015898]                               Результат ⁼ Список приказов; ←
      404[173015899]                               Результат ⁼ Список скидок; ←
      404[173015900]                               Результат ⁼ Поставщик; ←
      404[173015901]                               Результат ⁼ Возврат; ←
      404[173015902]                               Результат ⁼ Группа; ←
 30867473[173015054]                           ELSE • Оставляем столбцы без дивизиона ←
 11010080[173015276]                             = ≡ Строка ∙ 65545[655299188] ←
      404[173015904]                               Результат ⁼ Код магазина; ←
      404[173015905]                               Результат ⁼ Магазин; ←
      404[173015906]                               Результат ⁼ Код; ←
      404[173015907]                               Результат ⁼ Продукт; ←
      404[173015908]                               Результат ⁼ Кол-во (факт.); ←
      404[173015909]                               Результат ⁼ Кол-во (приказ); ←
      404[173015910]                               Результат ⁼ Кол-во (факт купонов, шт); ←
      404[173015911]                               Результат ⁼ Кол-во (приказ купонов, шт); ←
      404[173015912]                               Результат ⁼ Цена (розн); ←
      404[173015913]                               Результат ⁼ Цена (факт); ←
      404[173015914]                               Результат ⁼ Сумма (факт); ←
      404[173015915]                               Результат ⁼ Списано бонусов; ←
      404[173015916]                               Результат ⁼ Убыток; ←
      404[173015917]                               Результат ⁼ Чеков; ←
      404[173015918]                               Результат ⁼ Список приказов; ←
      404[173015919]                               Результат ⁼ Список скидок; ←
      404[173015920]                               Результат ⁼ Поставщик; ←
      404[173015921]                               Результат ⁼ Возврат; ←
      404[173015922]                               Результат ⁼ Группа; ←
  1507410[170918800]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 30867484[170917902]                       Выполнить перед обработкой блока ≡ ТТ ∙ 30867481[165806082] ←
 11010080[170921970]                         = ≡ Итого по ТТ ∙ 65545[165806510] ←
      404[170929669]                           Результат ⁼ 0 ←
 30867466[170918208]                       Выполнить после получения записи ←
 30867477[170917912]                         Отбор данных из локальной таблицы • собираем приказы  и скидки в строку ≡ Приказы ∙ 30867458[165019676] ←
 30867465[170917910]                           Выполнить при старте ←
 11010080[170921971]                             = ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[170929670]                               Результат ⁼ '' ←
 11010080[170921972]                             = ≡ Список скидок ∙ 65545[165020594] ←
      404[170929671]                               Результат ⁼ '' ←
 30867466[170918209]                           Выполнить после получения записи ←
 11010099[170917964]                             CONTINUE ←
      116[170919678]                               Выражение ←
      116[170919679]                                 Выражение ←
      404[170929672]                                   Результат ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
  1638479[170918175]                                   Не равно ←
      404[170929673]                                   Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      412[170918555]                                 ИЛИ ←
      116[170919680]                                 Выражение ←
      404[170929674]                                   Результат ≡ Приказы : ТТ ∙ 65545[165481410] ←
  1638479[170918176]                                   Не равно ←
      404[170929675]                                   Результат ≡ ТТ ∙ 65545[165020587] ←
 11010080[171119888]                             = ≡ Скидка ∙ 65545[165020593] ←
      404[171132435]                               Результат ≡ Приказы : Скидка ∙ 65545[165481409] ←
 11010080[170921974]                             = ≡ tmpstr ∙ 65545[165020611] ←
      404[170929677]                               Результат ⁼ '' ←
      404[170929678]                               Результат ≡ Скидка ∙ 65545[165020593] ←
      404[170929679]                               Результат ⁼ '' ←
 48431138[170917904]                             &= ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[170929680]                               Результат ≡ Приказы : Код ∙ 65545[165481412] ←
      404[170929681]                               Результат ⁼ , ←
 11010088[170919112]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170918350]                               Выражение ←
      404[170929682]                                 Результат ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
      411[170919679]                                   Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
      404[170929683]                                 Результат ⁼ ; ←
      404[170929684]                                 Результат ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
      404[170929685]                                 Результат ⁼ :  Список скидок < ←
      404[170929686]                                 Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[170929687]                                 Результат ⁼ >    Скидка ←
      404[170929688]                                 Результат ≡ tmpstr ∙ 65545[165020611] ←
      404[170929689]                                 Результат ⁼ %,  POS: ←
      116[170919681]                                 Выражение ←
      404[170929690]                                   Результат ≡ POS ∙ 387[1507422] ←
 11010095[170918351]                                     Выражение ←
      404[170929691]                                       Результат ≡ Список скидок ∙ 65545[165020594] ←
  1507510[170917917]                                     Искомая подстрока ←
      404[170929692]                                       Результат ≡ tmpstr ∙ 65545[165020611] ←
 11010073[170917917]                                     Позиция ⁼ 1 ←
  1507728[170918091]                             Начало многострочного комментария ←
  1507729[170918091]                             Конец многострочного комментария ←
 11010099[170917965]                             CONTINUE ←
      116[170919682]                               Выражение ←
      404[170929693]                                 Результат ≡ POS ∙ 387[1507422] ←
 11010095[170918352]                                   Выражение ←
      404[170929694]                                     Результат ≡ Список скидок ∙ 65545[165020594] ←
  1507510[170917918]                                   Искомая подстрока ←
      404[170929695]                                     Результат ≡ tmpstr ∙ 65545[165020611] ←
 11010073[170917918]                                   Позиция ⁼ 1 ←
 48431138[170917905]                             &= ≡ Список скидок ∙ 65545[165020594] ←
      404[170929696]                               Результат ≡ tmpstr ∙ 65545[165020611] ←
  1638461[171114802]                               Условный оператор (IF) ←
  1638463[171116525]                                 Условие ←
  1638460[171115146]                                   НЕ ←
      404[171132400]                                   Результат ≡ КЯ или Д ∙ 65545[165020579] ←
      105[171114802]                                 То ←
      404[171132401]                                   Результат ⁼ 'р,' ←
      424[171114780]                                 Иначе ←
      404[171132402]                                   Результат ⁼ '%,' ←
  1507728[170918092]                             Начало многострочного комментария ←
 11010088[170919113]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170918353]                               Выражение ←
      404[170929698]                                 Результат ⁼          Список скидок < ←
      404[170929699]                                 Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[170929700]                                 Результат ⁼ > ←
  1507729[170918092]                             Конец многострочного комментария ←
 30867467[170917910]                           Выполнить при завершении ←
 11010093[170918022]                             Комментарий •  обрежем запятую на конце, переменная "Скидка" используется как целочисленный буфер ←
 11010080[170921975]                             = ≡ tmp ∙ 65545[165020607] ←
      404[170929701]                               Результат ≡ LEN ∙ 387[1507420] ←
 11010095[170918354]                                 Выражение ←
      404[170929702]                                   Результат ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      406[170917956]                               Вычесть ←
      404[170929703]                               Результат ⁼ 1 ←
 11010080[170921976]                             = ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[170929704]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[170919249]                                 Значения формальных параметров при вызове ←
 32505860[170920599]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[170921539]                                     Выражение ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
 32505860[170920600]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[170921540]                                     Выражение ⁼ 1 ←
 32505860[170920601]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[170921541]                                     Выражение ≡ tmp ∙ 65545[165020607] ←
 11010080[170921977]                             = ≡ tmp ∙ 65545[165020607] ←
      116[170919683]                               Выражение ←
      404[170929705]                                 Результат ≡ LEN ∙ 387[1507420] ←
 11010095[170918355]                                   Выражение ←
      404[170929706]                                     Результат ≡ Список скидок ∙ 65545[165020594] ←
      406[170917957]                                 Вычесть ←
      404[170929707]                                 Результат ⁼ 1 ←
 11010080[170921978]                             = ≡ Список скидок ∙ 65545[165020594] ←
      404[170929708]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[170919250]                                 Значения формальных параметров при вызове ←
 32505860[170920602]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[170921542]                                     Выражение ≡ Список скидок ∙ 65545[165020594] ←
 32505860[170920603]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[170921543]                                     Выражение ⁼ 1 ←
 32505860[170920604]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[170921544]                                     Выражение ≡ tmp ∙ 65545[165020607] ←
 11010080[170921979]                         = ≡ Список поставщиков ∙ 65545[164824796] ←
  1638402[170918808]                           NULL ←
  1507360[170918187]                         Отбор данных (по запросу) • Поставщики ←
  1507673[170917913]                           Ключи оптимизации ←
  1507675[170917920]                             Использовать индекс ∙ 12124204[170918213] ←
  1507676[170917921]                               Уточняющий параметр ≡ ПРОДУКТ ∙ 1507445[54919247] ←
 12124200[170918107]                           From         (Таблицы) ←
 12124204[170918213]                             Таблица ≡ СПЕЦИФИКАЦИЯ ПОСТАВЩИКА ∙ 1507433[43122705] ←
 12124215[170918151]                           Where      (Ограничения на отбор данных) ←
  1507376[170919386]                             Выражение ←
  1507455[170919481]                               Результат ∙ 12124204[170918213] ←
  1507494[170919871]                                 Уточняющий параметр ≡ ПРОДУКТ ∙ 1507443[43122766] ←
  1638473[170920167]                               Равно ←
  1507452[170918836]                               Константа ≡ Продукт из чека ∙ 65545[165020582] ←
      413[170918293]                             И ←
  1507376[170919387]                             Выражение ←
  1507455[170919482]                               Результат ∙ 12124204[170918213] ←
  1507494[170919872]                                 Уточняющий параметр ≡ РЕГИОН ∙ 1507443[40043162] ←
  1638473[170920168]                               Равно ←
  1507452[170918837]                               Константа ≡ ТТ ∙ 65545[165020587] ←
      411[170919680]                                 Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
 12124213[170918116]                           Параметры ←
  1507335[170918295]                             Параметр • Поставщик ∙ 12124204[170918213] ←
  1507494[170919873]                               Уточняющий параметр ≡ ПОСТАВЩИК ∙ 1507443[43122765] ←
 12124224[170917926]                           Group By  (Группировка) ←
  1507533[170917937]                             Группировать по параметру ≡ Поставщик ∙ 1507335[170918295] ←
 30867466[170918210]                           Выполнить после получения записи ←
 11010080[170921980]                             = ≡ Поставщик ∙ 65545[165544278] ←
      404[170929709]                               Результат ≡ Поставщик ∙ 1507335[170918295] ←
 30867470[170918899]                             IF ←
  1638463[170919168]                               Условие ←
      404[170929710]                                 Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170918896]                               THEN ←
 11010080[170921981]                                 = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929711]                                   Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929712]                                   Результат ⁼ , ←
      404[170929713]                                   Результат ≡ Поставщик ∙ 1507335[170918295] ←
      411[170919681]                                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921982]                                 = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929714]                                   Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929715]                                   Результат ⁼ , ←
      404[170929716]                                   Результат ≡ Поставщик ∙ 65545[165544278] ←
      411[170919682]                                     Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919683]                                       Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170918197]                               ELSE ←
 11010080[170921983]                                 = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929717]                                   Результат ≡ Поставщик ∙ 1507335[170918295] ←
      411[170919684]                                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921984]                                 = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929718]                                   Результат ≡ Поставщик ∙ 65545[165544278] ←
      411[170919685]                                     Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919686]                                       Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867470[170918900]                         IF ←
  1638463[170919169]                           Условие ←
  1638460[170918039]                             НЕ ←
      404[170929719]                             Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170918897]                           THEN ←
 30867470[170918901]                             IF ←
  1638463[170919170]                               Условие ←
      404[170929720]                                 Результат ≡ Отладка (BUGS) ∙ 249[165478456] ←
 32505862[170919251]                                   Значения формальных параметров при вызове ←
 32505860[170920605]                                     Значение параметра при вызове процедуры/функции ≡ ID ∙ 65545[165480002] ←
   327700[170921545]                                       Выражение ⁼ #545807 ←
 30867472[170918898]                               THEN ←
  1507360[170918188]                                 Отбор данных (по запросу) ≡ Партии с остатком (VPSTOCK) ∙ 12124205[170983641] ←
 30867466[170918211]                                   Выполнить после получения записи ←
 30867470[170918902]                                     IF ←
  1638463[170919171]                                       Условие ←
      404[170929721]                                         Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170918899]                                       THEN ←
 11010080[170921985]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929722]                                           Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929723]                                           Результат ⁼ , ←
      404[170929724]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170919687]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919688]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921986]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929725]                                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929726]                                           Результат ⁼ , ←
      404[170929727]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170919689]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919690]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919691]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170918198]                                       ELSE ←
 11010080[170921987]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929728]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170919692]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919693]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921988]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929729]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170919694]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919695]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919696]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[170918049]                                     BREAK ←
 30867473[170918199]                               ELSE ←
  1507360[170918189]                                 Отбор данных (по запросу) ≡ Партии с остатком ∙ 12124205[164823118] ←
 30867466[170918212]                                   Выполнить после получения записи ←
 30867470[170918903]                                     IF ←
  1638463[170919172]                                       Условие ←
      404[170929730]                                         Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170918900]                                       THEN ←
 11010080[170921989]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929731]                                           Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929732]                                           Результат ⁼ , ←
      404[170929733]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170919697]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919698]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921990]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929734]                                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929735]                                           Результат ⁼ , ←
      404[170929736]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170919699]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919700]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919701]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170918200]                                       ELSE ←
 11010080[170921991]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929737]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170919702]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919703]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921992]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929738]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170919704]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919705]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919706]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[170918050]                                     BREAK ←
 30867469[170918385]                         БЛОК • ---- ←
 39780361[170918036]                           ЗАВЕРШИТЬ БЛОК ←
 30867470[170918904]                           IF ←
  1638463[170919173]                             Условие ←
  1638460[170918040]                               НЕ ←
      404[170929739]                               Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170918901]                             THEN ←
  1507360[170918190]                               Отбор данных (по запросу) ≡ Партии с остатком ∙ 12124205[164823118] ←
 30867466[170918213]                                 Выполнить после получения записи ←
 30867470[170918905]                                   IF ←
  1638463[170919174]                                     Условие ←
      404[170929740]                                       Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170918902]                                     THEN ←
 11010080[170921993]                                       = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929741]                                         Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929742]                                         Результат ⁼ , ←
      404[170929743]                                         Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170919707]                                           Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919708]                                             Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921994]                                       = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929744]                                         Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929745]                                         Результат ⁼ , ←
      404[170929746]                                         Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170919709]                                           Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919710]                                             Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919711]                                               Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170918201]                                     ELSE ←
 11010080[170921995]                                       = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170929747]                                         Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170919712]                                           Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919713]                                             Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170921996]                                       = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170929748]                                         Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170919714]                                           Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170919715]                                             Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170919716]                                               Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[170918051]                                   BREAK ←
 30867470[173015072]                         IF ←
  1638463[173015080]                           Условие ←
      404[173015923]                             Результат ≡ Отчет по дивизиону ∙ 65545[173015259] ←
 30867472[173015072]                           THEN • Выведем дополнительно столбец с названием дивизиона ←
 11010080[173015279]                             = ≡ Текущая ТТ ∙ 65545[173015257] ←
      404[173016000]                               Результат ≡ ТТ ∙ 65545[165020587] ←
 11010080[173015277]                             = ≡ Строка ∙ 65545[655299188] ←
      404[173015998]                               Результат ≡ Дивизион тт ∙ 117[173015051] ←
      404[173015999]                               Результат ⁼ ; ←
      404[173015924]                               Результат ≡ ТТ ∙ 65545[165020587] ←
      411[173015161]                                 Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
      411[173015162]                                   Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
      404[173015925]                               Результат ⁼ ; ←
      404[173015926]                               Результат ≡ ТТ ∙ 65545[165020587] ←
      411[173015163]                                 Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      404[173015927]                               Результат ⁼ ; ←
      404[173015928]                               Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[173015164]                                 Уточняющий параметр ≡ Код ∙ 305[5] ←
      404[173015929]                               Результат ⁼ ; ←
      404[173015930]                               Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[173015165]                                 Уточняющий параметр ≡ Наименование ∙ 305[6] ←
      404[173015931]                               Результат ⁼ ; ←
      404[173015932]                               Результат ≡ ЛТ Продано ∙ 65545[165020595] ←
      404[173015933]                               Результат ⁼ ; ←
      404[173015934]                               Результат ≡ ЛТ Выставлено ∙ 65545[165020596] ←
      404[173015935]                               Результат ⁼ ; ←
      404[173015936]                               Результат ≡ ЛТ Продано (купонов, шт) ∙ 65545[171117665] ←
      404[173015937]                               Результат ⁼ ; ←
      404[173015938]                               Результат ≡ ЛТ Выставлено (купонов, шт) ∙ 65545[171117664] ←
      404[173015939]                               Результат ⁼ ; ←
      404[173015940]                               Результат ≡ avg ∙ 249[165019653] ←
 32505862[173015078]                                 Значения формальных параметров при вызове ←
 32505860[173015092]                                   Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[165020609] ←
   327700[173015132]                                     Выражение ≡ ЛТ Цена (розн.) ∙ 65545[165020597] ←
 32505860[173015093]                                   Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[165020610] ←
   327700[173015136]                                     Выражение ≡ Счётчик операций ∙ 65545[165020602] ←
      404[173015941]                               Результат ⁼ ; ←
      404[173015942]                               Результат ≡ avg ∙ 249[165019653] ←
 32505862[173015079]                                 Значения формальных параметров при вызове ←
 32505860[173015094]                                   Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[165020609] ←
   327700[173015137]                                     Выражение ≡ ЛТ Цена (факт.) ∙ 65545[165020599] ←
 32505860[173015095]                                   Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[165020610] ←
   327700[173015138]                                     Выражение ≡ Счётчик операций ∙ 65545[165020602] ←
      404[173015943]                               Результат ⁼ ; ←
      404[173015944]                               Результат ≡ ЛТ Сумма (факт.) ∙ 65545[165020600] ←
      404[173015945]                               Результат ⁼ ; ←
      404[173015946]                               Результат ≡ Списано бонусов ∙ 65545[170918948] ←
      404[173015947]                               Результат ⁼ ; ←
      404[173015948]                               Результат ≡ ЛТ Убыток ∙ 65545[165020608] ←
      404[173015949]                               Результат ⁼ ; ←
      404[173015950]                               Результат ≡ Счётчик операций ∙ 65545[165020602] ←
      404[173015951]                               Результат ⁼ ; ←
      404[173015952]                               Результат ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[173015953]                               Результат ⁼ ; ←
      404[173015954]                               Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[173015955]                               Результат ⁼ ; ←
      404[173015956]                               Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[173015957]                               Результат ⁼ ; ←
      404[173015958]                               Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[173015959]                               Результат ⁼ ; ←
      404[173015960]                               Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[173015166]                                 Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[173015167]                                   Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[173015168]                                     Уточняющий параметр ≡ Наименование ∙ 296[6] ←
 30867473[173015055]                           ELSE ←
 11010080[173015278]                             = ≡ Строка ∙ 65545[655299188] ←
      404[173015961]                               Результат ≡ ТТ ∙ 65545[165020587] ←
      411[173015169]                                 Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
      411[173015170]                                   Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
      404[173015962]                               Результат ⁼ ; ←
      404[173015963]                               Результат ≡ ТТ ∙ 65545[165020587] ←
      411[173015171]                                 Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      404[173015964]                               Результат ⁼ ; ←
      404[173015965]                               Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[173015172]                                 Уточняющий параметр ≡ Код ∙ 305[5] ←
      404[173015966]                               Результат ⁼ ; ←
      404[173015967]                               Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[173015173]                                 Уточняющий параметр ≡ Наименование ∙ 305[6] ←
      404[173015968]                               Результат ⁼ ; ←
      404[173015969]                               Результат ≡ ЛТ Продано ∙ 65545[165020595] ←
      404[173015970]                               Результат ⁼ ; ←
      404[173015971]                               Результат ≡ ЛТ Выставлено ∙ 65545[165020596] ←
      404[173015972]                               Результат ⁼ ; ←
      404[173015973]                               Результат ≡ ЛТ Продано (купонов, шт) ∙ 65545[171117665] ←
      404[173015974]                               Результат ⁼ ; ←
      404[173015975]                               Результат ≡ ЛТ Выставлено (купонов, шт) ∙ 65545[171117664] ←
      404[173015976]                               Результат ⁼ ; ←
      404[173015977]                               Результат ≡ avg ∙ 249[165019653] ←
 32505862[173015080]                                 Значения формальных параметров при вызове ←
 32505860[173015096]                                   Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[165020609] ←
   327700[173015139]                                     Выражение ≡ ЛТ Цена (розн.) ∙ 65545[165020597] ←
 32505860[173015097]                                   Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[165020610] ←
   327700[173015140]                                     Выражение ≡ Счётчик операций ∙ 65545[165020602] ←
      404[173015978]                               Результат ⁼ ; ←
      404[173015979]                               Результат ≡ avg ∙ 249[165019653] ←
 32505862[173015081]                                 Значения формальных параметров при вызове ←
 32505860[173015107]                                   Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[165020609] ←
   327700[173015141]                                     Выражение ≡ ЛТ Цена (факт.) ∙ 65545[165020599] ←
 32505860[173015108]                                   Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[165020610] ←
   327700[173015142]                                     Выражение ≡ Счётчик операций ∙ 65545[165020602] ←
      404[173015980]                               Результат ⁼ ; ←
      404[173015981]                               Результат ≡ ЛТ Сумма (факт.) ∙ 65545[165020600] ←
      404[173015982]                               Результат ⁼ ; ←
      404[173015983]                               Результат ≡ Списано бонусов ∙ 65545[170918948] ←
      404[173015984]                               Результат ⁼ ; ←
      404[173015985]                               Результат ≡ ЛТ Убыток ∙ 65545[165020608] ←
      404[173015986]                               Результат ⁼ ; ←
      404[173015987]                               Результат ≡ Счётчик операций ∙ 65545[165020602] ←
      404[173015988]                               Результат ⁼ ; ←
      404[173015989]                               Результат ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[173015990]                               Результат ⁼ ; ←
      404[173015991]                               Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[173015992]                               Результат ⁼ ; ←
      404[173015993]                               Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[173015994]                               Результат ⁼ ; ←
      404[173015995]                               Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[173015996]                               Результат ⁼ ; ←
      404[173015997]                               Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[173015174]                                 Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[173015175]                                   Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[173015176]                                     Уточняющий параметр ≡ Наименование ∙ 296[6] ←
  1507410[170918801]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 11010093[170918023]                         Комментарий • заявка 408683. Хотели итоги по отчету. Сделал по аналогии с ускоренным (127[2518-160]) ←
 30867470[170918906]                         IF ←
  1638463[170919175]                           Условие ←
      404[170929782]                             Результат ≡ ЛТ Убыток ∙ 65545[165020608] ←
 30867472[170918903]                           THEN ←
 48431132[170917983]                             += ≡ Итого убытков ∙ 65545[165806509] ←
      404[170929783]                               Результат ≡ ЛТ Убыток ∙ 65545[165020608] ←
 48431132[170917984]                             += ≡ Итого по ТТ ∙ 65545[165806510] ←
      404[170929784]                               Результат ≡ ЛТ Убыток ∙ 65545[165020608] ←
 11010107[170917900]                       Выполнить после обработки блока ≡ ТТ ∙ 30867481[165806082] ←
 11010080[170921998]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170929785]                           Результат ≡ ТТ ∙ 65545[165020587] ←
      411[170919725]                             Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
      411[170919726]                               Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
      404[170929786]                           Результат ⁼ ; ←
      404[170929787]                           Результат ⁼ Итого по ТТ; ←
      404[170929788]                           Результат ⁼ ; ←
      404[170929789]                           Результат ⁼ ; ←
      404[170929790]                           Результат ⁼ ; ←
      404[170929791]                           Результат ⁼ ; ←
      404[170929792]                           Результат ⁼ ; ←
      404[170929793]                           Результат ⁼ ; ←
      404[170929794]                           Результат ⁼ ; ←
      404[170929795]                           Результат ≡ Итого по ТТ ∙ 65545[165806510] ←
      404[170929796]                           Результат ⁼ ; ←
      404[170929797]                           Результат ⁼ ; ←
      404[170929798]                           Результат ≡ CR+LF ∙ 117[1508547] ←
  1507410[170918802]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 30867467[170917911]                       Выполнить при завершении ←
 11010080[170921999]                         = ≡ Строка ∙ 65545[655299188] ←
      404[170929799]                           Результат ⁼ ; ←
      404[170929800]                           Результат ⁼ Итого; ←
      404[170929801]                           Результат ⁼ ; ←
      404[170929802]                           Результат ⁼ ; ←
      404[170929803]                           Результат ⁼ ; ←
      404[170929804]                           Результат ⁼ ; ←
      404[170929805]                           Результат ⁼ ; ←
      404[170929806]                           Результат ⁼ ; ←
      404[170929807]                           Результат ⁼ ; ←
      404[170929808]                           Результат ≡ Итого убытков ∙ 65545[165806509] ←
      404[170929809]                           Результат ⁼ ; ←
      404[170929810]                           Результат ⁼ ; ←
  1507410[170918803]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
  1507728[170918093]             Начало многострочного комментария • Очень долго рабтоает  ←
  1507360[165019789]             Отбор данных (по запросу) ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
 32505862[165020172]               Значения формальных параметров при вызове ←
 32505860[165020704]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа начальная ∙ 65545[18547260] ←
   327700[165021292]                   Выражение ≡ Дата начальная ∙ 381[131078] ←
 32505860[165020705]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа конечная ∙ 65545[18547261] ←
   327700[165021293]                   Выражение ≡ Дата конечная ∙ 381[131079] ←
 32505860[165020706]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Классы ∙ 65545[18547257] ←
   327700[165021294]                   Выражение ≡ КОНТРОЛЬНАЯ ЛЕНТА ∙ 541[40304641] ←
 32505860[165020707]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547258] ←
   327700[165021295]                   Выражение ≡ Контрольная лента ∙ 332[40304641] ←
 12124200[170524797]               From         (Таблицы) ←
  1507377[170524675]                 <Наследуемые пункты> ←
 12124204[170524844]                 Таблица • Кассовые аппараты ≡ Партнер ∙ 108[4] ←
 12124215[170524821]               Where      (Ограничения на отбор данных) ←
  1507381[170524691]                 <Наследуемые ограничения> ←
  1507376[170525357]                 Выражение ←
  1507455[170525364]                   Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[170525638]                     Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1638473[170525682]                   Равно ←
  1507455[170525365]                   Результат ≡ Кассовые аппараты ∙ 12124204[170524844] ←
  1507494[170525639]                     Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1507376[170525359]                 Выражение ←
  1507455[170525367]                   Результат ≡ Кассовые аппараты ∙ 12124204[170524844] ←
  1507494[170525641]                     Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[170525684]                   Равно ←
  1507452[170525068]                   Константа ≡ Подразделения ∙ 65545[165020571] ←
  1507376[170525358]                 Выражение ←
  1507455[170525366]                   Результат ≡ Кассовые аппараты ∙ 12124204[170524844] ←
  1507494[170525640]                     Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[170525683]                   Равно ←
  1507488[170524868]                   Константа (Ограничение по классу, типу, плану счетов) ≡ Кассовый аппарат (внешняя касса) ∙ 284[14745620] ←
 30867466[165019827]               Выполнить после получения записи ←
 11010080[165021185]                 = ≡ ТТ ∙ 65545[165020587] ←
      404[165024750]                   Результат ≡ з.Подразделение ∙ 1507335[18547061] ←
      411[165021091]                     Уточняющий параметр ≡ Родитель ∙ 283[2] ←
 11010080[165021207]                 = ≡ Приказы : ЦО ∙ 65545[165020574] ←
      404[165024866]                   Результат ≡ ТТ ∙ 65545[165020587] ←
      411[165021111]                     Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
 11010080[165347414]                 = ≡ Адрес УД(ТД) ∙ 65545[165347415] ←
      404[165347742]                   Результат ≡ Приказы : ЦО ∙ 65545[165020574] ←
      411[165347503]                     Уточняющий параметр ≡ Электронный адрес ∙ 283[14745623] ←
 11010080[164827525]                 = ≡ Адрес КД ∙ 65545[164824801] ←
      404[164845677]                   Результат ≡ Приказы : ЦО ∙ 65545[165020574] ←
      411[164833346]                     Уточняющий параметр ≡ Пластиковая карта ∙ 283[42401872] ←
      411[164833347]                       Уточняющий параметр ≡ Управляющий ∙ 283[28835886] ←
      411[164833348]                         Уточняющий параметр ≡ Электронный адрес ∙ 283[14745623] ←
 11010080[164827526]                 = ≡ Адрес ДД ∙ 65545[164824802] ←
      404[164845811]                   Результат ≡ Приказы : ЦО ∙ 65545[165020574] ←
      411[164833349]                     Уточняющий параметр ≡ Пластиковая карта ∙ 283[42401872] ←
      411[164833350]                       Уточняющий параметр ≡ Родитель ∙ 283[2] ←
      411[164833351]                         Уточняющий параметр ≡ Управляющий ∙ 283[28835886] ←
      411[164833352]                           Уточняющий параметр ≡ Электронный адрес ∙ 283[14745623] ←
 11010093[165019717]                 Комментарий •  отбираем в чеках товары, проданные с уценкой ←
  1507360[165019790]                 Отбор данных (по запросу) • ККЛ ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[165020174]                   Значения формальных параметров при вызове ←
 32505860[165020709]                     Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[165021297]                       Выражение ≡ з.Документ ∙ 1507335[18547059] ←
 12124215[165019755]                   Where      (Ограничения на отбор данных) ←
  1507381[165019704]                     <Наследуемые ограничения> ←
      413[165019940]                     И ←
  1507376[165019999]                     Выражение ←
  1507376[165020006]                       Выражение ←
  1507376[165020290]                         Выражение ←
  1507455[165019993]                           Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165020105]                             Уточняющий параметр ≡ Сервер SMTP ∙ 359[48431122] ←
  1638478[165019692]                           Больше ←
  1507452[165019868]                           Константа ⁼ 100 ←
      413[165020051]                     И ←
  1507376[165020291]                     Выражение ←
  1507376[165020301]                       Выражение ←
  1507376[165020302]                         Выражение ←
  1507455[165020223]                           Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165020391]                             Уточняющий параметр ≡ Сервер FTP ∙ 359[48431123] ←
  1638473[165020366]                           Равно ←
  1507452[165020013]                           Константа ⁼ 'N' ←
      412[165019780]                         ИЛИ ←
  1507376[165020308]                         Выражение ←
  1507455[165020262]                           Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165020431]                             Уточняющий параметр ≡ Сервер FTP ∙ 359[48431123] ←
  1638473[165020391]                           Равно ←
  1507452[165020017]                           Константа ⁼ 'C' ←
 30867466[165019828]                   Выполнить после получения записи ←
 11010080[165021179]                     = ≡ Строка ККЛ ∙ 65545[165020580] ←
      404[165024738]                       Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 11010080[165021182]                     = ≡ Дата продажи ∙ 65545[165020585] ←
      404[165024746]                       Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[165021090]                         Уточняющий параметр ≡ Дата окончания гарантии ∙ 359[14286866] ←
 11010080[165021183]                     = ≡ Продукт из чека ∙ 65545[165020582] ←
      404[165024752]                       Результат ≡ Строка.Продукт ∙ 1507335[1508517] ←
 11010080[165021214]                     = ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
      404[165024891]                       Результат ≡ Строка.Продукт ∙ 1507335[1508517] ←
 11010091[165019659]                     Получить из локальной таблицы • Поиск по товару ≡ Продажи ∙ 30867458[165019675] ←
 11010080[165021187]                     = ≡ Продано ∙ 65545[165020581] ←
  1638464[165024806]                       Ноль (0.0), если NULL ≡ Строка ККЛ ∙ 65545[165020580] ←
      411[165021092]                         Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
 11010080[165021188]                     = ≡ Цена (розн.) ∙ 65545[165020589] ←
  1638464[165024759]                       Ноль (0.0), если NULL ≡ Строка ККЛ ∙ 65545[165020580] ←
      411[165021094]                         Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 11010080[165021189]                     = ≡ Цена (факт.) ∙ 65545[165020590] ←
  1638464[165024760]                       Ноль (0.0), если NULL ≡ Строка ККЛ ∙ 65545[165020580] ←
      411[165021095]                         Уточняющий параметр ≡ Цена продажная (фактическая) ∙ 359[15007748] ←
 11010080[165021191]                     = ≡ Сумма (факт.) ∙ 65545[165020592] ←
  1638464[165024761]                       Ноль (0.0), если NULL ≡ Строка ККЛ ∙ 65545[165020580] ←
      411[165021099]                         Уточняющий параметр ≡ Сумма фактическая (точность 6 знаков) ∙ 117[21433337] ←
 11010080[170921321]                     = ≡ Списано бонусов ∙ 65545[170918948] ←
  1638464[170917930]                       Ноль (0.0), если NULL ≡ Строка ККЛ ∙ 65545[165020580] ←
      411[170918240]                         Уточняющий параметр ≡ Пробег ∙ 359[14483468] ←
 11010088[165021232]                     ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[165020277]                       Выражение ←
      404[165033887]                         Результат ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
      411[165023137]                           Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
 30867470[165020005]                     IF ←
  1638463[165020092]                       Условие ←
      404[165024739]                         Результат ≡ Строка ККЛ ∙ 65545[165020580] ←
      411[165021089]                           Уточняющий параметр ≡ Сервер SMTP ∙ 359[48431122] ←
  1638479[165019720]                         Не равно ←
      404[165024740]                         Результат ⁼ 1001 ←
 30867472[165020005]                       THEN •    ищем ценовую схему ←
 11010080[165021184]                         = ≡ Список приказов ценовых схем ∙ 65545[165020586] ←
  1638402[165019863]                           NULL ←
 11010080[165021201]                         = ≡ Список скидок ∙ 65545[165020594] ←
      404[165024811]                           Результат ⁼ '' ←
 11010080[165021769]                         = ≡ Ценовая схема ∙ 65545[165020952] ←
      404[165024809]                           Результат ≡ Строка ККЛ ∙ 65545[165020580] ←
      411[165021693]                             Уточняющий параметр ≡ Сервер SMTP ∙ 359[48431122] ←
  1507360[165019793]                         Отбор данных (по запросу) • Поиск приказов на цен.схемы ←
  1507447[165478830]                           Выражения ←
  1507449[165479980]                             Выражение • Цена закупочная ≡ Число, точность 6 знаков ∙ 107[42401800] ←
  1507608[165478507]                               Результат (Ноль (0.0), если NULL) ≡ Строки доков ∙ 12124204[165019704] ←
  1507494[165485453]                                 Уточняющий параметр ≡ Цена закупочная ∙ 359[15007745] ←
  1507449[165479982]                             Выражение • Номер сопутствующего документа ≡ Наименование объекта (80) ∙ 107[262147] ←
 12124205[165479320]                               Запрос ←
 12124213[165479347]                                 Параметры ←
  1507335[165481002]                                   Параметр • Номер сопутствующего документа ≡ Документы ∙ 12124204[165479526] ←
  1507494[165485464]                                     Уточняющий параметр ≡ Номер сопутствующего документа ∙ 331[9] ←
 12124200[165479336]                                 From         (Таблицы) ←
 12124204[165479526]                                   Таблица • Документы ≡ Документ ∙ 108[5] ←
 12124215[165479432]                                 Where      (Ограничения на отбор данных) ←
  1507376[165482461]                                   Выражение ←
  1507455[165483604]                                     Результат ≡ Документы ∙ 12124204[165479526] ←
  1507494[165485455]                                       Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638473[165482231]                                     Равно ←
  1507455[165483605]                                     Результат ≡ Строки доков ∙ 12124204[165019704] ←
  1507494[165485456]                                       Уточняющий параметр ≡ Реальная приходная накладная ∙ 359[15925249] ←
  1507449[165479983]                             Выражение • Подразделение документа ≡ Партнер ∙ 107[5] ←
 12124205[165479321]                               Запрос ←
 12124213[165479348]                                 Параметры ←
  1507335[165481005]                                   Параметр • Подразделение ≡ Документы ∙ 12124204[165479527] ←
  1507494[165485463]                                     Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
 12124200[165479337]                                 From         (Таблицы) ←
 12124204[165479527]                                   Таблица • Документы ≡ Документ ∙ 108[5] ←
 12124215[165479433]                                 Where      (Ограничения на отбор данных) ←
  1507376[165482462]                                   Выражение ←
  1507455[165483606]                                     Результат ≡ Документы ∙ 12124204[165479527] ←
  1507494[165485458]                                       Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638473[165482232]                                     Равно ←
  1507455[165483607]                                     Результат ≡ Строки доков ∙ 12124204[165019704] ←
  1507494[165485462]                                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1507449[165479985]                             Выражение • Подразделение документа.Родитель ≡ Партнер ∙ 107[5] ←
 12124205[165479323]                               Запрос ←
 12124213[165479417]                                 Параметры ←
  1507335[165481011]                                   Параметр • Родитель ≡ Подразделения ∙ 12124204[165479529] ←
  1507494[165485468]                                     Уточняющий параметр ≡ Родитель ∙ 283[2] ←
 12124200[165479339]                                 From         (Таблицы) ←
 12124204[165479529]                                   Таблица • Подразделения ≡ Партнер ∙ 108[4] ←
 12124215[165479436]                                 Where      (Ограничения на отбор данных) ←
  1507376[165482464]                                   Выражение ←
  1507455[165483614]                                     Результат ≡ Подразделения ∙ 12124204[165479529] ←
  1507494[165485469]                                       Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1638473[165482234]                                     Равно ←
  1507455[165483615]                                     Результат ≡ Подразделение документа ∙ 1507449[165479983] ←
  1507449[165479984]                             Выражение • Код документа ≡ Наименование объекта (80) ∙ 107[262147] ←
 12124205[165479322]                               Запрос ←
 12124213[165479349]                                 Параметры ←
  1507335[165481009]                                   Параметр • Код ≡ Документы ∙ 12124204[165479528] ←
  1507494[165485465]                                     Уточняющий параметр ≡ Код ∙ 331[6] ←
 12124200[165479338]                                 From         (Таблицы) ←
 12124204[165479528]                                   Таблица • Документы ≡ Документ ∙ 108[5] ←
 12124215[165479434]                                 Where      (Ограничения на отбор данных) ←
  1507376[165482463]                                   Выражение ←
  1507455[165483608]                                     Результат ≡ Документы ∙ 12124204[165479528] ←
  1507494[165485466]                                       Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638473[165482233]                                     Равно ←
  1507455[165483609]                                     Результат ≡ Строки доков ∙ 12124204[165019704] ←
  1507494[165485467]                                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
 12124213[165019706]                           Параметры ←
  1507335[165019735]                             Параметр • Приказ ≡ Доки ∙ 12124204[165019703] ←
  1507494[165020122]                               Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1507335[165019736]                             Параметр • Строчка ≡ Строки доков ∙ 12124204[165019704] ←
  1507494[165020123]                               Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507335[165481000]                             Параметр • Цена закупочная ≡ Цена закупочная ∙ 1507449[165479980] ←
  1507335[165481001]                             Параметр • Количество ≡ Строки доков ∙ 12124204[165019704] ←
  1507494[165485454]                               Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  1507335[165481003]                             Параметр • Номер сопутствующего документа ≡ Номер сопутствующего документа ∙ 1507449[165479982] ←
  1507335[165481004]                             Параметр • Реальная приходная накладная ≡ Строки доков ∙ 12124204[165019704] ←
  1507494[165485457]                               Уточняющий параметр ≡ Реальная приходная накладная ∙ 359[15925249] ←
  1507335[165481010]                             Параметр • Код документа ≡ Код документа ∙ 1507449[165479984] ←
  1507335[165481012]                             Параметр • Подразделение документа.Родитель ≡ Подразделение документа.Родитель ∙ 1507449[165479985] ←
  1507673[165019698]                           Ключи оптимизации ←
  1507675[165019701]                             Использовать индекс ≡ Доки ∙ 12124204[165019703] ←
  1507676[165019701]                               Уточняющий параметр ≡ Подразделение --> Класс --> Тип --> Дата --> ID ∙ 1507445[1507400] ←
  1507675[165019702]                             Использовать индекс ≡ Строки доков ∙ 12124204[165019704] ←
  1507676[165019702]                               Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
 12124200[165019693]                           From         (Таблицы) ←
 12124204[165019703]                             Таблица • Доки ≡ Документ ∙ 108[5] ←
 12124204[165019704]                             Таблица • Строки доков ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[165019758]                           Where      (Ограничения на отбор данных) ←
  1507376[165020020]                             Выражение ←
  1507455[165020015]                               Результат ≡ Доки ∙ 12124204[165019703] ←
  1507494[165020132]                                 Уточняющий параметр ≡ Класс ∙ 331[3] ←
  1638473[165020113]                               Равно ←
  1507488[165019719]                               Константа (Ограничение по классу, типу, плану счетов) ≡ ПРИКАЗ ∙ 541[14417922] ←
  1507376[165020019]                             Выражение ←
  1507455[165020014]                               Результат ≡ Доки ∙ 12124204[165019703] ←
  1507494[165020131]                                 Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[165020112]                               Равно ←
  1507488[165019718]                               Константа (Ограничение по классу, типу, плану счетов) ≡ Приказ на назначение ценовой схемы на товары ∙ 332[3342368] ←
  1507376[165020016]                             Выражение ←
  1507455[165020011]                               Результат ≡ Доки ∙ 12124204[165019703] ←
  1507494[165020128]                                 Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1638473[165020111]                               Равно ←
  1507452[165019876]                               Константа ≡ ТТ ∙ 65545[165020587] ←
      411[165021098]                                 Уточняющий параметр ≡ Подразделение для назначения цен ∙ 283[42401850] ←
  1507376[165020018]                             Выражение ←
  1507455[165020013]                               Результат ≡ Доки ∙ 12124204[165019703] ←
  1507494[165020130]                                 Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638476[165019673]                               Меньше ←
  1507452[165019878]                               Константа ≡ Дата продажи ∙ 65545[165020585] ←
  1507376[165020017]                             Выражение ←
  1507455[165020012]                               Результат ≡ Доки ∙ 12124204[165019703] ←
  1507494[165020129]                                 Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638477[165019700]                               Больше или равно ←
  1507452[165019877]                               Константа ≡ Дата1 ∙ 65545[165020583] ←
  1507376[165020013]                             Выражение ←
  1507455[165020007]                               Результат ≡ Доки ∙ 12124204[165019703] ←
  1507494[165020124]                                 Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[165019670]                               Меньше или равно ←
  1507452[165019874]                               Константа ≡ Дата продажи ∙ 65545[165020585] ←
  1507376[165020014]                             Выражение ←
  1507455[165020008]                               Результат ≡ Доки ∙ 12124204[165019703] ←
  1507494[165020125]                                 Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638477[165019680]                               Больше или равно ←
  1507452[165019875]                               Константа ≡ Дата, начало дня ∙ 249[30867471] ←
 32505862[165020256]                                 Значения формальных параметров при вызове ←
 32505860[165020900]                                   Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867497] ←
   327700[165021555]                                     Выражение ≡ Дата продажи ∙ 65545[165020585] ←
  1507376[165020015]                             Выражение ←
  1507455[165020009]                               Результат ≡ Доки ∙ 12124204[165019703] ←
  1507494[165020126]                                 Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638473[165020110]                               Равно ←
  1507455[165020010]                               Результат ≡ Строки доков ∙ 12124204[165019704] ←
  1507494[165020127]                                 Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1507376[165020012]                             Выражение ←
  1507455[165020006]                               Результат ≡ Строки доков ∙ 12124204[165019704] ←
  1507494[165020120]                                 Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[165020109]                               Равно ←
  1507452[165019879]                               Константа ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
 30867465[165019694]                           Выполнить при старте ←
 11010080[165021205]                             = ≡ Выставлено ∙ 65545[165020588] ←
      404[165024848]                               Результат ⁼ 0 ←
 11010080[165021771]                             = ≡ Точный приказ ∙ 65545[165020953] ←
  1638402[165019896]                               NULL ←
 11010080[165021772]                             = ≡ Скидка ∙ 65545[165020593] ←
      404[165026902]                               Результат ⁼ 0 ←
 30867466[165019831]                           Выполнить после получения записи ←
 11010080[165021186]                             = ≡ Список приказов ценовых схем ∙ 65545[165020586] ←
      404[165024751]                               Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[165019712]                                 Список элементов ←
   327700[165021332]                                   Выражение ≡ Список приказов ценовых схем ∙ 65545[165020586] ←
   327700[165021333]                                   Выражение ≡ Приказ ∙ 1507335[165019735] ←
 11010080[165021212]                             = ≡ Приказ ∙ 65545[165020603] ←
      404[165024884]                               Результат ≡ Приказ ∙ 1507335[165019735] ←
 11010080[165021213]                             = ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
      404[165024885]                               Результат ≡ Строчка ∙ 1507335[165019736] ←
 11010080[165021840]                             = ≡ Скидка ∙ 65545[165020593] ←
  1638464[165027169]                               Ноль (0.0), если NULL ≡ Цена закупочная ∙ 1507335[165481000] ←
 11010080[165022334]                             = ≡ Строка приказа на ценовую схему ∙ 65545[165020954] ←
      404[165029009]                               Результат ≡ Строчка ∙ 1507335[165019736] ←
 30867470[165020009]                             IF ←
  1638463[165020095]                               Условие ←
      404[165024810]                                 Результат ≡ Номер сопутствующего документа ∙ 1507335[165481003] ←
  1638473[165020105]                                 Равно ←
      404[165026891]                                 Результат ≡ Ценовая схема ∙ 65545[165020952] ←
 30867472[165020009]                               THEN •   точно нашли верный приказ, возьмём значение скидки ←
 11010080[165021190]                                 = ≡ Скидка ∙ 65545[165020593] ←
      404[165024770]                                   Результат ≡ Цена закупочная ∙ 1507335[165481000] ←
 11010080[165021770]                                 = ≡ Точный приказ ∙ 65545[165020953] ←
      404[165026901]                                   Результат ≡ Реальная приходная накладная ∙ 1507335[165481004] ←
 11010080[165021773]                                 = ≡ Строка приказа на ценовую схему ∙ 65545[165020954] ←
      404[165026909]                                   Результат ≡ Строчка ∙ 1507335[165019736] ←
 11010080[165022335]                                 = ≡ Приказ ∙ 65545[165020603] ←
      404[165029038]                                   Результат ≡ Точный приказ ∙ 65545[165020953] ←
 11010088[165020739]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[165020039]                               Выражение ←
      404[165029028]                                 Результат ≡ Приказ ∙ 65545[165020603] ←
      404[165033925]                                 Результат ⁼ ; ←
      404[165029019]                                 Результат ≡ Строчка ∙ 1507335[165019736] ←
      404[165033927]                                 Результат ⁼ ; ←
      404[165024822]                                 Результат ≡ Количество ∙ 1507335[165481001] ←
  1507728[165019779]                             Начало многострочного комментария ←
  1507729[165019779]                             Конец многострочного комментария ←
 11010080[165021202]                             = ≡ Список скидок ∙ 65545[165020594] ←
      404[165024812]                               Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[165024813]                               Результат ⁼ , ←
      404[165024814]                               Результат ≡ Скидка ∙ 65545[165020593] ←
 48431132[165019669]                             += ≡ Выставлено ∙ 65545[165020588] ←
      404[165024847]                               Результат ≡ Количество ∙ 1507335[165481001] ←
 11010080[165484378]                             = ≡ Приказы : Скидка ∙ 65545[165481409] ←
  1638464[165479717]                               Ноль (0.0), если NULL ≡ Цена закупочная ∙ 1507335[165481000] ←
 11010080[165484379]                             = ≡ Приказы : ТТ ∙ 65545[165481410] ←
      404[165495405]                               Результат ≡ Подразделение документа.Родитель ∙ 1507335[165481012] ←
 11010080[165484380]                             = ≡ Приказы : Код ∙ 65545[165481412] ←
      404[165495406]                               Результат ≡ Код документа ∙ 1507335[165481010] ←
 11010092[165019681]                             Добавить в локальную таблицу ≡ Приказы ∙ 30867458[165019676] ←
 39780361[165019722]                             ЗАВЕРШИТЬ БЛОК ≡ Точный приказ ∙ 65545[165020953] ←
  1507360[165019792]                         Отбор данных (по запросу) • Поиск суммарного кол-ва по приказам на цен.схемы ←
 12124213[165019705]                           Параметры ←
  1507335[165019750]                             Параметр ≡ SUM(Количество) ∙ 1507449[165019666] ←
  1507447[165019662]                           Выражения ←
  1507449[165019666]                             Выражение • SUM(Количество) ≡ Число ∙ 107[4] ←
  1507455[165020003]                               Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[165019657]                                 Значения параметров ←
  1507477[165019657]                                   Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[165019657]                                     Выражение ≡ Строки доков ∙ 12124204[165019702] ←
  1507494[165020118]                                       Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  1507673[165019699]                           Ключи оптимизации ←
  1507675[165019703]                             Использовать индекс ≡ Доки ∙ 12124204[165019695] ←
  1507676[165019703]                               Уточняющий параметр ≡ Подразделение --> Класс --> Тип --> Дата --> ID ∙ 1507445[1507400] ←
  1507675[165019704]                             Использовать индекс ≡ Строки доков ∙ 12124204[165019702] ←
  1507676[165019704]                               Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
 12124200[165019692]                           From         (Таблицы) ←
 12124204[165019695]                             Таблица • Доки ≡ Документ ∙ 108[5] ←
 12124204[165019702]                             Таблица • Строки доков ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[165019757]                           Where      (Ограничения на отбор данных) ←
  1507376[165020010]                             Выражение ←
  1507455[165020004]                               Результат ≡ Доки ∙ 12124204[165019695] ←
  1507494[165020121]                                 Уточняющий параметр ≡ Класс ∙ 331[3] ←
  1638473[165020114]                               Равно ←
  1507488[165019720]                               Константа (Ограничение по классу, типу, плану счетов) ≡ ПРИКАЗ ∙ 541[14417922] ←
  1507376[165020011]                             Выражение ←
  1507455[165020016]                               Результат ≡ Доки ∙ 12124204[165019695] ←
  1507494[165020133]                                 Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[165020115]                               Равно ←
  1507488[165019721]                               Константа (Ограничение по классу, типу, плану счетов) ≡ Приказ на назначение ценовой схемы на товары ∙ 332[3342368] ←
  1507376[165020021]                             Выражение ←
  1507455[165020017]                               Результат ≡ Доки ∙ 12124204[165019695] ←
  1507494[165020134]                                 Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1638473[165020116]                               Равно ←
  1507452[165019872]                               Константа ≡ ТТ ∙ 65545[165020587] ←
      411[165021096]                                 Уточняющий параметр ≡ Подразделение для назначения цен ∙ 283[42401850] ←
  1507376[165020022]                             Выражение ←
  1507455[165020018]                               Результат ≡ Доки ∙ 12124204[165019695] ←
  1507494[165020135]                                 Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638477[165019676]                               Больше или равно ←
  1507452[165019873]                               Константа ≡ Дата1 ∙ 65545[165020583] ←
  1507376[165020023]                             Выражение ←
  1507455[165020019]                               Результат ≡ Доки ∙ 12124204[165019695] ←
  1507494[165020136]                                 Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638475[165019666]                               Меньше или равно ←
  1507452[165019880]                               Константа ≡ Дата2 ∙ 65545[165020584] ←
  1507376[165020024]                             Выражение ←
  1507455[165020020]                               Результат ≡ Доки ∙ 12124204[165019695] ←
  1507494[165020137]                                 Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
  1638475[165019673]                               Меньше или равно ←
  1507452[165019883]                               Константа ≡ Дата2 ∙ 65545[165020584] ←
  1507376[165020025]                             Выражение ←
  1507455[165020021]                               Результат ≡ Доки ∙ 12124204[165019695] ←
  1507494[165020138]                                 Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
  1638478[165019676]                               Больше ←
  1507452[165019881]                               Константа ≡ Дата начальная ∙ 381[131078] ←
  1507376[165020026]                             Выражение ←
  1507455[165020023]                               Результат ≡ Строки доков ∙ 12124204[165019702] ←
  1507494[165020140]                                 Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638473[165020117]                               Равно ←
  1507455[165020022]                               Результат ≡ Доки ∙ 12124204[165019695] ←
  1507494[165020139]                                 Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1507376[165020027]                             Выражение ←
  1507455[165020005]                               Результат ≡ Строки доков ∙ 12124204[165019702] ←
  1507494[165020119]                                 Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[165020118]                               Равно ←
  1507452[165019882]                               Константа ≡ Продукт из чека ∙ 65545[165020582] ←
 30867466[165019830]                           Выполнить после получения записи ←
 11010080[165021206]                             = ≡ Выставлено ∙ 65545[165020588] ←
      404[165024827]                               Результат ∙ 1507335[165019750] ←
  1507728[165019742]                         Начало многострочного комментария ←
 11010088[165020419]                         ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[165019987]                           Выражение ←
      404[165026903]                             Результат ⁼ ККЛ; ←
      404[165025669]                             Результат ≡ Строка ККЛ ∙ 65545[165020580] ←
      404[165025670]                             Результат ⁼ ; ←
      404[165025671]                             Результат ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
      411[165021313]                               Уточняющий параметр ≡ Код ∙ 305[5] ←
      404[165026905]                             Результат ⁼ ; ←
      404[165026904]                             Результат ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
      411[165021697]                               Уточняющий параметр ≡ Наименование ∙ 305[6] ←
      404[165025672]                             Результат ⁼ ; ←
      404[165025675]                             Результат ≡ Дата продажи ∙ 65545[165020585] ←
      404[165025674]                             Результат ⁼ ; ←
      404[165026907]                             Результат ≡ Скидка ∙ 65545[165020593] ←
      404[165026908]                             Результат ⁼ ; ←
      404[165026899]                             Результат ≡ Ценовая схема ∙ 65545[165020952] ←
      404[165026898]                             Результат ⁼ ; ←
      404[165026906]                             Результат ≡ Точный приказ ∙ 65545[165020953] ←
      404[165026900]                             Результат ⁼ ; ←
      404[165025673]                             Результат ≡ Множество.Количество элементов ∙ 387[1507487] ←
   327700[165021554]                               Выражение ≡ Список приказов ценовых схем ∙ 65545[165020586] ←
      404[165026911]                             Результат ⁼ ; ←
      404[165026910]                             Результат ≡ Строка приказа на ценовую схему ∙ 65545[165020954] ←
  1507729[165019742]                         Конец многострочного комментария ←
 11010093[165019718]                     Комментарий •  проверим сумму фактическую, из-за расчёта Премией, она может быть неадекватной, пересчитаем цифры ←
 30867470[165020244]                     IF ←
  1638463[165020433]                       Условие ←
  1638460[165019873]                         НЕ ←
      404[165029039]                         Результат ≡ КЯ или Д ∙ 65545[165020579] ←
 30867472[165020244]                       THEN • для КЯ проверим применимость Премии ←
 30867470[165020006]                         IF ←
  1638463[165020093]                           Условие ←
      116[165019988]                             Выражение ←
      404[165024733]                               Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      402[165019658]                               Делить ←
      116[165019986]                               Выражение ←
      404[165024730]                                 Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      406[165019688]                                 Вычесть ←
      116[165019987]                                 Выражение ←
      404[165024731]                                   Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      403[165019718]                                   Умножить ←
      404[165024732]                                   Результат ≡ Скидка ∙ 65545[165020593] ←
      402[165019661]                                   Делить ←
      404[165024762]                                   Результат ⁼ 100 ←
  1638476[165019671]                             Меньше ←
      404[165024734]                             Результат ⁼ 0.8 ←
 30867472[165020006]                           THEN ←
 11010080[165021192]                             = ≡ Цена (факт.) ∙ 65545[165020590] ←
      116[165019992]                               Выражение ←
      404[165024763]                                 Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      406[165019690]                                 Вычесть ←
      116[165019993]                                 Выражение ←
      404[165024764]                                   Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      403[165019720]                                   Умножить ←
      404[165024765]                                   Результат ≡ Скидка ∙ 65545[165020593] ←
      402[165019662]                                   Делить ←
      404[165024766]                                   Результат ⁼ 100 ←
 11010080[165021193]                             = ≡ Сумма (факт.) ∙ 65545[165020592] ←
      404[165024767]                               Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      403[165019721]                               Умножить ←
      404[165024768]                               Результат ≡ Продано ∙ 65545[165020581] ←
  1507728[165019780]                             Начало многострочного комментария ←
 11010088[165020332]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[165019938]                               Выражение ←
      404[165024735]                                 Результат ⁼                             Похоже, рассчитались Премией. Цена фактическая не соответствует цене со скидкой: ←
      116[165019989]                                 Выражение ←
      404[165024736]                                   Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      402[165019659]                                   Делить ←
      116[165019990]                                   Выражение ←
      404[165024737]                                     Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      406[165019689]                                     Вычесть ←
      116[165019991]                                     Выражение ←
      404[165024749]                                       Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      403[165019719]                                       Умножить ←
      404[165024753]                                       Результат ≡ Скидка ∙ 65545[165020593] ←
      402[165019660]                                       Делить ←
      404[165024758]                                       Результат ⁼ 100 ←
 11010088[165020335]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[165019941]                               Выражение ←
      404[165024769]                                 Результат ⁼                Коррекция: ←
      404[165024787]                                 Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      404[165024788]                                 Результат ⁼   | ←
      404[165024790]                                 Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[165021086]                                   Уточняющий параметр ≡ Дата окончания гарантии ∙ 359[14286866] ←
      404[165024791]                                 Результат ⁼   | ←
      404[165024792]                                 Результат ≡ Строка.Продукт ∙ 1507335[1508517] ←
      411[165021087]                                   Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
      404[165024793]                                 Результат ⁼   | ←
      404[165024794]                                 Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[165021088]                                   Уточняющий параметр ≡ Сервер SMTP ∙ 359[48431122] ←
      404[165024795]                                 Результат ⁼   | ←
      404[165024796]                                 Результат ≡ Продано ∙ 65545[165020581] ←
      404[165024797]                                 Результат ⁼   | ←
      404[165024798]                                 Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      404[165024799]                                 Результат ⁼   | ←
      404[165024800]                                 Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      404[165024801]                                 Результат ⁼   | ←
      404[165024802]                                 Результат ≡ Сумма (факт.) ∙ 65545[165020592] ←
      404[165024803]                                 Результат ⁼   | ←
      404[165024804]                                 Результат ≡ Скидка ∙ 65545[165020593] ←
      404[165024805]                                 Результат ⁼ % ←
  1507729[165019780]                             Конец многострочного комментария ←
 30867470[165020008]                     IF ←
  1638463[165020094]                       Условие ←
  1638460[165019789]                         НЕ ←
      404[165024757]                         Результат ≡ ЛТ Продано ∙ 65545[165020595] ←
 30867472[165020008]                       THEN • если продукта в таблице нет, то добавляем данные, иначе, аккумулируем ←
 11010080[165021195]                         = ≡ ЛТ Продано ∙ 65545[165020595] ←
      404[165024807]                           Результат ≡ Продано ∙ 65545[165020581] ←
 11010080[165021196]                         = ≡ ЛТ Выставлено ∙ 65545[165020596] ←
      404[165024808]                           Результат ≡ Выставлено ∙ 65545[165020588] ←
 11010080[165021197]                         = ≡ ЛТ Цена (розн.) ∙ 65545[165020597] ←
      404[165024817]                           Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
 11010080[165021199]                         = ≡ ЛТ Цена (факт.) ∙ 65545[165020599] ←
      404[165024818]                           Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
 11010080[165021200]                         = ≡ ЛТ Сумма (факт.) ∙ 65545[165020600] ←
      404[165024819]                           Результат ≡ Сумма (факт.) ∙ 65545[165020592] ←
 11010080[165021221]                         = ≡ ЛТ Убыток ∙ 65545[165020608] ←
      116[165020000]                           Выражение ←
      116[165019998]                             Выражение ←
      404[165024865]                               Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      406[165019693]                               Вычесть ←
      404[165024867]                               Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      403[165019723]                           Умножить ←
      404[165024920]                           Результат ≡ Продано ∙ 65545[165020581] ←
 11010088[170984099]                         ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[170984398]                           Значения формальных параметров при вызове ←
      117[170983836]                             Выражение • Сообщение ≡ Длинная строка (1024) ∙ 107[48431108] ←
      404[170987627]                               Результат ⁼ '1. Цена роз : ' ←
      404[170988334]                               Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      404[170988006]                               Результат ⁼ ', факт : ' ←
      404[170988335]                               Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      404[170988332]                               Результат ⁼ ', кол-во : ' ←
      404[170988336]                               Результат ≡ Продано ∙ 65545[165020581] ←
      404[170988333]                               Результат ⁼ ', убыток : ' ←
      404[170988337]                               Результат ≡ ЛТ Убыток ∙ 65545[165020608] ←
 32505860[170985007]                             Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[170985376]                               Выражение ≡ Сообщение ∙ 117[170983836] ←
 11010080[165021198]                         = ≡ Счётчик операций ∙ 65545[165020602] ←
      404[165024820]                           Результат ⁼ 1 ←
 11010092[165019679]                         Добавить в локальную таблицу ≡ Продажи ∙ 30867458[165019675] ←
 30867473[165019755]                       ELSE ←
 48431132[165021203]                         += ≡ ЛТ Продано ∙ 65545[165020595] ←
      404[165024821]                           Результат ≡ Продано ∙ 65545[165020581] ←
 11010093[165019829]                         Комментарий • Выставлено не инкрементируется, так как ищется запросом через SUM за период отчёта ←
  1507728[165019857]                         Начало многострочного комментария ←
 11010080[165022229]                         = ≡ ЛТ Выставлено ∙ 65545[165020596] ←
      404[165033924]                           Результат ≡ Выставлено ∙ 65545[165020588] ←
  1507729[165019857]                         Конец многострочного комментария ←
 48431132[165021204]                         += ≡ ЛТ Цена (розн.) ∙ 65545[165020597] ←
      404[165024823]                           Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
 48431132[165021205]                         += ≡ ЛТ Цена (факт.) ∙ 65545[165020599] ←
      404[165024824]                           Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
 48431132[165021206]                         += ≡ ЛТ Сумма (факт.) ∙ 65545[165020600] ←
      404[165024825]                           Результат ≡ Сумма (факт.) ∙ 65545[165020592] ←
 48431132[165021222]                         += ≡ ЛТ Убыток ∙ 65545[165020608] ←
      116[165019999]                           Выражение ←
      116[165020001]                             Выражение ←
      404[165024921]                               Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      406[165019694]                               Вычесть ←
      404[165024922]                               Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      403[165019724]                           Умножить ←
      404[165024939]                           Результат ≡ Продано ∙ 65545[165020581] ←
 11010088[170984100]                         ВЫПОЛНИТЬ ≡ DEBUG : WriteMessageToLog ∙ 249[164298759] ←
 32505862[170984399]                           Значения формальных параметров при вызове ←
      117[170983837]                             Выражение • Сообщение ≡ Длинная строка (1024) ∙ 107[48431108] ←
      404[170988338]                               Результат ⁼ '2. Цена роз : ' ←
      404[170988339]                               Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      404[170988340]                               Результат ⁼ ', факт : ' ←
      404[170988341]                               Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      404[170988342]                               Результат ⁼ ', кол-во : ' ←
      404[170988343]                               Результат ≡ Продано ∙ 65545[165020581] ←
      404[170988344]                               Результат ⁼ ', убыток : ' ←
      404[170988345]                               Результат ≡ ЛТ Убыток ∙ 65545[165020608] ←
 32505860[170985008]                             Значение параметра при вызове процедуры/функции ≡ Текст (debug) ∙ 65545[164299011] ←
   327700[170985377]                               Выражение ≡ Сообщение ∙ 117[170983837] ←
 48431132[165021207]                         += ≡ Счётчик операций ∙ 65545[165020602] ←
      404[165024826]                           Результат ⁼ 1 ←
  1507625[165019656]                         Изменить локальную таблицу ≡ Продажи ∙ 30867458[165019675] ←
 11010088[165021235]                     ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[165020280]                       Выражение ←
      404[165033926]                         Результат ⁼          Стало: ←
      404[165033929]                         Результат ≡ ЛТ Выставлено ∙ 65545[165020596] ←
 11010080[165021204]                     = ≡ Строка ∙ 65545[655299188] ←
      404[165024830]                       Результат ≡ Дата продажи ∙ 65545[165020585] ←
      404[165024831]                       Результат ⁼ ; ←
      404[165024832]                       Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[165021104]                         Уточняющий параметр ≡ Код ∙ 305[5] ←
      404[165024838]                       Результат ⁼ ; ←
      404[165024833]                       Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[165021105]                         Уточняющий параметр ≡ Наименование ∙ 305[6] ←
      404[165024839]                       Результат ⁼ ; ←
      404[165024835]                       Результат ≡ Цена (розн.) ∙ 65545[165020589] ←
      404[165024840]                       Результат ⁼ ; ←
      404[165024836]                       Результат ≡ Цена (факт.) ∙ 65545[165020590] ←
      404[165024841]                       Результат ⁼ ; ←
      404[165024834]                       Результат ≡ Продано ∙ 65545[165020581] ←
      404[165024842]                       Результат ⁼ ; ←
      404[165024837]                       Результат ≡ Сумма (факт.) ∙ 65545[165020592] ←
      404[165024843]                       Результат ⁼ ; ←
 30867467[165019677]               Выполнить при завершении ←
 30867470[164826128]                 IF ←
  1638463[164826902]                   Условие ←
      404[164845813]                     Результат ≡ Автоматически ∙ 65545[58393339] ←
 30867472[164826094]                   THEN ←
 11010088[164825882]                     ВЫПОЛНИТЬ ≡ Файл.Закрыть ∙ 249[1507341] ←
 39780367[164824285]                       Файл ≡ Файл ∙ 65545[655299187] ←
 11010088[164825883]                     ВЫПОЛНИТЬ ≡ Файл.Удалить ∙ 249[1507333] ←
 39780367[164824286]                       Файл ≡ Файл ∙ 65545[655299187] ←
 30867477[164823076]                     Отбор данных из локальной таблицы • КД ≡ Продажи ∙ 30867458[165019675] ←
 30867484[164823065]                       Выполнить перед обработкой блока ≡ КД ∙ 30867481[164823063] ←
 11010105[164823159]                         Индикатор ⁼ Ученка. Рассылка КД ←
 11010080[164827547]                         = ≡ Имя ∙ 65545[655299190] ←
      404[164846929]                           Результат ⁼ 'ucenka-' ←
      404[164846930]                           Результат ≡ Случайное число (7 знаков) ∙ 117[1507630] ←
  1507410[164823242]                         ВЫПОЛНИТЬ БЛОК ≡ Создание файла ∙ 30867469[655295596] ←
 11010080[164827527]                         = ≡ Строка ∙ 65545[655299188] ←
      404[164845814]                           Результат ⁼ ; ←
      404[164845815]                           Результат ⁼ Отчёт 20/30/50 за период с ; ←
      404[164845816]                           Результат ≡ Дата начальная ∙ 381[131078] ←
      404[164845817]                           Результат ⁼  по ; ←
      404[164845818]                           Результат ≡ Дата конечная ∙ 381[131079] ←
  1507410[164823239]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 11010080[164827528]                         = ≡ Строка ∙ 65545[655299188] ←
      404[164845819]                           Результат ⁼ Код магазина; ←
      404[164845820]                           Результат ⁼ Магазин; ←
      404[164845821]                           Результат ⁼ Код; ←
      404[164845822]                           Результат ⁼ Продукт; ←
      404[164845823]                           Результат ⁼ Кол-во (факт.); ←
      404[164845824]                           Результат ⁼ Кол-во (приказ); ←
      404[164845825]                           Результат ⁼ Цена (розн); ←
      404[164845826]                           Результат ⁼ Цена (факт); ←
      404[164845827]                           Результат ⁼ Сумма (факт); ←
      404[170920256]                           Результат ⁼ Списано бонусов; ←
      404[164845828]                           Результат ⁼ Убыток; ←
      404[164845829]                           Результат ⁼ Чеков; ←
      404[164845830]                           Результат ⁼ Список приказов; ←
      404[164845831]                           Результат ⁼ Список скидок; ←
      404[164845832]                           Результат ⁼ Поставщик; ←
      404[165545730]                           Результат ⁼ Возврат; ←
      404[164845833]                           Результат ⁼ Группа; ←
  1507410[164823240]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 30867466[164823689]                       Выполнить после получения записи ←
 30867477[164823077]                         Отбор данных из локальной таблицы • собираем приказы  и скидки в строку ≡ Приказы ∙ 30867458[165019676] ←
 30867465[164823065]                           Выполнить при старте ←
 11010080[164827529]                             = ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[164845834]                               Результат ⁼ '' ←
 11010080[164827530]                             = ≡ Список скидок ∙ 65545[165020594] ←
      404[164845835]                               Результат ⁼ '' ←
 30867466[164823690]                           Выполнить после получения записи ←
 11010099[164823508]                             CONTINUE ←
      116[164827026]                               Выражение ←
      116[164827027]                                 Выражение ←
      404[164845836]                                   Результат ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
  1638479[164823168]                                   Не равно ←
      404[164845837]                                   Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      412[164823729]                                 ИЛИ ←
      116[164827028]                                 Выражение ←
      404[164845838]                                   Результат ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
      411[164833353]                                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164833354]                                       Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[164833355]                                         Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638479[164823397]                                   Не равно ←
      404[164845839]                                   Результат ≡ ТТ ∙ 65545[165020587] ←
 11010080[164827531]                             = ≡ Скидка ∙ 65545[165020593] ←
      404[164845840]                               Результат ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
      411[164833356]                                 Уточняющий параметр ≡ Цена закупочная ∙ 359[15007745] ←
 11010080[164827532]                             = ≡ tmpstr ∙ 65545[165020611] ←
      404[164845841]                               Результат ⁼ '' ←
      404[164845842]                               Результат ≡ Скидка ∙ 65545[165020593] ←
      404[164846140]                               Результат ⁼ '' ←
 48431138[164823045]                             &= ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[164846231]                               Результат ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
      411[164833357]                                 Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164833358]                                   Уточняющий параметр ≡ Код ∙ 331[6] ←
      404[164846232]                               Результат ⁼ , ←
  1507728[164823194]                             Начало многострочного комментария ←
 11010088[164825875]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823563]                               Выражение ←
      404[164846233]                                 Результат ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
      411[164833359]                                   Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
      404[164846234]                                 Результат ⁼ ; ←
      404[164846235]                                 Результат ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
      404[164846236]                                 Результат ⁼ :  Список скидок < ←
      404[164846237]                                 Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[164846242]                                 Результат ⁼ >    Скидка ←
      404[164846692]                                 Результат ≡ tmpstr ∙ 65545[165020611] ←
      404[164846693]                                 Результат ⁼ %,  POS: ←
      116[164827029]                                 Выражение ←
      404[164846694]                                   Результат ≡ POS ∙ 387[1507422] ←
 11010095[164823566]                                     Выражение ←
      404[164846695]                                       Результат ≡ Список скидок ∙ 65545[165020594] ←
  1507510[164823099]                                     Искомая подстрока ←
      404[164846696]                                       Результат ≡ tmpstr ∙ 65545[165020611] ←
 11010073[164823101]                                     Позиция ⁼ 1 ←
  1507729[164823193]                             Конец многострочного комментария ←
 11010099[164823509]                             CONTINUE ←
      116[164827030]                               Выражение ←
      404[164846697]                                 Результат ≡ POS ∙ 387[1507422] ←
 11010095[164823568]                                   Выражение ←
      404[164846698]                                     Результат ≡ Список скидок ∙ 65545[165020594] ←
  1507510[164823100]                                   Искомая подстрока ←
      404[164846699]                                     Результат ≡ tmpstr ∙ 65545[165020611] ←
 11010073[164823102]                                   Позиция ⁼ 1 ←
 48431138[164823046]                             &= ≡ Список скидок ∙ 65545[165020594] ←
      404[164846700]                               Результат ≡ tmpstr ∙ 65545[165020611] ←
      404[164846821]                               Результат ⁼ '%,' ←
  1507728[164823196]                             Начало многострочного комментария ←
 11010088[164825880]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823576]                               Выражение ←
      404[164846853]                                 Результат ⁼          Список скидок < ←
      404[164846854]                                 Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[164846855]                                 Результат ⁼ > ←
  1507729[164823194]                             Конец многострочного комментария ←
 30867467[164823064]                           Выполнить при завершении ←
 11010093[164823155]                             Комментарий •  обрежем запятую на конце, переменная "Скидка" используется как целочисленный буфер ←
 11010080[164827535]                             = ≡ tmp ∙ 65545[165020607] ←
      404[164846856]                               Результат ≡ LEN ∙ 387[1507420] ←
 11010095[164823577]                                 Выражение ←
      404[164846862]                                   Результат ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      406[164823266]                               Вычесть ←
      404[164846863]                               Результат ⁼ 1 ←
 11010080[164827536]                             = ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[164846864]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[164827324]                                 Значения формальных параметров при вызове ←
 32505860[164832362]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[164836056]                                     Выражение ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
 32505860[164832363]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[164836057]                                     Выражение ⁼ 1 ←
 32505860[164832364]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[164836058]                                     Выражение ≡ tmp ∙ 65545[165020607] ←
 11010080[164827537]                             = ≡ tmp ∙ 65545[165020607] ←
      116[164827031]                               Выражение ←
      404[164846865]                                 Результат ≡ LEN ∙ 387[1507420] ←
 11010095[164823578]                                   Выражение ←
      404[164846866]                                     Результат ≡ Список скидок ∙ 65545[165020594] ←
      406[164823267]                                 Вычесть ←
      404[164846867]                                 Результат ⁼ 1 ←
 11010080[164827538]                             = ≡ Список скидок ∙ 65545[165020594] ←
      404[164846868]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[164827326]                                 Значения формальных параметров при вызове ←
 32505860[164832368]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[164836062]                                     Выражение ≡ Список скидок ∙ 65545[165020594] ←
 32505860[164832369]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[164836063]                                     Выражение ⁼ 1 ←
 32505860[164832370]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[164836064]                                     Выражение ≡ tmp ∙ 65545[165020607] ←
 11010080[164827539]                         = ≡ Список поставщиков ∙ 65545[164824796] ←
  1638402[164824130]                           NULL ←
 11010080[165544724]                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
  1638402[165544004]                           NULL ←
  1507360[164823940]                         Отбор данных (по запросу) • Поставщики ←
  1507673[164823508]                           Ключи оптимизации ←
  1507675[164823689]                             Использовать индекс ∙ 12124204[164823329] ←
  1507676[164823598]                               Уточняющий параметр ≡ ПРОДУКТ ∙ 1507445[54919247] ←
 12124200[164823627]                           From         (Таблицы) ←
 12124204[164823329]                             Таблица ≡ СПЕЦИФИКАЦИЯ ПОСТАВЩИКА ∙ 1507433[43122705] ←
 12124215[164823966]                           Where      (Ограничения на отбор данных) ←
  1507376[164824245]                             Выражение ←
  1507455[164824316]                               Результат ∙ 12124204[164823329] ←
  1507494[164828000]                                 Уточняющий параметр ≡ ПРОДУКТ ∙ 1507443[43122766] ←
  1638473[164824651]                               Равно ←
  1507452[164823906]                               Константа ≡ Продукт из чека ∙ 65545[165020582] ←
      413[164824206]                             И ←
  1507376[164824246]                             Выражение ←
  1507455[164824317]                               Результат ∙ 12124204[164823329] ←
  1507494[164828005]                                 Уточняющий параметр ≡ РЕГИОН ∙ 1507443[40043162] ←
  1638473[164824652]                               Равно ←
  1507452[164823907]                               Константа ≡ ТТ ∙ 65545[165020587] ←
      411[164833360]                                 Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
 12124213[164823509]                           Параметры ←
  1507335[164824684]                             Параметр • Поставщик ∙ 12124204[164823329] ←
  1507494[164828007]                               Уточняющий параметр ≡ ПОСТАВЩИК ∙ 1507443[43122765] ←
 12124224[164823189]                           Group By  (Группировка) ←
  1507533[164823410]                             Группировать по параметру ≡ Поставщик ∙ 1507335[164824684] ←
 30867466[164823692]                           Выполнить после получения записи ←
 11010080[165544746]                             = ≡ Поставщик ∙ 65545[165544278] ←
      404[165545740]                               Результат ≡ Поставщик ∙ 1507335[164824684] ←
 30867470[164826130]                             IF ←
  1638463[164826905]                               Условие ←
      404[164846869]                                 Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[164826096]                               THEN ←
 11010080[164827540]                                 = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164846870]                                   Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164846871]                                   Результат ⁼ , ←
      404[164846872]                                   Результат ≡ Поставщик ∙ 1507335[164824684] ←
      411[164833361]                                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[165544725]                                 = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545703]                                   Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545704]                                   Результат ⁼ , ←
      404[165545705]                                   Результат ≡ Поставщик ∙ 65545[165544278] ←
      411[165544328]                                     Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[165544329]                                       Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[164824220]                               ELSE ←
 11010080[164827541]                                 = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164846873]                                   Результат ≡ Поставщик ∙ 1507335[164824684] ←
      411[164833362]                                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[165544726]                                 = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545708]                                   Результат ≡ Поставщик ∙ 65545[165544278] ←
      411[165544330]                                     Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[165544331]                                       Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867470[164826131]                         IF ←
  1638463[164826906]                           Условие ←
  1638460[164824101]                             НЕ ←
      404[164846874]                             Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[164826097]                           THEN ←
 30867470[170983880]                             IF ←
  1638463[170983986]                               Условие ←
      404[170988287]                                 Результат ≡ Отладка (BUGS) ∙ 249[165478456] ←
 32505862[170984391]                                   Значения формальных параметров при вызове ←
 32505860[170984994]                                     Значение параметра при вызове процедуры/функции ≡ ID ∙ 65545[165480002] ←
   327700[170985362]                                       Выражение ⁼ #545807 ←
 30867472[170983871]                               THEN ←
  1507360[170983568]                                 Отбор данных (по запросу) ≡ Партии с остатком (VPSTOCK) ∙ 12124205[170983641] ←
 30867466[170983569]                                   Выполнить после получения записи ←
 30867470[170983881]                                     IF ←
  1638463[170983987]                                       Условие ←
      404[170988290]                                         Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170983872]                                       THEN ←
 11010080[170984380]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170988291]                                           Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170988292]                                           Результат ⁼ , ←
      404[170988293]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170983990]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170983993]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170984381]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170988294]                                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170988295]                                           Результат ⁼ , ←
      404[170988296]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170983994]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170983995]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170983996]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170983618]                                       ELSE ←
 11010080[170984382]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170988297]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170983997]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170983998]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170984383]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170988298]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170983999]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170984000]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170984001]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[170983471]                                     BREAK ←
 30867473[170983617]                               ELSE ←
  1507360[164823941]                                 Отбор данных (по запросу) ≡ Партии с остатком ∙ 12124205[164823118] ←
 30867466[164823693]                                   Выполнить после получения записи ←
 30867470[164826132]                                     IF ←
  1638463[164826907]                                       Условие ←
      404[164846875]                                         Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[164826098]                                       THEN ←
 11010080[164827542]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164846876]                                           Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164846877]                                           Результат ⁼ , ←
      404[164846878]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[164833363]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[164833364]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[165544727]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545706]                                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545707]                                           Результат ⁼ , ←
      404[165545709]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[165544332]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[165544333]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[165544334]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[164824221]                                       ELSE ←
 11010080[164827543]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164846879]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[164833365]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[164833366]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[165544736]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545710]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[165544335]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[165544336]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[165544337]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[164823248]                                     BREAK ←
 11010080[164827544]                         = ≡ Строка ∙ 65545[655299188] ←
      404[164846880]                           Результат ≡ ТТ ∙ 65545[165020587] ←
      411[164833367]                             Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
      411[164833368]                               Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
      404[164846881]                           Результат ⁼ ; ←
      404[164846882]                           Результат ≡ ТТ ∙ 65545[165020587] ←
      411[164833369]                             Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      404[164846883]                           Результат ⁼ ; ←
      404[164846884]                           Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[164833370]                             Уточняющий параметр ≡ Код ∙ 305[5] ←
      404[164846885]                           Результат ⁼ ; ←
      404[164846886]                           Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[164833371]                             Уточняющий параметр ≡ Наименование ∙ 305[6] ←
      404[164846887]                           Результат ⁼ ; ←
      404[164846888]                           Результат ≡ ЛТ Продано ∙ 65545[165020595] ←
      404[164846889]                           Результат ⁼ ; ←
      404[164846890]                           Результат ≡ ЛТ Выставлено ∙ 65545[165020596] ←
      404[164846891]                           Результат ⁼ ; ←
      404[164846892]                           Результат ≡ avg ∙ 249[165019653] ←
 32505862[164827328]                             Значения формальных параметров при вызове ←
 32505860[164832374]                               Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[165020609] ←
   327700[164836068]                                 Выражение ≡ ЛТ Цена (розн.) ∙ 65545[165020597] ←
 32505860[164832375]                               Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[165020610] ←
   327700[164836069]                                 Выражение ≡ Счётчик операций ∙ 65545[165020602] ←
      404[164846893]                           Результат ⁼ ; ←
      404[164846894]                           Результат ≡ avg ∙ 249[165019653] ←
 32505862[164827329]                             Значения формальных параметров при вызове ←
 32505860[164832376]                               Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[165020609] ←
   327700[164836070]                                 Выражение ≡ ЛТ Цена (факт.) ∙ 65545[165020599] ←
 32505860[164832377]                               Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[165020610] ←
   327700[164836238]                                 Выражение ≡ Счётчик операций ∙ 65545[165020602] ←
      404[164846895]                           Результат ⁼ ; ←
      404[164846896]                           Результат ≡ ЛТ Сумма (факт.) ∙ 65545[165020600] ←
      404[164846897]                           Результат ⁼ ; ←
      404[170920393]                           Результат ≡ Списано бонусов ∙ 65545[170918948] ←
      404[170920392]                           Результат ⁼ ; ←
      404[164846898]                           Результат ≡ ЛТ Убыток ∙ 65545[165020608] ←
      404[164846899]                           Результат ⁼ ; ←
      404[164846917]                           Результат ≡ Счётчик операций ∙ 65545[165020602] ←
      404[164846918]                           Результат ⁼ ; ←
      404[164846919]                           Результат ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[164846920]                           Результат ⁼ ; ←
      404[164846921]                           Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[164846922]                           Результат ⁼ ; ←
      404[164846923]                           Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164846924]                           Результат ⁼ ; ←
      404[165545735]                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545734]                           Результат ⁼ ; ←
      404[164846925]                           Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[164833372]                             Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[164833373]                               Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[164833374]                                 Уточняющий параметр ≡ Наименование ∙ 296[6] ←
  1507410[164823241]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 11010107[164823056]                       Выполнить после обработки блока ≡ КД ∙ 30867481[164823063] ←
 11010088[164825884]                         ВЫПОЛНИТЬ ≡ Файл.Закрыть ∙ 249[1507341] ←
 39780367[164824292]                           Файл ≡ Файл ∙ 65545[655299187] ←
 30867470[164826133]                         IF ←
  1638463[164826908]                           Условие ←
      404[164846926]                             Результат ≡ Адрес КД ∙ 65545[164824801] ←
 30867472[164826099]                           THEN ←
 11010088[164825881]                             ВЫПОЛНИТЬ ≡ Передача файла на адреса эл.почты ∙ 127[656081354] ←
 32505862[164827330]                               Значения формальных параметров при вызове ←
 32505860[164832378]                                 Значение параметра при вызове процедуры/функции ≡ Файл имя (ф) ∙ 65545[656084450] ←
   327700[164836239]                                   Выражение ≡ Файл ∙ 65545[655299187] ←
 32505860[164832379]                                 Значение параметра при вызове процедуры/функции ≡ Менять кодировку ∙ 65545[656088207] ←
   327700[164836240]                                   Выражение ⁼ 1 ←
 32505860[164832380]                                 Значение параметра при вызове процедуры/функции ≡ Сообщение письма (ф) ∙ 65545[656084454] ←
   327700[164836241]                                   Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 32505860[164832381]                                 Значение параметра при вызове процедуры/функции ≡ Тема письма (ф) ∙ 65545[656084453] ←
   327700[164836242]                                   Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 12124189[164823056]                                     Выполнить при завершении ←
 39780366[164824198]                                       RETURN ←
      404[164846927]                                         Результат ⁼ 'Отчет уценка за ' ←
      404[164846928]                                         Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164836246]                                           Выражение ≡ Дата начальная ∙ 381[131078] ←
   131097[164824578]                                           Формат ≡ Дата без времени ∙ 131096[131073] ←
 32505860[164832382]                                 Значение параметра при вызове процедуры/функции ≡ E-mail(ы) получателей  (ф) ∙ 65545[656084452] ←
   327700[164836243]                                   Выражение ≡ Адрес КД ∙ 65545[164824801] ←
 32505860[164832383]                                 Значение параметра при вызове процедуры/функции ≡ Отправлено ∙ 65545[656084440] ←
   327700[164836244]                                   Выражение ≡ Отправлено ∙ 65545[164825640] ←
 32505860[164832384]                                 Значение параметра при вызове процедуры/функции ≡ E-mail отправителя (ф) ∙ 65545[656084451] ←
   327700[164836245]                                   Выражение ⁼ 'd8office@krasyar.ru' ←
 11010088[164825886]                         ВЫПОЛНИТЬ ≡ Файл.Удалить ∙ 249[1507333] ←
 39780367[164824293]                           Файл ≡ Файл ∙ 65545[655299187] ←
 30867477[164823078]                     Отбор данных из локальной таблицы • ДД ≡ Продажи ∙ 30867458[165019675] ←
 30867484[164823076]                       Выполнить перед обработкой блока ≡ ДД ∙ 30867481[164823065] ←
 11010105[164823160]                         Индикатор ⁼ Ученка. Рассылка ДД ←
 11010080[164827548]                         = ≡ Имя ∙ 65545[655299190] ←
      404[164846933]                           Результат ⁼ 'ucenka-' ←
      404[164846934]                           Результат ≡ Случайное число (7 знаков) ∙ 117[1507630] ←
  1507410[164823254]                         ВЫПОЛНИТЬ БЛОК ≡ Создание файла ∙ 30867469[655295596] ←
 11010080[164827549]                         = ≡ Строка ∙ 65545[655299188] ←
      404[164846935]                           Результат ⁼ ; ←
      404[164846936]                           Результат ⁼ Отчёт 20/30/50 за период с ; ←
      404[164846937]                           Результат ≡ Дата начальная ∙ 381[131078] ←
      404[164846938]                           Результат ⁼  по ; ←
      404[164846939]                           Результат ≡ Дата конечная ∙ 381[131079] ←
  1507410[164823255]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 11010080[164827550]                         = ≡ Строка ∙ 65545[655299188] ←
      404[164846940]                           Результат ⁼ Код магазина; ←
      404[164846941]                           Результат ⁼ Магазин; ←
      404[164846942]                           Результат ⁼ Код; ←
      404[164846943]                           Результат ⁼ Продукт; ←
      404[164846944]                           Результат ⁼ Кол-во (факт.); ←
      404[164846945]                           Результат ⁼ Кол-во (приказ); ←
      404[164846946]                           Результат ⁼ Цена (розн); ←
      404[164846947]                           Результат ⁼ Цена (факт); ←
      404[164846948]                           Результат ⁼ Сумма (факт); ←
      404[170920406]                           Результат ⁼ Списано бонусов; ←
      404[164846949]                           Результат ⁼ Убыток; ←
      404[164846950]                           Результат ⁼ Чеков; ←
      404[164846951]                           Результат ⁼ Список приказов; ←
      404[164846952]                           Результат ⁼ Список скидок; ←
      404[164846953]                           Результат ⁼ Поставщик; ←
      404[165545731]                           Результат ⁼ Возврат; ←
      404[164846954]                           Результат ⁼ Группа; ←
  1507410[164823256]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 30867466[164823694]                       Выполнить после получения записи ←
 30867477[164823079]                         Отбор данных из локальной таблицы • собираем приказы  и скидки в строку ≡ Приказы ∙ 30867458[165019676] ←
 30867465[164823062]                           Выполнить при старте ←
 11010080[164827551]                             = ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[164846955]                               Результат ⁼ '' ←
 11010080[164827552]                             = ≡ Список скидок ∙ 65545[165020594] ←
      404[164846956]                               Результат ⁼ '' ←
 30867466[164823698]                           Выполнить после получения записи ←
 11010099[164823510]                             CONTINUE ←
      116[164827032]                               Выражение ←
      116[164827033]                                 Выражение ←
      404[164846957]                                   Результат ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
  1638479[164823533]                                   Не равно ←
      404[164846958]                                   Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      412[164823730]                                 ИЛИ ←
      116[164827034]                                 Выражение ←
      404[164847370]                                   Результат ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
      411[164833375]                                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164833376]                                       Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[164833377]                                         Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638479[164823534]                                   Не равно ←
      404[164847398]                                   Результат ≡ ТТ ∙ 65545[165020587] ←
 11010080[164827553]                             = ≡ Скидка ∙ 65545[165020593] ←
      404[164847399]                               Результат ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
      411[164833378]                                 Уточняющий параметр ≡ Цена закупочная ∙ 359[15007745] ←
 11010080[164827554]                             = ≡ tmpstr ∙ 65545[165020611] ←
      404[164847401]                               Результат ⁼ '' ←
      404[164847402]                               Результат ≡ Скидка ∙ 65545[165020593] ←
      404[164847892]                               Результат ⁼ '' ←
 48431138[164823047]                             &= ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[164848116]                               Результат ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
      411[164833379]                                 Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164833380]                                   Уточняющий параметр ≡ Код ∙ 331[6] ←
      404[164848781]                               Результат ⁼ , ←
  1507728[164823200]                             Начало многострочного комментария ←
 11010088[164825917]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823579]                               Выражение ←
      404[164848782]                                 Результат ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
      411[164833381]                                   Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
      404[164848783]                                 Результат ⁼ ; ←
      404[164848784]                                 Результат ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
      404[164848802]                                 Результат ⁼ :  Список скидок < ←
      404[164848803]                                 Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[164848804]                                 Результат ⁼ >    Скидка ←
      404[164848805]                                 Результат ≡ tmpstr ∙ 65545[165020611] ←
      404[164848806]                                 Результат ⁼ %,  POS: ←
      116[164827035]                                 Выражение ←
      404[164848807]                                   Результат ≡ POS ∙ 387[1507422] ←
 11010095[164823580]                                     Выражение ←
      404[164848808]                                       Результат ≡ Список скидок ∙ 65545[165020594] ←
  1507510[164823101]                                     Искомая подстрока ←
      404[164848809]                                       Результат ≡ tmpstr ∙ 65545[165020611] ←
 11010073[164823103]                                     Позиция ⁼ 1 ←
  1507729[164823199]                             Конец многострочного комментария ←
 11010099[164823516]                             CONTINUE ←
      116[164827036]                               Выражение ←
      404[164848810]                                 Результат ≡ POS ∙ 387[1507422] ←
 11010095[164823581]                                   Выражение ←
      404[164848811]                                     Результат ≡ Список скидок ∙ 65545[165020594] ←
  1507510[164823102]                                   Искомая подстрока ←
      404[164848812]                                     Результат ≡ tmpstr ∙ 65545[165020611] ←
 11010073[164823104]                                   Позиция ⁼ 1 ←
 48431138[164823048]                             &= ≡ Список скидок ∙ 65545[165020594] ←
      404[164848813]                               Результат ≡ tmpstr ∙ 65545[165020611] ←
      404[164848814]                               Результат ⁼ '%,' ←
  1507728[164823201]                             Начало многострочного комментария ←
 11010088[164825918]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823584]                               Выражение ←
      404[164848815]                                 Результат ⁼          Список скидок < ←
      404[164848816]                                 Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[164848817]                                 Результат ⁼ > ←
  1507729[164823200]                             Конец многострочного комментария ←
 30867467[164823065]                           Выполнить при завершении ←
 11010093[164823156]                             Комментарий •  обрежем запятую на конце, переменная "Скидка" используется как целочисленный буфер ←
 11010080[164827555]                             = ≡ tmp ∙ 65545[165020607] ←
      404[164848818]                               Результат ≡ LEN ∙ 387[1507420] ←
 11010095[164823594]                                 Выражение ←
      404[164848819]                                   Результат ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      406[164823268]                               Вычесть ←
      404[164848820]                               Результат ⁼ 1 ←
 11010080[164827556]                             = ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[164848821]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[164827332]                                 Значения формальных параметров при вызове ←
 32505860[164832390]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[164836253]                                     Выражение ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
 32505860[164832392]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[164836255]                                     Выражение ⁼ 1 ←
 32505860[164832393]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[164836256]                                     Выражение ≡ tmp ∙ 65545[165020607] ←
 11010080[164827557]                             = ≡ tmp ∙ 65545[165020607] ←
      116[164827037]                               Выражение ←
      404[164848822]                                 Результат ≡ LEN ∙ 387[1507420] ←
 11010095[164823595]                                   Выражение ←
      404[164848824]                                     Результат ≡ Список скидок ∙ 65545[165020594] ←
      406[164823269]                                 Вычесть ←
      404[164848825]                                 Результат ⁼ 1 ←
 11010080[164827558]                             = ≡ Список скидок ∙ 65545[165020594] ←
      404[164848826]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[164827333]                                 Значения формальных параметров при вызове ←
 32505860[164832394]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[164836257]                                     Выражение ≡ Список скидок ∙ 65545[165020594] ←
 32505860[164832395]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[164836258]                                     Выражение ⁼ 1 ←
 32505860[164832396]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[164836259]                                     Выражение ≡ tmp ∙ 65545[165020607] ←
 11010080[164827559]                         = ≡ Список поставщиков ∙ 65545[164824796] ←
  1638402[164824132]                           NULL ←
  1507360[164823942]                         Отбор данных (по запросу) • Поставщики ←
  1507673[164823510]                           Ключи оптимизации ←
  1507675[164823690]                             Использовать индекс ∙ 12124204[164823360] ←
  1507676[164823693]                               Уточняющий параметр ≡ ПРОДУКТ ∙ 1507445[54919247] ←
 12124200[164823628]                           From         (Таблицы) ←
 12124204[164823360]                             Таблица ≡ СПЕЦИФИКАЦИЯ ПОСТАВЩИКА ∙ 1507433[43122705] ←
 12124215[164823967]                           Where      (Ограничения на отбор данных) ←
  1507376[164824247]                             Выражение ←
  1507455[164824318]                               Результат ∙ 12124204[164823360] ←
  1507494[164828045]                                 Уточняющий параметр ≡ ПРОДУКТ ∙ 1507443[43122766] ←
  1638473[164824653]                               Равно ←
  1507452[164823908]                               Константа ≡ Продукт из чека ∙ 65545[165020582] ←
      413[164824207]                             И ←
  1507376[164824248]                             Выражение ←
  1507455[164824319]                               Результат ∙ 12124204[164823360] ←
  1507494[164828127]                                 Уточняющий параметр ≡ РЕГИОН ∙ 1507443[40043162] ←
  1638473[164824654]                               Равно ←
  1507452[164823909]                               Константа ≡ ТТ ∙ 65545[165020587] ←
      411[164833382]                                 Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
 12124213[164823555]                           Параметры ←
  1507335[164824685]                             Параметр • Поставщик ∙ 12124204[164823360] ←
  1507494[164828568]                               Уточняющий параметр ≡ ПОСТАВЩИК ∙ 1507443[43122765] ←
 12124224[164823190]                           Group By  (Группировка) ←
  1507533[164823411]                             Группировать по параметру ≡ Поставщик ∙ 1507335[164824685] ←
 30867466[164823702]                           Выполнить после получения записи ←
 11010080[165544745]                             = ≡ Поставщик ∙ 65545[165544278] ←
      404[165545741]                               Результат ≡ Поставщик ∙ 1507335[164824685] ←
 30867470[164826134]                             IF ←
  1638463[164826909]                               Условие ←
      404[164848827]                                 Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[164826100]                               THEN ←
 11010080[164827560]                                 = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164848828]                                   Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164848829]                                   Результат ⁼ , ←
      404[164848830]                                   Результат ≡ Поставщик ∙ 1507335[164824685] ←
      411[164833383]                                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[165544737]                                 = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545711]                                   Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545716]                                   Результат ⁼ , ←
      404[165545717]                                   Результат ≡ Поставщик ∙ 65545[165544278] ←
      411[165544338]                                     Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[165544339]                                       Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[164824222]                               ELSE ←
 11010080[164827561]                                 = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164848831]                                   Результат ≡ Поставщик ∙ 1507335[164824685] ←
      411[164833384]                                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[165544738]                                 = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545720]                                   Результат ≡ Поставщик ∙ 65545[165544278] ←
      411[165544340]                                     Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[165544341]                                       Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867470[164826135]                         IF ←
  1638463[164826910]                           Условие ←
  1638460[164824102]                             НЕ ←
      404[164848832]                             Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[164826101]                           THEN ←
 30867470[170983882]                             IF ←
  1638463[170983988]                               Условие ←
      404[170988299]                                 Результат ≡ Отладка (BUGS) ∙ 249[165478456] ←
 32505862[170984393]                                   Значения формальных параметров при вызове ←
 32505860[170984996]                                     Значение параметра при вызове процедуры/функции ≡ ID ∙ 65545[165480002] ←
   327700[170985364]                                       Выражение ⁼ #545807 ←
 30867472[170983873]                               THEN ←
  1507360[170983569]                                 Отбор данных (по запросу) ≡ Партии с остатком (VPSTOCK) ∙ 12124205[170983641] ←
 30867466[170983570]                                   Выполнить после получения записи ←
 30867470[170983883]                                     IF ←
  1638463[170983989]                                       Условие ←
      404[170988300]                                         Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170983874]                                       THEN ←
 11010080[170984384]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170988301]                                           Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170988302]                                           Результат ⁼ , ←
      404[170988303]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170984002]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170984003]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170984385]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170988304]                                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170988305]                                           Результат ⁼ , ←
      404[170988306]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170984004]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170984005]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170984006]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170983620]                                       ELSE ←
 11010080[170984386]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170988307]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170984007]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170984008]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170984387]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170988308]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170984009]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170984010]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170984011]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[170983472]                                     BREAK ←
 30867473[170983619]                               ELSE ←
  1507360[164823949]                                 Отбор данных (по запросу) ≡ Партии с остатком ∙ 12124205[164823118] ←
 30867466[164823703]                                   Выполнить после получения записи ←
 30867470[164826136]                                     IF ←
  1638463[164826911]                                       Условие ←
      404[164848833]                                         Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[164826102]                                       THEN ←
 11010080[164827562]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164848834]                                           Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164848835]                                           Результат ⁼ , ←
      404[164848836]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[164833385]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[164833386]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[165544739]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545718]                                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545719]                                           Результат ⁼ , ←
      404[165545721]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[165544342]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[165544343]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[165544344]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[164824223]                                       ELSE ←
 11010080[164827563]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164848837]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[164833387]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[164833388]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[165544740]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545724]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[165544345]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[165544346]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[165544347]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[164823250]                                     BREAK ←
 11010080[164827564]                         = ≡ Строка ∙ 65545[655299188] ←
      404[164848838]                           Результат ≡ ТТ ∙ 65545[165020587] ←
      411[164833389]                             Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
      411[164833390]                               Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
      404[164848855]                           Результат ⁼ ; ←
      404[164848856]                           Результат ≡ ТТ ∙ 65545[165020587] ←
      411[164833391]                             Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      404[164848857]                           Результат ⁼ ; ←
      404[164848858]                           Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[164833392]                             Уточняющий параметр ≡ Код ∙ 305[5] ←
      404[164848859]                           Результат ⁼ ; ←
      404[164848860]                           Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[164833393]                             Уточняющий параметр ≡ Наименование ∙ 305[6] ←
      404[164848861]                           Результат ⁼ ; ←
      404[164848862]                           Результат ≡ ЛТ Продано ∙ 65545[165020595] ←
      404[164848882]                           Результат ⁼ ; ←
      404[164848883]                           Результат ≡ ЛТ Выставлено ∙ 65545[165020596] ←
      404[164848884]                           Результат ⁼ ; ←
      404[164849086]                           Результат ≡ avg ∙ 249[165019653] ←
 32505862[164827334]                             Значения формальных параметров при вызове ←
 32505860[164832397]                               Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[165020609] ←
   327700[164836260]                                 Выражение ≡ ЛТ Цена (розн.) ∙ 65545[165020597] ←
 32505860[164832398]                               Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[165020610] ←
   327700[164836261]                                 Выражение ≡ Счётчик операций ∙ 65545[165020602] ←
      404[164849087]                           Результат ⁼ ; ←
      404[164849088]                           Результат ≡ avg ∙ 249[165019653] ←
 32505862[164827335]                             Значения формальных параметров при вызове ←
 32505860[164832399]                               Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[165020609] ←
   327700[164836262]                                 Выражение ≡ ЛТ Цена (факт.) ∙ 65545[165020599] ←
 32505860[164832400]                               Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[165020610] ←
   327700[164836263]                                 Выражение ≡ Счётчик операций ∙ 65545[165020602] ←
      404[164849089]                           Результат ⁼ ; ←
      404[164849090]                           Результат ≡ ЛТ Сумма (факт.) ∙ 65545[165020600] ←
      404[164849091]                           Результат ⁼ ; ←
      404[170927381]                           Результат ≡ Списано бонусов ∙ 65545[170918948] ←
      404[170927322]                           Результат ⁼ ; ←
      404[164849132]                           Результат ≡ ЛТ Убыток ∙ 65545[165020608] ←
      404[164849133]                           Результат ⁼ ; ←
      404[164849134]                           Результат ≡ Счётчик операций ∙ 65545[165020602] ←
      404[164849135]                           Результат ⁼ ; ←
      404[164849136]                           Результат ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[164849137]                           Результат ⁼ ; ←
      404[164849138]                           Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[164849139]                           Результат ⁼ ; ←
      404[164849140]                           Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164849141]                           Результат ⁼ ; ←
      404[165545737]                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545736]                           Результат ⁼ ; ←
      404[164849142]                           Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[164833394]                             Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[164833395]                               Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[164833396]                                 Уточняющий параметр ≡ Наименование ∙ 296[6] ←
  1507410[164823258]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 11010107[164823058]                       Выполнить после обработки блока ≡ ДД ∙ 30867481[164823065] ←
 11010088[164825919]                         ВЫПОЛНИТЬ ≡ Файл.Закрыть ∙ 249[1507341] ←
 39780367[164824294]                           Файл ≡ Файл ∙ 65545[655299187] ←
 30867470[164826137]                         IF ←
  1638463[164826912]                           Условие ←
      404[164850013]                             Результат ≡ Адрес ДД ∙ 65545[164824802] ←
 30867472[164826103]                           THEN ←
 11010088[164825920]                             ВЫПОЛНИТЬ ≡ Передача файла на адреса эл.почты ∙ 127[656081354] ←
 32505862[164827336]                               Значения формальных параметров при вызове ←
 32505860[164832401]                                 Значение параметра при вызове процедуры/функции ≡ Файл имя (ф) ∙ 65545[656084450] ←
   327700[164836264]                                   Выражение ≡ Файл ∙ 65545[655299187] ←
 32505860[164832402]                                 Значение параметра при вызове процедуры/функции ≡ Менять кодировку ∙ 65545[656088207] ←
   327700[164836265]                                   Выражение ⁼ 1 ←
 32505860[164832403]                                 Значение параметра при вызове процедуры/функции ≡ Сообщение письма (ф) ∙ 65545[656084454] ←
   327700[164836266]                                   Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 32505860[164832404]                                 Значение параметра при вызове процедуры/функции ≡ Тема письма (ф) ∙ 65545[656084453] ←
   327700[164836267]                                   Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 12124189[164823112]                                     Выполнить при завершении ←
 39780366[164824202]                                       RETURN ←
      404[164850014]                                         Результат ⁼ 'Отчет уценка за ' ←
      404[164850015]                                         Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   327700[164836268]                                           Выражение ≡ Дата начальная ∙ 381[131078] ←
   131097[164824580]                                           Формат ≡ Дата без времени ∙ 131096[131073] ←
 32505860[164832405]                                 Значение параметра при вызове процедуры/функции ≡ E-mail(ы) получателей  (ф) ∙ 65545[656084452] ←
   327700[164836269]                                   Выражение ≡ Адрес ДД ∙ 65545[164824802] ←
 32505860[164832406]                                 Значение параметра при вызове процедуры/функции ≡ Отправлено ∙ 65545[656084440] ←
   327700[164836270]                                   Выражение ≡ Отправлено ∙ 65545[164825640] ←
 32505860[164832407]                                 Значение параметра при вызове процедуры/функции ≡ E-mail отправителя (ф) ∙ 65545[656084451] ←
   327700[164836271]                                   Выражение ⁼ 'd8office@krasyar.ru' ←
 11010088[164825922]                         ВЫПОЛНИТЬ ≡ Файл.Удалить ∙ 249[1507333] ←
 39780367[164824295]                           Файл ≡ Файл ∙ 65545[655299187] ←
 30867473[164824219]                   ELSE ←
 30867477[165019687]                     Отбор данных из локальной таблицы ≡ Продажи ∙ 30867458[165019675] ←
 30867465[165019695]                       Выполнить при старте ←
 11010080[165807072]                         = ≡ Итого убытков ∙ 65545[165806509] ←
      404[165810030]                           Результат ⁼ 0 ←
 11010080[165021220]                         = ≡ Строка ∙ 65545[655299188] ←
      404[165024929]                           Результат ⁼ ; ←
      404[165024914]                           Результат ⁼ Отчёт 20/30/50 за период с ; ←
      404[165024915]                           Результат ≡ Дата начальная ∙ 381[131078] ←
      404[165024917]                           Результат ⁼  по ; ←
      404[165024916]                           Результат ≡ Дата конечная ∙ 381[131079] ←
  1507410[165019715]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 11010080[165021208]                         = ≡ Строка ∙ 65545[655299188] ←
      404[165024868]                           Результат ⁼ Код магазина; ←
      404[165024858]                           Результат ⁼ Магазин; ←
      404[165024896]                           Результат ⁼ Код; ←
      404[165024897]                           Результат ⁼ Продукт; ←
      404[165024899]                           Результат ⁼ Кол-во (факт.); ←
      404[165024898]                           Результат ⁼ Кол-во (приказ); ←
      404[165024900]                           Результат ⁼ Цена (розн); ←
      404[165024901]                           Результат ⁼ Цена (факт); ←
      404[165024902]                           Результат ⁼ Сумма (факт); ←
      404[170918658]                           Результат ⁼ Списано бонусов; ←
      404[165024903]                           Результат ⁼ Убыток; ←
      404[165024904]                           Результат ⁼ Чеков; ←
      404[165024893]                           Результат ⁼ Список приказов; ←
      404[165024894]                           Результат ⁼ Список скидок; ←
      404[164844958]                           Результат ⁼ Поставщик; ←
      404[165545733]                           Результат ⁼ Возврат; ←
      404[164845328]                           Результат ⁼ Группа; ←
  1507410[165019716]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 30867484[165806082]                       Выполнить перед обработкой блока ≡ ТТ ∙ 30867481[165806082] ←
 11010080[165807093]                         = ≡ Итого по ТТ ∙ 65545[165806510] ←
      404[165810235]                           Результат ⁼ 0 ←
 30867466[165019833]                       Выполнить после получения записи ←
 30867477[165019686]                         Отбор данных из локальной таблицы • собираем приказы  и скидки в строку ≡ Приказы ∙ 30867458[165019676] ←
 30867465[165019696]                           Выполнить при старте ←
 11010080[165021210]                             = ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[165024871]                               Результат ⁼ '' ←
 11010080[165021211]                             = ≡ Список скидок ∙ 65545[165020594] ←
      404[165024880]                               Результат ⁼ '' ←
 30867466[165019832]                           Выполнить после получения записи ←
 11010099[165019720]                             CONTINUE ←
      116[165019994]                               Выражение ←
      116[164826013]                                 Выражение ←
      404[165024892]                                   Результат ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
  1638479[165019722]                                   Не равно ←
      404[165024895]                                   Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      412[164823533]                                 ИЛИ ←
      116[164826014]                                 Выражение ←
      404[164846851]                                   Результат ≡ Приказы : ТТ ∙ 65545[165481410] ←
  1638479[164823680]                                   Не равно ←
      404[164846852]                                   Результат ≡ ТТ ∙ 65545[165020587] ←
 11010080[165021222]                             = ≡ Скидка ∙ 65545[165020593] ←
      404[165024925]                               Результат ≡ Приказы : Скидка ∙ 65545[165481409] ←
 11010080[165021215]                             = ≡ tmpstr ∙ 65545[165020611] ←
      404[165024905]                               Результат ⁼ '' ←
      404[165024926]                               Результат ≡ Скидка ∙ 65545[165020593] ←
      404[165024927]                               Результат ⁼ '' ←
 48431138[165019663]                             &= ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[165024881]                               Результат ≡ Приказы : Код ∙ 65545[165481412] ←
      404[165024882]                               Результат ⁼ , ←
  1507728[165019721]                             Начало многострочного комментария ←
 11010088[165020340]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[165019950]                               Выражение ←
      404[165024951]                                 Результат ≡ Приказы : Продукт (приказы) ∙ 65545[165020606] ←
      411[165021084]                                   Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
      404[165024863]                                 Результат ⁼ ; ←
      404[165024845]                                 Результат ≡ Приказы : Строка приказа ∙ 65545[165020605] ←
      404[165024947]                                 Результат ⁼ :  Список скидок < ←
      404[165024948]                                 Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[165024949]                                 Результат ⁼ >    Скидка ←
      404[165024950]                                 Результат ≡ tmpstr ∙ 65545[165020611] ←
      404[165024943]                                 Результат ⁼ %,  POS: ←
      116[165020002]                                 Выражение ←
      404[165024944]                                   Результат ≡ POS ∙ 387[1507422] ←
 11010095[165019951]                                     Выражение ←
      404[165024945]                                       Результат ≡ Список скидок ∙ 65545[165020594] ←
  1507510[165019668]                                     Искомая подстрока ←
      404[165024946]                                       Результат ≡ tmpstr ∙ 65545[165020611] ←
 11010073[165019674]                                     Позиция ⁼ 1 ←
  1507729[165019721]                             Конец многострочного комментария ←
 11010099[165019721]                             CONTINUE ←
      116[165019995]                               Выражение ←
      404[165024923]                                 Результат ≡ POS ∙ 387[1507422] ←
 11010095[165019949]                                   Выражение ←
      404[165024940]                                     Результат ≡ Список скидок ∙ 65545[165020594] ←
  1507510[165019666]                                   Искомая подстрока ←
      404[165024941]                                     Результат ≡ tmpstr ∙ 65545[165020611] ←
 11010073[165019672]                                   Позиция ⁼ 1 ←
 48431138[165019665]                             &= ≡ Список скидок ∙ 65545[165020594] ←
      404[165024883]                               Результат ≡ tmpstr ∙ 65545[165020611] ←
      404[165024886]                               Результат ⁼ '%,' ←
  1507728[165019749]                             Начало многострочного комментария ←
 11010088[165020327]                             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[165019952]                               Выражение ←
      404[165024953]                                 Результат ⁼          Список скидок < ←
      404[165024954]                                 Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[165024955]                                 Результат ⁼ > ←
  1507729[165019749]                             Конец многострочного комментария ←
 30867467[165019675]                           Выполнить при завершении ←
 11010093[165019719]                             Комментарий •  обрежем запятую на конце, переменная "Скидка" используется как целочисленный буфер ←
 11010080[165021218]                             = ≡ tmp ∙ 65545[165020607] ←
      404[165024907]                               Результат ≡ LEN ∙ 387[1507420] ←
 11010095[165019942]                                 Выражение ←
      404[165024908]                                   Результат ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      406[165019691]                               Вычесть ←
      404[165024909]                               Результат ⁼ 1 ←
 11010080[165021216]                             = ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[165024906]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[165020175]                                 Значения формальных параметров при вызове ←
 32505860[165020710]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[165021298]                                     Выражение ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
 32505860[165020711]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[165021299]                                     Выражение ⁼ 1 ←
 32505860[165020732]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[165021321]                                     Выражение ≡ tmp ∙ 65545[165020607] ←
 11010080[165021219]                             = ≡ tmp ∙ 65545[165020607] ←
      116[165019997]                               Выражение ←
      404[165024910]                                 Результат ≡ LEN ∙ 387[1507420] ←
 11010095[165019945]                                   Выражение ←
      404[165024911]                                     Результат ≡ Список скидок ∙ 65545[165020594] ←
      406[165019692]                                 Вычесть ←
      404[165024912]                                 Результат ⁼ 1 ←
 11010080[165021217]                             = ≡ Список скидок ∙ 65545[165020594] ←
      404[165024913]                               Результат ≡ SubString ∙ 249[1507580] ←
 32505862[165020176]                                 Значения формальных параметров при вызове ←
 32505860[165020733]                                   Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[165021322]                                     Выражение ≡ Список скидок ∙ 65545[165020594] ←
 32505860[165020734]                                   Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[165021323]                                     Выражение ⁼ 1 ←
 32505860[165020735]                                   Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[165021324]                                     Выражение ≡ tmp ∙ 65545[165020607] ←
 11010080[164827507]                         = ≡ Список поставщиков ∙ 65545[164824796] ←
  1638402[164823509]                           NULL ←
  1507360[164823921]                         Отбор данных (по запросу) • Поставщики ←
  1507673[164823507]                           Ключи оптимизации ←
  1507675[164823571]                             Использовать индекс ∙ 12124204[164823319] ←
  1507676[164823573]                               Уточняющий параметр ≡ ПРОДУКТ ∙ 1507445[54919247] ←
 12124200[164823623]                           From         (Таблицы) ←
 12124204[164823319]                             Таблица ≡ СПЕЦИФИКАЦИЯ ПОСТАВЩИКА ∙ 1507433[43122705] ←
 12124215[164823964]                           Where      (Ограничения на отбор данных) ←
  1507376[164824219]                             Выражение ←
  1507455[164824282]                               Результат ∙ 12124204[164823319] ←
  1507494[164827972]                                 Уточняющий параметр ≡ ПРОДУКТ ∙ 1507443[43122766] ←
  1638473[164824621]                               Равно ←
  1507452[164823879]                               Константа ≡ Продукт из чека ∙ 65545[165020582] ←
      413[164824184]                             И ←
  1507376[164824220]                             Выражение ←
  1507455[164824283]                               Результат ∙ 12124204[164823319] ←
  1507494[164827973]                                 Уточняющий параметр ≡ РЕГИОН ∙ 1507443[40043162] ←
  1638473[164824622]                               Равно ←
  1507452[164823889]                               Константа ≡ ТТ ∙ 65545[165020587] ←
      411[164833288]                                 Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
 12124213[164823479]                           Параметры ←
  1507335[164824630]                             Параметр • Поставщик ∙ 12124204[164823319] ←
  1507494[164827974]                               Уточняющий параметр ≡ ПОСТАВЩИК ∙ 1507443[43122765] ←
 12124224[164823188]                           Group By  (Группировка) ←
  1507533[164823409]                             Группировать по параметру ≡ Поставщик ∙ 1507335[164824630] ←
 30867466[164823644]                           Выполнить после получения записи ←
 11010080[165544747]                             = ≡ Поставщик ∙ 65545[165544278] ←
      404[165545742]                               Результат ≡ Поставщик ∙ 1507335[164824630] ←
 30867470[164826118]                             IF ←
  1638463[164826889]                               Условие ←
      404[164844961]                                 Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[164826084]                               THEN ←
 11010080[164827508]                                 = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164844962]                                   Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164844963]                                   Результат ⁼ , ←
      404[164844965]                                   Результат ≡ Поставщик ∙ 1507335[164824630] ←
      411[164833289]                                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[165544741]                                 = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545722]                                   Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545723]                                   Результат ⁼ , ←
      404[165545725]                                   Результат ≡ Поставщик ∙ 65545[165544278] ←
      411[165544348]                                     Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[165544349]                                       Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[164824214]                               ELSE ←
 11010080[164827509]                                 = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164844967]                                   Результат ≡ Поставщик ∙ 1507335[164824630] ←
      411[164833290]                                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[165544742]                                 = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545728]                                   Результат ≡ Поставщик ∙ 65545[165544278] ←
      411[165544350]                                     Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[165544351]                                       Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867470[170983884]                         IF ←
  1638463[170983990]                           Условие ←
  1638460[170983483]                             НЕ ←
      404[170988309]                             Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170983875]                           THEN ←
 30867470[170983885]                             IF ←
  1638463[170983991]                               Условие ←
      404[170988310]                                 Результат ≡ Отладка (BUGS) ∙ 249[165478456] ←
 32505862[170984394]                                   Значения формальных параметров при вызове ←
 32505860[170984997]                                     Значение параметра при вызове процедуры/функции ≡ ID ∙ 65545[165480002] ←
   327700[170985365]                                       Выражение ⁼ #545807 ←
 30867472[170983876]                               THEN ←
  1507360[170983570]                                 Отбор данных (по запросу) ≡ Партии с остатком (VPSTOCK) ∙ 12124205[170983641] ←
 30867466[170983571]                                   Выполнить после получения записи ←
 30867470[170983886]                                     IF ←
  1638463[170983992]                                       Условие ←
      404[170988311]                                         Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170983877]                                       THEN ←
 11010080[170984388]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170988312]                                           Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170988313]                                           Результат ⁼ , ←
      404[170988314]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170984012]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170984013]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170984389]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170988315]                                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170988316]                                           Результат ⁼ , ←
      404[170988317]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170984014]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170984015]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170984016]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170983621]                                       ELSE ←
 11010080[170984390]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170988318]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170984017]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170984018]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170984391]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170988319]                                           Результат ≡ Партия ∙ 1507335[170984090] ←
      411[170984019]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170984020]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170984021]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[170983473]                                     BREAK ←
 30867473[170983622]                               ELSE ←
  1507360[170983571]                                 Отбор данных (по запросу) ≡ Партии с остатком ∙ 12124205[164823118] ←
 30867466[170983572]                                   Выполнить после получения записи ←
 30867470[170983887]                                     IF ←
  1638463[170983993]                                       Условие ←
      404[170988320]                                         Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[170983878]                                       THEN ←
 11010080[170984392]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170988321]                                           Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170988322]                                           Результат ⁼ , ←
      404[170988323]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170984022]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170984023]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170984393]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170988324]                                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170988325]                                           Результат ⁼ , ←
      404[170988326]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170984024]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170984025]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170984026]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[170983623]                                       ELSE ←
 11010080[170984394]                                         = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[170988327]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170984027]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170984028]                                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[170984395]                                         = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[170988328]                                           Результат ≡ Партия ∙ 1507335[164824631] ←
      411[170984029]                                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[170984030]                                               Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[170984031]                                                 Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[170983474]                                     BREAK ←
 30867469[170984077]                         БЛОК • ---- ←
 39780361[170983517]                           ЗАВЕРШИТЬ БЛОК ←
 30867470[164826119]                           IF ←
  1638463[164826890]                             Условие ←
  1638460[164824097]                               НЕ ←
      404[164844964]                               Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[164826085]                             THEN ←
  1507360[164823923]                               Отбор данных (по запросу) ≡ Партии с остатком ∙ 12124205[164823118] ←
 30867466[164823646]                                 Выполнить после получения записи ←
 30867470[164826120]                                   IF ←
  1638463[164826891]                                     Условие ←
      404[164844966]                                       Результат ≡ Список поставщиков ∙ 65545[164824796] ←
 30867472[164826086]                                     THEN ←
 11010080[164827510]                                       = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164844975]                                         Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164844976]                                         Результат ⁼ , ←
      404[164844979]                                         Результат ≡ Партия ∙ 1507335[164824631] ←
      411[164833296]                                           Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[164833293]                                             Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[165544743]                                       = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545726]                                         Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545727]                                         Результат ⁼ , ←
      404[165545729]                                         Результат ≡ Партия ∙ 1507335[164824631] ←
      411[165544352]                                           Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[165544353]                                             Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[165544354]                                               Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 30867473[164824215]                                     ELSE ←
 11010080[164827511]                                       = ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164844977]                                         Результат ≡ Партия ∙ 1507335[164824631] ←
      411[164833294]                                           Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[164833297]                                             Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010080[165544744]                                       = ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545732]                                         Результат ≡ Партия ∙ 1507335[164824631] ←
      411[165544355]                                           Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[165544356]                                             Уточняющий параметр ≡ Семейное положение ∙ 283[14811161] ←
      411[165544357]                                               Уточняющий параметр ≡ Приложение ∙ 331[14614549] ←
 11010100[164823247]                                   BREAK ←
 11010080[165021209]                         = ≡ Строка ∙ 65545[655299188] ←
      404[165024870]                           Результат ≡ ТТ ∙ 65545[165020587] ←
      411[165021109]                             Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
      411[165021110]                               Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
      404[165024864]                           Результат ⁼ ; ←
      404[165024728]                           Результат ≡ ТТ ∙ 65545[165020587] ←
      411[165021108]                             Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      404[165024860]                           Результат ⁼ ; ←
      404[165024727]                           Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[165021079]                             Уточняющий параметр ≡ Код ∙ 305[5] ←
      404[165024879]                           Результат ⁼ ; ←
      404[165024878]                           Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[165021097]                             Уточняющий параметр ≡ Наименование ∙ 305[6] ←
      404[165024726]                           Результат ⁼ ; ←
      404[165024859]                           Результат ≡ ЛТ Продано ∙ 65545[165020595] ←
      404[165024872]                           Результат ⁼ ; ←
      404[165024729]                           Результат ≡ ЛТ Выставлено ∙ 65545[165020596] ←
      404[165024873]                           Результат ⁼ ; ←
      404[165024850]                           Результат ≡ avg ∙ 249[165019653] ←
 32505862[165020186]                             Значения формальных параметров при вызове ←
 32505860[165020739]                               Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[165020609] ←
   327700[165021329]                                 Выражение ≡ ЛТ Цена (розн.) ∙ 65545[165020597] ←
 32505860[165020740]                               Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[165020610] ←
   327700[165021328]                                 Выражение ≡ Счётчик операций ∙ 65545[165020602] ←
      404[165024874]                           Результат ⁼ ; ←
      404[165024861]                           Результат ≡ avg ∙ 249[165019653] ←
 32505862[165020187]                             Значения формальных параметров при вызове ←
 32505860[165020741]                               Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[165020609] ←
   327700[165021330]                                 Выражение ≡ ЛТ Цена (факт.) ∙ 65545[165020599] ←
 32505860[165020742]                               Значение параметра при вызове процедуры/функции ≡ Кол-во ∙ 65545[165020610] ←
   327700[165021331]                                 Выражение ≡ Счётчик операций ∙ 65545[165020602] ←
      404[165024875]                           Результат ⁼ ; ←
      404[165024869]                           Результат ≡ ЛТ Сумма (факт.) ∙ 65545[165020600] ←
      404[165024876]                           Результат ⁼ ; ←
      404[170920255]                           Результат ≡ Списано бонусов ∙ 65545[170918948] ←
      404[170918665]                           Результат ⁼ ; ←
      404[165024862]                           Результат ≡ ЛТ Убыток ∙ 65545[165020608] ←
      404[165024877]                           Результат ⁼ ; ←
      404[165024844]                           Результат ≡ Счётчик операций ∙ 65545[165020602] ←
      404[165024888]                           Результат ⁼ ; ←
      404[165024887]                           Результат ≡ Список приказов ЦС (строка) ∙ 65545[165020604] ←
      404[165024889]                           Результат ⁼ ; ←
      404[165024890]                           Результат ≡ Список скидок ∙ 65545[165020594] ←
      404[164844959]                           Результат ⁼ ; ←
      404[164844960]                           Результат ≡ Список поставщиков ∙ 65545[164824796] ←
      404[164845658]                           Результат ⁼ ; ←
      404[165545739]                           Результат ≡ Список возвратный/невозвратный поставщик ∙ 65545[165544277] ←
      404[165545738]                           Результат ⁼ ; ←
      404[164845655]                           Результат ≡ Продукт из чека ∙ 65545[165020582] ←
      411[164833186]                             Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[164833187]                               Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[164833345]                                 Уточняющий параметр ≡ Наименование ∙ 296[6] ←
  1507410[165019721]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 11010093[165806129]                         Комментарий • заявка 408683. Хотели итоги по отчету. Сделал по аналогии с ускоренным (127[2518-160]) ←
 30867470[165806376]                         IF ←
  1638463[165806471]                           Условие ←
      404[165810031]                             Результат ≡ ЛТ Убыток ∙ 65545[165020608] ←
 30867472[165806375]                           THEN ←
 48431132[165806247]                             += ≡ Итого убытков ∙ 65545[165806509] ←
      404[165810032]                               Результат ≡ ЛТ Убыток ∙ 65545[165020608] ←
 48431132[165806248]                             += ≡ Итого по ТТ ∙ 65545[165806510] ←
      404[165810236]                               Результат ≡ ЛТ Убыток ∙ 65545[165020608] ←
 11010107[165806081]                       Выполнить после обработки блока ≡ ТТ ∙ 30867481[165806082] ←
 11010080[165807092]                         = ≡ Строка ∙ 65545[655299188] ←
      404[165810035]                           Результат ≡ ТТ ∙ 65545[165020587] ←
      411[165806758]                             Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
      411[165807233]                               Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
      404[165810054]                           Результат ⁼ ; ←
      404[165810055]                           Результат ⁼ Итого по ТТ; ←
      404[165810156]                           Результат ⁼ ; ←
      404[165810157]                           Результат ⁼ ; ←
      404[165810158]                           Результат ⁼ ; ←
      404[165810159]                           Результат ⁼ ; ←
      404[165810160]                           Результат ⁼ ; ←
      404[165810161]                           Результат ⁼ ; ←
      404[165810173]                           Результат ⁼ ; ←
      404[165810174]                           Результат ≡ Итого по ТТ ∙ 65545[165806510] ←
      404[165810232]                           Результат ⁼ ; ←
      404[165810233]                           Результат ⁼ ; ←
      404[165810234]                           Результат ≡ CR+LF ∙ 117[1508547] ←
  1507410[165806133]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
 30867467[165806086]                       Выполнить при завершении ←
 11010080[165807088]                         = ≡ Строка ∙ 65545[655299188] ←
      404[165810033]                           Результат ⁼ ; ←
      404[165810034]                           Результат ⁼ Итого; ←
      404[165810036]                           Результат ⁼ ; ←
      404[165810038]                           Результат ⁼ ; ←
      404[165810039]                           Результат ⁼ ; ←
      404[165810040]                           Результат ⁼ ; ←
      404[165810041]                           Результат ⁼ ; ←
      404[165810052]                           Результат ⁼ ; ←
      404[165810053]                           Результат ⁼ ; ←
      404[165810059]                           Результат ≡ Итого убытков ∙ 65545[165806509] ←
      404[165810060]                           Результат ⁼ ; ←
      404[165810061]                           Результат ⁼ ; ←
  1507410[165806132]                         ВЫПОЛНИТЬ БЛОК ≡ Выгрузка строки ∙ 30867469[655295591] ←
  1507728[170918096]                 Начало многострочного комментария ←
  1507729[170918096]                 Конец многострочного комментария ←
  1507729[170918093]             Конец многострочного комментария ←
 30867473[170983616]           ELSE ←
 11010088[170984098]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 387[59375699] ←
 32505862[170984390]               Значения формальных параметров при вызове ←
 32505860[170984993]                 Значение параметра при вызове процедуры/функции ≡ Текст сообщения ∙ 65545[59378874] ←
   327700[170985361]                   Выражение ⁼ Не задано подразделение !!! ←
 11010104[165019675]         Очистить локальную таблицу ≡ Приказы ∙ 30867458[165019676] ←
 11010104[165019674]         Очистить локальную таблицу ≡ Продажи ∙ 30867458[165019675] ←
