ETK\Admin

  1572874[164823051]   Подстановка Сценария (Меню) ≡ Локальное меню : Товар ∙ 113[28835846] ←
      113[170917925]     Сценарий (Меню) • Отправить товар в Centrum ←
      432[170918035]       Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[170918195]         Если истинно выражение ≡ Текущий узел является консолидированной базой ∙ 249[1507768] ←
  1572889[170917899]         Определена роль ≡ Интеграция с SetRetail ∙ 233[165347332] ←
      127[170918243]       Процедура • Отправить товар в Centrum (только ШК) ≡ Добавить объект в очередь отправки ∙ 127[170918132] ←
 32505862[170920037]         Значения формальных параметров при вызове ←
 32505860[170922384]           Значение параметра при вызове процедуры/функции ≡ фп Товар для добавления ∙ 65545[170919629] ←
   327700[170923634]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170922385]           Значение параметра при вызове процедуры/функции ≡ фп Централизованное добавление (def=false) ∙ 65545[170919713] ←
   327700[170923635]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922386]           Значение параметра при вызове процедуры/функции ≡ фп Жестко выгрузить в центрум не проверяя протокол изменений (def=false) ∙ 65545[170919744] ←
   327700[170923636]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922387]           Значение параметра при вызове процедуры/функции ≡ фп Флаг - вручную (def=false) ∙ 65545[170919907] ←
   327700[170923637]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922388]           Значение параметра при вызове процедуры/функции ≡ фп Добавить только ШК ∙ 65545[170919968] ←
   327700[170923638]             Выражение ≡ true ∙ 117[30867468] ←
      127[170918245]       Процедура • Отправить товар в Centrum на все магазины (только аттрибуты) ≡ Добавить объект в очередь отправки ∙ 127[170918132] ←
 32505862[170920039]         Значения формальных параметров при вызове ←
 32505860[170922394]           Значение параметра при вызове процедуры/функции ≡ фп Товар для добавления ∙ 65545[170919629] ←
   327700[170923644]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170922395]           Значение параметра при вызове процедуры/функции ≡ фп Централизованное добавление (def=false) ∙ 65545[170919713] ←
   327700[170923645]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922396]           Значение параметра при вызове процедуры/функции ≡ фп Жестко выгрузить в центрум не проверяя протокол изменений (def=false) ∙ 65545[170919744] ←
   327700[170923646]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922397]           Значение параметра при вызове процедуры/функции ≡ фп Флаг - вручную (def=false) ∙ 65545[170919907] ←
   327700[170923647]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922398]           Значение параметра при вызове процедуры/функции ≡ фп Добавить только атрибуты ∙ 65545[170919970] ←
   327700[170923648]             Выражение ≡ true ∙ 117[30867468] ←
      127[170918244]       Процедура • Отправить товар в Centrum на ВСЕ магазины (только цены) ≡ Добавить объект в очередь отправки ∙ 127[170918132] ←
 32505862[170920038]         Значения формальных параметров при вызове ←
 32505860[170922389]           Значение параметра при вызове процедуры/функции ≡ фп Товар для добавления ∙ 65545[170919629] ←
   327700[170923639]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170922390]           Значение параметра при вызове процедуры/функции ≡ фп Централизованное добавление (def=false) ∙ 65545[170919713] ←
   327700[170923640]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922391]           Значение параметра при вызове процедуры/функции ≡ фп Жестко выгрузить в центрум не проверяя протокол изменений (def=false) ∙ 65545[170919744] ←
   327700[170923641]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922392]           Значение параметра при вызове процедуры/функции ≡ фп Флаг - вручную (def=false) ∙ 65545[170919907] ←
   327700[170923642]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922393]           Значение параметра при вызове процедуры/функции ≡ фп Добавить только цены ∙ 65545[170919969] ←
   327700[170923643]             Выражение ≡ true ∙ 117[30867468] ←
      127[171115068]       Процедура • Отправить товар в Centrum на ВСЕ магазины (только МРЦ) ≡ Добавить объект в очередь отправки ∙ 127[170918132] ←
 32505862[171117807]         Значения формальных параметров при вызове ←
 32505860[171120981]           Значение параметра при вызове процедуры/функции ≡ фп Товар для добавления ∙ 65545[170919629] ←
   327700[171122944]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[171120982]           Значение параметра при вызове процедуры/функции ≡ фп Централизованное добавление (def=false) ∙ 65545[170919713] ←
   327700[171122945]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[171121014]           Значение параметра при вызове процедуры/функции ≡ фп Жестко выгрузить в центрум не проверяя протокол изменений (def=false) ∙ 65545[170919744] ←
   327700[171122972]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[171121015]           Значение параметра при вызове процедуры/функции ≡ фп Флаг - вручную (def=false) ∙ 65545[170919907] ←
   327700[171122973]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[171121016]           Значение параметра при вызове процедуры/функции ≡ фп Добавить только МРЦ ∙ 65545[171118321] ←
   327700[171122974]             Выражение ≡ true ∙ 117[30867468] ←
      127[170918145]       Процедура • Отправить товар в Centrum на ВСЕ магазины (ШК+Цены+Аттрибуты) ≡ Добавить объект в очередь отправки ∙ 127[170918132] ←
 32505862[170919848]         Значения формальных параметров при вызове ←
 32505860[170921960]           Значение параметра при вызове процедуры/функции ≡ фп Товар для добавления ∙ 65545[170919629] ←
   327700[170923232]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170921964]           Значение параметра при вызове процедуры/функции ≡ фп Централизованное добавление (def=false) ∙ 65545[170919713] ←
   327700[170923236]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170921772]           Значение параметра при вызове процедуры/функции ≡ фп Жестко выгрузить в центрум не проверяя протокол изменений (def=false) ∙ 65545[170919744] ←
   327700[170920695]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170921613]           Значение параметра при вызове процедуры/функции ≡ фп Флаг - вручную (def=false) ∙ 65545[170919907] ←
   327700[170922768]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922304]           Значение параметра при вызове процедуры/функции ≡ фп Добавить только ШК ∙ 65545[170919968] ←
   327700[170923549]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922305]           Значение параметра при вызове процедуры/функции ≡ фп Добавить только цены ∙ 65545[170919969] ←
   327700[170923550]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922306]           Значение параметра при вызове процедуры/функции ≡ фп Добавить только атрибуты ∙ 65545[170919970] ←
   327700[170923551]             Выражение ≡ true ∙ 117[30867468] ←
      127[170918073]       Процедура ≡ Товар является маркированным? ∙ 127[170918071] ←
 32505862[170919816]         Значения формальных параметров при вызове ←
 32505860[170921873]           Значение параметра при вызове процедуры/функции ≡ фп Товар ∙ 65545[170920121] ←
   327700[170923111]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[170918276]       Процедура • Передать аттрибуты на тестовый сервер Set ≡ Добавить объект в очередь отправки ∙ 127[170918132] ←
 32505862[170919118]         Значения формальных параметров при вызове ←
 32505860[170922567]           Значение параметра при вызове процедуры/функции ≡ фп Добавляем в тестовую очередь? ∙ 65545[170919502] ←
   327700[170923902]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922572]           Значение параметра при вызове процедуры/функции ≡ фп Товар для добавления ∙ 65545[170919629] ←
   327700[170923907]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170922568]           Значение параметра при вызове процедуры/функции ≡ фп Централизованное добавление (def=false) ∙ 65545[170919713] ←
   327700[170923903]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922569]           Значение параметра при вызове процедуры/функции ≡ фп Жестко выгрузить в центрум не проверяя протокол изменений (def=false) ∙ 65545[170919744] ←
   327700[170923904]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922570]           Значение параметра при вызове процедуры/функции ≡ фп Флаг - вручную (def=false) ∙ 65545[170919907] ←
   327700[170923905]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922571]           Значение параметра при вызове процедуры/функции ≡ фп Добавить только атрибуты ∙ 65545[170919970] ←
   327700[170923906]             Выражение ≡ true ∙ 117[30867468] ←
      432[170918034]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[170918423]           Если истинно выражение ≡ Интеграция с SetRetail ∙ 233[165347332] ←
      127[170918281]       Процедура • Передать ШК на тестовый сервер Set ≡ Добавить объект в очередь отправки ∙ 127[170918132] ←
 32505862[170920127]         Значения формальных параметров при вызове ←
 32505860[170922593]           Значение параметра при вызове процедуры/функции ≡ фп Добавляем в тестовую очередь? ∙ 65545[170919502] ←
   327700[170923928]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922596]           Значение параметра при вызове процедуры/функции ≡ фп Товар для добавления ∙ 65545[170919629] ←
   327700[170923931]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170922598]           Значение параметра при вызове процедуры/функции ≡ фп Централизованное добавление (def=false) ∙ 65545[170919713] ←
   327700[170923933]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922599]           Значение параметра при вызове процедуры/функции ≡ фп Жестко выгрузить в центрум не проверяя протокол изменений (def=false) ∙ 65545[170919744] ←
   327700[170923934]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922600]           Значение параметра при вызове процедуры/функции ≡ фп Флаг - вручную (def=false) ∙ 65545[170919907] ←
   327700[170923935]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922601]           Значение параметра при вызове процедуры/функции ≡ фп Добавить только ШК ∙ 65545[170919968] ←
   327700[170923936]             Выражение ≡ true ∙ 117[30867468] ←
      432[170918038]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[170918433]           Если истинно выражение ≡ Интеграция с SetRetail ∙ 233[165347332] ←
      127[171115069]       Процедура • Передать МРЦ на тестовый сервер Set ≡ Добавить объект в очередь отправки ∙ 127[170918132] ←
 32505862[171117808]         Значения формальных параметров при вызове ←
 32505860[171121022]           Значение параметра при вызове процедуры/функции ≡ фп Добавляем в тестовую очередь? ∙ 65545[170919502] ←
   327700[171122995]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[171121017]           Значение параметра при вызове процедуры/функции ≡ фп Товар для добавления ∙ 65545[170919629] ←
   327700[171122975]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[171121018]           Значение параметра при вызове процедуры/функции ≡ фп Централизованное добавление (def=false) ∙ 65545[170919713] ←
   327700[171122976]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[171121019]           Значение параметра при вызове процедуры/функции ≡ фп Жестко выгрузить в центрум не проверяя протокол изменений (def=false) ∙ 65545[170919744] ←
   327700[171122977]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[171121020]           Значение параметра при вызове процедуры/функции ≡ фп Флаг - вручную (def=false) ∙ 65545[170919907] ←
   327700[171122978]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[171121021]           Значение параметра при вызове процедуры/функции ≡ фп Добавить только МРЦ ∙ 65545[171118321] ←
   327700[171122994]             Выражение ≡ true ∙ 117[30867468] ←
      432[171114645]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[171115966]           Если истинно выражение ≡ Интеграция с SetRetail ∙ 233[165347332] ←
      127[170918295]       Процедура • Передать цену на тестовый сервер Set ≡ Добавить объект в очередь отправки ∙ 127[170918132] ←
 32505862[170920165]         Значения формальных параметров при вызове ←
 32505860[170922658]           Значение параметра при вызове процедуры/функции ≡ фп Добавляем в тестовую очередь? ∙ 65545[170919502] ←
   327700[170924006]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922659]           Значение параметра при вызове процедуры/функции ≡ фп Товар для добавления ∙ 65545[170919629] ←
   327700[170924007]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170922660]           Значение параметра при вызове процедуры/функции ≡ фп Централизованное добавление (def=false) ∙ 65545[170919713] ←
   327700[170924008]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922661]           Значение параметра при вызове процедуры/функции ≡ фп Жестко выгрузить в центрум не проверяя протокол изменений (def=false) ∙ 65545[170919744] ←
   327700[170924009]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922662]           Значение параметра при вызове процедуры/функции ≡ фп Флаг - вручную (def=false) ∙ 65545[170919907] ←
   327700[170924010]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922663]           Значение параметра при вызове процедуры/функции ≡ фп Добавить только цены ∙ 65545[170919969] ←
   327700[170924011]             Выражение ≡ true ∙ 117[30867468] ←
      432[170918043]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[170918211]           Если истинно выражение ≡ Интеграция с SetRetail ∙ 233[165347332] ←
      113[164823060]     Сценарий (Меню) ≡ Печать ценников и этикеток ∙ 113[144179206] ←
      127[170918272]       Процедура • Печатаем шаблон ценник+ку? ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
      432[170918022]         Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1507508[170918418]           Если истинно выражение ≡ Текущий пользователь - Жуков ∙ 117[165347329] ←
  1507508[171115852]           Если истинно выражение ≡ Текущий пользователь - Шубин ∙ 117[165806084] ←
 32505863[170918082]         Локальные переменные ←
    65545[170920337]           Локальная переменная • Результат ≡ bool ∙ 107[1507344] ←
 30867463[170918300]         Выполнить действия ←
 11010080[170924180]           = ≡ Результат ∙ 65545[170920337] ←
      404[170937825]             Результат ≡ Печатаем шаблон КУ+ценник?  ∙ 249[172621826] ←
 32505862[170920125]               Значения формальных параметров при вызове ←
 32505860[170922552]                 Значение параметра при вызове процедуры/функции ≡ ~ фп Товар ∙ 65545[172622023] ←
   327700[170923882]                   Выражение ≡ <<Продукт>> ∙ 367[3] ←
 11010088[170919950]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170918799]             Выражение ←
      404[170937823]               Результат ⁼ 'Результат = ' ←
      404[170937824]               Результат ≡ Результат ∙ 65545[170920337] ←
      127[164823323]       Процедура • Печать ценника-стикера ≡ Печать ценника по продукту ∙ 127[164298803] ←
      432[170918012]         Использование (в режиме выполнения) ≡ Нет, только если все условия соблюдены ∙ 534[4] ←
  1507508[170918256]           Если истинно выражение ≡ Отладка (BUGS) ∙ 249[165478456] ←
 32505862[170918548]             Значения формальных параметров при вызове ←
 32505860[170919190]               Значение параметра при вызове процедуры/функции ≡ ID ∙ 65545[165480002] ←
   327700[170918203]                 Выражение ⁼ #stickersona4_2 ←
  1507508[170918290]           Если истинно выражение ≡ Магазин входит в список тестируемых (MegaPricetags) ∙ 249[170917914] ←
      127[164823334]       Процедура • Печать ценника-стикера на будущую акцию ≡ Печать ценника по продукту ∙ 127[164298803] ←
      432[170918013]         Использование (в режиме выполнения) ≡ Нет, только если все условия соблюдены ∙ 534[4] ←
  1507508[170918309]           Если истинно выражение ≡ Отладка (BUGS) ∙ 249[165478456] ←
 32505862[170918549]             Значения формальных параметров при вызове ←
 32505860[170919191]               Значение параметра при вызове процедуры/функции ≡ ID ∙ 65545[165480002] ←
   327700[170919473]                 Выражение ⁼ #stickersona4_2 ←
  1507508[170918310]           Если истинно выражение ≡ Магазин входит в список тестируемых (MegaPricetags) ∙ 249[170917914] ←
 32505862[164824808]         Значения формальных параметров при вызове ←
 32505860[164826850]           Значение параметра при вызове процедуры/функции ≡ ~Дней до акции ∙ 65545[164302996] ←
   327700[164828040]             Выражение ⁼ 4 ←
      127[170918162]       Процедура • Печать ценника-стикера (А4) ≡ Mega pricetags  ∙ 127[170917890] ←
      432[170918005]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[170918269]           Если истинно выражение ≡ Отладка (BUGS) ∙ 249[165478456] ←
 32505862[170917961]             Значения формальных параметров при вызове ←
 32505860[170918333]               Значение параметра при вызове процедуры/функции ≡ ID ∙ 65545[165480002] ←
   327700[170917989]                 Выражение ⁼ #stickersona4_2 ←
  1507508[170918274]           Если истинно выражение ≡ Магазин входит в список тестируемых (MegaPricetags) ∙ 249[170917914] ←
 32505862[170917963]         Значения формальных параметров при вызове ←
 32505860[170917952]           Значение параметра при вызове процедуры/функции ≡ фп Формат ценника (0-стикер; 1-Бумажный (КЯ-А4, Д-А5)) ∙ 65545[170917911] ←
   327700[170918027]             Выражение ⁼ 0 ←
 32505860[170918334]           Значение параметра при вызове процедуры/функции ≡ фп Вручную? (bool) (def=false) ∙ 65545[170919801] ←
   327700[170917993]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170918336]           Значение параметра при вызове процедуры/функции ≡ фп Товар вход ∙ 65545[170917899] ←
   327700[170917996]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[170918163]       Процедура • Печать ценника-стикера на будущую акцию (А4) ≡ Mega pricetags  ∙ 127[170917890] ←
      432[170918006]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[170918273]           Если истинно выражение ≡ Текущий узел - КЯ ∙ 249[165347329] ←
  1507508[170918272]           Если истинно выражение ≡ Отладка (BUGS) ∙ 249[165478456] ←
 32505862[170919882]             Значения формальных параметров при вызове ←
 32505860[170920350]               Значение параметра при вызове процедуры/функции ≡ ID ∙ 65545[165480002] ←
   327700[170918123]                 Выражение ⁼ #stickersona4_2 ←
 32505862[170919883]         Значения формальных параметров при вызове ←
 32505860[170920351]           Значение параметра при вызове процедуры/функции ≡ фп Формат ценника (0-стикер; 1-Бумажный (КЯ-А4, Д-А5)) ∙ 65545[170917911] ←
   327700[170918519]             Выражение ⁼ 0 ←
 32505860[170920502]           Значение параметра при вызове процедуры/функции ≡ фп Вручную? (bool) (def=false) ∙ 65545[170919801] ←
   327700[170918520]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170920503]           Значение параметра при вызове процедуры/функции ≡ фп Товар вход ∙ 65545[170917899] ←
   327700[170918521]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170921994]           Значение параметра при вызове процедуры/функции ≡ фп Печать на будущую акцию (def=false) ∙ 65545[170918044] ←
   327700[170918522]             Выражение ≡ true ∙ 117[30867468] ←
      127[171114987]       Процедура • Печать ценника-стикера (тест, jpg) ≡ Печать ценника-стикера (тест) ∙ 127[171114985] ←
 32505862[171114861]         Значения формальных параметров при вызове ←
 32505860[171119482]           Значение параметра при вызове процедуры/функции ≡ ~Товары ∙ 65545[171117574] ←
   327700[171120637]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[171119484]           Значение параметра при вызове процедуры/функции ≡ ~Печать на термопринтер (def = 0) ∙ 65545[171117569] ←
   327700[171120685]             Выражение ⁼ 1 ←
      432[171114617]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[171115644]           Если истинно выражение ≡ Текущий пользователь - Шубин ∙ 117[165806084] ←
      127[171115121]       Процедура • Добавить в очередь печати ≡ Создать HTML-файл ценника и добавить в очередь печати ∙ 127[171115119] ←
 32505862[171117959]         Значения формальных параметров при вызове ←
  1507727[171114601]           <Наследуемые значения> ←
 32505860[171121323]           Значение параметра при вызове процедуры/функции ≡ ~Товары ∙ 65545[171117574] ←
   327700[171123404]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[171120773]           Значение параметра при вызове процедуры/функции ≡ ~Автоматически (def = 0) ∙ 65545[171117571] ←
   327700[171123058]             Выражение ⁼ 1 ←
      432[171114655]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[171115744]           Если истинно выражение ≡ Текущий пользователь - Шубин ∙ 117[165806084] ←
      127[171115064]       Процедура • Печать ценника-стикера (тест, jpg, отладка) ≡ Печать ценника-стикера (тест) ∙ 127[171114985] ←
 32505862[171117799]         Значения формальных параметров при вызове ←
 32505860[171120965]           Значение параметра при вызове процедуры/функции ≡ ~Товары ∙ 65545[171117574] ←
   327700[171122917]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[171120966]           Значение параметра при вызове процедуры/функции ≡ ~debug (def = 0) ∙ 65545[171117167] ←
   327700[171122918]             Выражение ⁼ 1 ←
 32505860[171120967]           Значение параметра при вызове процедуры/функции ≡ ~Показать на экран (def = Нет) ∙ 65545[171117583] ←
   327700[171122919]             Выражение ≡ Да ∙ 131203075[131203074] ←
 32505860[171120968]           Значение параметра при вызове процедуры/функции ≡ ~Печать на термопринтер (def = 0) ∙ 65545[171117569] ←
   327700[171122920]             Выражение ⁼ 1 ←
      432[171114641]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[171115932]           Если истинно выражение ≡ Текущий пользователь - Шубин ∙ 117[165806084] ←
      127[171114986]       Процедура • Печать ценника-стикера (тест, pdf) ≡ Печать ценника-стикера (тест) ∙ 127[171114985] ←
 32505862[171114860]         Значения формальных параметров при вызове ←
 32505860[171119430]           Значение параметра при вызове процедуры/функции ≡ ~Товары ∙ 65545[171117574] ←
   327700[171120627]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[171119481]           Значение параметра при вызове процедуры/функции ≡ ~Печать на термопринтер (def = 0) ∙ 65545[171117569] ←
   327700[171120636]             Выражение ⁼ 1 ←
 32505860[171120940]           Значение параметра при вызове процедуры/функции ≡ ~Как печатать (0 - jpg, 1 - pdf) (def = 0) ∙ 65545[171117164] ←
   327700[171122891]             Выражение ⁼ 1 ←
      432[171114616]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[171115645]           Если истинно выражение ≡ Программисты (НЕ ДОБАВЛЯТЬ СЮДА НИКОГО, КРОМЕ ПРОГРАММИСТОВ) ∙ 117[164823615] ←
      127[171115061]       Процедура • Печать ценника-стикера (тест, pdf, отладка) ≡ Печать ценника-стикера (тест) ∙ 127[171114985] ←
 32505862[171117798]         Значения формальных параметров при вызове ←
 32505860[171120960]           Значение параметра при вызове процедуры/функции ≡ ~Товары ∙ 65545[171117574] ←
   327700[171122912]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[171120963]           Значение параметра при вызове процедуры/функции ≡ ~debug (def = 0) ∙ 65545[171117167] ←
   327700[171122915]             Выражение ⁼ 1 ←
 32505860[171120964]           Значение параметра при вызове процедуры/функции ≡ ~Показать на экран (def = Нет) ∙ 65545[171117583] ←
   327700[171122916]             Выражение ≡ Да ∙ 131203075[131203074] ←
 32505860[171120961]           Значение параметра при вызове процедуры/функции ≡ ~Печать на термопринтер (def = 0) ∙ 65545[171117569] ←
   327700[171122913]             Выражение ⁼ 1 ←
 32505860[171120962]           Значение параметра при вызове процедуры/функции ≡ ~Как печатать (0 - jpg, 1 - pdf) (def = 0) ∙ 65545[171117164] ←
   327700[171122914]             Выражение ⁼ 1 ←
      432[171114640]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[171115931]           Если истинно выражение ≡ Программисты (НЕ ДОБАВЛЯТЬ СЮДА НИКОГО, КРОМЕ ПРОГРАММИСТОВ) ∙ 117[164823615] ←
      127[170917983]       Процедура • Печать качественного удостоверения_ТЕСТИРУЕТСЯ ≡ Печать КУ vers 2020_test ∙ 127[171573317] ←
      432[171573256]         Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1507508[171573463]           Если истинно выражение ≡ Текущий пользователь - Сериков ∙ 117[170918032] ←
  1507508[172884023]           Если истинно выражение ≡ Текущий пользователь - Осипов ∙ 117[656015364] ←
 32505862[170918682]         Значения формальных параметров при вызове ←
 32505860[170919461]           Значение параметра при вызове процедуры/функции ≡ фп Товары in ∙ 65545[171573570] ←
   327700[170920011]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[171573318]       Процедура • Печать качественного удостоверения ≡ Печать КУ vers 2020 ∙ 127[170917977] ←
 32505862[171574225]         Значения формальных параметров при вызове ←
 32505860[171574956]           Значение параметра при вызове процедуры/функции ≡ фп Товары in ∙ 65545[170918418] ←
   327700[171577552]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[171115161]       Процедура • Печать качественного удостоверения (Д04) ≡ Печать КУ vers 2020 ∙ 127[170917977] ←
      432[171114660]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[171116044]           Если истинно выражение ≡ Текущий пользователь - Шубин ∙ 117[165806084] ←
 32505862[171117966]         Значения формальных параметров при вызове ←
 32505860[171121415]           Значение параметра при вызове процедуры/функции ≡ фп Товары in ∙ 65545[170918418] ←
   327700[171123584]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[171121416]           Значение параметра при вызове процедуры/функции ≡ фп Подразделение (ТТ) ∙ 65545[170918447] ←
   327700[171123585]             Выражение ⁼ 4:0:0:1087467 ←
      127[171115162]       Процедура • Печать качественного удостоверения (Д10) ≡ Печать КУ vers 2020 ∙ 127[170917977] ←
      432[171114661]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[171116045]           Если истинно выражение ≡ Текущий пользователь - Шубин ∙ 117[165806084] ←
 32505862[171117968]         Значения формальных параметров при вызове ←
 32505860[171121418]           Значение параметра при вызове процедуры/функции ≡ фп Товары in ∙ 65545[170918418] ←
   327700[171123587]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[171121419]           Значение параметра при вызове процедуры/функции ≡ фп Подразделение (ТТ) ∙ 65545[170918447] ←
   327700[171123588]             Выражение ⁼ 4:0:0:1093219 ←
      127[172621894]       Процедура • Печать качественного удостоверения без второй наклейки с PLU ≡ Печать КУ vers 2020 ∙ 127[170917977] ←
 32505862[172622057]         Значения формальных параметров при вызове ←
 32505860[172622245]           Значение параметра при вызове процедуры/функции ≡ фп PLU для КУ ∙ 65545[172622281] ←
   327700[172622491]             Выражение ≡ false ∙ 117[30867469] ←
 32505860[172622244]           Значение параметра при вызове процедуры/функции ≡ фп Товары in ∙ 65545[170918418] ←
   327700[172622490]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[170918192]       Процедура • Печать качественного удостоверения на будущую акцию ≡ Печать КУ vers 2020 ∙ 127[170917977] ←
      432[170918028]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[170918329]           Если истинно выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[170918235]             Выполнить действия ←
 30867470[170919506]               IF ←
  1638463[170920058]                 Условие ←
      116[170921224]                   Выражение ←
      404[170928387]                     Результат ≡ Печатаем шаблон КУ+ценник?  ∙ 249[172621826] ←
 32505862[170919109]                       Значения формальных параметров при вызове ←
 32505860[170920348]                         Значение параметра при вызове процедуры/функции ≡ ~ фп Товар ∙ 65545[172622023] ←
   327700[170921175]                           Выражение ≡ <<Продукт>> ∙ 367[3] ←
  1638473[170920000]                     Равно ←
      404[170928388]                     Результат ≡ true ∙ 117[30867468] ←
 30867472[170919617]                 THEN ←
 39780366[170918314]                   RETURN ←
      404[170934381]                     Результат ≡ true ∙ 117[30867468] ←
 30867473[170918375]                 ELSE ←
 39780366[170918315]                   RETURN ←
      404[170934382]                     Результат ≡ false ∙ 117[30867469] ←
 32505862[170919987]         Значения формальных параметров при вызове ←
 32505860[170922269]           Значение параметра при вызове процедуры/функции ≡ фп Товары in ∙ 65545[170918418] ←
   327700[170923510]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170922270]           Значение параметра при вызове процедуры/функции ≡ фп Кол-во дней до акции ∙ 65545[170919925] ←
   327700[170923511]             Выражение ⁼ 3 ←
      127[170918131]       Процедура • Печать качественного удостоверения (А4) ≡ Mega pricetags  ∙ 127[170917890] ←
      432[170918014]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[170918010]           Если истинно выражение ≡ Отладка (BUGS) ∙ 249[165478456] ←
 32505862[170919925]             Значения формальных параметров при вызове ←
 32505860[170919411]               Значение параметра при вызове процедуры/функции ≡ ID ∙ 65545[165480002] ←
   327700[170920005]                 Выражение ⁼ #A4Quality ←
  1507508[170918024]           Если истинно выражение ≡ Магазин входит в список тестируемых (MegaPricetags + MiniCoupons) ∙ 249[170917916] ←
 32505862[170918658]         Значения формальных параметров при вызове ←
 32505860[170922129]           Значение параметра при вызове процедуры/функции ≡ фп Товар вход ∙ 65545[170917899] ←
   327700[170923434]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170919026]           Значение параметра при вызове процедуры/функции ≡ фп Печатаем ценник (def=true) ∙ 65545[170919842] ←
   327700[170918281]             Выражение ≡ false ∙ 117[30867469] ←
 32505860[170922127]           Значение параметра при вызове процедуры/функции ≡ фп Печатаем КУ (def=false) ∙ 65545[170919843] ←
   327700[170923432]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922137]           Значение параметра при вызове процедуры/функции ≡ фп Формат ценника (0-стикер; 1-Бумажный (КЯ-А4, Д-А5)) ∙ 65545[170917911] ←
   327700[170923443]             Выражение ⁼ 0 ←
 32505860[170922128]           Значение параметра при вызове процедуры/функции ≡ фп Вручную? (bool) (def=false) ∙ 65545[170919801] ←
   327700[170923433]             Выражение ≡ true ∙ 117[30867468] ←
      127[172097592]       Процедура ≡ Печать срок годн. кондит. цех ∙ 127[172097591] ←
      127[170918116]       Процедура • Найти комплект ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
      432[170917968]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[170918079]           Если истинно выражение ≡ Текущий пользователь - Жуков ∙ 117[165347329] ←
 32505863[170917987]         Локальные переменные ←
    65545[170919208]           Локальная переменная • Документ ≡ Документ ∙ 107[8] ←
 30867463[170918127]         Выполнить действия ←
 11010080[170922172]           = ≡ Документ ∙ 65545[170919208] ←
  1638402[170918467]             NULL ←
 11010088[170919188]           ВЫПОЛНИТЬ ≡ Найти комплект для текущего продукта ∙ 127[170918111] ←
 32505862[170919365]             Значения формальных параметров при вызове ←
 32505860[170920858]               Значение параметра при вызове процедуры/функции ≡ фп Документ комплекта (возврат) ∙ 65545[170919203] ←
   327700[170921817]                 Выражение ≡ Документ ∙ 65545[170919208] ←
 32505860[170920859]               Значение параметра при вызове процедуры/функции ≡ фп Продукт ∙ 65545[170919204] ←
   327700[170921818]                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
 11010088[170919189]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170918434]             Выражение ←
      404[170930848]               Результат ≡ Документ ∙ 65545[170919208] ←
      103[164823160]       Команда ≡ ------------ ∙ 102[57343] ←
      127[164823325]       Процедура • Печать паллетного ценника ≡ Печать ценника А4 (КЯ) ∙ 127[164298755] ←
 32505862[164824802]         Значения формальных параметров при вызове ←
 32505860[164826839]           Значение параметра при вызове процедуры/функции ≡ ~Тип ценника (1-сборный ценник / 2 - одиночный ценник) ∙ 65545[164299270] ←
   327700[164828029]             Выражение ⁼ 2 ←
 32505860[164826840]           Значение параметра при вызове процедуры/функции ≡ ~Список выбранных продуктов ∙ 65545[164299297] ←
   327700[164828030]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
      432[164823072]         Использование (в режиме выполнения) ≡ Нет, только если все условия соблюдены ∙ 534[4] ←
  1507508[164823506]           Если истинно выражение ≡ Текущий узел - БД с несколькими ТТ (Д1000, Э1001) ∙ 249[164364485] ←
      127[171114963]       Процедура • Печать нового паллетного ценника (jpg) ≡ Печать паллетного ценника КЯ ∙ 127[171114961] ←
 32505862[171117071]         Значения формальных параметров при вызове ←
 32505860[171119420]           Значение параметра при вызове процедуры/функции ≡ ~Товары ∙ 65545[171117574] ←
   327700[171121075]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
      432[171114615]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[171115549]           Если истинно выражение ≡ Текущий пользователь - Шубин ∙ 117[165806084] ←
      127[171115066]       Процедура • Печать нового паллетного ценника (pdf) ≡ Печать паллетного ценника КЯ ∙ 127[171114961] ←
 32505862[171117801]         Значения формальных параметров при вызове ←
 32505860[171119421]           Значение параметра при вызове процедуры/функции ≡ ~Товары ∙ 65545[171117574] ←
   327700[171121076]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[171120969]           Значение параметра при вызове процедуры/функции ≡ ~Как печатать (0 - jpg, 1 - pdf) (def = 0) ∙ 65545[171117164] ←
   327700[171122921]             Выражение ⁼ 1 ←
      432[171114643]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[171115964]           Если истинно выражение ≡ Текущий пользователь - Шубин ∙ 117[165806084] ←
      127[171115065]       Процедура • Печать нового паллетного ценника (отладка) ≡ Печать паллетного ценника КЯ ∙ 127[171114961] ←
 32505862[171117800]         Значения формальных параметров при вызове ←
 32505860[171119431]           Значение параметра при вызове процедуры/функции ≡ ~Товары ∙ 65545[171117574] ←
   327700[171120628]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[171119483]           Значение параметра при вызове процедуры/функции ≡ ~debug (def = 0) ∙ 65545[171117167] ←
   327700[171120684]             Выражение ⁼ 1 ←
      432[171114642]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[171115963]           Если истинно выражение ≡ Текущий пользователь - Шубин ∙ 117[165806084] ←
      127[171573376]       Процедура • Печать стикера дефростации ≡ Печать стикеров дефростации(TSC/ZEBRA) ∙ 127[171573372] ←
 32505862[171574315]         Значения формальных параметров при вызове ←
 32505860[171575281]           Значение параметра при вызове процедуры/функции ≡ фп PRICE*.TXT ∙ 65545[656089094] ←
   327700[171578046]             Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 32505863[171573305]               Локальные переменные ←
    65545[171574189]                 Локальная переменная • имя_файла ≡ Длинная строка (120) ∙ 107[7602177] ←
 30867463[171573432]               Выполнить действия ←
 11010080[171575585]                 = ≡ имя_файла ∙ 65545[171574189] ←
      404[171582643]                   Результат ⁼ 'defrost_sticker_' ←
      404[171582644]                   Результат ∙ 249[30867598] ←
      404[171582645]                   Результат ⁼ '.txt' ←
 12124189[171573269]               Выполнить при завершении ←
 39780366[171573412]                 RETURN ≡ имя_файла ∙ 65545[171574189] ←
 32505860[171575282]           Значение параметра при вызове процедуры/функции ≡ ФП Продукт ИД ∙ 65545[171574175] ←
   327700[171578047]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
      411[171576666]               Уточняющий параметр ≡ Продукт ∙ 305[1] ←
      432[171573253]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[171573511]           Если истинно выражение ≡ BUGS: defrost_print  ∙ 117[171573451] ←
 32505862[172490755]             Значения формальных параметров при вызове ←
      127[164823335]       Процедура • Печать паллетного ценника на будущую акцию ≡ Печать ценника А4 (КЯ) ∙ 127[164298755] ←
      432[165347371]         Использование (в режиме выполнения) ≡ Нет, только если все условия соблюдены ∙ 534[4] ←
  1507508[165347375]           Если истинно выражение ≡ Текущий узел - БД с несколькими ТТ (Д1000, Э1001) ∙ 249[164364485] ←
 32505862[164824809]         Значения формальных параметров при вызове ←
 32505860[164826851]           Значение параметра при вызове процедуры/функции ≡ ~Тип ценника (1-сборный ценник / 2 - одиночный ценник) ∙ 65545[164299270] ←
   327700[164828041]             Выражение ⁼ 2 ←
 32505860[164826852]           Значение параметра при вызове процедуры/функции ≡ ~Список выбранных продуктов ∙ 65545[164299297] ←
   327700[164828042]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826853]           Значение параметра при вызове процедуры/функции ≡ ~Колво дней до акции ∙ 65545[164303325] ←
   327700[164828043]             Выражение ⁼ 3 ←
      127[165347580]       Процедура ≡ Определить формат ценника для печати 2.0 ∙ 127[165347579] ←
 32505862[165349385]         Значения формальных параметров при вызове ←
 32505860[165351230]           Значение параметра при вызове процедуры/функции ≡ ~ ф.п. товары на вход ∙ 65545[165349694] ←
   327700[165352469]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
      432[165347466]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[165347670]           Если истинно выражение ≡ Текущий пользователь - Жуков ∙ 117[165347329] ←
      127[165347583]       Процедура • Печать ценника АВТО-ФОРМАТ ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
      432[165347469]         Использование (в режиме выполнения) ≡ Нет ∙ 534[40566786] ←
 32505863[165347484]         Локальные переменные ←
    65545[165349800]           Локальная переменная • Формат ценника ≡ Объект ∙ 107[19] ←
    65545[165349795]           Локальная переменная • Товар на А4 ≡ Продукт ∙ 107[7] ←
    65545[165349796]           Локальная переменная • Товар на А5 ≡ Продукт ∙ 107[7] ←
    65545[165349797]           Локальная переменная • Товар на 1/2 А5 ≡ Продукт ∙ 107[7] ←
    65545[165349798]           Локальная переменная • Товар на стикер ≡ Продукт ∙ 107[7] ←
    65545[165349799]           Локальная переменная • Товар на ручной выбор А5/стикер ≡ Продукт ∙ 107[7] ←
    65545[165350365]           Локальная переменная • Товар на ручной выбор half А5/стикер ≡ Продукт ∙ 107[7] ←
 30867463[165347617]         Выполнить действия ←
 11010088[165348986]           ВЫПОЛНИТЬ ≡ Определить формат ценника для печати 2.0 ∙ 127[165347579] ←
 32505862[165349427]             Значения формальных параметров при вызове ←
 32505860[165351457]               Значение параметра при вызове процедуры/функции ≡ ~ ф.п. товары на вход ∙ 65545[165349694] ←
   327700[165352614]                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[165351458]               Значение параметра при вызове процедуры/функции ≡ Множество продуктов А4~ ∙ 65545[165349770] ←
   327700[165352615]                 Выражение ≡ Товар на А4 ∙ 65545[165349795] ←
 32505860[165351459]               Значение параметра при вызове процедуры/функции ≡ Множество продуктов А5~ ∙ 65545[165349771] ←
   327700[165352616]                 Выражение ≡ Товар на А5 ∙ 65545[165349796] ←
 32505860[165351460]               Значение параметра при вызове процедуры/функции ≡ Множество продуктов 1/2 А5~ ∙ 65545[165349772] ←
   327700[165352617]                 Выражение ≡ Товар на 1/2 А5 ∙ 65545[165349797] ←
 32505860[165351461]               Значение параметра при вызове процедуры/функции ≡ Множество продуктов стикер~ ∙ 65545[165349773] ←
   327700[165352618]                 Выражение ≡ Товар на стикер ∙ 65545[165349798] ←
 32505860[165351462]               Значение параметра при вызове процедуры/функции ≡ Множество продуктов ручной выбор (А5/стикер) ~ ∙ 65545[165349774] ←
   327700[165352619]                 Выражение ≡ Товар на ручной выбор А5/стикер ∙ 65545[165349799] ←
 32505860[165352388]               Значение параметра при вызове процедуры/функции ≡ Множество продуктов ручной выбор (halfА5/стикер) ~ ∙ 65545[165350361] ←
   327700[165354051]                 Выражение ≡ Товар на ручной выбор half А5/стикер ∙ 65545[165350365] ←
 30867470[165348587]           IF ←
  1638463[165348990]             Условие ←
      404[165365407]               Результат ≡ Товар на А4 ∙ 65545[165349795] ←
 30867472[165348581]             THEN ←
 11010088[165349026]               ВЫПОЛНИТЬ ≡ Печать ценника А4 и А5 (Дискаунтер) ∙ 127[165347387] ←
 32505862[165349480]                 Значения формальных параметров при вызове ←
 32505860[165351599]                   Значение параметра при вызове процедуры/функции ≡ фп Продукты in ∙ 65545[165347765] ←
   327700[165352771]                     Выражение ≡ Товар на А4 ∙ 65545[165349795] ←
 32505860[165351602]                   Значение параметра при вызове процедуры/функции ≡ фп Шаблон (-1 - обычный А6, 0 - паллетный А4, 1 - паллетный А5, 2 - Так просто А4, 3 - так просто А5, 4 - кармашек А4, 5 - уценка А4, 6 - уценка А5, 7 - А4 ПРОМО, 8 - А5 ПРОМО) ∙ 65545[165347771] ←
   327700[165352774]                     Выражение ⁼ 0 ←
 32505860[165351616]                   Значение параметра при вызове процедуры/функции ≡ фп ТТ in ∙ 65545[165348608] ←
   327700[165352790]                     Выражение ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[165349481]                       Значения формальных параметров при вызове ←
 32505860[165351617]                         Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
   327700[165352791]                           Выражение ≡ ЦО для текущего узла (для дискаунтера и экспресса по ip адресу) ∙ 249[164298878] ←
 30867470[165348588]           IF ←
  1638463[165348991]             Условие ←
      404[165365408]               Результат ≡ Товар на А5 ∙ 65545[165349796] ←
 30867472[165348582]             THEN ←
 11010088[165349017]               ВЫПОЛНИТЬ ≡ Печать ценника А4 и А5 (Дискаунтер) ∙ 127[165347387] ←
 32505862[165349478]                 Значения формальных параметров при вызове ←
 32505860[165351597]                   Значение параметра при вызове процедуры/функции ≡ фп Продукты in ∙ 65545[165347765] ←
   327700[165352769]                     Выражение ≡ Товар на А5 ∙ 65545[165349796] ←
 32505860[165351598]                   Значение параметра при вызове процедуры/функции ≡ фп Шаблон (-1 - обычный А6, 0 - паллетный А4, 1 - паллетный А5, 2 - Так просто А4, 3 - так просто А5, 4 - кармашек А4, 5 - уценка А4, 6 - уценка А5, 7 - А4 ПРОМО, 8 - А5 ПРОМО) ∙ 65545[165347771] ←
   327700[165352770]                     Выражение ⁼ 1 ←
 32505860[165351600]                   Значение параметра при вызове процедуры/функции ≡ фп ТТ in ∙ 65545[165348608] ←
   327700[165352772]                     Выражение ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[165349479]                       Значения формальных параметров при вызове ←
 32505860[165351601]                         Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
   327700[165352773]                           Выражение ≡ ЦО для текущего узла (для дискаунтера и экспресса по ip адресу) ∙ 249[164298878] ←
 30867470[165348589]           IF ←
  1638463[165348992]             Условие ←
      404[165365409]               Результат ≡ Товар на 1/2 А5 ∙ 65545[165349797] ←
 30867472[165348583]             THEN ←
 11010088[165349015]               ВЫПОЛНИТЬ ≡ Печать ценника А4 и А5 (Дискаунтер) ∙ 127[165347387] ←
 32505862[165349457]                 Значения формальных параметров при вызове ←
 32505860[165351543]                   Значение параметра при вызове процедуры/функции ≡ фп Продукты in ∙ 65545[165347765] ←
   327700[165352707]                     Выражение ≡ Товар на 1/2 А5 ∙ 65545[165349797] ←
 32505860[165351544]                   Значение параметра при вызове процедуры/функции ≡ фп Шаблон (-1 - обычный А6, 0 - паллетный А4, 1 - паллетный А5, 2 - Так просто А4, 3 - так просто А5, 4 - кармашек А4, 5 - уценка А4, 6 - уценка А5, 7 - А4 ПРОМО, 8 - А5 ПРОМО) ∙ 65545[165347771] ←
   327700[165352708]                     Выражение ⁼ -1 ←
 32505860[165351545]                   Значение параметра при вызове процедуры/функции ≡ фп ТТ in ∙ 65545[165348608] ←
   327700[165352709]                     Выражение ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[165349458]                       Значения формальных параметров при вызове ←
 32505860[165351546]                         Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
   327700[165352710]                           Выражение ≡ ЦО для текущего узла (для дискаунтера и экспресса по ip адресу) ∙ 249[164298878] ←
 30867470[165348590]           IF ←
  1638463[165348993]             Условие ←
      404[165365410]               Результат ≡ Товар на стикер ∙ 65545[165349798] ←
 30867472[165348584]             THEN ←
 11010088[165349021]               ВЫПОЛНИТЬ ≡ Печать ценника по продукту ∙ 127[164298803] ←
 30867470[165348591]           IF ←
  1638463[165348994]             Условие ←
      404[165365411]               Результат ≡ Товар на ручной выбор А5/стикер ∙ 65545[165349799] ←
 30867472[165348585]             THEN ←
 12124190[165347395]               Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
   262166[165347365]                 Заголовок ⁼ Выберите формат ценника ←
      245[165347428]                 Список полей формы ←
      598[165347731]                   Поле (колонка) для ввода данных ≡ Формат ценника ∙ 65545[165349800] ←
      209[165347506]                     Выбор из списка ≡ ВЫБОР ПРОЕКТНОГО ЭЛЕМЕНТА {...} ∙ 371[1507506] ←
       27[165347363]                       При выборе использовать стиль выпадающего списка ≡ Да ∙ 534[40566785] ←
  1507614[165347374]                       Отбор данных ←
 11010080[165352817]                         = ≡ Элемент проекта ∙ 65545[1509214] ←
      404[165365429]                           Результат ≡ А5 ∙ 165347342[165347331] ←
 11010088[165349016]                         ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
 11010080[165352818]                         = ≡ Элемент проекта ∙ 65545[1509214] ←
      404[165365430]                           Результат ≡ Стикер ∙ 165347342[165347329] ←
 11010088[165349029]                         ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
 11010079[165347485]               CASE ←
  1572877[165347501]                 Условие ←
      404[165365431]                   Результат ≡ Формат ценника ∙ 65545[165349800] ←
 11010081[165348120]                 OF ≡ А5 ∙ 165347342[165347331] ←
 11010088[165349025]                   ВЫПОЛНИТЬ ≡ Печать ценника А4 и А5 (Дискаунтер) ∙ 127[165347387] ←
 32505862[165349475]                     Значения формальных параметров при вызове ←
 32505860[165351586]                       Значение параметра при вызове процедуры/функции ≡ фп Продукты in ∙ 65545[165347765] ←
   327700[165352756]                         Выражение ≡ Товар на А5 ∙ 65545[165349796] ←
 32505860[165351587]                       Значение параметра при вызове процедуры/функции ≡ фп Шаблон (-1 - обычный А6, 0 - паллетный А4, 1 - паллетный А5, 2 - Так просто А4, 3 - так просто А5, 4 - кармашек А4, 5 - уценка А4, 6 - уценка А5, 7 - А4 ПРОМО, 8 - А5 ПРОМО) ∙ 65545[165347771] ←
   327700[165352757]                         Выражение ⁼ 1 ←
 32505860[165351588]                       Значение параметра при вызове процедуры/функции ≡ фп ТТ in ∙ 65545[165348608] ←
   327700[165352758]                         Выражение ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[165349476]                           Значения формальных параметров при вызове ←
 32505860[165351589]                             Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
   327700[165352759]                               Выражение ≡ ЦО для текущего узла (для дискаунтера и экспресса по ip адресу) ∙ 249[164298878] ←
 11010081[165348121]                 OF ≡ Стикер ∙ 165347342[165347329] ←
 11010088[165349020]                   ВЫПОЛНИТЬ ≡ Печать ценника по продукту ∙ 127[164298803] ←
 11010081[165348122]                 OF ≡ А4 ∙ 165347342[165347333] ←
 11010088[165349028]                   ВЫПОЛНИТЬ ≡ Печать ценника А4 и А5 (Дискаунтер) ∙ 127[165347387] ←
 32505862[165349485]                     Значения формальных параметров при вызове ←
 32505860[165351612]                       Значение параметра при вызове процедуры/функции ≡ фп Продукты in ∙ 65545[165347765] ←
   327700[165352786]                         Выражение ≡ Товар на А4 ∙ 65545[165349795] ←
 32505860[165351613]                       Значение параметра при вызове процедуры/функции ≡ фп Шаблон (-1 - обычный А6, 0 - паллетный А4, 1 - паллетный А5, 2 - Так просто А4, 3 - так просто А5, 4 - кармашек А4, 5 - уценка А4, 6 - уценка А5, 7 - А4 ПРОМО, 8 - А5 ПРОМО) ∙ 65545[165347771] ←
   327700[165352787]                         Выражение ⁼ 0 ←
 32505860[165351614]                       Значение параметра при вызове процедуры/функции ≡ фп ТТ in ∙ 65545[165348608] ←
   327700[165352788]                         Выражение ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[165349486]                           Значения формальных параметров при вызове ←
 32505860[165351615]                             Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
   327700[165352789]                               Выражение ≡ ЦО для текущего узла (для дискаунтера и экспресса по ip адресу) ∙ 249[164298878] ←
 11010081[165348123]                 OF ≡ 1/2 А5 ∙ 165347342[165347332] ←
 11010088[165349019]                   ВЫПОЛНИТЬ ≡ Печать ценника А4 и А5 (Дискаунтер) ∙ 127[165347387] ←
 32505862[165349463]                     Значения формальных параметров при вызове ←
 32505860[165351555]                       Значение параметра при вызове процедуры/функции ≡ фп Продукты in ∙ 65545[165347765] ←
   327700[165352719]                         Выражение ≡ Товар на 1/2 А5 ∙ 65545[165349797] ←
 32505860[165351556]                       Значение параметра при вызове процедуры/функции ≡ фп Шаблон (-1 - обычный А6, 0 - паллетный А4, 1 - паллетный А5, 2 - Так просто А4, 3 - так просто А5, 4 - кармашек А4, 5 - уценка А4, 6 - уценка А5, 7 - А4 ПРОМО, 8 - А5 ПРОМО) ∙ 65545[165347771] ←
   327700[165352720]                         Выражение ⁼ -1 ←
 32505860[165351557]                       Значение параметра при вызове процедуры/функции ≡ фп ТТ in ∙ 65545[165348608] ←
   327700[165352721]                         Выражение ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[165349464]                           Значения формальных параметров при вызове ←
 32505860[165351558]                             Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
   327700[165352722]                               Выражение ≡ ЦО для текущего узла (для дискаунтера и экспресса по ip адресу) ∙ 249[164298878] ←
 30867473[165347818]                 ELSE ←
 11010088[165349038]                   ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
 11010095[165348164]                     Выражение ←
      404[165365444]                       Результат ⁼ Выберите корректный формат ценника: А4, А5, 1/2 А5 или стикер ←
 30867470[165348911]           IF ←
  1638463[165349403]             Условие ←
      404[165370658]               Результат ≡ Товар на ручной выбор half А5/стикер ∙ 65545[165350365] ←
 30867472[165348905]             THEN ←
 12124190[165347412]               Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
   262166[165347380]                 Заголовок ⁼ Выберите формат ценника ←
      245[165347448]                 Список полей формы ←
      598[165347787]                   Поле (колонка) для ввода данных ≡ Формат ценника ∙ 65545[165349800] ←
      209[165347533]                     Выбор из списка ≡ ВЫБОР ПРОЕКТНОГО ЭЛЕМЕНТА {...} ∙ 371[1507506] ←
       27[165347367]                       При выборе использовать стиль выпадающего списка ≡ Да ∙ 534[40566785] ←
  1507614[165347388]                       Отбор данных ←
 11010080[165354451]                         = ≡ Элемент проекта ∙ 65545[1509214] ←
      404[165370661]                           Результат ≡ 1/2 А5 ∙ 165347342[165347332] ←
 11010088[165349747]                         ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
 11010080[165354450]                         = ≡ Элемент проекта ∙ 65545[1509214] ←
      404[165370660]                           Результат ≡ Стикер ∙ 165347342[165347329] ←
 11010088[165349849]                         ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
 11010079[165347563]               CASE ←
  1572877[165347584]                 Условие ←
      404[165370662]                   Результат ≡ Формат ценника ∙ 65545[165349800] ←
 11010081[165348381]                 OF ≡ А5 ∙ 165347342[165347331] ←
 11010088[165349852]                   ВЫПОЛНИТЬ ≡ Печать ценника А4 и А5 (Дискаунтер) ∙ 127[165347387] ←
 32505862[165349906]                     Значения формальных параметров при вызове ←
 32505860[165352389]                       Значение параметра при вызове процедуры/функции ≡ фп Продукты in ∙ 65545[165347765] ←
   327700[165354052]                         Выражение ≡ Товар на А5 ∙ 65545[165349796] ←
 32505860[165352390]                       Значение параметра при вызове процедуры/функции ≡ фп Шаблон (-1 - обычный А6, 0 - паллетный А4, 1 - паллетный А5, 2 - Так просто А4, 3 - так просто А5, 4 - кармашек А4, 5 - уценка А4, 6 - уценка А5, 7 - А4 ПРОМО, 8 - А5 ПРОМО) ∙ 65545[165347771] ←
   327700[165354053]                         Выражение ⁼ 1 ←
 32505860[165352391]                       Значение параметра при вызове процедуры/функции ≡ фп ТТ in ∙ 65545[165348608] ←
   327700[165354054]                         Выражение ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[165349907]                           Значения формальных параметров при вызове ←
 32505860[165352392]                             Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
   327700[165354055]                               Выражение ≡ ЦО для текущего узла (для дискаунтера и экспресса по ip адресу) ∙ 249[164298878] ←
 11010081[165348382]                 OF ≡ Стикер ∙ 165347342[165347329] ←
 11010088[165349853]                   ВЫПОЛНИТЬ ≡ Печать ценника по продукту ∙ 127[164298803] ←
 11010081[165348383]                 OF ≡ А4 ∙ 165347342[165347333] ←
 11010088[165349854]                   ВЫПОЛНИТЬ ≡ Печать ценника А4 и А5 (Дискаунтер) ∙ 127[165347387] ←
 32505862[165350021]                     Значения формальных параметров при вызове ←
 32505860[165352393]                       Значение параметра при вызове процедуры/функции ≡ фп Продукты in ∙ 65545[165347765] ←
   327700[165354056]                         Выражение ≡ Товар на А4 ∙ 65545[165349795] ←
 32505860[165352654]                       Значение параметра при вызове процедуры/функции ≡ фп Шаблон (-1 - обычный А6, 0 - паллетный А4, 1 - паллетный А5, 2 - Так просто А4, 3 - так просто А5, 4 - кармашек А4, 5 - уценка А4, 6 - уценка А5, 7 - А4 ПРОМО, 8 - А5 ПРОМО) ∙ 65545[165347771] ←
   327700[165354057]                         Выражение ⁼ 0 ←
 32505860[165352656]                       Значение параметра при вызове процедуры/функции ≡ фп ТТ in ∙ 65545[165348608] ←
   327700[165354058]                         Выражение ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[165350022]                           Значения формальных параметров при вызове ←
 32505860[165352657]                             Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
   327700[165354482]                               Выражение ≡ ЦО для текущего узла (для дискаунтера и экспресса по ip адресу) ∙ 249[164298878] ←
 11010081[165348384]                 OF ≡ 1/2 А5 ∙ 165347342[165347332] ←
 11010088[165349855]                   ВЫПОЛНИТЬ ≡ Печать ценника А4 и А5 (Дискаунтер) ∙ 127[165347387] ←
 32505862[165350025]                     Значения формальных параметров при вызове ←
 32505860[165352658]                       Значение параметра при вызове процедуры/функции ≡ фп Продукты in ∙ 65545[165347765] ←
   327700[165354483]                         Выражение ≡ Товар на 1/2 А5 ∙ 65545[165349797] ←
 32505860[165352659]                       Значение параметра при вызове процедуры/функции ≡ фп Шаблон (-1 - обычный А6, 0 - паллетный А4, 1 - паллетный А5, 2 - Так просто А4, 3 - так просто А5, 4 - кармашек А4, 5 - уценка А4, 6 - уценка А5, 7 - А4 ПРОМО, 8 - А5 ПРОМО) ∙ 65545[165347771] ←
   327700[165354484]                         Выражение ⁼ -1 ←
 32505860[165352660]                       Значение параметра при вызове процедуры/функции ≡ фп ТТ in ∙ 65545[165348608] ←
   327700[165354488]                         Выражение ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[165350026]                           Значения формальных параметров при вызове ←
 32505860[165352661]                             Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
   327700[165354489]                               Выражение ≡ ЦО для текущего узла (для дискаунтера и экспресса по ip адресу) ∙ 249[164298878] ←
 30867473[165348035]                 ELSE ←
 11010088[165349856]                   ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
 11010095[165348477]                     Выражение ←
      404[165370665]                       Результат ⁼ Выберите корректный формат ценника: А4, А5, 1/2 А5 или стикер ←
      127[165347386]       Процедура • Печать ценник А5 ≡ Печать ценника А4 и А5 (Дискаунтер) ∙ 127[165347387] ←
 32505862[165347681]         Значения формальных параметров при вызове ←
 32505860[165348092]           Значение параметра при вызове процедуры/функции ≡ фп Продукты in ∙ 65545[165347765] ←
   327700[165348393]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[165348098]           Значение параметра при вызове процедуры/функции ≡ фп Шаблон (-1 - обычный А6, 0 - паллетный А4, 1 - паллетный А5, 2 - Так просто А4, 3 - так просто А5, 4 - кармашек А4, 5 - уценка А4, 6 - уценка А5, 7 - А4 ПРОМО, 8 - А5 ПРОМО) ∙ 65545[165347771] ←
   327700[165348394]             Выражение ⁼ 1 ←
 32505860[165349479]           Значение параметра при вызове процедуры/функции ≡ фп ТТ in ∙ 65545[165348608] ←
   327700[165350085]             Выражение ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[165348331]               Значения формальных параметров при вызове ←
 32505860[165349480]                 Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
   327700[165350086]                   Выражение ≡ ЦО для текущего узла (для дискаунтера и экспресса по ip адресу) ∙ 249[164298878] ←
      432[165347341]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[165347371]           Если истинно выражение ≡ Текущий узел - БД с несколькими ТТ (Д1000, Э1001) ∙ 249[164364485] ←
      127[165347365]       Процедура • Печать ценник "Самая цена" (А5) ≡ Печать ценника А4 и А5 (Дискаунтер) ∙ 127[165347387] ←
 32505862[165347582]         Значения формальных параметров при вызове ←
 32505860[165347884]           Значение параметра при вызове процедуры/функции ≡ фп Продукты in ∙ 65545[165347765] ←
   327700[165348121]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[165347885]           Значение параметра при вызове процедуры/функции ≡ фп Шаблон (-1 - обычный А6, 0 - паллетный А4, 1 - паллетный А5, 2 - Так просто А4, 3 - так просто А5, 4 - кармашек А4, 5 - уценка А4, 6 - уценка А5, 7 - А4 ПРОМО, 8 - А5 ПРОМО) ∙ 65545[165347771] ←
   327700[165348122]             Выражение ⁼ 3 ←
 32505860[165349502]           Значение параметра при вызове процедуры/функции ≡ фп ТТ in ∙ 65545[165348608] ←
   327700[165350108]             Выражение ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[165348343]               Значения формальных параметров при вызове ←
 32505860[165349503]                 Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
   327700[165350109]                   Выражение ≡ ЦО для текущего узла (для дискаунтера и экспресса по ip адресу) ∙ 249[164298878] ←
      432[170917952]         Использование (в режиме выполнения) ≡ Нет ∙ 534[40566786] ←
      127[165347364]       Процедура • Печать ценник 1/2 А5 ≡ Печать ценника А4 и А5 (Дискаунтер) ∙ 127[165347387] ←
 32505862[165347556]         Значения формальных параметров при вызове ←
 32505860[165347821]           Значение параметра при вызове процедуры/функции ≡ фп Продукты in ∙ 65545[165347765] ←
   327700[165348022]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[165347822]           Значение параметра при вызове процедуры/функции ≡ фп Шаблон (-1 - обычный А6, 0 - паллетный А4, 1 - паллетный А5, 2 - Так просто А4, 3 - так просто А5, 4 - кармашек А4, 5 - уценка А4, 6 - уценка А5, 7 - А4 ПРОМО, 8 - А5 ПРОМО) ∙ 65545[165347771] ←
   327700[165348023]             Выражение ⁼ -1 ←
 32505860[165349506]           Значение параметра при вызове процедуры/функции ≡ фп ТТ in ∙ 65545[165348608] ←
   327700[165350112]             Выражение ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[165348345]               Значения формальных параметров при вызове ←
 32505860[165349507]                 Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
   327700[165350113]                   Выражение ≡ ЦО для текущего узла (для дискаунтера и экспресса по ip адресу) ∙ 249[164298878] ←
      432[165347336]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[165347351]           Если истинно выражение ≡ Текущий узел - дискаунтер ∙ 249[164364415] ←
      127[164823329]       Процедура ≡ Печать состав по продукту ∙ 127[164298839] ←
      432[165347367]         Использование (в режиме выполнения) ≡ Нет ∙ 534[40566786] ←
      103[164823161]       Команда ≡ ------------ ∙ 102[57343] ←
      432[165347372]         Использование (в режиме выполнения) ≡ Нет ∙ 534[40566786] ←
      127[164823330]       Процедура ≡ Печать бумажного ценника ∙ 127[655294666] ←
      432[170917956]         Использование (в режиме выполнения) ≡ Нет ∙ 534[40566786] ←
 32505862[164824806]         Значения формальных параметров при вызове ←
 32505860[164826847]           Значение параметра при вызове процедуры/функции ≡ Подразделение ценообразования ∙ 65545[655294917] ←
   327700[164828037]             Выражение ≡ Подразделение для вида просмотра (глоб.перем.) ∙ 381[42401793] ←
      411[164827349]               Уточняющий параметр ≡ Родитель ∙ 283[2] ←
      411[164827350]                 Уточняющий параметр ≡ Подразделение для назначения цен ∙ 283[42401850] ←
 32505860[164826848]           Значение параметра при вызове процедуры/функции ≡ Брать из справочника ∙ 65545[655294918] ←
   327700[164828038]             Выражение ⁼ 1 ←
      103[164823162]       Команда ≡ ------------ ∙ 102[57343] ←
      432[170917957]         Использование (в режиме выполнения) ≡ Нет ∙ 534[40566786] ←
      127[164823331]       Процедура ≡ Печать этикеток (28 х 18 мм) по товару с выбором (сотрудник, штрих-код, цена) ∙ 127[40370823] ←
      432[170917958]         Использование (в режиме выполнения) ≡ Нет ∙ 534[40566786] ←
      127[164823332]       Процедура ≡ Печать этикеток (28 х 18 мм) с рекомендациями по использованию ∙ 127[655294880] ←
      432[170917959]         Использование (в режиме выполнения) ≡ Нет ∙ 534[40566786] ←
      127[164823333]       Процедура • Печать 2 ≡ Печать этикеток (28 х 18 мм) с рекомендациями по использованию ∙ 127[655294880] ←
      432[170917960]         Использование (в режиме выполнения) ≡ Нет ∙ 534[40566786] ←
 32505862[164824807]         Значения формальных параметров при вызове ←
 32505860[164826849]           Значение параметра при вызове процедуры/функции ≡ Печать фруктовых сертификатов ∙ 65545[164303601] ←
   327700[164828039]             Выражение ⁼ 1 ←
      103[164823163]       Команда ≡ ------------ ∙ 102[57343] ←
      432[165347374]         Использование (в режиме выполнения) ≡ Нет, только если все условия соблюдены ∙ 534[4] ←
  1507508[165347360]           Если истинно выражение ≡ Текущий узел - БД с несколькими ТТ (Д1000, Э1001) ∙ 249[164364485] ←
      103[164823164]     Команда ≡ ------------ ∙ 102[57343] ←
      127[170918296]     Процедура • Есть ли товар в ВСО ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
      432[170918046]       Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1507508[170918107]         Если истинно выражение ≡ Программисты (НЕ ДОБАВЛЯТЬ СЮДА НИКОГО, КРОМЕ ПРОГРАММИСТОВ) ∙ 117[164823615] ←
  1507508[170918531]         Если истинно выражение ≡ Текущий сотрудник из группы "Аудит" ∙ 117[165347336] ←
  1507508[170918532]         Если истинно выражение ≡ Текущий сотрудник из группы "нм Аудит. Полное меню" ∙ 117[164889119] ←
  1507508[170918533]         Если истинно выражение ≡ Текущий сотрудник из группы "нм Аудит. Товаровед" ∙ 117[170918101] ←
 32505863[170918107]       Локальные переменные ←
    65545[170920480]         Локальная переменная • Документ ≡ Документ ∙ 107[8] ←
      355[170918736]           Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[170920481]         Локальная переменная • Флаг - товар есть в всо ≡ bool ∙ 107[1507344] ←
      355[170918735]           Начальное значение ≡ false ∙ 117[30867469] ←
 30867463[170918337]       Выполнить действия ←
 11010080[170924403]         = ≡ Флаг - товар есть в всо ∙ 65545[170920481] ←
      404[170938634]           Результат ≡ false ∙ 117[30867469] ←
 11010088[170920064]         ВЫПОЛНИТЬ ≡ Товар есть в документе ассортимента ВСО ∙ 249[170917927] ←
 32505862[170920212]           Значения формальных параметров при вызове ←
 32505860[170922748]             Значение параметра при вызове процедуры/функции ≡ фп Товар вход ∙ 65545[170920474] ←
   327700[170924098]               Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170922749]             Значение параметра при вызове процедуры/функции ≡ фп Документ выход ∙ 65545[170920479] ←
   327700[170924097]               Выражение ≡ Документ ∙ 65545[170920480] ←
 32505860[170922752]             Значение параметра при вызове процедуры/функции ≡ фп Флаг - товар есть в документе ВСО выход ∙ 65545[170920475] ←
   327700[170924101]               Выражение ≡ Флаг - товар есть в всо ∙ 65545[170920481] ←
 30867470[170919888]         IF ←
  1638463[170920329]           Условие ←
      404[170938619]             Результат ≡ Флаг - товар есть в всо ∙ 65545[170920481] ←
  1638473[170922619]             Равно ←
      404[170938635]             Результат ≡ true ∙ 117[30867468] ←
 30867472[170919884]           THEN ←
 11010088[170920065]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170918854]               Выражение ←
      404[170938616]                 Результат ≡ Флаг - товар есть в всо ∙ 65545[170920481] ←
      404[170938617]                 Результат ⁼ ' - ' ←
      404[170938615]                 Результат ≡ Документ ∙ 65545[170920480] ←
      127[170918303]     Процедура • Есть ли товар в ГК ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
      432[170918048]       Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1507508[170918447]         Если истинно выражение ≡ Программисты (НЕ ДОБАВЛЯТЬ СЮДА НИКОГО, КРОМЕ ПРОГРАММИСТОВ) ∙ 117[164823615] ←
  1507508[170918520]         Если истинно выражение ≡ Текущий сотрудник из группы "Аудит" ∙ 117[165347336] ←
  1507508[170918521]         Если истинно выражение ≡ Текущий сотрудник из группы "нм Аудит. Полное меню" ∙ 117[164889119] ←
  1507508[170918530]         Если истинно выражение ≡ Текущий сотрудник из группы "нм Аудит. Товаровед" ∙ 117[170918101] ←
 32505863[170918114]       Локальные переменные ←
    65545[170920517]         Локальная переменная • Документ ≡ Документ ∙ 107[8] ←
      355[170918754]           Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[170920518]         Локальная переменная • Флаг - товар есть в ГК ≡ bool ∙ 107[1507344] ←
      355[170918755]           Начальное значение ≡ false ∙ 117[30867469] ←
 30867463[170918344]       Выполнить действия ←
 11010080[170924500]         = ≡ Флаг - товар есть в ГК ∙ 65545[170920518] ←
      404[170939087]           Результат ≡ false ∙ 117[30867469] ←
 11010088[170920121]         ВЫПОЛНИТЬ ≡ Товар есть в документе горячих клавиш ∙ 249[170917930] ←
 32505862[170920241]           Значения формальных параметров при вызове ←
 32505860[170922828]             Значение параметра при вызове процедуры/функции ≡ фп Товар вход ∙ 65545[170920506] ←
   327700[170924210]               Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170922830]             Значение параметра при вызове процедуры/функции ≡ фп Документ гк выход ∙ 65545[170920507] ←
   327700[170924212]               Выражение ≡ Документ ∙ 65545[170920517] ←
 32505860[170922831]             Значение параметра при вызове процедуры/функции ≡ фп Флаг - товар есть в документе ГК выход ∙ 65545[170920508] ←
   327700[170924213]               Выражение ≡ Флаг - товар есть в ГК ∙ 65545[170920518] ←
 30867470[170919924]         IF ←
  1638463[170920374]           Условие ←
      404[170939088]             Результат ≡ Флаг - товар есть в ГК ∙ 65545[170920518] ←
  1638473[170922721]             Равно ←
      404[170939089]             Результат ≡ true ∙ 117[30867468] ←
 30867472[170919920]           THEN ←
 11010088[170920122]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170918874]               Выражение ←
      404[170939090]                 Результат ≡ Флаг - товар есть в ГК ∙ 65545[170920518] ←
      404[170939091]                 Результат ⁼ ' - ' ←
      404[170939092]                 Результат ≡ Документ ∙ 65545[170920517] ←
  1507728[170918362]             Начало многострочного комментария ←
 11010088[170920175]             ВЫПОЛНИТЬ ≡ Добавить объект в очередь отправки ∙ 127[170918132] ←
 32505862[170920268]               Значения формальных параметров при вызове ←
 32505860[170922902]                 Значение параметра при вызове процедуры/функции ≡ фп Магазин(ТТ)  ∙ 65545[170919630] ←
   327700[170924311]                   Выражение ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[170920269]                     Значения формальных параметров при вызове ←
 32505860[170922903]                       Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
   327700[170924312]                         Выражение ≡ ЦО для текущего узла (для дискаунтера и экспресса по ip адресу) ∙ 249[164298878] ←
 32505860[170922900]                 Значение параметра при вызове процедуры/функции ≡ фп Документ для добавления ∙ 65545[170919628] ←
   327700[170924310]                   Выражение ≡ Документ ∙ 65545[170920517] ←
 32505860[170922901]                 Значение параметра при вызове процедуры/функции ≡ фп Жестко выгрузить в центрум не проверяя протокол изменений (def=false) ∙ 65545[170919744] ←
   327700[170924314]                   Выражение ⁼ 1 ←
  1507729[170918362]             Конец многострочного комментария ←
      127[170918322]     Процедура • Получить сезоны для товара ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
      432[170918059]       Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1507508[170918517]         Если истинно выражение ≡ Текущий пользователь - Жуков ∙ 117[165347329] ←
 32505863[170918128]       Локальные переменные ←
    65545[170920661]         Локальная переменная • Сезон кя ≡ Каталог ∙ 107[9] ←
    65545[170920662]         Локальная переменная • Сезон д ≡ Каталог ∙ 107[9] ←
 30867463[170918374]       Выполнить действия ←
 11010088[170920269]         ВЫПОЛНИТЬ ≡ Получить сезон по товару ∙ 249[170917933] ←
 32505862[170920338]           Значения формальных параметров при вызове ←
 32505860[170923002]             Значение параметра при вызове процедуры/функции ≡ фп Товар вход ∙ 65545[170920656] ←
   327700[170924444]               Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170923003]             Значение параметра при вызове процедуры/функции ≡ фп Сезон КЯ выход ∙ 65545[170920657] ←
   327700[170924445]               Выражение ≡ Сезон кя ∙ 65545[170920661] ←
 32505860[170923004]             Значение параметра при вызове процедуры/функции ≡ фп Сезон Д выход ∙ 65545[170920658] ←
   327700[170924446]               Выражение ≡ Сезон д ∙ 65545[170920662] ←
 11010088[170920270]         ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170918963]           Выражение ←
      404[170940038]             Результат ⁼ Сезон КЯ =  ←
      404[170940036]             Результат ≡ Сезон кя ∙ 65545[170920661] ←
      411[170921240]               Уточняющий параметр ≡ Наименование ∙ 296[6] ←
      404[170940039]             Результат ⁼ . Сезон Д =  ←
      404[170940037]             Результат ≡ Сезон д ∙ 65545[170920662] ←
      411[170921241]               Уточняющий параметр ≡ Наименование ∙ 296[6] ←
      127[170918193]     Процедура • Передать товар в кассы ≡ Добавить объект в очередь отправки ∙ 127[170918132] ←
 32505862[170919706]       Значения формальных параметров при вызове ←
 32505860[170921597]         Значение параметра при вызове процедуры/функции ≡ фп Товар для добавления ∙ 65545[170919629] ←
   327700[170922749]           Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170921599]         Значение параметра при вызове процедуры/функции ≡ фп Магазин(ТТ)  ∙ 65545[170919630] ←
   327700[170922751]           Выражение ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
 32505862[170919707]             Значения формальных параметров при вызове ←
 32505860[170921600]               Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
   327700[170922752]                 Выражение ≡ ЦО для текущего узла (для дискаунтера и экспресса по ip адресу) ∙ 249[164298878] ←
 32505860[170921598]         Значение параметра при вызове процедуры/функции ≡ фп Жестко выгрузить в центрум не проверяя протокол изменений (def=false) ∙ 65545[170919744] ←
   327700[170922750]           Выражение ≡ true ∙ 117[30867468] ←
 32505860[170921614]         Значение параметра при вызове процедуры/функции ≡ фп Флаг - вручную (def=false) ∙ 65545[170919907] ←
   327700[170922769]           Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922307]         Значение параметра при вызове процедуры/функции ≡ фп Добавить только цены ∙ 65545[170919969] ←
   327700[170923552]           Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922476]         Значение параметра при вызове процедуры/функции ≡ фп Добавить только ШК ∙ 65545[170919968] ←
   327700[170923789]           Выражение ≡ true ∙ 117[30867468] ←
 32505860[170922477]         Значение параметра при вызове процедуры/функции ≡ фп Добавить только атрибуты ∙ 65545[170919970] ←
   327700[170923790]           Выражение ≡ true ∙ 117[30867468] ←
      103[164823165]     Команда ≡ ------------ ∙ 102[57343] ←
      113[164823061]     Сценарий (Меню) • Печать отчетов по товару ←
      127[164823337]       Процедура • Изменение закупочных цен ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
      432[171704349]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[171704441]           Если истинно выражение ≡ Видимость закупочной и учетной цены ∙ 249[171638788] ←
 30867463[164823248]         Выполнить действия ←
 12124190[164823154]           Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823162]             Список полей формы ←
      598[164823534]               Поле (колонка) для ввода данных ≡ Дата начальная ∙ 381[131078] ←
      598[164823535]               Поле (колонка) для ввода данных ≡ Дата конечная ∙ 381[131079] ←
  1507360[164823646]           Отбор данных (по запросу) ≡ ПРОДУКТЫ ∙ 12124205[18546749] ←
 32505862[164824811]             Значения формальных параметров при вызове ←
 32505860[164826860]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547184] ←
   327700[164828050]                 Выражение ≡ Партия товара ∙ 306[14745602] ←
 32505860[164826861]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510268] ←
   327700[164828051]                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
 12124215[164823377]             Where      (Ограничения на отбор данных) ←
  1507381[164823163]               <Наследуемые ограничения> ←
      413[164824568]               И ←
  1507376[164824697]               Выражение ←
  1507455[164824912]                 Результат ≡ ПРОДУКТЫ ∙ 12124204[18546830] ←
  1507494[164825546]                   Уточняющий параметр ≡ Дата ∙ 305[9] ←
  1638477[164823224]                 Больше или равно ←
  1507452[164824254]                 Константа ≡ Дата начальная ∙ 381[131078] ←
      413[164824569]               И ←
  1507376[164824698]               Выражение ←
  1507455[164824913]                 Результат ≡ ПРОДУКТЫ ∙ 12124204[18546830] ←
  1507494[164825547]                   Уточняющий параметр ≡ Дата ∙ 305[9] ←
  1638475[164823172]                 Меньше или равно ←
  1507452[164824255]                 Константа ≡ Дата конечная ∙ 381[131079] ←
 30867466[164823743]             Выполнить после получения записи ←
 11010099[164823172]               CONTINUE ←
      116[164824476]                 Выражение ←
      404[164839625]                   Результат ≡ з.Продукт ∙ 1507335[18546999] ←
      411[164827351]                     Уточняющий параметр ≡ Приходный документ ∙ 305[14745618] ←
      411[164827352]                       Уточняющий параметр ≡ UID типа ∙ 249[2621444] ←
  1638479[164823420]                   Не равно ←
      404[164839626]                   Результат ≡ Приход товаров ∙ 332[14286901] ←
 11010088[164824468]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823722]                 Выражение ←
      404[164839627]                   Результат ≡ з.Продукт ∙ 1507335[18546999] ←
  1638487[164823419]                   Конкатенировать строки ←
      404[164839628]                   Результат ⁼ ';' ←
  1638487[164823420]                   Конкатенировать строки ←
      404[164839629]                   Результат ≡ з.Продукт ∙ 1507335[18546999] ←
      411[164827353]                     Уточняющий параметр ≡ Дата ∙ 305[9] ←
  1638487[164823421]                   Конкатенировать строки ←
      404[164839630]                   Результат ⁼ ';' ←
  1638487[164823422]                   Конкатенировать строки ←
      404[164839631]                   Результат ≡ з.Продукт ∙ 1507335[18546999] ←
      411[164827354]                     Уточняющий параметр ≡ Цена закупочная ∙ 305[15007745] ←
  1638487[164823423]                   Конкатенировать строки ←
      404[164839632]                   Результат ⁼ ';' ←
  1638487[164823424]                   Конкатенировать строки ←
      404[164839633]                   Результат ≡ з.Продукт ∙ 1507335[18546999] ←
      411[164827355]                     Уточняющий параметр ≡ Количество в строке прихода ∙ 305[14352395] ←
  1638487[164823425]                   Конкатенировать строки ←
      404[164839634]                   Результат ⁼ ';' ←
  1638487[164823426]                   Конкатенировать строки ←
      404[164839635]                   Результат ≡ з.Продукт ∙ 1507335[18546999] ←
      411[164827356]                     Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
      411[164827357]                       Уточняющий параметр ≡ Наименование ∙ 283[5] ←
  1638487[164823427]                   Конкатенировать строки ←
      404[164839636]                   Результат ⁼ ';' ←
  1638487[164823428]                   Конкатенировать строки ←
      404[164839637]                   Результат ≡ з.Продукт ∙ 1507335[18546999] ←
      411[164827358]                     Уточняющий параметр ≡ Приходный документ ∙ 305[14745618] ←
      411[164827359]                       Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[164827360]                         Уточняющий параметр ≡ Организация (Юридическое лицо) ∙ 283[28835910] ←
      411[164827361]                           Уточняющий параметр ≡ Наименование ∙ 283[5] ←
  1638487[164823429]                   Конкатенировать строки ←
      404[164839638]                   Результат ⁼ ';' ←
  1638487[164823430]                   Конкатенировать строки ←
      404[164839639]                   Результат ≡ з.Продукт ∙ 1507335[18546999] ←
      411[164827362]                     Уточняющий параметр ≡ Приходный документ ∙ 305[14745618] ←
      411[164827363]                       Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[164827364]                         Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      127[164823338]       Процедура • Изменение розничных цен ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
      432[164823076]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[164823509]           Если истинно выражение ≡ Видимость розн. цены на магазине ∙ 117[164430104] ←
 30867463[164823249]         Выполнить действия ←
 12124190[164823155]           Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823163]             Список полей формы ←
      598[164823536]               Поле (колонка) для ввода данных ≡ Дата начальная ∙ 381[131078] ←
      598[164823537]               Поле (колонка) для ввода данных ≡ Дата конечная ∙ 381[131079] ←
      598[164823538]               Поле (колонка) для ввода данных ≡ Подразделение ∙ 381[2] ←
      209[164823234]                 Выбор из списка ≡ Выбор Коммерческого подразделения ∙ 371[24379396] ←
  1507360[164823647]           Отбор данных (по запросу) ≡ ПРОВОДКИ ∙ 12124205[48431274] ←
 32505862[164824812]             Значения формальных параметров при вызове ←
 32505860[164826862]               Значение параметра при вызове процедуры/функции ≡ Список ЦФО ∙ 65545[48433455] ←
   327700[164828052]                 Выражение ≡ Центр финанс. ответственности для ТОВАРНЫХ ПЛАНОВ ∙ 117[45613057] ←
 32505860[164826863]               Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[48433456] ←
   327700[164828053]                 Выражение ≡ Дата начальная ∙ 381[131078] ←
 32505860[164826864]               Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[48433457] ←
   327700[164828054]                 Выражение ≡ Дата конечная ∙ 381[131079] ←
 32505860[164826865]               Значение параметра при вызове процедуры/функции ≡ Валюты ∙ 65545[48433458] ←
   327700[164828055]                 Выражение ≡ Российский рубль ∙ 131203081[28114945] ←
 32505860[164826866]               Значение параметра при вызове процедуры/функции ≡ Счета по дебету ∙ 65545[48433459] ←
   327700[164828056]                 Выражение ≡ Цена для партнера ∙ 131[6684674] ←
 32505860[164826867]               Значение параметра при вызове процедуры/функции ≡ Счета по кредиту ∙ 65545[48433460] ←
   327700[164828057]                 Выражение ≡ Цена для партнера ∙ 131[6684674] ←
 32505860[164826868]               Значение параметра при вызове процедуры/функции ≡ Дт [1] ∙ 65545[48433462] ←
   327700[164828058]                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826869]               Значение параметра при вызове процедуры/функции ≡ Кт [1] ∙ 65545[48433467] ←
   327700[164828059]                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826870]               Значение параметра при вызове процедуры/функции ≡ Дт [2] ∙ 65545[48433463] ←
   327700[164828060]                 Выражение ≡ Подразделение ∙ 381[2] ←
 32505860[164826871]               Значение параметра при вызове процедуры/функции ≡ Кт [2] ∙ 65545[48433468] ←
   327700[164828061]                 Выражение ≡ Подразделение ∙ 381[2] ←
 30867466[164823744]             Выполнить после получения записи ←
 11010088[164824469]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823723]                 Выражение ←
      404[164839640]                   Результат ≡ Дата из проводки ∙ 1507335[48432397] ←
  1638487[164823431]                   Конкатенировать строки ←
      404[164839641]                   Результат ⁼ ';' ←
  1638487[164823432]                   Конкатенировать строки ←
      404[164839642]                   Результат ≡ Сумма из проводки ∙ 1507335[48432401] ←
      103[164823166]       Команда ≡ ------------ ∙ 102[57343] ←
      127[164823339]       Процедура ≡ Движение базового товара по документам ∙ 127[2822113] ←
      103[164823167]       Команда ≡ ------------ ∙ 102[57343] ←
       73[164823051]       Отчет • Карточка товара ≡ Карточка товара ∙ 73[28836005] ←
      127[164823340]       Процедура ≡ Партии уцененного товара с наименованием ∙ 127[144310424] ←
       12[164823096]         Иконка ≡ Отчет ∙ 90[16] ←
      103[164823168]       Команда ≡ ------------ ∙ 102[57343] ←
       73[164823052]       Отчет • Остаток товара ≡ Остаток товара ∙ 73[28836006] ←
       73[164823053]       Отчет • Остаток товара по партиям ≡ Остаток товара по партиям ∙ 73[2818952] ←
       73[164823054]       Отчет ∙ 73[21430474] ←
      127[164823341]       Процедура • Остаток по магазинам ≡ { ... скрипт-отчет (для печати с одним шаблоном) ... } ∙ 127[12059188] ←
 32505863[164823227]         Локальные переменные ←
    65545[164825873]           Локальная переменная • Учитывать закрытые подразделения ≡ Признак (Да/Нет) ∙ 107[131203074] ←
      355[164823851]             Начальное значение ≡ Нет ∙ 131203075[131203073] ←
    65545[164825874]           Локальная переменная • Итого остаток по магазинам ≡ Число ∙ 107[4] ←
    65545[164825875]           Локальная переменная • Итого остаток РЦ ≡ Число ∙ 107[4] ←
    65545[164825876]           Локальная переменная • Итого остататок ≡ Число ∙ 107[4] ←
    65545[170655834]           Локальная переменная • Итого по сети ≡ Число ∙ 107[4] ←
    65545[170655836]           Локальная переменная • Остаток по РЦ ≡ Число ∙ 107[4] ←
    65545[164825877]           Локальная переменная • КЯ ≡ Короткая строка (12 символов) ∙ 107[2293761] ←
    65545[170655833]           Локальная переменная • Сеть ≡ Наименование объекта (80) ∙ 107[262147] ←
    65545[170655835]           Локальная переменная • Сеть РЦ ≡ Наименование объекта (80) ∙ 107[262147] ←
    65545[171704453]           Локальная переменная • Адрес ≡ Длинная строка (120) ∙ 107[7602177] ←
 30867483[164823094]         Локальные таблицы ←
 30867458[164823144]           Локальная таблица • Остатки ←
 11010090[164823144]             Структура (Поля, сортировка, генерируемые события) ←
 30867481[170655746]               Блок (при отборе данных будет генерироваться это событие) • Сеть ←
 30867475[164823873]                 Параметр ≡ Сеть ∙ 65545[170655833] ←
 30867476[164823262]                   Сортировать по возрастанию ←
 30867475[170655750]               Параметр ≡ КЯ ∙ 65545[164825877] ←
 30867476[170655747]                 Сортировать по возрастанию ←
 30867475[164823881]               Параметр ≡ Подразделение ∙ 381[2] ←
 30867476[164823265]                 Сортировать по возрастанию ←
 30867475[164823882]               Параметр ≡ Для хранения числа ∙ 381[6291457] ←
 30867475[171704326]               Параметр ≡ Адрес ∙ 65545[171704453] ←
 12124192[164823071]         Шаблоны отчетов ←
 12124193[164823089]           Шаблон отчета • Отчет ≡ Базовый шаблон ∙ 12124193[1507346] ⁼ {{заголовок}}
<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
  <link rel=stylesheet href="file:{STYLE}" type="text/css">
</head>
<body>

<P>Отпечатано : {Дата}
<H1>ТЕКУЩИЙ ОСТАТОК ТОВАРА <I> {Товар}</I></H1>

<table border="1" width="90%" cellspacing="0" cellpadding="4" align=center>

<tr>
  <td class="TableHeader" width="12%" >Магазин</td>
  <td class="TableHeader" width="12%" >Адрес</td>
  <td class="TableHeader" width="12%" >Остаток</td>
</tr>

{{строка}}

<tr class="TableBody">
 <td  align=left>{Номер магазина}</td>
 <td  align=left>{Адрес}</td>
 <td  align=right>{STOCK}
</tr>

{{Сеть}}
<tr>
 <td class=Total  align=left>  Итого по сети {Сеть имя}:</td>
 <td class=Total>&nbsp</td>
 <td class=Total align=right>{Итого сеть}</td>
</tr>

{{ТЗ РЦ}}
<tr class="TableBody">
 <td  align=left>&nbsp &nbsp &nbsp в т.ч. {СетьРЦ}</td>
 <td  align=left>{Адрес}</td>
 <td  align=right>{ОстатокРЦ}
</tr>

{{итог}}

<tr>
 <td class=Total  align=left>  Итого по магазинам (без ост.РЦ): </td>
 <td class=Total  align=left>&nbsp</td>
 <td class=Total align=right>{Итого остаток}</td>
</tr>

<tr>
 <td class=Total  align=left>  Итого по РЦ: </td>
 <td class=Total  align=left>&nbsp</td>
 <td class=Total align=right> {Итого остаток РЦ} </td>
</tr>

<tr>
 <td class=Total  align=left>  Итого: </td>
 <td class=Total  align=left>&nbsp</td>
 <td class=Total align=right> {Итого остаток всего} </td>
</tr>

</table>
</body></html>


 ←
 12124195[164823083]             Блоки шаблона ←
 12124197[164823133]               Блок шаблона • заголовок ←
 12124197[164823134]               Блок шаблона • строка ←
 12124197[164823135]               Блок шаблона • итог ←
 12124197[170655748]               Блок шаблона • Сеть ←
 12124197[170655749]               Блок шаблона • ТЗ РЦ ←
 12124194[164823087]             Поля шаблона ←
 12124196[164824808]               Поле шаблона • STYLE ≡ Стиль 1 (голубой мелкий) ∙ 381[11534337] ←
 12124196[164824809]               Поле шаблона • Дата ≡ Текущие дата-время ∙ 249[42467332] ←
 12124196[164824810]               Поле шаблона • Товар ≡ <<Продукт>> ∙ 367[3] ←
      411[164827365]                 Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
 12124196[164824811]               Поле шаблона • Подразделение ≡ Подразделение ∙ 381[2] ←
      411[164827366]                 Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 12124196[171704392]               Поле шаблона • Адрес ≡ Адрес ∙ 65545[171704453] ←
 12124196[164824812]               Поле шаблона • Номер магазина ≡ КЯ ∙ 65545[164825877] ←
 12124196[170655753]               Поле шаблона • Сеть имя ≡ Сеть ∙ 65545[170655833] ←
 12124196[164824813]               Поле шаблона • STOCK ≡ Для хранения числа ∙ 381[6291457] ←
 12124196[164824814]               Поле шаблона • Итого остаток ≡ Итого остаток по магазинам ∙ 65545[164825874] ←
 12124196[170655752]               Поле шаблона • Итого сеть ≡ Итого по сети ∙ 65545[170655834] ←
 12124196[164824815]               Поле шаблона • Итого остаток РЦ ≡ Итого остаток РЦ ∙ 65545[164825875] ←
 12124196[164824816]               Поле шаблона • Итого остаток всего ≡ Итого остататок ∙ 65545[164825876] ←
 12124196[170655754]               Поле шаблона • СетьРЦ ≡ Сеть РЦ ∙ 65545[170655835] ←
 12124196[170655755]               Поле шаблона • ОстатокРЦ ≡ Остаток по РЦ ∙ 65545[170655836] ←
  1507531[164823091]         Подстановки виртуальных блоков ←
 30867469[164823777]           БЛОК ≡ Инициализация ∙ 30867469[12058692] ←
 12124190[164823156]             Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823164]               Список полей формы ←
      598[164823539]                 Поле (колонка) для ввода данных ≡ Партнер ∙ 381[3] ←
      209[164823235]                   Выбор из списка ≡ Выбор торгового партнера по наименованию ∙ 371[11141132] ←
      598[164823540]                 Поле (колонка) для ввода данных ≡ Учитывать закрытые подразделения ∙ 65545[164825873] ←
 30867469[164823778]           БЛОК ≡ Подготовка данных ∙ 30867469[12058688] ←
 11010105[164823230]             Индикатор ⁼ Запрос... ←
  1507728[164823506]             Начало многострочного комментария ←
 11010088[164824470]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823724]               Выражение ←
      404[164839643]                 Результат ≡ Текущие дата-время ∙ 249[42467332] ←
  1507729[164823504]             Конец многострочного комментария ←
  1507360[164823648]             Отбор данных (по запросу) • Остатки ←
 12124213[164823340]               Параметры ←
  1507335[164823607]                 Параметр • Магазин ≡ Подразделения ∙ 12124204[164823420] ←
  1507494[164825563]                   Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1507335[164823953]                 Параметр • Наименование ≡ Магазины ∙ 12124204[164823421] ←
  1507494[164828620]                   Уточняющий параметр ≡ Наименование ∙ 283[5] ←
  1507335[171704482]                 Параметр • Город ≡ Города ∙ 12124204[171704421] ←
  1507494[171704836]                   Уточняющий параметр ≡ Наименование ∙ 296[6] ←
  1507335[171704513]                 Параметр • Улица ≡ Улицы ∙ 12124204[171704422] ←
  1507494[171704837]                   Уточняющий параметр ≡ Наименование ∙ 296[6] ←
  1507335[171704514]                 Параметр • Дом ≡ Магазины ∙ 12124204[164823421] ←
  1507494[171704838]                   Уточняющий параметр ≡ Дом ∙ 283[14745632] ←
  1507335[171704515]                 Параметр • Помещение ≡ Магазины ∙ 12124204[164823421] ←
  1507494[171704839]                   Уточняющий параметр ≡ Квартира (Комната) ∙ 283[14745634] ←
  1507335[164823608]                 Параметр ≡ Остаток ∙ 1507449[164823243] ←
  1507447[164823117]               Выражения ←
  1507449[164823243]                 Выражение • Остаток ≡ Число ∙ 107[4] ←
  1507455[164824927]                   Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[164823119]                     Значения параметров ←
  1507477[164823152]                       Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[164823152]                         Выражение ≡ Ост ∙ 1507449[164823244] ←
  1507449[164823244]                 Выражение • Ост ≡ Число ∙ 107[4] ←
  1507376[164824709]                   Выражение ←
  1507455[164824928]                     Результат ∙ 12124204[164823419] ←
  1507494[164825561]                       Уточняющий параметр ≡ Сумма дебет ∙ 393[9] ←
      406[164823580]                     Вычесть ←
  1507455[164824929]                     Результат ∙ 12124204[164823419] ←
  1507494[164825562]                       Уточняющий параметр ≡ Сумма кредит ∙ 393[10] ←
  1507673[164823178]               Ключи оптимизации ←
  1507446[164823044]                 Использовать прямой порядок индекса ∙ 12124204[164823419] ←
  1507676[164823228]                   Уточняющий параметр ≡ ЦФО --> Счет --> Ан2 --> Валюта ∙ 1507445[1507441] ←
 12124200[164823282]               From         (Таблицы) ←
 12124204[164823419]                 Таблица ≡ Сальдо ∙ 108[10] ←
 12124204[164823420]                 Таблица • Подразделения ≡ Партнер ∙ 108[4] ←
 12124204[164823421]                 Таблица • Магазины ≡ Партнер ∙ 108[4] ←
  1507506[164823484]                   Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164823510]                     Если истинно выражение ≡ Учитывать закрытые подразделения ∙ 65545[164825873] ←
 12124204[164823422]                 Таблица • Партии ≡ Продукт ∙ 108[3] ←
  1507506[164823485]                   Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164823511]                     Если истинно выражение ≡ Партнер ∙ 381[3] ←
 12124204[171704421]                 Таблица • Города ≡ Каталог ∙ 108[2] ←
 12124204[171704422]                 Таблица • Улицы ≡ Каталог ∙ 108[2] ←
 12124215[164823420]               Where      (Ограничения на отбор данных) ←
  1507376[164824699]                 Выражение ←
  1507455[164824914]                   Результат ∙ 12124204[164823419] ←
  1507494[164825548]                     Уточняющий параметр ≡ ЦФО ∙ 393[1] ←
  1638473[164825203]                   Равно ←
  1507452[164824256]                   Константа ≡ Центр финанс. ответственности для ТОВАРНЫХ ПЛАНОВ ∙ 117[45613057] ←
  1507376[164824700]                 Выражение ←
  1507455[164824915]                   Результат ∙ 12124204[164823419] ←
  1507494[164825549]                     Уточняющий параметр ≡ Счет ∙ 393[2] ←
  1638473[164825204]                   Равно ←
  1507452[164824257]                   Константа ≡ Количество по партиям (товарный запас) ∙ 131[14417935] ←
  1507376[164824701]                 Выражение ←
  1507455[164824916]                   Результат ∙ 12124204[164823419] ←
  1507494[164825550]                     Уточняющий параметр ≡ Аналитика (1) ∙ 393[3] ←
  1638473[164825205]                   Равно ←
  1507455[164824917]                   Результат ≡ Подразделения ∙ 12124204[164823420] ←
  1507494[164825551]                     Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1507376[164824702]                 Выражение ←
  1507455[164824918]                   Результат ∙ 12124204[164823419] ←
  1507494[164825552]                     Уточняющий параметр ≡ Аналитика (2) ∙ 393[4] ←
  1638473[164825206]                   Равно ←
  1507452[164824258]                   Константа ≡ <<Продукт>> ∙ 367[3] ←
  1507376[164824703]                 Выражение ←
  1507455[164824919]                   Результат ∙ 12124204[164823419] ←
  1507494[164825553]                     Уточняющий параметр ≡ Валюта ∙ 393[8] ←
  1638473[164825207]                   Равно ←
  1507452[164824259]                   Константа ≡ Штука ∙ 131108[28049409] ←
  1507376[164824704]                 Выражение ←
  1507455[164824920]                   Результат ≡ Подразделения ∙ 12124204[164823420] ←
  1507494[164825554]                     Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[164825208]                   Равно ←
  1507488[164823275]                   Константа (Ограничение по классу, типу, плану счетов) ≡ Товарный склад/секция ∙ 284[14745607] ←
  1507376[171704605]                 Выражение ←
  1507455[171704679]                   Результат ≡ Магазины ∙ 12124204[164823421] ←
  1507494[171704832]                     Уточняющий параметр ≡ Город ∙ 283[28835895] ←
  1638473[171704540]                   Равно ←
  1507455[171704680]                   Результат ≡ Города ∙ 12124204[171704421] ←
  1507494[171704833]                     Уточняющий параметр ≡ Каталог ∙ 296[1] ←
  1507376[171704606]                 Выражение ←
  1507455[171704681]                   Результат ≡ Магазины ∙ 12124204[164823421] ←
  1507494[171704834]                     Уточняющий параметр ≡ Улица ∙ 283[28835896] ←
  1638473[171704541]                   Равно ←
  1507455[171704682]                   Результат ≡ Улицы ∙ 12124204[171704422] ←
  1507494[171704835]                     Уточняющий параметр ≡ Каталог ∙ 296[1] ←
  1507376[164824705]                 Выражение ←
  1507506[164823487]                   Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164823513]                     Если истинно выражение ≡ Партнер ∙ 381[3] ←
  1507455[164824921]                   Результат ∙ 12124204[164823419] ←
  1507494[164825555]                     Уточняющий параметр ≡ Аналитика (3) ∙ 393[5] ←
  1638473[164825209]                   Равно ←
  1507455[164824922]                   Результат ≡ Партии ∙ 12124204[164823422] ←
  1507494[164825556]                     Уточняющий параметр ≡ Продукт ∙ 305[1] ←
  1507376[164824706]                 Выражение ←
  1507506[164823489]                   Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164823515]                     Если истинно выражение ≡ Партнер ∙ 381[3] ←
  1507455[164824923]                   Результат ≡ Партии ∙ 12124204[164823422] ←
  1507494[164825557]                     Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
  1638473[164825210]                   Равно ←
  1507452[164824260]                   Константа ≡ Партнер ∙ 381[3] ←
  1507376[164824707]                 Выражение ←
  1507506[164823491]                   Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164823517]                     Если истинно выражение ≡ Учитывать закрытые подразделения ∙ 65545[164825873] ←
  1507455[164824924]                   Результат ≡ Подразделения ∙ 12124204[164823420] ←
  1507494[164825558]                     Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[164825211]                   Равно ←
  1507455[164824925]                   Результат ≡ Магазины ∙ 12124204[164823421] ←
  1507494[164825559]                     Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1507376[164824708]                 Выражение ←
  1507506[164823493]                   Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164823519]                     Если истинно выражение ≡ Учитывать закрытые подразделения ∙ 65545[164825873] ←
  1507455[164824926]                   Результат ≡ Магазины ∙ 12124204[164823421] ←
  1507494[164825560]                     Уточняющий параметр ≡ Не рассчитывать скорость продаж ∙ 283[43122692] ←
  1638473[164825212]                   Равно ←
  1507452[164824261]                   Константа ≡ Да ∙ 131203075[131203074] ←
 12124224[164823067]               Group By  (Группировка) ←
  1507533[164823106]                 Группировать по параметру ≡ Магазин ∙ 1507335[164823607] ←
  1507533[164823229]                 Группировать по параметру ≡ Наименование ∙ 1507335[164823953] ←
  1507533[171704356]                 Группировать по параметру ≡ Город ∙ 1507335[171704482] ←
  1507533[171704357]                 Группировать по параметру ≡ Улица ∙ 1507335[171704513] ←
  1507533[171704358]                 Группировать по параметру ≡ Дом ∙ 1507335[171704514] ←
  1507533[171704359]                 Группировать по параметру ≡ Помещение ∙ 1507335[171704515] ←
  1507585[164823042]               Having     (Ограничения на группы строк заданных разделом GROUP BY) ←
  1507376[164824710]                 Выражение ←
  1507455[164824930]                   Результат ≡ Остаток ∙ 1507449[164823243] ←
  1638479[164823421]                   Не равно ←
  1507452[164824262]                   Константа ⁼ 0 ←
 12124222[164823321]               Order By   (Сортировка) ←
  1507464[164823325]                 Сортировать по возрастанию ≡ Наименование ∙ 1507335[164823953] ←
 30867466[164823745]               Выполнить после получения записи ←
 11010080[164829064]                 = ≡ Подразделение ∙ 381[2] ←
      404[164839644]                   Результат ≡ Магазин ∙ 1507335[164823607] ←
 11010080[164829065]                 = ≡ КЯ ∙ 65545[164825877] ←
      404[164839645]                   Результат ≡ Подразделение ∙ 381[2] ←
      411[164827367]                     Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
      411[164830347]                       Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
 11010080[170655902]                 = ≡ Сеть ∙ 65545[170655833] ←
      404[170656330]                   Результат ≡ Подразделение ∙ 381[2] ←
      411[170655953]                     Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
      411[170655954]                       Уточняющий параметр ≡ Родитель ∙ 283[2] ←
      411[170655955]                         Уточняющий параметр ≡ Родитель ∙ 283[2] ←
      411[170655956]                           Уточняющий параметр ≡ Родитель ∙ 283[2] ←
      411[170655957]                             Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 30867470[170655788]                 IF ←
  1638463[170655812]                   Условие ←
  1638460[170655801]                     НЕ ←
      404[170656335]                     Результат ≡ Сеть ∙ 65545[170655833] ←
 30867472[170655788]                   THEN • присвоим яя ←
 11010080[170655914]                     = ≡ Сеть ∙ 65545[170655833] ←
      404[170656336]                       Результат ⁼ 'яя' ←
 11010080[164829066]                 = ≡ Для хранения числа ∙ 381[6291457] ←
      404[164839646]                   Результат ∙ 1507335[164823608] ←
 11010080[171704465]                 = ≡ Адрес ∙ 65545[171704453] ←
      404[171704759]                   Результат ≡ Город ∙ 1507335[171704482] ←
  1638487[171704352]                   Конкатенировать строки ←
      404[171704760]                   Результат ⁼ ', ' ←
  1638487[171704353]                   Конкатенировать строки ←
      404[171704761]                   Результат ≡ Улица ∙ 1507335[171704513] ←
  1638487[171704354]                   Конкатенировать строки ←
      404[171704762]                   Результат ⁼ ', д.' ←
  1638487[171704355]                   Конкатенировать строки ←
      404[171704763]                   Результат ≡ Дом ∙ 1507335[171704514] ←
  1638461[171704332]                   Условный оператор (IF) ←
  1638463[171704363]                     Условие ←
      404[171704764]                       Результат ≡ Помещение ∙ 1507335[171704515] ←
  1638479[171704329]                       Не равно ←
  1638402[171704339]                       NULL ←
      105[171704332]                     То ←
  1638461[171704333]                       Условный оператор (IF) ←
  1638463[171704364]                         Условие ←
      116[171704339]                           Выражение ←
      404[171704765]                             Результат ≡ SubString ∙ 249[1507580] ←
 32505862[171704378]                               Значения формальных параметров при вызове ←
 32505860[171704417]                                 Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[171704438]                                   Выражение ≡ Помещение ∙ 1507335[171704515] ←
 32505860[171704418]                                 Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[171704439]                                   Выражение ⁼ 1 ←
 32505860[171704419]                                 Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[171704440]                                   Выражение ⁼ 3 ←
  1638473[171704542]                             Равно ←
      404[171704766]                             Результат ⁼ 'пом' ←
      412[171704324]                           ИЛИ ←
      116[171704357]                           Выражение ←
      404[171704767]                             Результат ≡ SubString ∙ 249[1507580] ←
 32505862[171704379]                               Значения формальных параметров при вызове ←
 32505860[171704420]                                 Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[171704441]                                   Выражение ≡ Помещение ∙ 1507335[171704515] ←
 32505860[171704421]                                 Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[171704442]                                   Выражение ⁼ 1 ←
 32505860[171704422]                                 Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[171704443]                                   Выражение ⁼ 3 ←
  1638473[171704543]                             Равно ←
      404[171704768]                             Результат ⁼ 'стр' ←
      105[171704333]                         То ←
  1638487[171704356]                           Конкатенировать строки ←
      404[171704769]                           Результат ⁼ ', ' ←
  1638487[171704357]                           Конкатенировать строки ←
      404[171704770]                           Результат ≡ Помещение ∙ 1507335[171704515] ←
      424[171704329]                         Иначе ←
  1638487[171704358]                           Конкатенировать строки ←
      404[171704771]                           Результат ⁼ ', пом.' ←
  1638487[171704359]                           Конкатенировать строки ←
      404[171704772]                           Результат ≡ Помещение ∙ 1507335[171704515] ←
 11010092[164823248]                 Добавить в локальную таблицу ≡ Остатки ∙ 30867458[164823144] ←
  1507728[164823507]             Начало многострочного комментария ←
 11010088[164824471]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823725]               Выражение ←
      404[164839647]                 Результат ≡ Текущие дата-время ∙ 249[42467332] ←
  1507729[164823505]             Конец многострочного комментария ←
 30867469[164823779]           БЛОК ≡ Печать данных ∙ 30867469[12058690] ←
 30867477[164823137]             Отбор данных из локальной таблицы ≡ Остатки ∙ 30867458[164823144] ←
 30867465[164823096]               Выполнить при старте ←
  1507728[164823505]                 Начало многострочного комментария ←
 11010088[164824472]                 ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823726]                   Выражение ←
      404[164839648]                     Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[164827368]                       Уточняющий параметр ≡ Код ∙ 305[5] ←
  1638487[164823433]                     Конкатенировать строки ←
      404[164839649]                     Результат ⁼ ';' ←
  1638487[164823434]                     Конкатенировать строки ←
      404[164839650]                     Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[164827369]                       Уточняющий параметр ≡ Наименование ∙ 305[6] ←
  1507729[164823503]                 Конец многострочного комментария ←
 11010088[164824473]                 ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780357[164823328]                   Ссылка на блок шаблона ≡ заголовок ∙ 12124197[164823133] ←
 11010080[164829067]                 = ≡ Итого остаток по магазинам ∙ 65545[164825874] ←
      404[164839651]                   Результат ⁼ 0 ←
 11010080[164829068]                 = ≡ Итого остаток РЦ ∙ 65545[164825875] ←
      404[164839652]                   Результат ⁼ 0 ←
 11010080[164829069]                 = ≡ Итого остататок ∙ 65545[164825876] ←
      404[164839653]                   Результат ⁼ 0 ←
 30867484[170655746]               Выполнить перед обработкой блока ≡ Сеть ∙ 30867481[170655746] ←
 11010080[170655903]                 = ≡ Итого по сети ∙ 65545[170655834] ←
      404[170656331]                   Результат ⁼ 0 ←
 30867466[164823746]               Выполнить после получения записи ←
 11010088[164824474]                 ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780357[164823334]                   Ссылка на блок шаблона ≡ строка ∙ 12124197[164823134] ←
  1507728[164823503]                 Начало многострочного комментария ←
 11010088[164824475]                 ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823727]                   Выражение ←
      404[164839654]                     Результат ≡ КЯ ∙ 65545[164825877] ←
      404[164839655]                     Результат ⁼ ';' ←
      404[164839656]                     Результат ≡ Подразделение ∙ 381[2] ←
      404[164839657]                     Результат ⁼ ';' ←
      404[164839658]                     Результат ≡ Для хранения числа ∙ 381[6291457] ←
  1507729[164823501]                 Конец многострочного комментария ←
 30867470[164824376]                 IF ←
  1638463[164824606]                   Условие ←
      404[164839659]                     Результат ≡ Подразделение ∙ 381[2] ←
      411[164830350]                       Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
      411[164830351]                         Уточняющий параметр ≡ Назначение подразделения ∙ 283[15073286] ←
  1638473[164827448]                     Равно ←
      404[164850663]                     Результат ≡ Распределительный центр ∙ 655294475[655294467] ←
 30867472[164824353]                   THEN • суммируем по РЦ и выводим детализацию ←
 48431132[164823405]                     += ≡ Итого остаток РЦ ∙ 65545[164825875] ←
      404[164839661]                       Результат ≡ Для хранения числа ∙ 381[6291457] ←
  1507360[170655789]                     Отбор данных (по запросу) • Остатки по подразделению ←
  1507673[170655770]                       Ключи оптимизации ←
  1507446[170655745]                         Использовать прямой порядок индекса ∙ 12124204[170655786] ←
  1507676[170655780]                           Уточняющий параметр ≡ ЦФО --> Счет --> Ан1 --> Ан2 --> Ан3 --> Ан4 --> Ан5 --> Валюта ∙ 1507445[1507435] ←
  1507447[170655757]                       Выражения ←
  1507449[170655766]                         Выражение • Остаток ≡ Число ∙ 107[4] ←
  1507455[170655910]                           Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[170655752]                             Значения параметров ←
  1507477[170655753]                               Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[170655753]                                 Выражение ≡ Ост ∙ 1507449[170655769] ←
  1507449[170655769]                         Выражение • Ост ≡ Число ∙ 107[4] ←
  1507376[170655883]                           Выражение ←
  1507455[170655911]                             Результат ∙ 12124204[170655786] ←
  1507494[170656008]                               Уточняющий параметр ≡ Сумма дебет ∙ 393[9] ←
      406[170655750]                             Вычесть ←
  1507455[170655912]                             Результат ∙ 12124204[170655786] ←
  1507494[170656009]                               Уточняющий параметр ≡ Сумма кредит ∙ 393[10] ←
 12124213[170655782]                       Параметры ←
  1507335[170655811]                         Параметр • Сеть ≡ Подразделения ∙ 12124204[170655787] ←
  1507494[170656010]                           Уточняющий параметр ≡ Ранг партнера ∙ 283[28835905] ←
  1507335[170655812]                         Параметр • Наименование ≡ Подразделения ∙ 12124204[170655787] ←
  1507494[170656011]                           Уточняющий параметр ≡ Наименование ∙ 283[5] ←
  1507335[171704516]                         Параметр • Город ≡ Города ∙ 12124204[171704423] ←
  1507494[171704844]                           Уточняющий параметр ≡ Наименование ∙ 296[6] ←
  1507335[171704517]                         Параметр • Улица ≡ Улицы ∙ 12124204[171704424] ←
  1507494[171704845]                           Уточняющий параметр ≡ Наименование ∙ 296[6] ←
  1507335[171704518]                         Параметр • Дом ≡ Магазины ∙ 12124204[170655788] ←
  1507494[171704846]                           Уточняющий параметр ≡ Дом ∙ 283[14745632] ←
  1507335[171704519]                         Параметр • Помещение ≡ Магазины ∙ 12124204[170655788] ←
  1507494[171704847]                           Уточняющий параметр ≡ Квартира (Комната) ∙ 283[14745634] ←
  1507335[170655813]                         Параметр ≡ Остаток ∙ 1507449[170655766] ←
 12124200[170655771]                       From         (Таблицы) ←
 12124204[170655786]                         Таблица ≡ Сальдо ∙ 108[10] ←
 12124204[170655787]                         Таблица • Подразделения ≡ Партнер ∙ 108[4] ←
 12124204[170655788]                         Таблица • Магазины ≡ Партнер ∙ 108[4] ←
  1507506[170655805]                           Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[170655875]                             Если истинно выражение ≡ Учитывать закрытые подразделения ∙ 65545[164825873] ←
 12124204[170655789]                         Таблица • Партии ≡ Продукт ∙ 108[3] ←
  1507506[170655806]                           Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[170655876]                             Если истинно выражение ≡ Партнер ∙ 381[3] ←
 12124204[171704423]                         Таблица • Города ≡ Каталог ∙ 108[2] ←
 12124204[171704424]                         Таблица • Улицы ≡ Каталог ∙ 108[2] ←
 12124215[170655780]                       Where      (Ограничения на отбор данных) ←
  1507376[170655873]                         Выражение ←
  1507455[170655897]                           Результат ∙ 12124204[170655786] ←
  1507494[170655995]                             Уточняющий параметр ≡ ЦФО ∙ 393[1] ←
  1638473[170655872]                           Равно ←
  1507452[170655839]                           Константа ≡ Центр финанс. ответственности для ТОВАРНЫХ ПЛАНОВ ∙ 117[45613057] ←
      413[170655833]                         И ←
  1507376[170655874]                         Выражение ←
  1507455[170655898]                           Результат ∙ 12124204[170655786] ←
  1507494[170655996]                             Уточняющий параметр ≡ Счет ∙ 393[2] ←
  1638473[170655873]                           Равно ←
  1507452[170655841]                           Константа ≡ Количество по партиям (товарный запас) ∙ 131[14417935] ←
      413[170655834]                         И ←
  1507376[170655878]                         Выражение ←
  1507455[170655903]                           Результат ∙ 12124204[170655786] ←
  1507494[170656001]                             Уточняющий параметр ≡ Аналитика (1) ∙ 393[3] ←
  1507662[170655751]                           IN  (равно какому-либо из...) ←
  1507673[170655771]                             Ключи оптимизации ←
  1507675[170655780]                               Использовать индекс ≡ ТЗ по ТТ ∙ 12124204[170655790] ←
  1507676[170655781]                                 Уточняющий параметр ≡ По родителю ∙ 1507445[1507361] ←
 12124213[170655783]                             Параметры ←
  1507335[170655814]                               Параметр ≡ ТЗ по ТТ ∙ 12124204[170655790] ←
  1507494[170656012]                                 Уточняющий параметр ≡ Партнер ∙ 283[1] ←
 12124200[170655772]                             From         (Таблицы) ←
 12124204[170655790]                               Таблица • ТЗ по ТТ ≡ Партнер ∙ 108[4] ←
 12124215[170655781]                             Where      (Ограничения на отбор данных) ←
  1507376[170655885]                               Выражение ←
  1507455[170655914]                                 Результат ≡ ТЗ по ТТ ∙ 12124204[170655790] ←
  1507494[170656013]                                   Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[170655877]                                 Равно ←
  1507488[170655768]                                 Константа (Ограничение по классу, типу, плану счетов) ≡ Товарный склад/секция ∙ 284[14745607] ←
  1507376[170655886]                               Выражение ←
  1507455[170655915]                                 Результат ≡ ТЗ по ТТ ∙ 12124204[170655790] ←
  1507494[170656014]                                   Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[170655882]                                 Равно ←
  1507452[170655847]                                 Константа ≡ Подразделение ∙ 381[2] ←
      413[170655835]                         И ←
  1507376[170655876]                         Выражение ←
  1507455[170655901]                           Результат ∙ 12124204[170655786] ←
  1507494[170655999]                             Уточняющий параметр ≡ Аналитика (2) ∙ 393[4] ←
  1638473[170655875]                           Равно ←
  1507452[170655842]                           Константа ≡ <<Продукт>> ∙ 367[3] ←
      413[170655836]                         И ←
  1507376[170655877]                         Выражение ←
  1507455[170655902]                           Результат ∙ 12124204[170655786] ←
  1507494[170656000]                             Уточняющий параметр ≡ Валюта ∙ 393[8] ←
  1638473[170655876]                           Равно ←
  1507452[170655843]                           Константа ≡ Штука ∙ 131108[28049409] ←
      413[170655837]                         И ←
  1507376[170655875]                         Выражение ←
  1507455[170655900]                           Результат ≡ Подразделения ∙ 12124204[170655787] ←
  1507494[170655998]                             Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1638473[170655874]                           Равно ←
  1507455[170655899]                           Результат ∙ 12124204[170655786] ←
  1507494[170655997]                             Уточняющий параметр ≡ Аналитика (1) ∙ 393[3] ←
      413[170655838]                         И ←
  1507376[171704607]                         Выражение ←
  1507455[171704683]                           Результат ≡ Магазины ∙ 12124204[170655788] ←
  1507494[171704840]                             Уточняющий параметр ≡ Город ∙ 283[28835895] ←
  1638473[171704544]                           Равно ←
  1507455[171704684]                           Результат ≡ Города ∙ 12124204[171704423] ←
  1507494[171704841]                             Уточняющий параметр ≡ Каталог ∙ 296[1] ←
      413[171704358]                         И ←
  1507376[171704608]                         Выражение ←
  1507455[171704685]                           Результат ≡ Магазины ∙ 12124204[170655788] ←
  1507494[171704842]                             Уточняющий параметр ≡ Улица ∙ 283[28835896] ←
  1638473[171704545]                           Равно ←
  1507455[171704686]                           Результат ≡ Улицы ∙ 12124204[171704424] ←
  1507494[171704843]                             Уточняющий параметр ≡ Каталог ∙ 296[1] ←
      413[171704359]                         И ←
  1507376[170655879]                         Выражение ←
  1507506[170655808]                           Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[170655878]                             Если истинно выражение ≡ Партнер ∙ 381[3] ←
  1507455[170655904]                           Результат ∙ 12124204[170655786] ←
  1507494[170656002]                             Уточняющий параметр ≡ Аналитика (3) ∙ 393[5] ←
  1638473[170655878]                           Равно ←
  1507455[170655905]                           Результат ≡ Партии ∙ 12124204[170655789] ←
  1507494[170656003]                             Уточняющий параметр ≡ Продукт ∙ 305[1] ←
      413[170655839]                         И ←
  1507506[170655809]                           Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[170655879]                             Если истинно выражение ≡ Партнер ∙ 381[3] ←
  1507376[170655880]                         Выражение ←
  1507506[170655810]                           Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[170655880]                             Если истинно выражение ≡ Партнер ∙ 381[3] ←
  1507455[170655906]                           Результат ≡ Партии ∙ 12124204[170655789] ←
  1507494[170656004]                             Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
  1638473[170655879]                           Равно ←
  1507452[170655844]                           Константа ≡ Партнер ∙ 381[3] ←
      413[170655840]                         И ←
  1507506[170655811]                           Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[170655881]                             Если истинно выражение ≡ Учитывать закрытые подразделения ∙ 65545[164825873] ←
  1507376[170655881]                         Выражение ←
  1507506[170655812]                           Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[170655882]                             Если истинно выражение ≡ Учитывать закрытые подразделения ∙ 65545[164825873] ←
  1507455[170655907]                           Результат ≡ Подразделения ∙ 12124204[170655787] ←
  1507494[170656005]                             Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[170655880]                           Равно ←
  1507455[170655908]                           Результат ≡ Магазины ∙ 12124204[170655788] ←
  1507494[170656006]                             Уточняющий параметр ≡ Партнер ∙ 283[1] ←
      413[170655841]                         И ←
  1507506[170655813]                           Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[170655883]                             Если истинно выражение ≡ Учитывать закрытые подразделения ∙ 65545[164825873] ←
  1507376[170655882]                         Выражение ←
  1507506[170655814]                           Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[170655884]                             Если истинно выражение ≡ Учитывать закрытые подразделения ∙ 65545[164825873] ←
  1507455[170655909]                           Результат ≡ Магазины ∙ 12124204[170655788] ←
  1507494[170656007]                             Уточняющий параметр ≡ Не рассчитывать скорость продаж ∙ 283[43122692] ←
  1638473[170655881]                           Равно ←
  1507452[170655845]                           Константа ≡ Да ∙ 131203075[131203074] ←
 12124224[170655747]                       Group By  (Группировка) ←
  1507533[170655751]                         Группировать по параметру ≡ Сеть ∙ 1507335[170655811] ←
  1507533[170655752]                         Группировать по параметру ≡ Наименование ∙ 1507335[170655812] ←
  1507533[171704360]                         Группировать по параметру ≡ Город ∙ 1507335[171704516] ←
  1507533[171704361]                         Группировать по параметру ≡ Улица ∙ 1507335[171704517] ←
  1507533[171704362]                         Группировать по параметру ≡ Дом ∙ 1507335[171704518] ←
  1507533[171704363]                         Группировать по параметру ≡ Помещение ∙ 1507335[171704519] ←
  1507585[170655745]                       Having     (Ограничения на группы строк заданных разделом GROUP BY) ←
  1507376[170655884]                         Выражение ←
  1507455[170655913]                           Результат ≡ Остаток ∙ 1507449[170655766] ←
  1638479[170655755]                           Не равно ←
  1507452[170655846]                           Константа ⁼ 0 ←
 12124222[170655757]                       Order By   (Сортировка) ←
  1507464[170655768]                         Сортировать по возрастанию ≡ Наименование ∙ 1507335[170655812] ←
 30867466[170655790]                       Выполнить после получения записи ←
 11010080[170655915]                         = ≡ Сеть РЦ ∙ 65545[170655835] ←
      404[170656337]                           Результат ≡ Сеть ∙ 1507335[170655811] ←
      411[170655958]                             Уточняющий параметр ≡ Имя ∙ 249[262146] ←
 30867470[170655789]                         IF ←
  1638463[170655813]                           Условие ←
  1638460[170655804]                             НЕ ←
      404[170656338]                             Результат ≡ Сеть РЦ ∙ 65545[170655835] ←
 30867472[170655789]                           THEN • имя подразделения ←
 11010080[170655916]                             = ≡ Сеть РЦ ∙ 65545[170655835] ←
      404[170656339]                               Результат ≡ Наименование ∙ 1507335[170655812] ←
 11010080[170655921]                         = ≡ Остаток по РЦ ∙ 65545[170655836] ←
      404[170656342]                           Результат ∙ 1507335[170655813] ←
 11010080[171704466]                         = ≡ Адрес ∙ 65545[171704453] ←
      404[171704773]                           Результат ≡ Город ∙ 1507335[171704516] ←
  1638487[171704360]                           Конкатенировать строки ←
      404[171704774]                           Результат ⁼ ', ' ←
  1638487[171704361]                           Конкатенировать строки ←
      404[171704775]                           Результат ≡ Улица ∙ 1507335[171704517] ←
  1638487[171704362]                           Конкатенировать строки ←
      404[171704776]                           Результат ⁼ ', д.' ←
  1638487[171704363]                           Конкатенировать строки ←
      404[171704777]                           Результат ≡ Дом ∙ 1507335[171704518] ←
  1638461[171704334]                           Условный оператор (IF) ←
  1638463[171704365]                             Условие ←
      404[171704778]                               Результат ≡ Помещение ∙ 1507335[171704519] ←
  1638479[171704330]                               Не равно ←
  1638402[171704340]                               NULL ←
      105[171704334]                             То ←
  1638461[171704335]                               Условный оператор (IF) ←
  1638463[171704366]                                 Условие ←
      116[171704358]                                   Выражение ←
      404[171704779]                                     Результат ≡ SubString ∙ 249[1507580] ←
 32505862[171704380]                                       Значения формальных параметров при вызове ←
 32505860[171704423]                                         Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[171704444]                                           Выражение ≡ Помещение ∙ 1507335[171704519] ←
 32505860[171704424]                                         Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[171704445]                                           Выражение ⁼ 1 ←
 32505860[171704425]                                         Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[171704446]                                           Выражение ⁼ 3 ←
  1638473[171704546]                                     Равно ←
      404[171704780]                                     Результат ⁼ 'пом' ←
      412[171704325]                                   ИЛИ ←
      116[171704359]                                   Выражение ←
      404[171704781]                                     Результат ≡ SubString ∙ 249[1507580] ←
 32505862[171704381]                                       Значения формальных параметров при вызове ←
 32505860[171704426]                                         Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[171704447]                                           Выражение ≡ Помещение ∙ 1507335[171704519] ←
 32505860[171704427]                                         Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[171704448]                                           Выражение ⁼ 1 ←
 32505860[171704428]                                         Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[171704449]                                           Выражение ⁼ 3 ←
  1638473[171704547]                                     Равно ←
      404[171704782]                                     Результат ⁼ 'стр' ←
      105[171704335]                                 То ←
  1638487[171704364]                                   Конкатенировать строки ←
      404[171704783]                                   Результат ⁼ ', ' ←
  1638487[171704365]                                   Конкатенировать строки ←
      404[171704784]                                   Результат ≡ Помещение ∙ 1507335[171704519] ←
      424[171704330]                                 Иначе ←
  1638487[171704366]                                   Конкатенировать строки ←
      404[171704785]                                   Результат ⁼ ', пом.' ←
  1638487[171704367]                                   Конкатенировать строки ←
      404[171704786]                                   Результат ≡ Помещение ∙ 1507335[171704519] ←
 11010088[170655801]                         ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780357[170655751]                           Ссылка на блок шаблона ≡ ТЗ РЦ ∙ 12124197[170655749] ←
 30867473[164823497]                   ELSE • суммируем сумму ←
 48431132[164823404]                     += ≡ Итого остаток по магазинам ∙ 65545[164825874] ←
      404[164839660]                       Результат ≡ Для хранения числа ∙ 381[6291457] ←
 48431132[170655756]                 += ≡ Итого по сети ∙ 65545[170655834] ←
      404[170656332]                   Результат ≡ Для хранения числа ∙ 381[6291457] ←
 11010107[170655746]               Выполнить после обработки блока ≡ Сеть ∙ 30867481[170655746] ←
 30867470[170655787]                 IF ←
  1638463[170655811]                   Условие ←
      404[170656333]                     Результат ≡ Сеть ∙ 65545[170655833] ←
  1638479[170655754]                     Не равно ←
      404[170656334]                     Результат ⁼ 'яя' ←
 30867472[170655787]                   THEN • печать итогов ←
 11010088[170655800]                     ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780357[170655750]                       Ссылка на блок шаблона ≡ Сеть ∙ 12124197[170655748] ←
 30867473[170655765]                   ELSE ←
 30867467[164823089]               Выполнить при завершении ←
 11010080[164829070]                 = ≡ Итого остататок ∙ 65545[164825876] ←
  1638464[164824436]                   Ноль (0.0), если NULL ≡ Итого остаток по магазинам ∙ 65545[164825874] ←
      380[164823520]                   Сложить ←
  1638464[164824437]                   Ноль (0.0), если NULL ≡ Итого остаток РЦ ∙ 65545[164825875] ←
 11010088[164824476]                 ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780357[164823335]                   Ссылка на блок шаблона ≡ итог ∙ 12124197[164823135] ←
  1507728[164823504]                 Начало многострочного комментария ←
 11010088[164824477]                 ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823728]                   Выражение ←
      404[164839662]                     Результат ⁼ 'Итого по магазинам (без РЦ);' ←
  1638487[164823435]                     Конкатенировать строки ←
      404[164839663]                     Результат ≡ Итого остаток по магазинам ∙ 65545[164825874] ←
  1507729[164823502]                 Конец многострочного комментария ←
      127[164823342]       Процедура • Остаток по партиям ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 12124192[164823072]         Шаблоны отчетов ←
 12124193[164823090]           Шаблон отчета ≡ Базовый шаблон ∙ 12124193[1507346] ⁼ {{Заголовок}}
<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
  <link rel=stylesheet href="file:{STYLE}" type="text/css">
</head>
<body>

<P>Отпечатано : {Дата}
<H1><I> ТЕКУЩИЙ ОСТАТОК ТОВАРА {PRODUCT}</I></H1>
<table border="0" width="90%" cellspacing="0" cellpadding="4" align=center>

<tr>
  <td colspan=2 class="TableHeader" width="12%" >Товар</td>
  <td class="TableHeader" width="12%" >Остаток</td>
</tr>

{{Подразделение}}

<tr class="TableBody">
<td  align=left>{Подразделение}</td>
<td  align=right>{STOCK}
</tr>


{{Итог}}

<tr>
<td colspan=2 class=Total  align=left>  Итого {Всего товаров}</td>
<td class=Total align=right>{F_STOCK}</td>

</tr>

</table>
</body></html>


 ←
 12124195[164823084]             Блоки шаблона ←
  1507384[164823067]               <Наследуемые блоки> ←
 12124194[164823088]             Поля шаблона ←
 12124196[164824817]               Поле шаблона • STYLE ≡ Стиль 1 (голубой мелкий) ∙ 381[11534337] ←
 12124196[164824818]               Поле шаблона • Дата ≡ Текущие дата-время ∙ 249[42467332] ←
 12124196[164824819]               Поле шаблона • PRODUCT ≡ { ... выражение ... } ∙ 249[1507471] ←
      116[164824477]                 Выражение ←
      404[164839664]                   Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[164827370]                     Уточняющий параметр ≡ Код ∙ 305[5] ←
  1638487[164823436]                   Конкатенировать строки ←
      404[164839665]                   Результат ⁼ '  ' ←
  1638487[164823437]                   Конкатенировать строки ←
      404[164839666]                   Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[164827371]                     Уточняющий параметр ≡ Наименование ∙ 305[6] ←
 12124196[164824820]               Поле шаблона • Подразделение ≡ Подразделение ∙ 381[2] ←
      411[164827372]                 Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 12124196[164824821]               Поле шаблона • STOCK ≡ Для хранения числа ∙ 381[6291457] ←
 30867463[164823250]         Выполнить действия ←
 12124190[164823157]           Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823165]             Список полей формы ←
      598[164823541]               Поле (колонка) для ввода данных ≡ Партнер ∙ 381[3] ←
      209[164823236]                 Выбор из списка ≡ Выбор товарного подразделения по наименованию ∙ 371[17104897] ←
 11010088[164824478]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823729]             Выражение ←
      404[164839667]               Результат ≡ Текущие дата-время ∙ 249[42467332] ←
 11010105[164823231]           Индикатор ⁼ Запрос... ←
  1507360[164823649]           Отбор данных (по запросу) • Остатки по товару ←
 12124200[164823283]             From         (Таблицы) ←
 12124204[164823423]               Таблица ≡ Сальдо ∙ 108[10] ←
 12124204[164823424]               Таблица • Партии ≡ Продукт ∙ 108[3] ←
  1507447[164823118]             Выражения ←
  1507449[164823245]               Выражение • Ост ≡ Число ∙ 107[4] ←
  1507455[164824931]                 Результат ∙ 12124204[164823423] ←
  1507494[164825564]                   Уточняющий параметр ≡ Сумма дебет ∙ 393[9] ←
      406[164823581]                 Вычесть ←
  1507455[164824932]                 Результат ∙ 12124204[164823423] ←
  1507494[164825565]                   Уточняющий параметр ≡ Сумма кредит ∙ 393[10] ←
 12124215[164823421]             Where      (Ограничения на отбор данных) ←
  1507376[164824711]               Выражение ←
  1507376[164824712]                 Выражение ←
  1507455[164824933]                   Результат ∙ 12124204[164823423] ←
  1507494[164825566]                     Уточняющий параметр ≡ ЦФО ∙ 393[1] ←
  1638473[164825213]                   Равно ←
  1507452[164824263]                   Константа ≡ Центр финанс. ответственности для ТОВАРНЫХ ПЛАНОВ ∙ 117[45613057] ←
      413[164824579]                 И ←
  1507376[164824713]                 Выражение ←
  1507455[164824934]                   Результат ∙ 12124204[164823423] ←
  1507494[164825567]                     Уточняющий параметр ≡ Счет ∙ 393[2] ←
  1638473[164825214]                   Равно ←
  1507452[164824264]                   Константа ≡ Количество по партиям (товарный запас) ∙ 131[14417935] ←
      413[164824580]                 И ←
  1507376[164824714]                 Выражение ←
  1507455[164824935]                   Результат ∙ 12124204[164823423] ←
  1507494[164825568]                     Уточняющий параметр ≡ Аналитика (1) ∙ 393[3] ←
  1638473[164825215]                   Равно ←
  1507452[164824265]                   Константа ≡ Партнер ∙ 381[3] ←
      413[164824581]                 И ←
  1507376[164824715]                 Выражение ←
  1507455[164824936]                   Результат ∙ 12124204[164823423] ←
  1507494[164825569]                     Уточняющий параметр ≡ Аналитика (2) ∙ 393[4] ←
  1638473[164825216]                   Равно ←
  1507452[164824266]                   Константа ≡ <<Продукт>> ∙ 367[3] ←
      413[164824582]                 И ←
  1507376[164824716]                 Выражение ←
  1507455[164824937]                   Результат ∙ 12124204[164823423] ←
  1507494[164825570]                     Уточняющий параметр ≡ Валюта ∙ 393[8] ←
  1638473[164825217]                   Равно ←
  1507452[164824267]                   Константа ≡ Штука ∙ 131108[28049409] ←
      413[164824583]               И ←
  1507376[164824717]               Выражение ←
  1507455[164824938]                 Результат ≡ Партии ∙ 12124204[164823424] ←
  1507494[164825571]                   Уточняющий параметр ≡ Продукт ∙ 305[1] ←
  1638473[164825218]                 Равно ←
  1507455[164824939]                 Результат ∙ 12124204[164823423] ←
  1507494[164825572]                   Уточняющий параметр ≡ Аналитика (3) ∙ 393[5] ←
      413[164824584]               И ←
  1507376[164824718]               Выражение ←
  1507455[164824940]                 Результат ≡ Партии ∙ 12124204[164823424] ←
  1507494[164825573]                   Уточняющий параметр ≡ Родитель ∙ 305[2] ←
  1638473[164825219]                 Равно ←
  1507452[164824268]                 Константа ≡ <<Продукт>> ∙ 367[3] ←
 12124222[164823126]             Order By   (Сортировка) ←
  1507532[164823100]               Сортировать по убыванию ≡ Партии ∙ 12124204[164823424] ←
  1507494[164825574]                 Уточняющий параметр ≡ Дата ∙ 305[9] ←
 12124213[164823341]             Параметры ←
  1507335[164823609]               Параметр • Партия ≡ Партии ∙ 12124204[164823424] ←
  1507494[164825575]                 Уточняющий параметр ≡ Продукт ∙ 305[1] ←
  1507335[164823610]               Параметр • L ≡ Ост ∙ 1507449[164823245] ←
 30867466[164823747]             Выполнить после получения записи ←
 11010088[164824479]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823730]                 Выражение ←
      404[164839668]                   Результат ≡ Партия ∙ 1507335[164823609] ←
      411[164827373]                     Уточняющий параметр ≡ Код ∙ 305[5] ←
  1638487[164823438]                   Конкатенировать строки ←
      404[164839669]                   Результат ⁼ ';' ←
  1638487[164823439]                   Конкатенировать строки ←
      404[164839670]                   Результат ⁼ ';' ←
  1638487[164823440]                   Конкатенировать строки ←
      404[164839671]                   Результат ≡ L ∙ 1507335[164823610] ←
  1638487[164823441]                   Конкатенировать строки ←
      404[164839672]                   Результат ⁼ ';' ←
  1638487[164823442]                   Конкатенировать строки ←
 11010088[164824480]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823731]             Выражение ←
      404[164839673]               Результат ≡ Текущие дата-время ∙ 249[42467332] ←
      127[164823343]       Процедура • Остатки с учетом оперативного товарного запаса ≡ Остатки товара по подразделениям ∙ 127[21430628] ←
       12[164823097]         Иконка ≡ Отчет ∙ 90[16] ←
      432[164823077]         Использование (в режиме выполнения) ≡ Нет ∙ 534[40566786] ←
      127[164823344]       Процедура • Остатки по товару в разрезе подразделений ≡ Остатки по товару в разрезе подразделений ∙ 127[16842754] ←
 32505862[164824813]         Значения формальных параметров при вызове ←
 32505860[164826872]           Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[16843365] ←
   327700[164828062]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[164823345]       Процедура ≡ Остатки товара и по каждой партии (не ноль) на ДАТУ ∙ 127[58392759] ←
      127[656082417]       Процедура • Текущие остатки по магазинам с учётом активной матрицы товаров ≡ ОПТ Текущие остатки по магазинам с учётом активной матрицы товаров ∙ 127[165543950] ←
 32505862[656086695]         Значения формальных параметров при вызове ←
 32505860[656091869]           Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[165544179] ←
   327700[656100063]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
      103[164823169]       Команда ≡ ------------ ∙ 102[57343] ←
       73[164823055]       Отчет • Товарный отчет в двух рублевых ценах ≡ Товарный отчет по закупочной цене(базовые товары) ∙ 73[13566206] ←
      432[164823078]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[164823520]           Если истинно выражение ≡ Видимость розн. цены на магазине ∙ 117[164430104] ←
       73[164823056]       Отчет • Товарный отчет по партиям в двух рублевых ценах ≡ Товарный отчет по закупочной цене(партионные товары) ∙ 73[13566207] ←
      432[164823079]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[164823521]           Если истинно выражение ≡ Видимость розн. цены на магазине ∙ 117[164430104] ←
      103[164823170]       Команда ≡ ------------ ∙ 102[57343] ←
      432[164823080]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[164823522]           Если истинно выражение ≡ Видимость розн. цены на магазине ∙ 117[164430104] ←
      113[164823062]       Сценарий (Меню) • Движение товара ←
      432[164823081]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[164823523]           Если истинно выражение ≡ Видимость розн. цены на магазине ∙ 117[164430104] ←
      127[164823346]         Процедура ≡ Реализация по товару ∙ 127[13567291] ←
       12[164823098]           Иконка ≡ Отчет ∙ 90[16] ←
       73[164823057]         Отчет ≡ Движение партий, итоги по операциям ∙ 73[2818853] ←
      103[164823171]         Команда ≡ ------------ ∙ 102[57343] ←
       73[164823058]         Отчет ≡ Приходы по месяцам ∙ 73[2818854] ←
      103[164823172]         Команда ≡ ------------ ∙ 102[57343] ←
       73[164823059]         Отчет ≡ Реализация по дням недели за месяц ∙ 73[2818856] ←
       73[164823060]         Отчет ≡ Реализация по времени суток за неделю (ККЛ) ∙ 73[2818857] ←
      103[164823173]     Команда ≡ ------------ ∙ 102[57343] ←
      127[164823347]     Процедура ≡ Выгрузка товаров для весов  CAS+МЕТЛЕР+ACLAS ∙ 127[144965910] ←
 32505862[164824814]       Значения формальных параметров при вызове ←
 32505860[164826873]         Значение параметра при вызове процедуры/функции ≡ фп Продукт ∙ 65545[144966666] ←
   327700[164828063]           Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826874]         Значение параметра при вызове процедуры/функции ≡ фп Выгружать данные в весы? ∙ 65545[144966668] ←
   327700[164828064]           Выражение ⁼ 1 ←
      127[165347590]     Процедура • Документы ПРОМО по товару ≡ Документы ПРОМО по товару через проводки ∙ 127[165347487] ←
      127[171835427]     Процедура • Документы ПРОМО по товару (следующие 20 дней) ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[171835480]       Выполнить действия ←
 39780361[171835406]         ЗАВЕРШИТЬ БЛОК ←
      116[171835751]           Выражение ←
  1638460[171835453]             НЕ ←
      404[171839552]             Результат ≡ Есть ПРОМО на товар (период +20 дней) - ДУЦ ∙ 249[164364385] ←
 32505862[171835897]               Значения формальных параметров при вызове ←
 32505860[171836380]                 Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164369870] ←
   327700[171836962]                   Выражение ≡ <<Продукт>> ∙ 367[3] ←
 12124191[171835394]         Вид просмотра • ПРОМО-акции ≡ ДОКУМЕНТЫ {...} ∙ 371[18546725] ←
   262166[171835398]           Заголовок ≡ Заголовок ∙ 117[656081128] ←
 32505862[171835898]           Значения формальных параметров при вызове ←
 32505860[171836381]             Значение параметра при вызове процедуры/функции ≡ Фильтр.Список типов ∙ 65545[18547219] ←
   327700[171836963]               Выражение ≡ Перечень товаров для акции ∙ 332[3342383] ←
 32505860[171836382]             Значение параметра при вызове процедуры/функции ≡ Фильтр.Список UID-ов ∙ 65545[1510082] ←
   327700[171836964]               Выражение ≡ Есть ПРОМО на товар (период +20 дней) - ДУЦ ∙ 249[164364385] ←
 32505862[171835899]                 Значения формальных параметров при вызове ←
 32505860[171836383]                   Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164369870] ←
   327700[171836965]                     Выражение ≡ <<Продукт>> ∙ 367[3] ←
      247[171835394]           Список полей просмотра ←
      117[171835414]             Выражение • * ←
  1638461[171835487]               Условный оператор (IF) ←
  1638463[171835730]                 Условие ←
      404[171839553]                   Результат ≡ <<Документ>> ∙ 367[5] ←
      411[171836967]                     Уточняющий параметр ≡ Состояние документа ∙ 331[14] ←
      105[171835487]                 То ←
      404[171839554]                   Результат ⁼ * ←
      424[171835454]                 Иначе ←
  1638402[171835477]                   NULL ←
      590[171835406]             Поле (колонка), являющееся параметром объекта ≡ * ∙ 117[171835414] ←
      326[171835396]               Минимально возможная ширина ⁼ 3 ←
      351[171835393]               Максимально возможная ширина ⁼ 3 ←
      605[171835393]               Выравнивание ≡ По центру ∙ 607[4] ←
      590[171835407]             Поле (колонка), являющееся параметром объекта • Код ≡ <<Документ>> ∙ 367[5] ←
      411[171836968]               Уточняющий параметр ≡ Код ∙ 331[6] ←
      326[171835397]               Минимально возможная ширина ⁼ 15 ←
      605[171835394]               Выравнивание ≡ По левой границе ∙ 607[1] ←
      590[171835408]             Поле (колонка), являющееся параметром объекта • Дата ≡ Дата ∙ 331[8] ←
   131097[171835758]               Формат ≡ Дата без времени ∙ 131096[131073] ←
      326[171835398]               Минимально возможная ширина ⁼ 20 ←
      605[171835395]               Выравнивание ≡ По левой границе ∙ 607[1] ←
      590[171835409]             Поле (колонка), являющееся параметром объекта ≡ Дата начальная ∙ 331[14745601] ←
   131097[171835759]               Формат ≡ Дата без времени ∙ 131096[131073] ←
      605[171835396]               Выравнивание ≡ По левой границе ∙ 607[1] ←
      590[171835410]             Поле (колонка), являющееся параметром объекта ≡ Дата конечная ∙ 331[14745602] ←
   131097[171835763]               Формат ≡ Дата без времени ∙ 131096[131073] ←
      605[171835397]               Выравнивание ≡ По левой границе ∙ 607[1] ←
      590[171835411]             Поле (колонка), являющееся параметром объекта • Подразделение ≡ <<Документ>> ∙ 367[5] ←
      411[171836969]               Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[171836975]                 Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      326[171835399]               Минимально возможная ширина ⁼ 35 ←
      605[171835398]               Выравнивание ≡ По левой границе ∙ 607[1] ←
      590[171835412]             Поле (колонка), являющееся параметром объекта • Тип ≡ Условия оплаты ∙ 331[14352404] ←
      326[171835400]               Минимально возможная ширина ⁼ 20 ←
      411[171836976]               Уточняющий параметр ≡ Имя ∙ 249[262146] ←
      590[171835413]             Поле (колонка), являющееся параметром объекта ≡ Комментарий ∙ 331[11] ←
      212[171835398]           Сценарий ←
      103[171835402]             Команда • Назад ≡ Назад ∙ 102[57089] ←
       12[171835413]               Иконка ≡ Back ∙ 90[24] ←
      127[170917907]     Процедура • Выгрузить текущий товар в LOYMAX ≡ Выгрузка списка товаров для LOYMAX (XML) ∙ 127[164365368] ←
      432[170917990]       Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1507508[170918147]         Если истинно выражение ≡ Текущий пользователь - Жуков ∙ 117[165347329] ←
  1507508[171704403]         Если истинно выражение ≡ Текущий пользователь - Апполонов ∙ 117[171311115] ←
  1507508[171115029]         Если истинно выражение ≡ Текущий пользователь - Шубин ∙ 117[165806084] ←
  1507508[170918148]         Если истинно выражение ≡ Текущий пользователь из группы Маркетинг. Аналитик отдела ∙ 117[170918060] ←
 32505862[170919259]       Значения формальных параметров при вызове ←
 32505860[170920621]         Значение параметра при вызове процедуры/функции ≡ фп Товар на выгрузку ∙ 65545[170919411] ←
   327700[170921561]           Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[170918036]     Процедура • Выгрузить текущий товар в LOYMAX (тестовый сервер) ≡ Выгрузка списка товаров для LOYMAX (XML) ∙ 127[164365368] ←
      432[170918044]       Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1507508[170918324]         Если истинно выражение ≡ Программисты (НЕ ДОБАВЛЯТЬ СЮДА НИКОГО, КРОМЕ ПРОГРАММИСТОВ) ∙ 117[164823615] ←
 32505862[170919306]       Значения формальных параметров при вызове ←
 32505860[170920689]         Значение параметра при вызове процедуры/функции ≡ фп Товар на выгрузку ∙ 65545[170919411] ←
   327700[170920266]           Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170920690]         Значение параметра при вызове процедуры/функции ≡ Сервер для отправки файла (1 - акции, 0 - товары, 2 - stg-сервер, 7 - товары на stg) ∙ 65545[164371999] ←
   327700[170920267]           Выражение ⁼ 7 ←
      127[171115100]     Процедура • Добавить товар в очередь выгрузки в LOYMAX ≡ Добавить товар в очередь выгрузки в LOYMAX ∙ 127[171115095] ←
      432[171114651]       Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1507508[171115711]         Если истинно выражение ≡ Программисты (НЕ ДОБАВЛЯТЬ СЮДА НИКОГО, КРОМЕ ПРОГРАММИСТОВ) ∙ 117[164823615] ←
 32505862[171117557]       Значения формальных параметров при вызове ←
 32505860[171119997]         Значение параметра при вызове процедуры/функции ≡ фп Продукт ∙ 65545[171118508] ←
   327700[171122144]           Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[171119998]         Значение параметра при вызове процедуры/функции ≡ фп Сервер для выгрузки (prod - 0; (def) pstg - 1; stg - 2) ∙ 65545[171118510] ←
   327700[171122145]           Выражение ⁼ 0 ←
      127[171115146]     Процедура • Добавить товар в очередь выгрузки в LOYMAX (psgt) ≡ Добавить товар в очередь выгрузки в LOYMAX ∙ 127[171115095] ←
      432[171114659]       Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1507508[171115921]         Если истинно выражение ≡ Программисты (НЕ ДОБАВЛЯТЬ СЮДА НИКОГО, КРОМЕ ПРОГРАММИСТОВ) ∙ 117[164823615] ←
 32505862[171117650]       Значения формальных параметров при вызове ←
 32505860[171120732]         Значение параметра при вызове процедуры/функции ≡ фп Продукт ∙ 65545[171118508] ←
   327700[171122638]           Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[171120733]         Значение параметра при вызове процедуры/функции ≡ фп Сервер для выгрузки (prod - 0; (def) pstg - 1; stg - 2) ∙ 65545[171118510] ←
   327700[171122639]           Выражение ⁼ 1 ←
      127[170918084]     Процедура ≡ Документы уценки 20/30/50 по товару ∙ 127[170918082] ←
      432[170917954]       Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[170917998]         Если истинно выражение ≡ Текущий пользователь - Жуков ∙ 117[165347329] ←
 32505862[170919146]       Значения формальных параметров при вызове ←
 32505860[170920399]         Значение параметра при вызове процедуры/функции ≡ ФП Товар ∙ 65545[170919052] ←
   327700[170921268]           Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[164823435]     Процедура ≡ Документы уценки по товару ∙ 127[164823434] ←
      127[170918083]     Процедура • Найти МРЦ по продукту ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[170917974]       Локальные переменные ←
    65545[170919094]         Локальная переменная • лп МРЦ ≡ Сумма ∙ 107[12] ←
      355[170918306]           Начальное значение ≡ NULL ∙ 117[30670850] ←
 30867463[170918096]       Выполнить действия ←
 11010088[170919060]         ВЫПОЛНИТЬ ≡ Определение МРЦ алкоголя по товару и дате ∙ 127[656081151] ←
 32505862[170919185]           Значения формальных параметров при вызове ←
 32505860[170920484]             Значение параметра при вызове процедуры/функции ≡ ~Товар ∙ 65545[656081859] ←
   327700[170921381]               Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170920485]             Значение параметра при вызове процедуры/функции ≡ МРЦ~ ∙ 65545[656081861] ←
   327700[170921382]               Выражение ≡ лп МРЦ ∙ 65545[170919094] ←
 30867470[170918839]         IF ←
  1638463[170919104]           Условие ←
      404[170928979]             Результат ≡ лп МРЦ ∙ 65545[170919094] ←
 30867472[170918836]           THEN ←
 11010088[170919064]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170918323]               Выражение ←
      404[170928975]                 Результат ⁼ 'Для товара ' ←
      404[170928976]                 Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[170919529]                   Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
      404[170928977]                 Результат ⁼ ' МРЦ = ' ←
      404[170928978]                 Результат ≡ лп МРЦ ∙ 65545[170919094] ←
 30867473[170918172]           ELSE ←
 11010088[170919067]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[170918324]               Выражение ←
      404[170928980]                 Результат ⁼ 'Для товара ' ←
      404[170928981]                 Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[170919530]                   Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
      404[170928982]                 Результат ⁼ ' МРЦ  НЕ НАЙДЕН' ←
      127[171835428]     Процедура • Цена из ДУЦ ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[171835412]       Локальные переменные ←
    65545[171835796]         Локальная переменная • Формат магазина ≡ Партнер ∙ 107[5] ←
    65545[171835800]         Локальная переменная • Цена из ДУЦ ≡ Число ∙ 107[4] ←
    65545[171835802]         Локальная переменная • Дата ≡ Дата ∙ 107[3] ←
 30867463[171835481]       Выполнить действия ←
  1507360[171835505]         Отбор данных (по запросу) • Форматы ценообразования ≡ ПАРТНЕРЫ ∙ 12124205[18546727] ←
 32505862[171835903]           Значения формальных параметров при вызове ←
 32505860[171836387]             Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547202] ←
   327700[171836969]               Выражение ≡ Ценовой формат ∙ 284[4653058] ←
 30867466[171835511]           Выполнить после получения записи ←
 11010080[171836087]             = ≡ Формат магазина ∙ 65545[171835796] ←
      404[171839560]               Результат ≡ з.Партнёр_UID ∙ 1507335[18547014] ←
 11010080[171836088]             = ≡ Цена из ДУЦ ∙ 65545[171835800] ←
      404[171839561]               Результат ≡ Цена из ДУЦ на дату ∙ 249[164364356] ←
 32505862[171835905]                 Значения формальных параметров при вызове ←
 32505860[171836390]                   Значение параметра при вызове процедуры/функции ≡ Товар из реестра ∙ 65545[164368290] ←
   327700[171836970]                     Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[171836391]                   Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164368299] ←
   327700[171836971]                     Выражение ≡ Формат магазина ∙ 65545[171835796] ←
 32505860[171836392]                   Значение параметра при вызове процедуры/функции ≡ Дата цены ∙ 65545[164372427] ←
   327700[171836974]                     Выражение ≡ Дата ∙ 65545[171835802] ←
 11010099[171835456]             CONTINUE ←
      116[171835752]               Выражение ←
  1638460[171835455]                 НЕ ←
      404[171839562]                 Результат ≡ Цена из ДУЦ ∙ 65545[171835800] ←
 11010088[171835666]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[171835425]               Выражение ←
      404[171839563]                 Результат ⁼ Формат: ←
      404[171839564]                 Результат ≡ Формат магазина ∙ 65545[171835796] ←
      411[171836986]                   Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      404[171839565]                 Результат ⁼ , цена: ←
      404[171839566]                 Результат ≡ Цена из ДУЦ ∙ 65545[171835800] ←
      404[171839567]                 Результат ⁼ ', дата: ' ←
      404[171839568]                 Результат ≡ Дата ∙ 65545[171835802] ←
      371[165347408]     Вид просмотра • Документы со сниженным  ОСГ ≡ Разрешение на прием товара с коротким сроком годности ∙ 371[164364344] ←
 32505862[171311672]       Значения формальных параметров при вызове ←
 32505860[171311957]         Значение параметра при вызове процедуры/функции ≡ фп Товар ∙ 65545[171311430] ←
   327700[171312201]           Выражение ≡ <<Продукт>> ∙ 367[3] ←
      371[164823082]     Вид просмотра ≡ Информация о работе с возвратами и списаниями ∙ 371[164364308] ←
      127[164823349]     Процедура • Онлайн-остаток ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[164823228]       Локальные переменные ←
    65545[656090774]         Локальная переменная • Остаток онлайн ≡ Количество ∙ 107[15] ←
 30867463[164823251]       Выполнить действия ←
 11010080[656097984]         = ≡ Остаток онлайн ∙ 65545[656090774] ←
  1638464[656084103]           Ноль (0.0), если NULL ≡ Остаток товара учитывая онлайн чеки ∙ 249[656081032] ←
 32505862[656086921]             Значения формальных параметров при вызове ←
 32505860[656093932]               Значение параметра при вызове процедуры/функции ≡ фп Продукт ∙ 65545[656090770] ←
   327700[656100617]                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[656093935]               Значение параметра при вызове процедуры/функции ≡ фп Подразделения ∙ 65545[656090771] ←
   327700[656100619]                 Выражение ≡ Подразделение для вида просмотра (глоб.перем.) ∙ 381[42401793] ←
 11010088[164824481]         ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823732]           Выражение ←
      404[164839679]             Результат ⁼ Онлайн остаток ←
  1507360[164823650]         Отбор данных (по запросу) • Запрос ←
 12124213[164823342]           Параметры ←
  1507335[164823611]             Параметр • чек_номер ∙ 12124204[164823425] ←
  1507494[164825576]               Уточняющий параметр ≡ Чек ∙ 1507443[164298847] ←
  1507335[164823612]             Параметр • чек_дата ∙ 12124204[164823425] ←
  1507494[164825577]               Уточняющий параметр ≡ Дата ∙ 1507443[164298844] ←
  1507335[164823613]             Параметр • чек_колво ∙ 12124204[164823425] ←
  1507494[164825578]               Уточняющий параметр ≡ Колво ∙ 1507443[164298845] ←
  1507335[164365376]             Параметр • чек_смена ∙ 12124204[164823425] ←
  1507494[164368673]               Уточняющий параметр ≡ Смена ∙ 1507443[164298848] ←
 12124200[164823284]           From         (Таблицы) ←
 12124204[164823425]             Таблица ≡ CHECK_ONLINE ∙ 1507433[164298769] ←
 12124215[164823422]           Where      (Ограничения на отбор данных) ←
  1507376[164824719]             Выражение ←
  1507455[164824941]               Результат ∙ 12124204[164823425] ←
  1507494[164825579]                 Уточняющий параметр ≡ Продукт ∙ 1507443[164298843] ←
  1638473[164825220]               Равно ←
  1507452[164824269]               Константа ≡ <<Продукт>> ∙ 367[3] ←
  1507376[170917995]             Выражение ←
  1507455[170918003]               Результат ≡ NVL ∙ 1507471[135266341] ←
  1507476[170917890]                 Значения параметров ←
  1507477[170917891]                   Параметр ≡ Проверяемое выражение ∙ 1507473[135266344] ←
  1507478[170917891]                     Выражение ∙ 12124204[164823425] ←
  1507494[170918020]                       Уточняющий параметр ≡ Принят ККЛ ∙ 1507443[164298846] ←
  1507477[170917892]                   Параметр ≡ Если NULL ∙ 1507473[135266345] ←
  1507478[170917892]                     Выражение ⁼ 0 ←
  1638473[170918160]               Равно ←
  1507452[170917950]               Константа ⁼ 0 ←
  1507376[164824721]             Выражение ←
  1507455[164824943]               Результат ∙ 12124204[164823425] ←
  1507494[164825581]                 Уточняющий параметр ≡ Подразделение (ТЗ) ∙ 1507443[164298850] ←
  1638473[164825222]               Равно ←
  1507452[164824270]               Константа ≡ Подразделение для вида просмотра (глоб.перем.) ∙ 381[42401793] ←
  1507376[164824722]             Выражение ←
  1507455[164824944]               Результат ∙ 12124204[164823425] ←
  1507494[164825582]                 Уточняющий параметр ≡ Дата ∙ 1507443[164298844] ←
  1638477[164823225]               Больше или равно ←
  1507376[164824723]               Выражение ←
  1507452[164824271]                 Константа ≡ Текущие дата-время ∙ 249[42467332] ←
      406[164823582]                 Вычесть ←
  1507452[164824272]                 Константа ⁼ 10 ←
 12124222[164823127]           Order By   (Сортировка) ←
  1507464[164823135]             Сортировать по возрастанию ≡ чек_дата ∙ 1507335[164823612] ←
 30867466[164823748]           Выполнить после получения записи ←
 11010088[164824482]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823733]               Выражение ←
      404[170932731]                 Результат ⁼ 'Дата = ' ←
      404[164839682]                 Результат ≡ чек_дата ∙ 1507335[164823612] ←
      404[164839681]                 Результат ⁼ ; ←
      404[170932736]                 Результат ⁼ 'Смена = ' ←
      404[164373008]                 Результат ≡ чек_смена ∙ 1507335[164365376] ←
      404[164839683]                 Результат ⁼ ; ←
      404[170932737]                 Результат ⁼ 'Чек = ' ←
      404[164839680]                 Результат ≡ чек_номер ∙ 1507335[164823611] ←
      404[164373006]                 Результат ⁼ ; ←
      404[170932739]                 Результат ⁼ 'Кол-во = ' ←
      404[164839684]                 Результат ≡ чек_колво ∙ 1507335[164823613] ←
 12124190[164823158]         Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
   262166[164823078]           Заголовок ⁼ Остаток с учетом онлайн-чеков ←
      245[164823166]           Список полей формы ←
      598[656083715]             Поле (колонка) для ввода данных ≡ Остаток онлайн ∙ 65545[656090774] ←
      602[656081295]               Только для просмотра ←
      127[164889026]     Процедура • Онлайн-остаток по подразделениям (в протокол) ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
      432[164888762]       Использование (в режиме выполнения) ≡ Нет ∙ 534[40566786] ←
 32505863[164888856]       Локальные переменные ←
    65545[164891865]         Локальная переменная • Сумматор ≡ Число ∙ 107[4] ←
 30867463[164889132]       Выполнить действия ←
 11010093[171704348]         Комментарий • По заявке 797625 отчет переделан в HTML (см. процедуру ниже) ←
 39780361[164889147]         ЗАВЕРШИТЬ БЛОК ←
      116[164892080]           Выражение ←
  1638460[164889741]             НЕ ←
      404[164907164]             Результат ≡ <<Продукт>> ∙ 367[3] ←
 11010080[164893182]         = ≡ Сумматор ∙ 65545[164891865] ←
      404[164907169]           Результат ⁼ 0 ←
  1507360[164889274]         Отбор данных (по запросу) • Остатки + онлайн ←
  1507673[164888981]           Ключи оптимизации ←
  1507675[164889119]             Использовать индекс ∙ 12124204[164889033] ←
  1507676[164889118]               Уточняющий параметр ≡ ID ∙ 1507445[1507430] ←
  1507447[164888747]           Выражения ←
  1507449[164889088]             Выражение • Сумма остаток ≡ Число ∙ 107[4] ←
  1507455[164891020]               Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[164888773]                 Значения параметров ←
  1507477[164888782]                   Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[164888782]                     Выражение ≡ Vstock + check online ∙ 12124206[164888585] ←
  1507494[164892063]                       Уточняющий параметр ≡ u.Остаток ∙ 1507500[164888637] ←
  1507449[164889089]             Выражение • Сумма онлайн ≡ Число ∙ 107[4] ←
  1507455[164891021]               Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[164888775]                 Значения параметров ←
  1507477[164888783]                   Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[164888783]                     Выражение ≡ Vstock + check online ∙ 12124206[164888585] ←
  1507494[164892064]                       Уточняющий параметр ≡ u.Онлайн ∙ 1507500[164888638] ←
 12124213[164888902]           Параметры ←
  1507335[164889541]             Параметр • з.Подразделение ∙ 12124204[164889033] ←
  1507494[164892060]               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
  1507335[164889542]             Параметр • з.Остаток ≡ Сумма остаток ∙ 1507449[164889088] ←
  1507335[164889543]             Параметр • з.Онлайн продажи ≡ Сумма онлайн ∙ 1507449[164889089] ←
 12124200[164888849]           From         (Таблицы) ←
 12124206[164888585]             Объединение нескольких запросов • Vstock + check online ←
  1507498[164888585]               Параметры ←
  1507500[164888628]                 Параметр • u.Подразделение ≡ Партнер ∙ 107[5] ←
  1507500[164888637]                 Параметр • u.Остаток ≡ Число ∙ 107[4] ←
  1507500[164888638]                 Параметр • u.Онлайн ≡ Число ∙ 107[4] ←
  1507361[164888585]               Описание ←
 12124205[164888752]                 Запрос • vstock ←
  1507447[164888745]                   Выражения ←
  1507449[164889084]                     Выражение • Сумма остатка ≡ Число ∙ 107[4] ←
  1507455[164891016]                       Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[164888771]                         Значения параметров ←
  1507477[164888777]                           Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[164888777]                             Выражение ∙ 12124204[164889031] ←
  1507494[164892055]                               Уточняющий параметр ≡ Остаток ∙ 1507443[40042866] ←
  1507449[164889085]                     Выражение • 0 ≡ Число ∙ 107[4] ←
  1507452[164890177]                       Константа ⁼ 0 ←
 12124213[164888900]                   Параметры ←
  1507335[164889535]                     Параметр • vstock.Подразделение ∙ 12124204[164889031] ←
  1507494[164892054]                       Уточняющий параметр ≡ Подразделение ∙ 1507443[40042864] ←
  1507335[164889536]                     Параметр • vstock.Сумма остатка ≡ Сумма остатка ∙ 1507449[164889084] ←
  1507335[164889537]                     Параметр • vstock.Сумма онлайн ≡ 0 ∙ 1507449[164889085] ←
 12124200[164888850]                   From         (Таблицы) ←
 12124204[164889031]                     Таблица ≡ ОСТАТКИ БАЗОВЫХ ТОВАРОВ ∙ 1507696[48431115] ←
 12124215[164889142]                   Where      (Ограничения на отбор данных) ←
  1507376[164890726]                     Выражение ←
  1507455[164891015]                       Результат ∙ 12124204[164889031] ←
  1507494[164892053]                         Уточняющий параметр ≡ Базовый продукт ∙ 1507443[40042865] ←
  1638473[164890849]                       Равно ←
  1507452[164890176]                       Константа ≡ <<Продукт>> ∙ 367[3] ←
 12124224[164888650]                   Group By  (Группировка) ←
  1507533[164888778]                     Группировать по параметру ≡ vstock.Подразделение ∙ 1507335[164889535] ←
 12124219[164888587]                 Union All      (Объединить включая дубликаты) ←
 12124205[164888753]                 Запрос • check_online ←
  1507673[164888978]                   Ключи оптимизации ←
  1507675[164889118]                     Использовать индекс ∙ 12124204[164889032] ←
  1507676[164889117]                       Уточняющий параметр ≡ По продукту ∙ 1507445[164298762] ←
  1507447[164888746]                   Выражения ←
  1507449[164889086]                     Выражение • Сумма онлайн ≡ Число ∙ 107[4] ←
  1507455[164891018]                       Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[164888772]                         Значения параметров ←
  1507477[164888778]                           Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[164888778]                             Выражение ∙ 12124204[164889032] ←
  1507494[164892057]                               Уточняющий параметр ≡ Колво ∙ 1507443[164298845] ←
  1507449[164889087]                     Выражение • 0 ≡ Число ∙ 107[4] ←
  1507452[164890179]                       Константа ⁼ 0 ←
 12124213[164888901]                   Параметры ←
  1507335[164889538]                     Параметр • chekon.Подразделение ∙ 12124204[164889032] ←
  1507494[164892058]                       Уточняющий параметр ≡ Подразделение (ТЗ) ∙ 1507443[164298850] ←
  1507335[164889539]                     Параметр • chekon.Сумма остатка ≡ 0 ∙ 1507449[164889087] ←
  1507335[164889540]                     Параметр • checkon.Сумма онлайн ≡ Сумма онлайн ∙ 1507449[164889086] ←
 12124200[164888851]                   From         (Таблицы) ←
 12124204[164889032]                     Таблица ≡ CHECK_ONLINE ∙ 1507433[164298769] ←
 12124215[164889143]                   Where      (Ограничения на отбор данных) ←
  1507376[164890727]                     Выражение ←
  1507455[164891017]                       Результат ∙ 12124204[164889032] ←
  1507494[164892056]                         Уточняющий параметр ≡ Продукт ∙ 1507443[164298843] ←
  1638473[164890850]                       Равно ←
  1507452[164890178]                       Константа ≡ <<Продукт>> ∙ 367[3] ←
      413[164890465]                     И ←
  1507376[172228618]                     Выражение ←
  1507455[172228642]                       Результат ≡ NVL ∙ 1507471[48431117] ←
  1507476[172228627]                         Значения параметров ←
  1507477[172228636]                           Параметр ≡ Значение ∙ 1507473[48431126] ←
  1507478[172228636]                             Выражение ∙ 12124204[164889032] ←
  1507494[172228664]                               Уточняющий параметр ≡ Принят ККЛ ∙ 1507443[164298846] ←
  1507477[172228637]                           Параметр ≡ Значение если NULL ∙ 1507473[48431127] ←
  1507478[172228637]                             Выражение ⁼ 0 ←
  1638473[172228654]                       Равно ←
  1507452[172228623]                       Константа ⁼ 0 ←
  1507376[164890728]                     Выражение ←
  1507506[172228615]                       Использование (в режиме выполнения) ≡ Нет ∙ 534[11599875] ←
  1507455[164891019]                       Результат ∙ 12124204[164889032] ←
  1507494[164892059]                         Уточняющий параметр ≡ Принят ККЛ ∙ 1507443[164298846] ←
  1638473[164890851]                       Равно ←
  1638402[164889340]                       NULL ←
 12124224[164888656]                   Group By  (Группировка) ←
  1507533[164888783]                     Группировать по параметру ≡ chekon.Подразделение ∙ 1507335[164889538] ←
 12124204[164889033]             Таблица ≡ Партнер ∙ 108[4] ←
 12124215[164889144]           Where      (Ограничения на отбор данных) ←
  1507376[164890729]             Выражение ←
  1507455[164891022]               Результат ≡ Vstock + check online ∙ 12124206[164888585] ←
  1507494[164892061]                 Уточняющий параметр ≡ u.Подразделение ∙ 1507500[164888628] ←
  1638473[164890852]               Равно ←
  1507455[164891023]               Результат ∙ 12124204[164889033] ←
  1507494[164892062]                 Уточняющий параметр ≡ Партнер ∙ 283[1] ←
 12124224[164888658]           Group By  (Группировка) ←
  1507533[164888784]             Группировать по параметру ≡ з.Подразделение ∙ 1507335[164889541] ←
 12124222[164888707]           Order By   (Сортировка) ←
  1507464[164888706]             Сортировать по возрастанию ∙ 12124204[164889033] ←
  1507494[164892065]               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 30867465[164888642]           Выполнить при старте ←
 11010088[164890287]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164889419]               Выражение ←
      116[164892120]                 Выражение ←
      404[164907166]                   Результат ⁼ 'Онлайн-остаток по товару: ' ←
      404[164907167]                   Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[164890946]                     Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
 30867466[164889332]           Выполнить после получения записи ←
 48431132[164888762]             += ≡ Сумматор ∙ 65545[164891865] ←
      116[164892173]               Выражение ←
  1638464[164888825]                 Ноль (0.0), если NULL ≡ з.Остаток ∙ 1507335[164889542] ←
      406[164888898]                 Вычесть ←
  1638464[164889564]                 Ноль (0.0), если NULL ≡ з.Онлайн продажи ∙ 1507335[164889543] ←
 11010088[164890286]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164889418]               Выражение ←
      116[164892095]                 Выражение ←
      404[164907165]                   Результат ≡ з.Подразделение ∙ 1507335[164889541] ←
      404[164907168]                   Результат ⁼ ; ←
      116[164892119]                   Выражение ←
      404[164907171]                     Результат ≡ з.Остаток ∙ 1507335[164889542] ←
      406[164888897]                     Вычесть ←
      404[164907172]                     Результат ≡ з.Онлайн продажи ∙ 1507335[164889543] ←
 30867467[164888654]           Выполнить при завершении ←
 11010088[164890288]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164889420]               Выражение ←
      116[164892172]                 Выражение ←
      404[164907170]                   Результат ⁼ 'Итого: ' ←
      404[164907173]                   Результат ≡ Сумматор ∙ 65545[164891865] ←
      127[171704355]     Процедура • Онлайн-остаток по подразделениям ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
      432[171704328]       Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[171704354]         Если истинно выражение ≡ Текущий узел является консолидированной базой ∙ 249[1507768] ←
 12124192[171704328]       Шаблоны отчетов ←
 12124193[171704328]         Шаблон отчета • Онлайн-остатки по подразделениям HTML ⁼ {{ЗАГОЛОВОК}}
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
   <link rel=stylesheet href="file:{STYLE}" type="text/css">
</head>
<body>
<p>Отпечатано: {ТЕКУЩАЯ ДАТА}

<H1>ОНЛАЙН-ОСТАТОК ТОВАРА <i>{КОД И НАИМЕНОВАНИЕ ТОВАРА}</i></H1>

<table class=MainTable border=1 width=95% cellspacing=0 cellpadding=4 align=center>
<tr>
  <td class=TableHeader bgcolor="3A426B" style="color:#FFFFFF" width=33%><b>№ ТТ</b></td>
  <td class=TableHeader bgcolor="3A426B" style="color:#FFFFFF" width=33%><b>Адрес ТТ</b></td>
  <td class=TableHeader bgcolor="3A426B" style="color:#FFFFFF" width=33%><b>Остаток</b></td>
</tr>
{{СТРОКА}}
<tr class="TableBody">
<td bgcolor="C2CBDC" align=left>{ТОРГОВАЯ ТОЧКА}</td>
<td bgcolor="C2CBDC" align=left>{АДРЕС ТТ}</td>
<td bgcolor="C2CBDC" align=right>{ОСТАТОК}</td>
</tr>
{{ИТОГО}}
<tr>
<td class=Total bgcolor="8A9BBD" align=left><b>{ТЕКСТ ПОДИТОГА}</b></td>
<td class=Total bgcolor="8A9BBD" align=left>&nbsp</td>
<td class=Total bgcolor="8A9BBD" align=right><b>{ПОДИТОГ}</b></td>
</tr>
{{ИТОГИ}}
<tr>  
  <td class=Total bgcolor="8A9BBD" align=left><b> Итого:</b></td>
  <td class=Total bgcolor="8A9BBD" align=left>&nbsp</td>
  <td class=Total bgcolor="8A9BBD" align=right><b>{ОБЩИЙ ИТОГ}</b></td>
</tr>
</table>



</body></html>

 ←
 12124194[171704328]           Поля шаблона ←
 12124196[171704393]             Поле шаблона • STYLE ≡ Стиль 1 (голубой мелкий) ∙ 381[11534337] ←
 12124196[171704378]             Поле шаблона • ТЕКУЩАЯ ДАТА ≡ Текущие дата-время ∙ 249[42467332] ←
 12124196[171704379]             Поле шаблона • КОД И НАИМЕНОВАНИЕ ТОВАРА ≡ ЛП Код и наименование товара ∙ 65545[171704446] ←
 12124196[171704380]             Поле шаблона • ТОРГОВАЯ ТОЧКА ≡ ЛП Торговая точка ∙ 65545[171704449] ←
 12124196[171704381]             Поле шаблона • АДРЕС ТТ ≡ ЛП Адрес ∙ 65545[171704447] ←
 12124196[171704382]             Поле шаблона • ОСТАТОК ≡ ЛП Остаток ∙ 65545[171704448] ←
 12124196[171704383]             Поле шаблона • ТЕКСТ ПОДИТОГА ≡ ЛП Текст подитог ∙ 65545[171704450] ←
 12124196[171704384]             Поле шаблона • ПОДИТОГ ≡ Сумматор подитог ∙ 65545[171704445] ←
 12124196[171704385]             Поле шаблона • ОБЩИЙ ИТОГ ≡ Сумматор ∙ 65545[171704444] ←
 12124195[171704328]           Блоки шаблона ←
 12124197[171704358]             Блок шаблона • ЗАГОЛОВОК ≡ Заголовок, Параметры, Итоги ∙ 48431404[48431105] ←
 12124197[171704359]             Блок шаблона • СТРОКА ≡ Табличная часть ∙ 48431404[48431106] ←
 12124197[171704360]             Блок шаблона • ИТОГО ≡ Табличная часть ∙ 48431404[48431106] ←
 12124197[171704361]             Блок шаблона • ИТОГИ ≡ Заголовок, Параметры, Итоги ∙ 48431404[48431105] ←
  1507334[171704335]           Интерфейс ≡ HTML ∙ 486[3342337] ←
 32505863[171704340]       Локальные переменные ←
    65545[171704443]         Локальная переменная • Файл ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[171704444]         Локальная переменная • Сумматор ≡ Число ∙ 107[4] ←
    65545[171704445]         Локальная переменная • Сумматор подитог ≡ Число ∙ 107[4] ←
    65545[171704446]         Локальная переменная • ЛП Код и наименование товара ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[171704447]         Локальная переменная • ЛП Адрес ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[171704448]         Локальная переменная • ЛП Остаток ≡ Число ∙ 107[4] ←
    65545[171704449]         Локальная переменная • ЛП Торговая точка ≡ Строка (40) ∙ 107[1] ←
    65545[171704450]         Локальная переменная • ЛП Текст подитог ≡ Строка (40) ∙ 107[1] ←
 30867463[171704343]       Выполнить действия ←
 39780361[171704328]         ЗАВЕРШИТЬ БЛОК ←
      116[171704352]           Выражение ←
  1638460[171704333]             НЕ ←
      404[171704699]             Результат ≡ <<Продукт>> ∙ 367[3] ←
 11010080[171704451]         = ≡ Файл ∙ 65545[171704443] ←
      404[171704700]           Результат ≡ Отчет.Инициализация ∙ 249[12124171] ←
 12124199[171704327]             Ссылка на шаблон ≡ Онлайн-остатки по подразделениям HTML ∙ 12124193[171704328] ←
 11010080[171704452]         = ≡ Сумматор ∙ 65545[171704444] ←
      404[171704701]           Результат ⁼ 0 ←
 11010080[171704453]         = ≡ Сумматор подитог ∙ 65545[171704445] ←
      404[171704702]           Результат ⁼ 0 ←
 11010080[171704454]         = ≡ ЛП Код и наименование товара ∙ 65545[171704446] ←
      404[171704703]           Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[171704389]             Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[164757648] ←
 11010088[171704423]         ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[171704365]           Файл ≡ Файл ∙ 65545[171704443] ←
 39780357[171704354]           Ссылка на блок шаблона ≡ ЗАГОЛОВОК ∙ 12124197[171704358] ←
  1507360[171704348]         Отбор данных (по запросу) • Остатки + онлайн ←
  1507673[171704332]           Ключи оптимизации ←
  1507675[171704330]             Использовать индекс ∙ 12124204[171704410] ←
  1507676[171704329]               Уточняющий параметр ≡ ID ∙ 1507445[1507430] ←
  1507447[171704354]           Выражения ←
  1507449[171704394]             Выражение • Сумма остаток ≡ Число ∙ 107[4] ←
  1507455[171704635]               Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[171704350]                 Значения параметров ←
  1507477[171704350]                   Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[171704350]                     Выражение ≡ Vstock + check online ∙ 12124206[171704327] ←
  1507494[171704780]                       Уточняющий параметр ≡ u.Остаток ∙ 1507500[171704342] ←
  1507449[171704409]             Выражение • Сумма онлайн ≡ Число ∙ 107[4] ←
  1507455[171704636]               Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[171704351]                 Значения параметров ←
  1507477[171704351]                   Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[171704351]                     Выражение ≡ Vstock + check online ∙ 12124206[171704327] ←
  1507494[171704781]                       Уточняющий параметр ≡ u.Онлайн ∙ 1507500[171704343] ←
 12124213[171704395]           Параметры ←
  1507335[171704498]             Параметр • з.Подразделение ∙ 12124204[171704410] ←
  1507494[171704782]               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
  1507335[171704499]             Параметр • з.ТТ ≡ По родителю родителя ∙ 12124204[171704414] ←
  1507494[171704783]               Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
  1507335[171704500]             Параметр • з.Тип ТТ ≡ По родителю родителя ∙ 12124204[171704414] ←
  1507494[171704784]               Уточняющий параметр ≡ Ранг партнера ∙ 283[28835905] ←
  1507335[171704501]             Параметр • з.Город ≡ Для города ∙ 12124204[171704411] ←
  1507494[171704785]               Уточняющий параметр ≡ Наименование ∙ 296[6] ←
  1507335[171704502]             Параметр • з.Улица ≡ Для улицы ∙ 12124204[171704412] ←
  1507494[171704786]               Уточняющий параметр ≡ Наименование ∙ 296[6] ←
  1507335[171704503]             Параметр • з.Дом ≡ По родителю ∙ 12124204[171704413] ←
  1507494[171704787]               Уточняющий параметр ≡ Дом ∙ 283[14745632] ←
  1507335[171704504]             Параметр • з.Помещение ≡ По родителю ∙ 12124204[171704413] ←
  1507494[171704788]               Уточняющий параметр ≡ Квартира (Комната) ∙ 283[14745634] ←
  1507335[171704505]             Параметр • з.Остаток ≡ Сумма остаток ∙ 1507449[171704394] ←
  1507335[171704506]             Параметр • з.Онлайн продажи ≡ Сумма онлайн ∙ 1507449[171704409] ←
 12124200[171704395]           From         (Таблицы) ←
 12124206[171704327]             Объединение нескольких запросов • Vstock + check online ←
  1507498[171704327]               Параметры ←
  1507500[171704341]                 Параметр • u.Подразделение ≡ Партнер ∙ 107[5] ←
  1507500[171704342]                 Параметр • u.Остаток ≡ Число ∙ 107[4] ←
  1507500[171704343]                 Параметр • u.Онлайн ≡ Число ∙ 107[4] ←
  1507361[171704327]               Описание ←
 12124205[171704370]                 Запрос • vstock ←
  1507447[171704355]                   Выражения ←
  1507449[171704411]                     Выражение • Сумма остатка ≡ Число ∙ 107[4] ←
  1507455[171704637]                       Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[171704352]                         Значения параметров ←
  1507477[171704352]                           Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[171704352]                             Выражение ∙ 12124204[171704408] ←
  1507494[171704789]                               Уточняющий параметр ≡ Остаток ∙ 1507443[40042866] ←
  1507449[171704414]                     Выражение • 0 ≡ Число ∙ 107[4] ←
  1507452[171704441]                       Константа ⁼ 0 ←
 12124213[171704396]                   Параметры ←
  1507335[171704507]                     Параметр • vstock.Подразделение ∙ 12124204[171704408] ←
  1507494[171704790]                       Уточняющий параметр ≡ Подразделение ∙ 1507443[40042864] ←
  1507335[171704508]                     Параметр • vstock.Сумма остатка ≡ Сумма остатка ∙ 1507449[171704411] ←
  1507335[171704509]                     Параметр • vstock.Сумма онлайн ≡ 0 ∙ 1507449[171704414] ←
 12124200[171704396]                   From         (Таблицы) ←
 12124204[171704408]                     Таблица ≡ ОСТАТКИ БАЗОВЫХ ТОВАРОВ ∙ 1507696[48431115] ←
 12124215[171704399]                   Where      (Ограничения на отбор данных) ←
  1507376[171704575]                     Выражение ←
  1507455[171704638]                       Результат ∙ 12124204[171704408] ←
  1507494[171704791]                         Уточняющий параметр ≡ Базовый продукт ∙ 1507443[40042865] ←
  1638473[171704510]                       Равно ←
  1507452[171704442]                       Константа ≡ <<Продукт>> ∙ 367[3] ←
 12124224[171704333]                   Group By  (Группировка) ←
  1507533[171704345]                     Группировать по параметру ≡ vstock.Подразделение ∙ 1507335[171704507] ←
 12124219[171704327]                 Union All      (Объединить включая дубликаты) ←
 12124205[171704371]                 Запрос • check_online ←
  1507673[171704333]                   Ключи оптимизации ←
  1507675[171704331]                     Использовать индекс ∙ 12124204[171704409] ←
  1507676[171704330]                       Уточняющий параметр ≡ По продукту ∙ 1507445[164298762] ←
  1507447[171704356]                   Выражения ←
  1507449[171704415]                     Выражение • Сумма онлайн ≡ Число ∙ 107[4] ←
  1507455[171704639]                       Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[171704353]                         Значения параметров ←
  1507477[171704353]                           Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[171704353]                             Выражение ∙ 12124204[171704409] ←
  1507494[171704792]                               Уточняющий параметр ≡ Колво ∙ 1507443[164298845] ←
  1507449[171704416]                     Выражение • 0 ≡ Число ∙ 107[4] ←
  1507452[171704443]                       Константа ⁼ 0 ←
 12124213[171704397]                   Параметры ←
  1507335[171704510]                     Параметр • chekon.Подразделение ∙ 12124204[171704409] ←
  1507494[171704793]                       Уточняющий параметр ≡ Подразделение (ТЗ) ∙ 1507443[164298850] ←
  1507335[171704511]                     Параметр • chekon.Сумма остатка ≡ 0 ∙ 1507449[171704416] ←
  1507335[171704512]                     Параметр • checkon.Сумма онлайн ≡ Сумма онлайн ∙ 1507449[171704415] ←
 12124200[171704397]                   From         (Таблицы) ←
 12124204[171704409]                     Таблица ≡ CHECK_ONLINE ∙ 1507433[164298769] ←
 12124215[171704400]                   Where      (Ограничения на отбор данных) ←
  1507376[171704576]                     Выражение ←
  1507455[171704640]                       Результат ∙ 12124204[171704409] ←
  1507494[171704794]                         Уточняющий параметр ≡ Продукт ∙ 1507443[164298843] ←
  1638473[171704511]                       Равно ←
  1507452[171704444]                       Константа ≡ <<Продукт>> ∙ 367[3] ←
      413[171704336]                     И ←
  1507376[172228630]                     Выражение ←
  1507455[172228643]                       Результат ≡ NVL ∙ 1507471[48431117] ←
  1507476[172228628]                         Значения параметров ←
  1507477[172228638]                           Параметр ≡ Значение ∙ 1507473[48431126] ←
  1507478[172228638]                             Выражение ∙ 12124204[171704409] ←
  1507494[172228682]                               Уточняющий параметр ≡ Принят ККЛ ∙ 1507443[164298846] ←
  1507477[172228639]                           Параметр ≡ Значение если NULL ∙ 1507473[48431127] ←
  1507478[172228639]                             Выражение ⁼ 0 ←
  1638473[172228655]                       Равно ←
  1507452[172228624]                       Константа ⁼ 0 ←
  1507376[171704577]                     Выражение ←
  1507506[172228616]                       Использование (в режиме выполнения) ≡ Нет ∙ 534[11599875] ←
  1507455[171704641]                       Результат ∙ 12124204[171704409] ←
  1507494[171704795]                         Уточняющий параметр ≡ Принят ККЛ ∙ 1507443[164298846] ←
  1638473[171704512]                       Равно ←
  1638402[171704337]                       NULL ←
 12124224[171704334]                   Group By  (Группировка) ←
  1507533[171704346]                     Группировать по параметру ≡ chekon.Подразделение ∙ 1507335[171704510] ←
 12124204[171704410]             Таблица ≡ Партнер ∙ 108[4] ←
 12124204[171704411]             Таблица • Для города ≡ Каталог ∙ 108[2] ←
 12124204[171704412]             Таблица • Для улицы ≡ Каталог ∙ 108[2] ←
 12124204[171704413]             Таблица • По родителю ≡ Партнер ∙ 108[4] ←
 12124204[171704414]             Таблица • По родителю родителя ≡ Партнер ∙ 108[4] ←
 12124215[171704401]           Where      (Ограничения на отбор данных) ←
  1507376[171704578]             Выражение ←
  1507455[171704642]               Результат ≡ Vstock + check online ∙ 12124206[171704327] ←
  1507494[171704796]                 Уточняющий параметр ≡ u.Подразделение ∙ 1507500[171704341] ←
  1638473[171704513]               Равно ←
  1507455[171704643]               Результат ∙ 12124204[171704410] ←
  1507494[171704797]                 Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1507376[171704579]             Выражение ←
  1507455[171704644]               Результат ∙ 12124204[171704410] ←
  1507494[171704798]                 Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[171704514]               Равно ←
  1507455[171704645]               Результат ≡ По родителю ∙ 12124204[171704413] ←
  1507494[171704799]                 Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1507376[171704580]             Выражение ←
  1507455[171704646]               Результат ≡ По родителю ∙ 12124204[171704413] ←
  1507494[171704800]                 Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[171704515]               Равно ←
  1507455[171704647]               Результат ≡ По родителю родителя ∙ 12124204[171704414] ←
  1507494[171704801]                 Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1507376[171704581]             Выражение ←
  1507455[171704648]               Результат ≡ По родителю ∙ 12124204[171704413] ←
  1507494[171704802]                 Уточняющий параметр ≡ Город ∙ 283[28835895] ←
  1638473[171704516]               Равно ←
  1507455[171704649]               Результат ≡ Для города ∙ 12124204[171704411] ←
  1507494[171704803]                 Уточняющий параметр ≡ Каталог ∙ 296[1] ←
  1507376[171704582]             Выражение ←
  1507455[171704650]               Результат ≡ По родителю ∙ 12124204[171704413] ←
  1507494[171704804]                 Уточняющий параметр ≡ Улица ∙ 283[28835896] ←
  1638473[171704517]               Равно ←
  1507455[171704651]               Результат ≡ Для улицы ∙ 12124204[171704412] ←
  1507494[171704805]                 Уточняющий параметр ≡ Каталог ∙ 296[1] ←
 12124224[171704335]           Group By  (Группировка) ←
  1507533[171704347]             Группировать по параметру ≡ з.Подразделение ∙ 1507335[171704498] ←
  1507533[171704348]             Группировать по параметру ≡ з.ТТ ∙ 1507335[171704499] ←
  1507533[171704349]             Группировать по параметру ≡ з.Тип ТТ ∙ 1507335[171704500] ←
  1507533[171704350]             Группировать по параметру ≡ з.Город ∙ 1507335[171704501] ←
  1507533[171704351]             Группировать по параметру ≡ з.Улица ∙ 1507335[171704502] ←
  1507533[171704352]             Группировать по параметру ≡ з.Дом ∙ 1507335[171704503] ←
  1507533[171704353]             Группировать по параметру ≡ з.Помещение ∙ 1507335[171704504] ←
 12124222[171704330]           Order By   (Сортировка) ←
  1507464[171704327]             Сортировать по возрастанию ∙ 12124204[171704410] ←
  1507494[171704806]               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
  1507465[171704329]             Блок (Сортировка с генерацией события) • По типу ТТ ←
  1507559[171704329]               Сортировать по возрастанию ≡ з.Тип ТТ ∙ 1507335[171704500] ←
 30867466[171704348]           Выполнить после получения записи ←
 48431132[171704330]             += ≡ Сумматор ∙ 65545[171704444] ←
      116[171704353]               Выражение ←
  1638464[171704335]                 Ноль (0.0), если NULL ≡ з.Остаток ∙ 1507335[171704505] ←
      406[171704353]                 Вычесть ←
  1638464[171704336]                 Ноль (0.0), если NULL ≡ з.Онлайн продажи ∙ 1507335[171704506] ←
 48431132[171704331]             += ≡ Сумматор подитог ∙ 65545[171704445] ←
      116[171704354]               Выражение ←
  1638464[171704337]                 Ноль (0.0), если NULL ≡ з.Остаток ∙ 1507335[171704505] ←
      406[171704354]                 Вычесть ←
  1638464[171704338]                 Ноль (0.0), если NULL ≡ з.Онлайн продажи ∙ 1507335[171704506] ←
 11010080[171704455]             = ≡ ЛП Остаток ∙ 65545[171704448] ←
      404[171704704]               Результат ≡ з.Остаток ∙ 1507335[171704505] ←
      406[171704355]               Вычесть ←
      404[171704705]               Результат ≡ з.Онлайн продажи ∙ 1507335[171704506] ←
 11010080[171704456]             = ≡ ЛП Адрес ∙ 65545[171704447] ←
      404[171704706]               Результат ≡ з.Город ∙ 1507335[171704501] ←
  1638487[171704333]               Конкатенировать строки ←
      404[171704707]               Результат ⁼ ', ' ←
  1638487[171704334]               Конкатенировать строки ←
      404[171704708]               Результат ≡ з.Улица ∙ 1507335[171704502] ←
  1638487[171704335]               Конкатенировать строки ←
      404[171704709]               Результат ⁼ ', д.' ←
  1638487[171704336]               Конкатенировать строки ←
      404[171704710]               Результат ≡ з.Дом ∙ 1507335[171704503] ←
  1638461[171704328]               Условный оператор (IF) ←
  1638463[171704355]                 Условие ←
      404[171704711]                   Результат ≡ з.Помещение ∙ 1507335[171704504] ←
  1638479[171704324]                   Не равно ←
  1638402[171704338]                   NULL ←
      105[171704328]                 То ←
  1638461[171704329]                   Условный оператор (IF) ←
  1638463[171704356]                     Условие ←
      116[171704355]                       Выражение ←
      404[171704712]                         Результат ≡ SubString ∙ 249[1507580] ←
 32505862[171704374]                           Значения формальных параметров при вызове ←
 32505860[171704405]                             Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[171704426]                               Выражение ≡ з.Помещение ∙ 1507335[171704504] ←
 32505860[171704406]                             Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[171704427]                               Выражение ⁼ 1 ←
 32505860[171704407]                             Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[171704428]                               Выражение ⁼ 3 ←
  1638473[171704518]                         Равно ←
      404[171704713]                         Результат ⁼ 'пом' ←
      412[171704322]                       ИЛИ ←
      116[171704356]                       Выражение ←
      404[171704714]                         Результат ≡ SubString ∙ 249[1507580] ←
 32505862[171704375]                           Значения формальных параметров при вызове ←
 32505860[171704408]                             Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[171704429]                               Выражение ≡ з.Помещение ∙ 1507335[171704504] ←
 32505860[171704409]                             Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[171704430]                               Выражение ⁼ 1 ←
 32505860[171704410]                             Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[171704431]                               Выражение ⁼ 3 ←
  1638473[171704519]                         Равно ←
      404[171704715]                         Результат ⁼ 'стр' ←
      105[171704329]                     То ←
  1638487[171704337]                       Конкатенировать строки ←
      404[171704716]                       Результат ⁼ ', ' ←
  1638487[171704338]                       Конкатенировать строки ←
      404[171704717]                       Результат ≡ з.Помещение ∙ 1507335[171704504] ←
      424[171704327]                     Иначе ←
  1638487[171704339]                       Конкатенировать строки ←
      404[171704718]                       Результат ⁼ ', пом.' ←
  1638487[171704340]                       Конкатенировать строки ←
      404[171704719]                       Результат ≡ з.Помещение ∙ 1507335[171704504] ←
 11010080[171704457]             = ≡ ЛП Торговая точка ∙ 65545[171704449] ←
      404[171704720]               Результат ≡ з.ТТ ∙ 1507335[171704499] ←
 11010088[171704424]             ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[171704366]               Файл ≡ Файл ∙ 65545[171704443] ←
 39780357[171704355]               Ссылка на блок шаблона ≡ СТРОКА ∙ 12124197[171704359] ←
  1507468[171704327]           Выполнить после обработки блока ≡ По типу ТТ ∙ 1507465[171704329] ←
 11010079[171704326]             CASE ←
  1572877[171704326]               Условие ←
      404[171704721]                 Результат ≡ з.Тип ТТ ∙ 1507335[171704500] ←
 11010081[171704331]               OF ≡ Супермаркет ∙ 164364327[164364289] ←
 11010080[171704458]                 = ≡ ЛП Текст подитог ∙ 65545[171704450] ←
      404[171704722]                   Результат ⁼ Итого по сети Гастроном: ←
 11010081[171704332]               OF ≡ Дискаунтер ∙ 164364327[164364290] ←
 11010080[171704459]                 = ≡ ЛП Текст подитог ∙ 65545[171704450] ←
      404[171704723]                   Результат ⁼ Итого по сети Дискаунтер: ←
 30867473[171704331]               ELSE ←
 11010080[171704460]                 = ≡ ЛП Текст подитог ∙ 65545[171704450] ←
      404[171704724]                   Результат ⁼ Итого по другим типам подразделений:  ←
 11010088[171704425]             ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[171704367]               Файл ≡ Файл ∙ 65545[171704443] ←
 39780357[171704356]               Ссылка на блок шаблона ≡ ИТОГО ∙ 12124197[171704360] ←
 11010080[171704461]             = ≡ Сумматор подитог ∙ 65545[171704445] ←
      404[171704725]               Результат ⁼ 0 ←
 11010088[171704426]         ВЫПОЛНИТЬ ≡ Отчет.Печать блока ∙ 220[12124165] ←
 39780367[171704368]           Файл ≡ Файл ∙ 65545[171704443] ←
 39780357[171704357]           Ссылка на блок шаблона ≡ ИТОГИ ∙ 12124197[171704361] ←
 11010088[171704427]         ВЫПОЛНИТЬ ≡ Отчет.Показать ∙ 220[12124164] ←
 39780367[171704369]           Файл ≡ Файл ∙ 65545[171704443] ←
  1507334[171704336]           Интерфейс ≡ HTML ∙ 486[3342337] ←
 12124189[171704330]       Выполнить при завершении ←
 11010088[171704428]         ВЫПОЛНИТЬ ≡ Отчет.Закрыть ∙ 249[12124172] ←
      127[171311142]     Процедура • Онлайн-остаток по всей сети ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[171311120]       Выполнить действия ←
 11010088[171311226]         ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[171311157]           Выражение ←
      404[171311936]             Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[171311294]               Уточняющий параметр ≡ Остаток-онлайн по всей сети ∙ 249[170459159] ←
 32505862[171311213]                 Значения формальных параметров при вызове ←
 32505860[171311336]                   Значение параметра при вызове процедуры/функции ≡ фп обяз Товар ∙ 65545[170461092] ←
   327700[171311400]                     Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[170918043]     Процедура • Получить опт цену и коэф. ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
      432[170917925]       Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[170917955]         Если истинно выражение ≡ Текущий пользователь - Жуков ∙ 117[165347329] ←
 30867463[170918051]       Выполнить действия ←
 11010088[170918846]         ВЫПОЛНИТЬ ≡ Получить опт цену и коэф. через параметры (продукт и количество) ∙ 249[170917895] ←
 32505862[170918915]           Значения формальных параметров при вызове ←
 32505860[170919948]             Значение параметра при вызове процедуры/функции ≡ фп Продукт in ∙ 65545[170918319] ←
   327700[170920623]               Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170919949]             Значение параметра при вызове процедуры/функции ≡ фп log (1-on, 0-off) ∙ 65545[170918363] ←
   327700[170920624]               Выражение ⁼ 1 ←
 32505860[170918352]             Значение параметра при вызове процедуры/функции ≡ фп Отладка ∙ 65545[170919431] ←
   327700[170918539]               Выражение ≡ true ∙ 117[30867468] ←
      127[171835429]     Процедура ≡ Проверка параметров ценообразования для товара ∙ 127[164365421] ←
 32505862[171835906]       Значения формальных параметров при вызове ←
 32505860[171836393]         Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164372435] ←
   327700[171836975]           Выражение ≡ <<Продукт>> ∙ 367[3] ←
      371[164823083]     Вид просмотра ≡ Неакцептованные расходные документы ∙ 371[164823060] ←
 32505862[171311131]       Значения формальных параметров при вызове ←
 32505860[171311191]         Значение параметра при вызове процедуры/функции ≡ фп обяз Товар ∙ 65545[171311133] ←
   327700[171311225]           Выражение ≡ <<Продукт>> ∙ 367[3] ←
      371[165675035]     Вид просмотра • Претензии, по которым не принято решение ≡ Претензии (КРО + Алкосклад) ∙ 371[164823101] ←
 32505862[165675367]       Значения формальных параметров при вызове ←
 32505860[165675827]         Значение параметра при вызове процедуры/функции ≡ фпПродукт ∙ 65545[165675227] ←
   327700[165676387]           Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[164823350]     Процедура ≡ Отчет о фьючерсных остатках ∙ 127[164757643] ←
      371[164823079]     Вид просмотра • Спецификации по товару ≡ Спецификации по товару поставщикам ∙ 371[57868398] ←
 32505862[164824798]       Значения формальных параметров при вызове ←
 32505860[164826835]         Значение параметра при вызове процедуры/функции ≡ ~Uid товара _вп ∙ 65545[57869198] ←
   327700[164828025]           Выражение ≡ <<Продукт>> ∙ 367[3] ←
 30867533[164823041]       Подсказка (ToolTip) ⁼ Спецификации по товару ←
      127[170917921]     Процедура • Найти спецификацию для подразделения ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[170918006]       Локальные переменные ←
 30867463[170918153]       Выполнить действия ←
 11010088[170918076]         ВЫПОЛНИТЬ ≡ Получить активную спецификацию для товара  ∙ 249[170917908] ←
 32505862[170919602]           Значения формальных параметров при вызове ←
 32505860[170921310]             Значение параметра при вызове процедуры/функции ≡ фп Отладка ∙ 65545[170919438] ←
   327700[170922400]               Выражение ≡ true ∙ 117[30867468] ←
 32505860[170921311]             Значение параметра при вызове процедуры/функции ≡ фп Товар  ∙ 65545[170919435] ←
   327700[170922401]               Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[656082414]     Процедура • Ставка НДС ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[656081709]       Локальные переменные ←
    65545[656090662]         Локальная переменная • Дата ≡ Дата ∙ 107[3] ←
 30867463[656081878]       Выполнить действия ←
 12124190[656081365]         Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[656081478]           Список полей формы ←
      598[656083614]             Поле (колонка) для ввода данных ≡ Дата ∙ 65545[656090662] ←
 11010088[656086623]         ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[656084057]           Выражение ←
      404[656128254]             Результат ⁼ 'Объект: ' ←
      404[656127943]             Результат ≡ f_Ставка_НДС_(товар, дата) ∙ 249[656081026] ←
 32505862[656085855]               Значения формальных параметров при вызове ←
 32505860[656091634]                 Значение параметра при вызове процедуры/функции ≡ ~Товар ∙ 65545[656090656] ←
   327700[656100031]                   Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[656091635]                 Значение параметра при вызове процедуры/функции ≡ ~Дата ∙ 65545[656090657] ←
   327700[656100032]                   Выражение ≡ Дата ∙ 65545[656090662] ←
 32505860[656091636]                 Значение параметра при вызове процедуры/функции ≡ ~Вернуть_Объект(0)/Кодификатор(1-def)/Значение(2) ∙ 65545[656090661] ←
   327700[656100033]                   Выражение ⁼ 0 ←
 11010088[656086624]         ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[656084058]           Выражение ←
      404[656128255]             Результат ⁼ 'Кодификатор: ' ←
      404[656127944]             Результат ≡ f_Ставка_НДС_(товар, дата) ∙ 249[656081026] ←
 32505862[656085856]               Значения формальных параметров при вызове ←
 32505860[656091637]                 Значение параметра при вызове процедуры/функции ≡ ~Товар ∙ 65545[656090656] ←
   327700[656100034]                   Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[656091638]                 Значение параметра при вызове процедуры/функции ≡ ~Дата ∙ 65545[656090657] ←
   327700[656100035]                   Выражение ≡ Дата ∙ 65545[656090662] ←
 32505860[656091639]                 Значение параметра при вызове процедуры/функции ≡ ~Вернуть_Объект(0)/Кодификатор(1-def)/Значение(2) ∙ 65545[656090661] ←
   327700[656100036]                   Выражение ⁼ 1 ←
 11010088[656086625]         ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[656084076]           Выражение ←
      404[656128256]             Результат ⁼ 'Значение: ' ←
      404[656127945]             Результат ≡ f_Ставка_НДС_(товар, дата) ∙ 249[656081026] ←
 32505862[656085865]               Значения формальных параметров при вызове ←
 32505860[656091640]                 Значение параметра при вызове процедуры/функции ≡ ~Товар ∙ 65545[656090656] ←
   327700[656100037]                   Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[656091641]                 Значение параметра при вызове процедуры/функции ≡ ~Дата ∙ 65545[656090657] ←
   327700[656100038]                   Выражение ≡ Дата ∙ 65545[656090662] ←
 32505860[656091642]                 Значение параметра при вызове процедуры/функции ≡ ~Вернуть_Объект(0)/Кодификатор(1-def)/Значение(2) ∙ 65545[656090661] ←
   327700[656100039]                   Выражение ⁼ 2 ←
 11010088[656087249]         ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[656084352]           Выражение ←
      404[656131929]             Результат ⁼ Ставка НДС через выражение: ←
      404[656131930]             Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[656085118]               Уточняющий параметр ≡ x/y_Ставка_НДС ∙ 117[656082520] ←
      404[656131928]             Результат ⁼ '; ' ←
      404[656131931]             Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[656085215]               Уточняющий параметр ≡ x/y_Ставка_НДС ∙ 117[656082520] ←
      411[656092009]                 Уточняющий параметр ≡ Имя ∙ 249[262146] ←
 11010088[656087250]         ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[656084353]           Выражение ←
      404[656131932]             Результат ⁼ Ставка НДС через параметр: ←
      404[656131933]             Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[656092010]               Уточняющий параметр ≡ f_Ставка_НДС_(дата) ∙ 249[656081027] ←
 32505862[165544299]                 Значения формальных параметров при вызове ←
 32505860[165544471]                   Значение параметра при вызове процедуры/функции ≡ ~Дата_f ∙ 65545[656090685] ←
   327700[165544719]                     Выражение ≡ Дата ∙ 65545[656090662] ←
      404[656131934]             Результат ⁼ '; ' ←
      404[656131936]             Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[656093408]               Уточняющий параметр ≡ f_Ставка_НДС_(дата) ∙ 249[656081027] ←
 32505862[165544300]                 Значения формальных параметров при вызове ←
 32505860[165544472]                   Значение параметра при вызове процедуры/функции ≡ ~Дата_f ∙ 65545[656090685] ←
   327700[165544720]                     Выражение ≡ Дата ∙ 65545[656090662] ←
 32505860[165544487]                   Значение параметра при вызове процедуры/функции ≡ ~Что вернуть: 1 - кодификатор, 2 - значение, 3 - имя ∙ 65545[656089121] ←
   327700[165544735]                     Выражение ⁼ 3 ←
  1507360[656081088]         Отбор данных (по запросу) • Тест запрос ←
 12124200[656081159]           From         (Таблицы) ←
 12124204[656081072]             Таблица ≡ Продукт ∙ 108[3] ←
 12124215[656081011]           Where      (Ограничения на отбор данных) ←
  1507376[656081307]             Выражение ←
  1507455[656081274]               Результат ∙ 12124204[656081072] ←
  1507494[656081310]                 Уточняющий параметр ≡ Продукт ∙ 305[1] ←
  1638473[656081407]               Равно ←
  1507452[656081256]               Константа ≡ <<Продукт>> ∙ 367[3] ←
  1507447[656081011]           Выражения ←
  1507449[656081449]             Выражение • продукт ≡ Продукт ∙ 107[7] ←
  1507455[656081275]               Результат ∙ 12124204[656081072] ←
  1507494[656081311]                 Уточняющий параметр ≡ Продукт ∙ 305[1] ←
  1507449[656081451]             Выражение • дата ≡ Дата ∙ 107[3] ←
  1507452[656081360]               Константа ≡ Дата ∙ 65545[656090662] ←
  1507449[656081450]             Выражение • f_ставка_ндс ≡ Объект ∙ 107[19] ←
  1507455[656083100]               Результат ≡ stavka_nds_V2 (Product, Date) ∙ 1507471[165281802] ←
  1507476[172228643]                 Значения параметров ←
  1507477[172228654]                   Параметр ≡ Product_ID ∙ 1507473[165281796] ←
  1507478[172228654]                     Выражение ≡ продукт ∙ 1507449[656081449] ←
  1507477[172228655]                   Параметр ≡ Date ∙ 1507473[165281797] ←
  1507478[172228655]                     Выражение ≡ дата ∙ 1507449[656081451] ←
 12124224[656080909]           Group By  (Группировка) ←
  1507533[656080911]             Группировать по параметру ≡ f_ставка_ндс ∙ 1507449[656081450] ←
 12124213[656081186]           Параметры ←
  1507335[656081450]             Параметр • ставка_ндс ≡ f_ставка_ндс ∙ 1507449[656081450] ←
 30867466[656081102]           Выполнить после получения записи ←
 11010088[656082324]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[656081103]               Выражение ←
      404[656084421]                 Результат ⁼ Тест запроса и выражения: ←
      404[656084422]                 Результат ≡ ставка_ндс ∙ 1507335[656081450] ←
      404[656084423]                 Результат ⁼ '; ' ←
      404[656084424]                 Результат ≡ ставка_ндс ∙ 1507335[656081450] ←
      411[656082652]                   Уточняющий параметр ≡ Имя ∙ 249[262146] ←
      404[656084425]                 Результат ⁼ '; ' ←
      404[656084426]                 Результат ≡ ставка_ндс ∙ 1507335[656081450] ←
      411[656082653]                   Уточняющий параметр ≡ Значение ∙ 249[262147] ←
      127[170524678]     Процедура • Подконтрольная продукция в Меркурий? ≡ Подконтрольная продукция в Меркурий? (448569) ∙ 127[164430647] ←
 32505862[170524709]       Значения формальных параметров при вызове ←
 32505860[170524744]         Значение параметра при вызове процедуры/функции ≡ фп Товар, обяз ∙ 65545[164434589] ←
   327700[170524763]           Выражение ≡ Продукт ∙ 305[1] ←
      103[164823174]     Команда ≡ ------------ ∙ 102[57343] ←
      432[164823082]       Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1572889[164823062]         Определена роль ≡ Системный администратор Домино ∙ 233[2818071] ←
      113[164823063]     Сценарий (Меню) • Для администратора ←
      432[164823083]       Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1572889[164823063]         Определена роль ≡ Администратор организации (магазина) ∙ 233[2818070] ←
      127[164823351]       Процедура • Реестр приказов о назначении/отмене ценовой схемы ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[164823253]         Выполнить действия ←
 12124190[164823159]           Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823167]             Список полей формы ←
      598[164823544]               Поле (колонка) для ввода данных ≡ Дата начальная ∙ 381[131078] ←
      598[164823545]               Поле (колонка) для ввода данных ≡ Дата конечная ∙ 381[131079] ←
 11010105[164823232]           Индикатор ⁼ Запрос ←
  1507360[164823651]           Отбор данных (по запросу) ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
 32505862[164824817]             Значения формальных параметров при вызове ←
 32505860[164826879]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Классы ∙ 65545[18547257] ←
   327700[164828069]                 Выражение ≡ ПРИКАЗ ∙ 541[14417922] ←
 32505860[164826880]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547258] ←
   327700[164828070]                 Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823276]                   Список элементов ←
   327700[164828071]                     Выражение ≡ Приказ на назначение ценовой схемы на товары ∙ 332[3342368] ←
   327700[164828072]                     Выражение ≡ Приказ на отмену ценовой схемы на товары ∙ 332[655294503] ←
 32505860[164826881]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа начальная ∙ 65545[18547260] ←
   327700[164828073]                 Выражение ≡ Дата начальная ∙ 381[131078] ←
 32505860[164826882]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа конечная ∙ 65545[18547261] ←
   327700[164828074]                 Выражение ≡ Дата конечная ∙ 381[131079] ←
 30867466[164823749]             Выполнить после получения записи ←
 11010080[164829074]               = ≡ <<Документ>> ∙ 367[5] ←
      404[164839685]                 Результат ≡ з.Документ ∙ 1507335[18547059] ←
 11010105[164823233]               Индикатор ≡ <<Документ>> ∙ 367[5] ←
  1507360[164823652]               Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[164824818]                 Значения формальных параметров при вызове ←
 32505860[164826883]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164828075]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164826884]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт ∙ 65545[1510111] ←
   327700[164828076]                     Выражение ≡ <<Продукт>> ∙ 367[3] ←
 30867466[164823750]                 Выполнить после получения записи ←
 11010088[164824483]                   ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823734]                     Выражение ←
      404[164839686]                       Результат ≡ <<Документ>> ∙ 367[5] ←
      404[164839687]                       Результат ⁼ ';' ←
      404[164839688]                       Результат ≡ <<Документ>> ∙ 367[5] ←
      411[164827374]                         Уточняющий параметр ≡ Имя типа документа ∙ 249[45940737] ←
      103[164823175]       Команда ≡ ------------ ∙ 102[57343] ←
      127[164823352]       Процедура • Изменить картинку ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[164823229]         Локальные переменные ←
    65545[164825881]           Локальная переменная • Файл ≡ Длинная строка (120) ∙ 107[7602177] ←
    65545[164825882]           Локальная переменная • Картинка ≡ BLOB ∙ 89[64] ←
 30867463[164823254]         Выполнить действия ←
 12124190[164823160]           Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823168]             Список полей формы ←
      598[164823546]               Поле (колонка) для ввода данных ≡ Файл ∙ 65545[164825881] ←
 45940768[164823052]                 Внешний редактор поля объекта БД ≡ Диалог выбора файла ∙ 387[48431152] ←
 11010088[164824484]           ВЫПОЛНИТЬ ∙ 249[30867505] ←
 32505862[164824819]             Значения формальных параметров при вызове ←
 32505860[164826885]               Значение параметра при вызове процедуры/функции ≡ Контейнер ∙ 65545[30867934] ←
   327700[164828077]                 Выражение ≡ Картинка ∙ 65545[164825882] ←
 32505860[164826886]               Значение параметра при вызове процедуры/функции ≡ Имя файла на диске (откуда читать) ∙ 65545[30867936] ←
   327700[164828078]                 Выражение ≡ Файл ∙ 65545[164825881] ←
 32505860[164826887]               Значение параметра при вызове процедуры/функции ≡ Имя файла в контейнере (куда писать) ∙ 65545[30867935] ←
   327700[164828079]                 Выражение ≡ Файл.Выделить имя ∙ 249[1507505] ←
   327700[164828080]                   Выражение ≡ Файл ∙ 65545[164825881] ←
 11010088[164824485]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823735]             Выражение ←
      404[164839689]               Результат ≡ Картинка ∙ 65545[164825882] ←
 11010088[164824486]           ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[164823074]             Объект ≡ <<Продукт>> ∙ 367[3] ←
      377[164823084]             Начальные значения полей объекта ←
   131095[164823225]               Начальное значение поля ≡ Фото этикетки ∙ 305[40042530] ←
   327700[164828081]                 Выражение ≡ Картинка ∙ 65545[164825882] ←
      127[164823353]       Процедура • Показать картинку ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[164823230]         Локальные переменные ←
    65545[164825883]           Локальная переменная • файл ≡ Длинная строка (120) ∙ 107[7602177] ←
      355[164823860]             Начальное значение ⁼ 'c:\domino8\pic.jpg' ←
 30867463[164823255]         Выполнить действия ←
 11010088[164824487]           ВЫПОЛНИТЬ ∙ 249[30867504] ←
 32505862[164824820]             Значения формальных параметров при вызове ←
 32505860[164826888]               Значение параметра при вызове процедуры/функции ≡ Контейнер ∙ 65545[30867931] ←
   327700[164828082]                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
      411[164827375]                   Уточняющий параметр ≡ Фото этикетки ∙ 305[40042530] ←
 32505860[164826889]               Значение параметра при вызове процедуры/функции ≡ Имя файла в контейнере (откуда читать) ∙ 65545[30867932] ←
   327700[164828083]                 Выражение ⁼ '1261006060_1' ←
 32505860[164826890]               Значение параметра при вызове процедуры/функции ≡ Имя файла на диске (куда писать) ∙ 65545[30867933] ←
   327700[164828084]                 Выражение ≡ файл ∙ 65545[164825883] ←
      103[164823176]       Команда ≡ ------------ ∙ 102[57343] ←
      127[164823355]       Процедура • Партия  с макс. зак. ценой с остатком ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[164823257]         Выполнить действия ←
  1507360[164823653]           Отбор данных (по запросу) • Партии товара по подразделению ←
 12124200[164823285]             From         (Таблицы) ←
 12124204[164823426]               Таблица ≡ Документ ∙ 108[5] ←
 12124204[164823427]               Таблица ≡ Продукт ∙ 108[3] ←
 12124222[164823128]             Order By   (Сортировка) ←
  1507532[164823101]               Сортировать по убыванию ∙ 12124204[164823427] ←
  1507494[164825583]                 Уточняющий параметр ≡ Продукт ∙ 305[1] ←
 12124215[164823423]             Where      (Ограничения на отбор данных) ←
  1507376[164824724]               Выражение ←
  1507455[164824945]                 Результат ∙ 12124204[164823427] ←
  1507494[164825584]                   Уточняющий параметр ≡ Родитель ∙ 305[2] ←
  1638473[164825223]                 Равно ←
  1507452[164824273]                 Константа ≡ <<Продукт>> ∙ 367[3] ←
      413[164824588]               И ←
  1507376[164824725]               Выражение ←
  1507455[164824946]                 Результат ∙ 12124204[164823427] ←
  1507494[164825585]                   Уточняющий параметр ≡ Приходный документ ∙ 305[14745618] ←
  1638473[164825224]                 Равно ←
  1507455[164824947]                 Результат ∙ 12124204[164823426] ←
  1507494[164825586]                   Уточняющий параметр ≡ Документ ∙ 331[1] ←
      413[164824589]               И ←
  1507376[164824726]               Выражение ←
  1507455[164824948]                 Результат ∙ 12124204[164823426] ←
  1507494[164825587]                   Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1638473[164825225]                 Равно ←
  1507452[164824274]                 Константа ≡ Подразделение для вида просмотра (глоб.перем.) ∙ 381[42401793] ←
 12124213[164823343]             Параметры ←
  1507335[164823699]               Параметр ∙ 12124204[164823427] ←
  1507494[164825588]                 Уточняющий параметр ≡ Продукт ∙ 305[1] ←
 30867466[164823751]             Выполнить после получения записи ←
 39780366[164823226]               RETURN ∙ 1507335[164823699] ←
      113[164823064]       Сценарий (Меню) • Последняя партия ←
      127[164823356]         Процедура • Последняя партия (Дата текущая) ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[164823258]           Выполнить действия ←
 12124190[164823161]             Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823169]               Список полей формы ←
      598[164823547]                 Поле (колонка) для ввода данных ≡ Подразделение для вида просмотра (глоб.перем.) ∙ 381[42401793] ←
      209[164823237]                   Выбор из списка ≡ Выбор товарного подразделения по наименованию ∙ 371[17104897] ←
 11010088[164824489]             ВЫПОЛНИТЬ ≡ ShowOkMsg ∙ 127[39780363] ←
 11010095[164823737]               Выражение ←
      404[164839691]                 Результат ≡ Последняя партия по подразделению (Дата текущая) (вер 1) ∙ 249[40370222] ←
 32505862[164824822]                   Значения формальных параметров при вызове ←
 32505860[164826895]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[40373179] ←
   327700[164828085]                       Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826896]                     Значение параметра при вызове процедуры/функции ≡ Подразделения ∙ 65545[40373180] ←
   327700[164828086]                       Выражение ≡ Подразделение для вида просмотра (глоб.перем.) ∙ 381[42401793] ←
      127[164823357]         Процедура • Последняя партия (Через дату и остаток) - Дата формальный параметр ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[164823259]           Выполнить действия ←
 12124190[164823162]             Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823170]               Список полей формы ←
      598[164823548]                 Поле (колонка) для ввода данных • Дата ≡ Дата начальная ∙ 381[131078] ←
   131097[164823616]                   Формат ≡ Дата + Время (DD-MM-YYYY HH:NN:SS) ∙ 131096[32505857] ←
      598[164823549]                 Поле (колонка) для ввода данных ≡ Подразделение для вида просмотра (глоб.перем.) ∙ 381[42401793] ←
      209[164823238]                   Выбор из списка ≡ Выбор товарного подразделения по наименованию ∙ 371[17104897] ←
 11010088[164824490]             ВЫПОЛНИТЬ ≡ ShowOkMsg ∙ 127[39780363] ←
 11010095[164823738]               Выражение ←
      404[164839692]                 Результат ≡ Последняя партия по подразделениям (Через дату - параметр) ∙ 249[40370294] ←
 32505862[164824823]                   Значения формальных параметров при вызове ←
 32505860[164826897]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[40376222] ←
   327700[164828087]                       Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826898]                     Значение параметра при вызове процедуры/функции ≡ Подразделения ∙ 65545[40376223] ←
   327700[164828088]                       Выражение ≡ Подразделение для вида просмотра (глоб.перем.) ∙ 381[42401793] ←
 32505860[164826899]                     Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[40376225] ←
   327700[164828089]                       Выражение ≡ Дата начальная ∙ 381[131078] ←
      113[164823065]       Сценарий (Меню) • Реализация ←
      127[164823358]         Процедура • Реализация по списку подразделений (ЦФО) ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[164823231]           Локальные переменные ←
    65545[164825884]             Локальная переменная • Тов.подразделения ≡ Список партнеров ∙ 107[1507332] ←
 30867463[164823260]           Выполнить действия ←
 12124190[164823163]             Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823171]               Список полей формы ←
      598[164823550]                 Поле (колонка) для ввода данных ≡ Подразделение ∙ 381[2] ←
      209[164823239]                   Выбор из списка ≡ Организации (Юридические лица) ∙ 371[42401908] ←
      598[164823551]                 Поле (колонка) для ввода данных ≡ Дата начальная ∙ 381[131078] ←
      598[164823552]                 Поле (колонка) для ввода данных ≡ Дата конечная ∙ 381[131079] ←
 30867469[164823780]             БЛОК • Подразделения ←
  1507360[164823654]               Отбор данных (по запросу) • Подразделения (нормальные) ←
 12124200[164823286]                 From         (Таблицы) ←
 12124204[164823428]                   Таблица • Тов зал ≡ Партнер ∙ 108[4] ←
 12124204[164823429]                   Таблица • Магазин ≡ Партнер ∙ 108[4] ←
 12124215[164823424]                 Where      (Ограничения на отбор данных) ←
  1507376[164824727]                   Выражение ←
  1507455[164824949]                     Результат ≡ Тов зал ∙ 12124204[164823428] ←
  1507494[164825589]                       Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[164825226]                     Равно ←
  1507488[164823276]                     Константа (Ограничение по классу, типу, плану счетов) ≡ Товарный склад/секция ∙ 284[14745607] ←
      413[164824590]                   И ←
  1507376[164824728]                   Выражение ←
  1507455[164824950]                     Результат ≡ Тов зал ∙ 12124204[164823428] ←
  1507494[164825590]                       Уточняющий параметр ≡ Организация (Юридическое лицо) ∙ 283[28835910] ←
  1638473[164825227]                     Равно ←
  1507452[164824275]                     Константа ≡ Подразделение ∙ 381[2] ←
      413[164824591]                   И ←
  1507376[164824729]                   Выражение ←
  1507455[164824951]                     Результат ≡ Тов зал ∙ 12124204[164823428] ←
  1507494[164825591]                       Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[164825228]                     Равно ←
  1507455[164824952]                     Результат ≡ Магазин ∙ 12124204[164823429] ←
  1507494[164825592]                       Уточняющий параметр ≡ Партнер ∙ 283[1] ←
      413[164824592]                   И ←
  1507376[164824730]                   Выражение ←
  1507455[164824953]                     Результат ≡ Магазин ∙ 12124204[164823429] ←
  1507494[164825593]                       Уточняющий параметр ≡ Член комиссии по приемке товара ∙ 283[28835854] ←
  1638473[164825229]                     Равно ←
  1638402[164823572]                     NULL ←
 12124213[164823344]                 Параметры ←
  1507335[164823700]                   Параметр ≡ Тов зал ∙ 12124204[164823428] ←
  1507494[164825594]                     Уточняющий параметр ≡ Партнер ∙ 283[1] ←
 30867466[164823752]                 Выполнить после получения записи ←
 11010080[164829075]                   = ≡ Тов.подразделения ∙ 65545[164825884] ←
      404[164839693]                     Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823277]                       Список элементов ←
   327700[164828090]                         Выражение ≡ Тов.подразделения ∙ 65545[164825884] ←
   327700[164828091]                         Выражение ∙ 1507335[164823700] ←
  1507360[164823655]               Отбор данных (по запросу) • Подразделения (комиссионные) ←
 12124200[164823287]                 From         (Таблицы) ←
 12124204[164823430]                   Таблица • Тов зал ≡ Партнер ∙ 108[4] ←
 12124204[164823431]                   Таблица • Магазин ≡ Партнер ∙ 108[4] ←
 12124215[164823425]                 Where      (Ограничения на отбор данных) ←
  1507376[164824731]                   Выражение ←
  1507455[164824954]                     Результат ≡ Тов зал ∙ 12124204[164823430] ←
  1507494[164825595]                       Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[164825230]                     Равно ←
  1507488[164823277]                     Константа (Ограничение по классу, типу, плану счетов) ≡ Товарный склад/секция ∙ 284[14745607] ←
      413[164824593]                   И ←
  1507376[164825019]                   Выражение ←
  1507455[164824955]                     Результат ≡ Тов зал ∙ 12124204[164823430] ←
  1507494[164825596]                       Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[164825231]                     Равно ←
  1507455[164824956]                     Результат ≡ Магазин ∙ 12124204[164823431] ←
  1507494[164825597]                       Уточняющий параметр ≡ Партнер ∙ 283[1] ←
      413[164824594]                   И ←
  1507376[164825020]                   Выражение ←
  1507455[164824957]                     Результат ≡ Магазин ∙ 12124204[164823431] ←
  1507494[164825598]                       Уточняющий параметр ≡ Член комиссии по приемке товара ∙ 283[28835854] ←
  1638473[164825232]                     Равно ←
  1507452[164824276]                     Константа ≡ Подразделение ∙ 381[2] ←
 12124213[164823345]                 Параметры ←
  1507335[164823701]                   Параметр ≡ Тов зал ∙ 12124204[164823430] ←
  1507494[164825599]                     Уточняющий параметр ≡ Партнер ∙ 283[1] ←
 30867466[164823753]                 Выполнить после получения записи ←
 11010080[164829076]                   = ≡ Тов.подразделения ∙ 65545[164825884] ←
      404[164839694]                     Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823278]                       Список элементов ←
   327700[164828092]                         Выражение ≡ Тов.подразделения ∙ 65545[164825884] ←
   327700[164828093]                         Выражение ∙ 1507335[164823701] ←
 11010088[164824491]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823739]               Выражение ←
  1638464[164824441]                 Ноль (0.0), если NULL ≡ Реализация (Факт) (по Списку подразделений) БАЗОВЫЙ ∙ 249[40370264] ←
 32505862[164824824]                   Значения формальных параметров при вызове ←
 32505860[164826900]                     Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[40374801] ←
   327700[164828094]                       Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826901]                     Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[40374802] ←
   327700[164828095]                       Выражение ≡ Дата начальная ∙ 381[131078] ←
 32505860[164826902]                     Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[40374803] ←
   327700[164828096]                       Выражение ≡ Дата конечная ∙ 381[131079] ←
 32505860[164826903]                     Значение параметра при вызове процедуры/функции ≡ Список подразделений ∙ 65545[40374804] ←
   327700[164828097]                       Выражение ≡ Тов.подразделения ∙ 65545[164825884] ←
  1638487[164823443]                 Конкатенировать строки ←
      404[164839695]                 Результат ⁼ ' ; ' ←
  1638487[164823444]                 Конкатенировать строки ←
  1638464[164824442]                 Ноль (0.0), если NULL ≡ Реализация (ШТ) (по Списку подразделений) БАЗОВЫЙ ∙ 249[40370265] ←
 32505862[164824825]                   Значения формальных параметров при вызове ←
 32505860[164826904]                     Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[40374815] ←
   327700[164828098]                       Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826905]                     Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[40374816] ←
   327700[164828099]                       Выражение ≡ Дата начальная ∙ 381[131078] ←
 32505860[164826906]                     Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[40374817] ←
   327700[164828100]                       Выражение ≡ Дата конечная ∙ 381[131079] ←
 32505860[164826907]                     Значение параметра при вызове процедуры/функции ≡ Список подразделений ∙ 65545[40374818] ←
   327700[164828101]                       Выражение ≡ Тов.подразделения ∙ 65545[164825884] ←
      127[164823359]         Процедура • Реализация по списку подразделений ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[164823232]           Локальные переменные ←
    65545[164825885]             Локальная переменная • Тов.подразделения ≡ Список партнеров ∙ 107[1507332] ←
 30867463[164823261]           Выполнить действия ←
 12124190[164823164]             Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823172]               Список полей формы ←
      598[164823553]                 Поле (колонка) для ввода данных ≡ Дата начальная ∙ 381[131078] ←
      598[164823554]                 Поле (колонка) для ввода данных ≡ Дата конечная ∙ 381[131079] ←
      598[164823555]                 Поле (колонка) для ввода данных ≡ <<Партнер>> ∙ 367[4] ←
      209[164823240]                   Выбор из списка ≡ Выбор торгового партнера по наименованию ∙ 371[11141132] ←
 11010080[164829077]             = ≡ Дата конечная ∙ 381[131079] ←
      404[164839696]               Результат ≡ Дата, конец дня ∙ 249[30867475] ←
 32505862[164824826]                 Значения формальных параметров при вызове ←
 32505860[164826908]                   Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
   327700[164828102]                     Выражение ≡ Дата конечная ∙ 381[131079] ←
  1507360[164823656]             Отбор данных (по запросу) • Тов.подразделения ←
 12124200[164823288]               From         (Таблицы) ←
 12124204[164823432]                 Таблица • Подразделения ≡ Партнер ∙ 108[4] ←
 12124215[164823426]               Where      (Ограничения на отбор данных) ←
  1507376[164825021]                 Выражение ←
  1507455[164824958]                   Результат ≡ Подразделения ∙ 12124204[164823432] ←
  1507494[164825600]                     Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[164825233]                   Равно ←
  1507488[164823278]                   Константа (Ограничение по классу, типу, плану счетов) ≡ Товарный склад/секция ∙ 284[14745607] ←
 12124213[164823346]               Параметры ←
  1507335[164823702]                 Параметр ≡ Подразделения ∙ 12124204[164823432] ←
  1507494[164825601]                   Уточняющий параметр ≡ Партнер ∙ 283[1] ←
 30867466[164823754]               Выполнить после получения записи ←
 11010080[164829078]                 = ≡ Тов.подразделения ∙ 65545[164825885] ←
      404[164839697]                   Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823279]                     Список элементов ←
   327700[164828103]                       Выражение ≡ Тов.подразделения ∙ 65545[164825885] ←
   327700[164828104]                       Выражение ∙ 1507335[164823702] ←
 11010088[164824492]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823740]               Выражение ←
  1638464[164824443]                 Ноль (0.0), если NULL ≡ Реализация (Факт) (Список подразделений) ∙ 249[40370273] ←
 32505862[164824827]                   Значения формальных параметров при вызове ←
 32505860[164826909]                     Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[40375217] ←
   327700[164828105]                       Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826910]                     Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[40375218] ←
   327700[164828106]                       Выражение ≡ Дата начальная ∙ 381[131078] ←
 32505860[164826911]                     Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[40375219] ←
   327700[164828107]                       Выражение ≡ Дата конечная ∙ 381[131079] ←
 32505860[164826912]                     Значение параметра при вызове процедуры/функции ≡ Список подразделений ∙ 65545[40375220] ←
   327700[164828108]                       Выражение ≡ Тов.подразделения ∙ 65545[164825885] ←
  1638487[164823445]                 Конкатенировать строки ←
      404[164839698]                 Результат ⁼ ' ; ' ←
  1638487[164823446]                 Конкатенировать строки ←
  1638464[164824444]                 Ноль (0.0), если NULL ≡ Реализация (Зак) (по Списку подразделений) БАЗОВЫЙ ∙ 249[40370286] ←
 32505862[164824828]                   Значения формальных параметров при вызове ←
 32505860[164826913]                     Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[40376083] ←
   327700[164828109]                       Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826914]                     Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[40376084] ←
   327700[164828110]                       Выражение ≡ Дата начальная ∙ 381[131078] ←
 32505860[164826915]                     Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[40376085] ←
   327700[164828111]                       Выражение ≡ Дата конечная ∙ 381[131079] ←
 32505860[164826916]                     Значение параметра при вызове процедуры/функции ≡ Список подразделений ∙ 65545[40376086] ←
   327700[164828112]                       Выражение ≡ Тов.подразделения ∙ 65545[164825885] ←
 32505860[164826917]                     Значение параметра при вызове процедуры/функции ≡ Список поставщиков ∙ 65545[40376087] ←
   327700[164828113]                       Выражение ≡ <<Партнер>> ∙ 367[4] ←
      127[164823360]         Процедура • Недостача и Излишки (ШТ) ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[164823233]           Локальные переменные ←
    65545[164825886]             Локальная переменная • Тов.подразделения ≡ Список партнеров ∙ 107[1507332] ←
 30867463[164823262]           Выполнить действия ←
 12124190[164823165]             Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823173]               Список полей формы ←
      598[164823556]                 Поле (колонка) для ввода данных ≡ Дата начальная ∙ 381[131078] ←
      598[164823557]                 Поле (колонка) для ввода данных ≡ Дата конечная ∙ 381[131079] ←
 11010080[164829079]             = ≡ Дата конечная ∙ 381[131079] ←
      404[164839699]               Результат ≡ Дата, конец дня ∙ 249[30867475] ←
 32505862[164824829]                 Значения формальных параметров при вызове ←
 32505860[164826918]                   Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
   327700[164828114]                     Выражение ≡ Дата конечная ∙ 381[131079] ←
  1507360[164823657]             Отбор данных (по запросу) • Тов.подразделения ←
 12124200[164823289]               From         (Таблицы) ←
 12124204[164823433]                 Таблица • Подразделения ≡ Партнер ∙ 108[4] ←
 12124215[164823427]               Where      (Ограничения на отбор данных) ←
  1507376[164825022]                 Выражение ←
  1507455[164824959]                   Результат ≡ Подразделения ∙ 12124204[164823433] ←
  1507494[164825602]                     Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[164825234]                   Равно ←
  1507488[164823279]                   Константа (Ограничение по классу, типу, плану счетов) ≡ Товарный склад/секция ∙ 284[14745607] ←
 12124213[164823347]               Параметры ←
  1507335[164823703]                 Параметр ≡ Подразделения ∙ 12124204[164823433] ←
  1507494[164825603]                   Уточняющий параметр ≡ Партнер ∙ 283[1] ←
 30867466[164823755]               Выполнить после получения записи ←
 11010080[164829080]                 = ≡ Тов.подразделения ∙ 65545[164825886] ←
      404[164839700]                   Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823280]                     Список элементов ←
   327700[164828115]                       Выражение ≡ Тов.подразделения ∙ 65545[164825886] ←
   327700[164828116]                       Выражение ∙ 1507335[164823703] ←
 11010088[164824493]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823741]               Выражение ←
      404[164839701]                 Результат ≡ Текущие дата-время ∙ 249[42467332] ←
 11010088[164824494]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823742]               Выражение ←
  1638464[164824445]                 Ноль (0.0), если NULL ≡ Недостача (ШТ) (Список подразделений) БАЗОВЫЙ ∙ 249[40370282] ←
 32505862[164824830]                   Значения формальных параметров при вызове ←
 32505860[164826919]                     Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[40376029] ←
   327700[164828117]                       Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826920]                     Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[40376030] ←
   327700[164828118]                       Выражение ≡ Дата начальная ∙ 381[131078] ←
 32505860[164826921]                     Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[40376031] ←
   327700[164828119]                       Выражение ≡ Дата конечная ∙ 381[131079] ←
 32505860[164826922]                     Значение параметра при вызове процедуры/функции ≡ Список подразделений ∙ 65545[40376032] ←
   327700[164828120]                       Выражение ≡ Тов.подразделения ∙ 65545[164825886] ←
  1638487[164823447]                 Конкатенировать строки ←
      404[164839702]                 Результат ⁼ ' ; ' ←
  1638487[164823448]                 Конкатенировать строки ←
  1638464[164824446]                 Ноль (0.0), если NULL ≡ Излишек (ШТ) (Список подразделений) БАЗОВЫЙ ∙ 249[40370283] ←
 32505862[164824831]                   Значения формальных параметров при вызове ←
 32505860[164826923]                     Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[40376033] ←
   327700[164828121]                       Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826924]                     Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[40376034] ←
   327700[164828122]                       Выражение ≡ Дата начальная ∙ 381[131078] ←
 32505860[164826925]                     Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[40376035] ←
   327700[164828123]                       Выражение ≡ Дата конечная ∙ 381[131079] ←
 32505860[164826926]                     Значение параметра при вызове процедуры/функции ≡ Список подразделений ∙ 65545[40376036] ←
   327700[164828124]                       Выражение ≡ Тов.подразделения ∙ 65545[164825886] ←
 11010088[164824495]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823743]               Выражение ←
      404[164839703]                 Результат ≡ Текущие дата-время ∙ 249[42467332] ←
      113[164823066]       Сценарий (Меню) • Остатки ←
      127[164823361]         Процедура ≡ Остаток по ОСТ_парт по товару ∙ 127[135267394] ←
      127[164823362]         Процедура • Остаток по базовому (Магазин) ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[164823263]           Выполнить действия ←
 12124190[164823166]             Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823174]               Список полей формы ←
      598[164823558]                 Поле (колонка) для ввода данных ≡ Дата конечная ∙ 381[131079] ←
   131097[164823617]                   Формат ≡ Дата + Время (DD-MM-YYYY HH:NN:SS) ∙ 131096[32505857] ←
      598[164823559]                 Поле (колонка) для ввода данных • Магазин ≡ Подразделение ∙ 381[2] ←
      209[164823241]                   Выбор из списка ≡ Торговые точки (Магазины) + РЦ + ПЦ ∙ 371[144310390] ←
 11010088[164824496]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823744]               Выражение ←
      404[164839704]                 Результат ≡ Остатки баз. товара [по Магазину, на дату] ∙ 249[40370196] ←
 32505862[164824832]                   Значения формальных параметров при вызове ←
 32505860[164826927]                     Значение параметра при вызове процедуры/функции ≡ Магазины ∙ 65545[40371465] ←
   327700[164828125]                       Выражение ≡ Подразделение ∙ 381[2] ←
 32505860[164826928]                     Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[40371468] ←
   327700[164828126]                       Выражение ≡ Дата конечная ∙ 381[131079] ←
 32505860[164826929]                     Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[40371466] ←
   327700[164828127]                       Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826930]                     Значение параметра при вызове процедуры/функции ≡ Показать лог ∙ 65545[58524266] ←
   327700[164828128]                       Выражение ≡ true ∙ 117[30867468] ←
      127[164823363]         Процедура • Остаток по списку подразделений (ЦФО) ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[164823234]           Локальные переменные ←
    65545[164825887]             Локальная переменная • Тов.подразделения ≡ Список партнеров ∙ 107[1507332] ←
 30867463[164823264]           Выполнить действия ←
 12124190[164823167]             Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823175]               Список полей формы ←
      598[164823560]                 Поле (колонка) для ввода данных ≡ Подразделение ∙ 381[2] ←
      209[164823242]                   Выбор из списка ≡ Организации (Юридические лица) ∙ 371[42401908] ←
      598[164823561]                 Поле (колонка) для ввода данных ≡ Дата конечная ∙ 381[131079] ←
 11010080[164829081]             = ≡ Дата конечная ∙ 381[131079] ←
      404[164839705]               Результат ≡ Дата, конец дня ∙ 249[30867475] ←
 32505862[164824833]                 Значения формальных параметров при вызове ←
 32505860[164826931]                   Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
   327700[164828129]                     Выражение ≡ Дата конечная ∙ 381[131079] ←
 30867469[164823781]             БЛОК • Подразделения ←
  1507360[164823658]               Отбор данных (по запросу) • Подразделения (нормальные) ←
 12124200[164823290]                 From         (Таблицы) ←
 12124204[164823434]                   Таблица • Тов зал ≡ Партнер ∙ 108[4] ←
 12124204[164823435]                   Таблица • Магазин ≡ Партнер ∙ 108[4] ←
 12124215[164823428]                 Where      (Ограничения на отбор данных) ←
  1507376[164825023]                   Выражение ←
  1507455[164824960]                     Результат ≡ Тов зал ∙ 12124204[164823434] ←
  1507494[164825604]                       Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[164825235]                     Равно ←
  1507488[164823280]                     Константа (Ограничение по классу, типу, плану счетов) ≡ Товарный склад/секция ∙ 284[14745607] ←
      413[164824595]                   И ←
  1507376[164825024]                   Выражение ←
  1507455[164824961]                     Результат ≡ Тов зал ∙ 12124204[164823434] ←
  1507494[164825605]                       Уточняющий параметр ≡ Организация (Юридическое лицо) ∙ 283[28835910] ←
  1638473[164825236]                     Равно ←
  1507452[164824284]                     Константа ≡ Подразделение ∙ 381[2] ←
      413[164824596]                   И ←
  1507376[164825025]                   Выражение ←
  1507455[164824962]                     Результат ≡ Тов зал ∙ 12124204[164823434] ←
  1507494[164825606]                       Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[164825237]                     Равно ←
  1507455[164824963]                     Результат ≡ Магазин ∙ 12124204[164823435] ←
  1507494[164825607]                       Уточняющий параметр ≡ Партнер ∙ 283[1] ←
      413[164824597]                   И ←
  1507376[164825026]                   Выражение ←
  1507455[164824964]                     Результат ≡ Магазин ∙ 12124204[164823435] ←
  1507494[164825608]                       Уточняющий параметр ≡ Член комиссии по приемке товара ∙ 283[28835854] ←
  1638473[164825238]                     Равно ←
  1638402[164823573]                     NULL ←
 12124213[164823348]                 Параметры ←
  1507335[164823704]                   Параметр ≡ Тов зал ∙ 12124204[164823434] ←
  1507494[164825609]                     Уточняющий параметр ≡ Партнер ∙ 283[1] ←
 30867466[164823756]                 Выполнить после получения записи ←
 11010080[164829082]                   = ≡ Тов.подразделения ∙ 65545[164825887] ←
      404[164839706]                     Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823281]                       Список элементов ←
   327700[164828130]                         Выражение ≡ Тов.подразделения ∙ 65545[164825887] ←
   327700[164828131]                         Выражение ∙ 1507335[164823704] ←
  1507360[164823659]               Отбор данных (по запросу) • Подразделения (комиссионные) ←
 12124200[164823291]                 From         (Таблицы) ←
 12124204[164823436]                   Таблица • Тов зал ≡ Партнер ∙ 108[4] ←
 12124204[164823437]                   Таблица • Магазин ≡ Партнер ∙ 108[4] ←
 12124215[164823429]                 Where      (Ограничения на отбор данных) ←
  1507376[164825027]                   Выражение ←
  1507455[164824965]                     Результат ≡ Тов зал ∙ 12124204[164823436] ←
  1507494[164825610]                       Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[164825239]                     Равно ←
  1507488[164823281]                     Константа (Ограничение по классу, типу, плану счетов) ≡ Товарный склад/секция ∙ 284[14745607] ←
      413[164824598]                   И ←
  1507376[164825028]                   Выражение ←
  1507455[164824966]                     Результат ≡ Тов зал ∙ 12124204[164823436] ←
  1507494[164825611]                       Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[164825240]                     Равно ←
  1507455[164824967]                     Результат ≡ Магазин ∙ 12124204[164823437] ←
  1507494[164825612]                       Уточняющий параметр ≡ Партнер ∙ 283[1] ←
      413[164824599]                   И ←
  1507376[164825029]                   Выражение ←
  1507455[164824968]                     Результат ≡ Магазин ∙ 12124204[164823437] ←
  1507494[164825613]                       Уточняющий параметр ≡ Член комиссии по приемке товара ∙ 283[28835854] ←
  1638473[164825241]                     Равно ←
  1507452[164824308]                     Константа ≡ Подразделение ∙ 381[2] ←
 12124213[164823349]                 Параметры ←
  1507335[164823705]                   Параметр ≡ Тов зал ∙ 12124204[164823436] ←
  1507494[164825614]                     Уточняющий параметр ≡ Партнер ∙ 283[1] ←
 30867466[164823757]                 Выполнить после получения записи ←
 11010080[164829083]                   = ≡ Тов.подразделения ∙ 65545[164825887] ←
      404[164839707]                     Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823282]                       Список элементов ←
   327700[164828132]                         Выражение ≡ Тов.подразделения ∙ 65545[164825887] ←
   327700[164828133]                         Выражение ∙ 1507335[164823705] ←
 11010088[164824497]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823745]               Выражение ←
      404[164839708]                 Результат ≡ Остатки баз. товара (Розн.РУБ)       [по Списку подразделений] ∙ 249[40370184] ←
 32505862[164824834]                   Значения формальных параметров при вызове ←
 32505860[164826932]                     Значение параметра при вызове процедуры/функции ≡ Список подразделений ∙ 65545[40370855] ←
   327700[164828134]                       Выражение ≡ Тов.подразделения ∙ 65545[164825887] ←
 32505860[164826933]                     Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[40375889] ←
   327700[164828135]                       Выражение ≡ Дата конечная ∙ 381[131079] ←
 32505860[164826934]                     Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[40375890] ←
   327700[164828136]                       Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[164823364]         Процедура • Остаток по всем подразделениям ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[164823235]           Локальные переменные ←
    65545[164825888]             Локальная переменная • Тов.подразделения ≡ Список партнеров ∙ 107[1507332] ←
 30867463[164823265]           Выполнить действия ←
 12124190[164823168]             Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823176]               Список полей формы ←
      598[164823562]                 Поле (колонка) для ввода данных ≡ Дата конечная ∙ 381[131079] ←
      598[164823563]                 Поле (колонка) для ввода данных ≡ <<Партнер>> ∙ 367[4] ←
      209[164823243]                   Выбор из списка ≡ Выбор торгового партнера по наименованию ∙ 371[11141132] ←
      598[164823564]                 Поле (колонка) для ввода данных • Список подразделений ≡ Список объектов ∙ 381[42401803] ←
      209[164823244]                   Выбор из списка ≡ ПАРТНЕРЫ {...} ∙ 371[18546706] ←
   262165[164823135]                     Выбор нескольких объектов из списка ≡ Да ∙ 534[40566785] ←
      598[164823565]                 Поле (колонка) для ввода данных ≡ Тов.подразделения ∙ 65545[164825888] ←
      209[164823245]                   Выбор из списка ≡ ПАРТНЕРЫ {...} ∙ 371[18546706] ←
 11010080[164829084]             = ≡ Дата конечная ∙ 381[131079] ←
      404[164839709]               Результат ≡ Дата, конец дня ∙ 249[30867475] ←
 32505862[164824835]                 Значения формальных параметров при вызове ←
 32505860[164826935]                   Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
   327700[164828137]                     Выражение ≡ Дата конечная ∙ 381[131079] ←
 11010105[164823234]             Индикатор ⁼ Запрос ←
 11010088[164824498]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823746]               Выражение ←
      404[164839710]                 Результат ≡ Текущие дата-время ∙ 249[42467332] ←
 11010088[164824499]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823747]               Выражение ←
      404[164839711]                 Результат ≡ Остаток Базового товара по всем подразделениям (по поставщику) ∙ 249[40370288] ←
 32505862[164824836]                   Значения формальных параметров при вызове ←
 32505860[164826936]                     Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[40376134] ←
   327700[164828138]                       Выражение ≡ Дата конечная ∙ 381[131079] ←
 32505860[164826937]                     Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[40376133] ←
   327700[164828139]                       Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826938]                     Значение параметра при вызове процедуры/функции ≡ Список поставщиков ∙ 65545[40376150] ←
   327700[164828140]                       Выражение ≡ <<Партнер>> ∙ 367[4] ←
 11010088[164824500]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823748]               Выражение ←
      404[164839712]                 Результат ≡ Текущие дата-время ∙ 249[42467332] ←
 11010088[164824501]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823749]               Выражение ←
      404[164839713]                 Результат ≡ Остатки баз. товара (ШТ)                   [по Списку подразделений] ∙ 249[40370223] ←
 32505862[164824837]                   Значения формальных параметров при вызове ←
 32505860[164826939]                     Значение параметра при вызове процедуры/функции ≡ Список подразделений ∙ 65545[40373216] ←
   327700[164828141]                       Выражение ≡ Список объектов ∙ 381[42401803] ←
 32505860[164826940]                     Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[40373217] ←
   327700[164828142]                       Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 32505860[164826941]                     Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[40373218] ←
   327700[164828143]                       Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[164823365]         Процедура • Осаток партии по Сальдо ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[164823266]           Выполнить действия ←
 12124190[164823169]             Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823177]               Список полей формы ←
      598[164823566]                 Поле (колонка) для ввода данных • Магазин ≡ Подразделение ∙ 381[2] ←
      209[164823246]                   Выбор из списка ≡ Торговые точки (Магазины) + РЦ + ПЦ ∙ 371[144310390] ←
 30867470[164824377]             IF ←
  1638463[164824607]               Условие ←
      404[164839714]                 Результат ≡ Подразделение ∙ 381[2] ←
 30867472[164824354]               THEN • по магазину ←
  1507360[164823660]                 Отбор данных (по запросу) • Подразделения ←
 12124200[164823292]                   From         (Таблицы) ←
 12124204[164823517]                     Таблица ≡ Партнер ∙ 108[4] ←
 12124215[164823430]                   Where      (Ограничения на отбор данных) ←
  1507376[164825030]                     Выражение ←
  1507455[164824969]                       Результат ∙ 12124204[164823517] ←
  1507494[164825615]                         Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[164825242]                       Равно ←
  1507452[164824314]                       Константа ≡ Подразделение ∙ 381[2] ←
      413[164824600]                     И ←
  1507376[164825031]                     Выражение ←
  1507455[164824970]                       Результат ∙ 12124204[164823517] ←
  1507494[164825616]                         Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[164825243]                       Равно ←
  1507488[164823282]                       Константа (Ограничение по классу, типу, плану счетов) ≡ Товарный склад/секция ∙ 284[14745607] ←
      413[164824601]                     И ←
  1507376[164825032]                     Выражение ←
  1507455[164824971]                       Результат ∙ 12124204[164823517] ←
  1507494[164825617]                         Уточняющий параметр ≡ Класс ∙ 283[3] ←
  1638473[164825244]                       Равно ←
  1507488[164823283]                       Константа (Ограничение по классу, типу, плану счетов) ≡ ПОДРАЗДЕЛЕНИЕ ∙ 539[2] ←
 12124213[164823350]                   Параметры ←
  1507335[164823706]                     Параметр • тз ∙ 12124204[164823517] ←
  1507494[164825618]                       Уточняющий параметр ≡ Партнер ∙ 283[1] ←
 30867466[164823758]                   Выполнить после получения записи ←
  1507360[164823661]                     Отбор данных (по запросу) • Остатки по продукту ←
 12124200[164823293]                       From         (Таблицы) ←
 12124204[164823518]                         Таблица ≡ Сальдо ∙ 108[10] ←
  1507673[164823179]                       Ключи оптимизации ←
  1507635[164823048]                         Быстрый показ первых записей ←
  1507446[164823045]                         Использовать прямой порядок индекса ∙ 12124204[164823518] ←
  1507676[164823229]                           Уточняющий параметр ≡ ЦФО --> Счет --> Ан1 --> Ан2 --> Ан3 --> Ан4 --> Ан5 --> Валюта ∙ 1507445[1507435] ←
  1507447[164823119]                       Выражения ←
  1507449[164823246]                         Выражение • Сумма ≡ Число ∙ 107[4] ←
  1507376[164825033]                           Выражение ←
  1507455[164824972]                             Результат ∙ 12124204[164823518] ←
  1507494[164825619]                               Уточняющий параметр ≡ Сумма дебет ∙ 393[9] ←
      406[164823586]                             Вычесть ←
  1507455[164824973]                             Результат ∙ 12124204[164823518] ←
  1507494[164825620]                               Уточняющий параметр ≡ Сумма кредит ∙ 393[10] ←
 12124215[164823431]                       Where      (Ограничения на отбор данных) ←
  1507376[164825034]                         Выражение ←
  1507455[164824974]                           Результат ∙ 12124204[164823518] ←
  1507494[164825621]                             Уточняющий параметр ≡ ЦФО ∙ 393[1] ←
  1638473[164825245]                           Равно ←
  1507452[164824485]                           Константа ≡ Центр финанс. ответственности для ТОВАРНЫХ ПЛАНОВ ∙ 117[45613057] ←
      413[164824602]                         И ←
  1507376[164825035]                         Выражение ←
  1507455[164824975]                           Результат ∙ 12124204[164823518] ←
  1507494[164825622]                             Уточняющий параметр ≡ Счет ∙ 393[2] ←
  1638473[164825246]                           Равно ←
  1507452[164824486]                           Константа ≡ Количество по партиям (товарный запас) ∙ 131[14417935] ←
      413[164824603]                         И ←
  1507376[164825036]                         Выражение ←
  1507455[164824976]                           Результат ∙ 12124204[164823518] ←
  1507494[164825623]                             Уточняющий параметр ≡ Аналитика (1) ∙ 393[3] ←
  1638473[164825247]                           Равно ←
  1507452[164824487]                           Константа ≡ тз ∙ 1507335[164823706] ←
      413[164824604]                         И ←
  1507376[164825037]                         Выражение ←
  1507455[164824977]                           Результат ∙ 12124204[164823518] ←
  1507494[164825624]                             Уточняющий параметр ≡ Аналитика (2) ∙ 393[4] ←
  1638473[164825248]                           Равно ←
  1507452[164824488]                           Константа ≡ <<Продукт>> ∙ 367[3] ←
      413[164824605]                         И ←
  1507376[164825038]                         Выражение ←
  1507455[164824978]                           Результат ∙ 12124204[164823518] ←
  1507494[164825625]                             Уточняющий параметр ≡ Валюта ∙ 393[8] ←
  1638473[164825249]                           Равно ←
  1507452[164824489]                           Константа ≡ Штука ∙ 131108[28049409] ←
 12124213[164823351]                       Параметры ←
  1507335[164823707]                         Параметр • партия ∙ 12124204[164823518] ←
  1507494[164825626]                           Уточняющий параметр ≡ Аналитика (3) ∙ 393[5] ←
  1507335[164823708]                         Параметр • подразделение ∙ 12124204[164823518] ←
  1507494[164825627]                           Уточняющий параметр ≡ Аналитика (1) ∙ 393[3] ←
  1507335[164823709]                         Параметр • остаток ≡ Сумма ∙ 1507449[164823246] ←
 30867466[164823759]                       Выполнить после получения записи ←
 11010099[164823173]                         CONTINUE ←
      116[164824481]                           Выражение ←
  1638464[164824447]                             Ноль (0.0), если NULL ≡ остаток ∙ 1507335[164823709] ←
  1638473[164825250]                             Равно ←
      404[164839715]                             Результат ⁼ 0 ←
 11010088[164824502]                         ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823750]                           Выражение ←
      404[164839716]                             Результат ≡ подразделение ∙ 1507335[164823708] ←
      411[164827376]                               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      404[164839717]                             Результат ⁼ ';' ←
      404[164839718]                             Результат ≡ партия ∙ 1507335[164823707] ←
      404[164839719]                             Результат ⁼ ';' ←
      404[164839720]                             Результат ≡ партия ∙ 1507335[164823710] ←
      411[164827377]                               Уточняющий параметр ≡ Код ∙ 305[5] ←
      404[164839721]                             Результат ⁼ ';' ←
      404[164839722]                             Результат ≡ остаток ∙ 1507335[164823709] ←
 30867473[164823498]               ELSE • по всем подразделениям ←
  1507360[164823662]                 Отбор данных (по запросу) • Остатки по продукту ←
 12124200[164823294]                   From         (Таблицы) ←
 12124204[164823519]                     Таблица ≡ Сальдо ∙ 108[10] ←
  1507673[164823180]                   Ключи оптимизации ←
  1507635[164823049]                     Быстрый показ первых записей ←
  1507446[164823046]                     Использовать прямой порядок индекса ∙ 12124204[164823519] ←
  1507676[164823230]                       Уточняющий параметр ≡ ЦФО --> Счет --> Ан1 --> Ан2 --> Ан3 --> Ан4 --> Ан5 --> Валюта ∙ 1507445[1507435] ←
  1507447[164823120]                   Выражения ←
  1507449[164823247]                     Выражение • Сумма ≡ Число ∙ 107[4] ←
  1507376[164825039]                       Выражение ←
  1507455[164824979]                         Результат ∙ 12124204[164823519] ←
  1507494[164825628]                           Уточняющий параметр ≡ Сумма дебет ∙ 393[9] ←
      406[164823587]                         Вычесть ←
  1507455[164824980]                         Результат ∙ 12124204[164823519] ←
  1507494[164825629]                           Уточняющий параметр ≡ Сумма кредит ∙ 393[10] ←
 12124215[164823432]                   Where      (Ограничения на отбор данных) ←
  1507376[164825040]                     Выражение ←
  1507455[164824981]                       Результат ∙ 12124204[164823519] ←
  1507494[164825630]                         Уточняющий параметр ≡ ЦФО ∙ 393[1] ←
  1638473[164825251]                       Равно ←
  1507452[164824490]                       Константа ≡ Центр финанс. ответственности для ТОВАРНЫХ ПЛАНОВ ∙ 117[45613057] ←
      413[164824606]                     И ←
  1507376[164825041]                     Выражение ←
  1507455[164824982]                       Результат ∙ 12124204[164823519] ←
  1507494[164825631]                         Уточняющий параметр ≡ Счет ∙ 393[2] ←
  1638473[164825252]                       Равно ←
  1507452[164824491]                       Константа ≡ Количество по партиям (товарный запас) ∙ 131[14417935] ←
      413[164824607]                     И ←
  1507376[164825042]                     Выражение ←
  1507455[164824983]                       Результат ∙ 12124204[164823519] ←
  1507494[164825632]                         Уточняющий параметр ≡ Аналитика (2) ∙ 393[4] ←
  1638473[164825253]                       Равно ←
  1507452[164824492]                       Константа ≡ <<Продукт>> ∙ 367[3] ←
      413[164824608]                     И ←
  1507376[164825043]                     Выражение ←
  1507455[164824984]                       Результат ∙ 12124204[164823519] ←
  1507494[164825633]                         Уточняющий параметр ≡ Валюта ∙ 393[8] ←
  1638473[164825254]                       Равно ←
  1507452[164824493]                       Константа ≡ Штука ∙ 131108[28049409] ←
 12124213[164823352]                   Параметры ←
  1507335[164823710]                     Параметр • партия ∙ 12124204[164823519] ←
  1507494[164825634]                       Уточняющий параметр ≡ Аналитика (3) ∙ 393[5] ←
  1507335[164823711]                     Параметр • подразделение ∙ 12124204[164823519] ←
  1507494[164825635]                       Уточняющий параметр ≡ Аналитика (1) ∙ 393[3] ←
  1507335[164823712]                     Параметр • остаток ≡ Сумма ∙ 1507449[164823247] ←
 30867466[164823760]                   Выполнить после получения записи ←
 11010099[164823174]                     CONTINUE ←
      116[164824482]                       Выражение ←
  1638464[164824448]                         Ноль (0.0), если NULL ≡ остаток ∙ 1507335[164823709] ←
  1638473[164825255]                         Равно ←
      404[164839723]                         Результат ⁼ 0 ←
 11010088[164824503]                     ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823751]                       Выражение ←
      404[164839724]                         Результат ≡ подразделение ∙ 1507335[164823711] ←
      411[164827378]                           Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      404[164839725]                         Результат ⁼ ';' ←
      404[164839726]                         Результат ≡ партия ∙ 1507335[164823710] ←
      404[164839727]                         Результат ⁼ ';' ←
      404[164839728]                         Результат ≡ партия ∙ 1507335[164823710] ←
      411[164827379]                           Уточняющий параметр ≡ Код ∙ 305[5] ←
      404[164839729]                         Результат ⁼ ';' ←
      404[164839730]                         Результат ≡ остаток ∙ 1507335[164823712] ←
      127[164823366]         Процедура ≡ Остатки товара и по каждой партии (не ноль) на ДАТУ ∙ 127[58392759] ←
      103[164823177]         Команда ≡ ------------ ∙ 102[57343] ←
      127[164823367]         Процедура ≡ Остаток товара/последняя партия: тестирование времени ∙ 127[656082171] ←
      103[164823178]         Команда ≡ ------------ ∙ 102[57343] ←
      127[164823354]         Процедура • Фьючерсный приход за период от заказа до поставки (ШТ) ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[164823256]           Выполнить действия ←
 11010088[164824488]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823736]               Выражение ←
      404[164839690]                 Результат ≡ Фьючерсный приход за период от заказа до поставки (ШТ) ∙ 249[40370193] ←
 32505862[164824821]                   Значения формальных параметров при вызове ←
 32505860[164826891]                     Значение параметра при вызове процедуры/функции ≡ ф.Список ТЗ ∙ 65545[40371009] ←
   327700[656100791]                       Выражение ≡ Подразделение для вида просмотра (глоб.перем.) ∙ 381[42401793] ←
 32505860[164826892]                     Значение параметра при вызове процедуры/функции ≡ ф.Список Магазинов и ЦО ∙ 65545[655298560] ←
   327700[656100792]                       Выражение ≡ Подразделение для вида просмотра (глоб.перем.) ∙ 381[42401793] ←
      411[656096534]                         Уточняющий параметр ≡ Родитель ∙ 283[2] ←
 32505860[164826893]                     Значение параметра при вызове процедуры/функции ≡ ф.Продукт ∙ 65545[40371010] ←
   327700[656100793]                       Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826894]                     Значение параметра при вызове процедуры/функции ≡ ф.Дата заказа ∙ 65545[40371011] ←
   327700[656100794]                       Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 32505860[656094048]                     Значение параметра при вызове процедуры/функции ≡ ф.Дата поставки ∙ 65545[656089687] ←
   327700[656100795]                       Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 32505860[656094049]                     Значение параметра при вызове процедуры/функции ≡ ф.Дата след поставки ∙ 65545[656089688] ←
   327700[656100796]                       Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
      127[656082502]         Процедура • Расходы (не утверждённые): расход в орг + возвраты + списания ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[656082044]           Выполнить действия ←
 11010088[171311120]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[171311114]               Выражение ←
      404[171311328]                 Результат ⁼ 'Количество расхода = ' ←
  1638464[171311120]                 Ноль (0.0), если NULL ≡ Фьючерсный расход Автозаказ2018 ∙ 249[656081038] ←
 32505862[171311126]                   Значения формальных параметров при вызове ←
 32505860[656094045]                     Значение параметра при вызове процедуры/функции ≡ фп Продукт ∙ 65545[656091097] ←
   327700[656100788]                       Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[656094046]                     Значение параметра при вызове процедуры/функции ≡ фп Список ТЗ ∙ 65545[656091096] ←
   327700[656100789]                       Выражение ≡ Подразделение для вида просмотра (глоб.перем.) ∙ 381[42401793] ←
      127[164823368]         Процедура • Неакцептованные возварты и списания ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[164823267]           Выполнить действия ←
 12124190[164823170]             Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823178]               Список полей формы ←
      598[164823567]                 Поле (колонка) для ввода данных ≡ Дата конечная ∙ 381[131079] ←
   131097[164823618]                   Формат ≡ Дата + Время (DD-MM-YYYY HH:NN:SS) ∙ 131096[32505857] ←
      598[164823568]                 Поле (колонка) для ввода данных • Магазин ≡ Подразделение ∙ 381[2] ←
      209[164823247]                   Выбор из списка ≡ ЦО (распределение расходов/доходов) ∙ 371[40370472] ←
 11010088[164824504]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823752]               Выражение ←
      404[164839731]                 Результат ≡ Возврат/Списание (Неакцептованые) (ШТ) (Список подразделений) БАЗОВЫЙ ∙ 249[655294467] ←
 32505862[164824838]                   Значения формальных параметров при вызове ←
 32505860[164826942]                     Значение параметра при вызове процедуры/функции ≡ Список подразделений ∙ 65545[655296322] ←
   327700[164828144]                       Выражение ≡ Список ТЗ списка ЦО v.1 ∙ 249[56164373] ←
 32505862[164824839]                         Значения формальных параметров при вызове ←
 32505860[164826943]                           Значение параметра при вызове процедуры/функции ≡ ~Список ЦО ∙ 65545[56165024] ←
   327700[164828145]                             Выражение ≡ Подразделение ∙ 381[2] ←
 32505860[164826944]                     Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[655296320] ←
   327700[164828146]                       Выражение ≡ Дата конечная ∙ 381[131079] ←
 32505860[164826945]                     Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[655296319] ←
   327700[164828147]                       Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826946]                     Значение параметра при вызове процедуры/функции ≡ Лог ∙ 65545[655296681] ←
   327700[164828148]                       Выражение ≡ true ∙ 117[30867468] ←
      103[164823179]       Команда ≡ ------------ ∙ 102[57343] ←
      127[164823369]       Процедура • !Спецификации ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[164823268]         Выполнить действия ←
 11010088[164824505]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823753]             Выражение ←
  1638464[164824449]               Ноль (0.0), если NULL ≡ Цена по спецификации ∙ 249[655294509] ←
 32505862[164824840]                 Значения формальных параметров при вызове ←
 32505860[164826947]                   Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[655299436] ←
   327700[164828149]                     Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826948]                   Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[655299439] ←
   327700[164828150]                     Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 32505860[164826949]                   Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[655299438] ←
   327700[164828151]                     Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 32505860[164826950]                   Значение параметра при вызове процедуры/функции ≡ Строка прайса ∙ 65545[58393282] ←
   327700[164828152]                     Выражение ≡ Созданный документ ∙ 381[30670850] ←
  1507728[164823310]           Начало многострочного комментария ←
 12124190[164823171]           Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823179]             Список полей формы ←
      598[164823569]               Поле (колонка) для ввода данных ≡ Подразделение ∙ 381[2] ←
      209[164823248]                 Выбор из списка ≡ ЦО (все) ∙ 371[40370464] ←
 12124190[164823172]           Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823180]             Список полей формы ←
      598[164823570]               Поле (колонка) для ввода данных ≡ Дата конечная ∙ 381[131079] ←
 11010088[164824506]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823754]             Выражение ←
      404[164839732]               Результат ⁼ ! ←
  1507360[164823663]           Отбор данных (по запросу) ≡ Спецификации по списку ЦО/ поставщикам / подгруппам --- ∙ 12124205[57869009] ←
 32505862[164824841]             Значения формальных параметров при вызове ←
 32505860[164826951]               Значение параметра при вызове процедуры/функции ≡ ~uid Товара _zapros ∙ 65545[57870603] ←
   327700[164828153]                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826952]               Значение параметра при вызове процедуры/функции ≡ ~Дата для переоценок _zapros ∙ 65545[57870616] ←
   327700[164828154]                 Выражение ≡ Дата конечная ∙ 381[131079] ←
 30867466[164823761]             Выполнить после получения записи ←
 11010088[164824507]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823755]                 Выражение ←
      404[164839733]                   Результат ≡ Поставщик в спец-ии _запрос ∙ 1507335[57869833] ←
      404[164839734]                   Результат ⁼ ';' ←
      404[164839735]                   Результат ≡ Дата нач _запрос ∙ 1507335[57869835] ←
      404[164839736]                   Результат ⁼ ';' ←
      404[164839737]                   Результат ≡ Дата кон_запрос ∙ 1507335[57869836] ←
  1507729[164823307]           Конец многострочного комментария ←
 11010088[164824508]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823756]             Выражение ←
  1638464[164824450]               Ноль (0.0), если NULL ≡ Созданный документ ∙ 381[30670850] ←
      103[164823180]       Команда ≡ ------------ ∙ 102[57343] ←
      127[164823370]       Процедура • Движение по БТ ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[164823269]         Выполнить действия ←
 12124190[164823173]           Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823181]             Список полей формы ←
      598[164823571]               Поле (колонка) для ввода данных ≡ Дата начальная ∙ 381[131078] ←
      598[164823572]               Поле (колонка) для ввода данных ≡ Дата конечная ∙ 381[131079] ←
      598[164823573]               Поле (колонка) для ввода данных ≡ Подразделение ∙ 381[2] ←
      209[164823249]                 Выбор из списка ≡ Выбор товарного подразделения по наименованию ∙ 371[17104897] ←
  1507360[164823664]           Отбор данных (по запросу) • Дебет ←
 12124200[164823295]             From         (Таблицы) ←
 12124204[164823520]               Таблица ≡ Проводка ∙ 108[7] ←
 12124215[164823433]             Where      (Ограничения на отбор данных) ←
  1507376[164825044]               Выражение ←
  1507455[164824985]                 Результат ∙ 12124204[164823520] ←
  1507494[164826076]                   Уточняющий параметр ≡ ЦФО ∙ 269[2] ←
  1638473[164825256]                 Равно ←
  1507452[164824494]                 Константа ≡ Подразделение ∙ 381[2] ←
      411[164827380]                   Уточняющий параметр ≡ Предприятие (ЦФО) ∙ 283[6684675] ←
      413[164824609]               И ←
  1507376[164825045]               Выражение ←
  1507455[164824986]                 Результат ∙ 12124204[164823520] ←
  1507494[164826077]                   Уточняющий параметр ≡ Дата ∙ 269[5] ←
  1638477[164823226]                 Больше или равно ←
  1507452[164824495]                 Константа ≡ Дата начальная ∙ 381[131078] ←
      413[164824610]               И ←
  1507376[164825046]               Выражение ←
  1507455[164824987]                 Результат ∙ 12124204[164823520] ←
  1507494[164826078]                   Уточняющий параметр ≡ Дата ∙ 269[5] ←
  1638475[164823173]                 Меньше или равно ←
  1507452[164824496]                 Константа ≡ Дата конечная ∙ 381[131079] ←
      413[164824611]               И ←
  1507376[164825047]               Выражение ←
  1507455[164824988]                 Результат ∙ 12124204[164823520] ←
  1507494[164826079]                   Уточняющий параметр ≡ Счет дебет ∙ 269[6] ←
  1638473[164825257]                 Равно ←
  1507452[164824497]                 Константа ≡ Количество по партиям (товарный запас) ∙ 131[14417935] ←
      413[164824612]               И ←
  1507506[164823494]                 Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164823524]                   Если истинно выражение ≡ Подразделение ∙ 381[2] ←
  1507376[164825048]               Выражение ←
  1507506[164823495]                 Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164823525]                   Если истинно выражение ≡ Подразделение ∙ 381[2] ←
  1507455[164824989]                 Результат ∙ 12124204[164823520] ←
  1507494[164826080]                   Уточняющий параметр ≡ Аналитика по дебету (1) ∙ 269[7] ←
  1638473[164825258]                 Равно ←
  1507452[164824498]                 Константа ≡ Подразделение ∙ 381[2] ←
      413[164824613]               И ←
  1507376[164825049]               Выражение ←
  1507455[164824990]                 Результат ∙ 12124204[164823520] ←
  1507494[164826081]                   Уточняющий параметр ≡ Аналитика по дебету (2) ∙ 269[8] ←
  1638473[164825259]                 Равно ←
  1507452[164824499]                 Константа ≡ <<Продукт>> ∙ 367[3] ←
      413[164824614]               И ←
  1507376[164825050]               Выражение ←
  1507455[164824991]                 Результат ∙ 12124204[164823520] ←
  1507494[164826082]                   Уточняющий параметр ≡ Аналитика по дебету (3) ∙ 269[9] ←
  1638473[164825260]                 Равно ←
  1507452[164824500]                 Константа ≡ <<Продукт>> ∙ 367[3] ←
      413[164824615]               И ←
  1507376[164825051]               Выражение ←
  1507455[164824992]                 Результат ∙ 12124204[164823520] ←
  1507494[164826083]                   Уточняющий параметр ≡ Валюта ∙ 269[18] ←
  1638473[164825261]                 Равно ←
  1507452[164824501]                 Константа ≡ Штука ∙ 131108[28049409] ←
 12124213[164823353]             Параметры ←
  1507335[164823713]               Параметр • документ ∙ 12124204[164823520] ←
  1507494[164826084]                 Уточняющий параметр ≡ Документ ∙ 269[3] ←
 30867466[164823762]             Выполнить после получения записи ←
 11010088[164824509]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823757]                 Выражение ←
      404[164839738]                   Результат ⁼ 'Д ' ←
  1638487[164823449]                   Конкатенировать строки ←
      404[164839739]                   Результат ≡ документ ∙ 1507335[164823713] ←
  1507360[164823665]           Отбор данных (по запросу) • Кредит ←
 12124200[164823296]             From         (Таблицы) ←
 12124204[164823521]               Таблица ≡ Проводка ∙ 108[7] ←
 12124215[164823434]             Where      (Ограничения на отбор данных) ←
  1507376[164825052]               Выражение ←
  1507455[164824993]                 Результат ∙ 12124204[164823521] ←
  1507494[164826085]                   Уточняющий параметр ≡ ЦФО ∙ 269[2] ←
  1638473[164825262]                 Равно ←
  1507452[164824502]                 Константа ≡ Подразделение ∙ 381[2] ←
      411[164827381]                   Уточняющий параметр ≡ Предприятие (ЦФО) ∙ 283[6684675] ←
      413[164824616]               И ←
  1507376[164825053]               Выражение ←
  1507455[164824994]                 Результат ∙ 12124204[164823521] ←
  1507494[164826086]                   Уточняющий параметр ≡ Дата ∙ 269[5] ←
  1638477[164823227]                 Больше или равно ←
  1507452[164824503]                 Константа ≡ Дата начальная ∙ 381[131078] ←
      413[164824617]               И ←
  1507376[164825054]               Выражение ←
  1507455[164824995]                 Результат ∙ 12124204[164823521] ←
  1507494[164826087]                   Уточняющий параметр ≡ Дата ∙ 269[5] ←
  1638475[164823174]                 Меньше или равно ←
  1507452[164824504]                 Константа ≡ Дата конечная ∙ 381[131079] ←
      413[164824618]               И ←
  1507376[164825055]               Выражение ←
  1507455[164824996]                 Результат ∙ 12124204[164823521] ←
  1507494[164826088]                   Уточняющий параметр ≡ Счет кредит ∙ 269[12] ←
  1638473[164825263]                 Равно ←
  1507452[164824505]                 Константа ≡ Количество по партиям (товарный запас) ∙ 131[14417935] ←
      413[164824619]               И ←
  1507506[164823496]                 Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164823526]                   Если истинно выражение ≡ Подразделение ∙ 381[2] ←
  1507376[164825056]               Выражение ←
  1507506[164823497]                 Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164823527]                   Если истинно выражение ≡ Подразделение ∙ 381[2] ←
  1507455[164824997]                 Результат ∙ 12124204[164823521] ←
  1507494[164826089]                   Уточняющий параметр ≡ Аналитика по кредиту (1) ∙ 269[13] ←
  1638473[164825264]                 Равно ←
  1507452[164824506]                 Константа ≡ Подразделение ∙ 381[2] ←
      413[164824620]               И ←
  1507376[164825057]               Выражение ←
  1507455[164824998]                 Результат ∙ 12124204[164823521] ←
  1507494[164826090]                   Уточняющий параметр ≡ Аналитика по кредиту (2) ∙ 269[14] ←
  1638473[164825265]                 Равно ←
  1507452[164824507]                 Константа ≡ <<Продукт>> ∙ 367[3] ←
      413[164824621]               И ←
  1507376[164825058]               Выражение ←
  1507455[164824999]                 Результат ∙ 12124204[164823521] ←
  1507494[164826091]                   Уточняющий параметр ≡ Аналитика по кредиту (3) ∙ 269[15] ←
  1638473[164825266]                 Равно ←
  1507452[164824508]                 Константа ≡ <<Продукт>> ∙ 367[3] ←
      413[164824622]               И ←
  1507376[164825059]               Выражение ←
  1507455[164825000]                 Результат ∙ 12124204[164823521] ←
  1507494[164826092]                   Уточняющий параметр ≡ Валюта ∙ 269[18] ←
  1638473[164825267]                 Равно ←
  1507452[164824509]                 Константа ≡ Штука ∙ 131108[28049409] ←
 12124213[164823354]             Параметры ←
  1507335[164823714]               Параметр • документ ∙ 12124204[164823521] ←
  1507494[164826093]                 Уточняющий параметр ≡ Документ ∙ 269[3] ←
 30867466[164823763]             Выполнить после получения записи ←
 11010088[164824510]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823758]                 Выражение ←
      404[164839740]                   Результат ⁼ 'К ' ←
  1638487[164823450]                   Конкатенировать строки ←
      404[164839741]                   Результат ≡ документ ∙ 1507335[164823714] ←
      127[164823371]       Процедура ≡ Сравнение остатков по БТ (документы движения за период) ∙ 127[656015363] ←
      103[164823181]       Команда ≡ ------------ ∙ 102[57343] ←
      432[164823084]         Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1572889[164823064]           Определена роль ≡ Системный администратор Домино ∙ 233[2818071] ←
      127[164823372]       Процедура • Поступление ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[164823236]         Локальные переменные ←
    65545[164825889]           Локальная переменная • Список подразделений ≡ Список партнеров ∙ 107[1507332] ←
 30867463[164823270]         Выполнить действия ←
 12124190[164823174]           Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823182]             Список полей формы ←
      598[164823574]               Поле (колонка) для ввода данных ≡ Подразделение ∙ 381[2] ←
      209[164823250]                 Выбор из списка ≡ Организации (Юридические лица) ∙ 371[42401908] ←
      598[164823575]               Поле (колонка) для ввода данных ≡ Дата начальная ∙ 381[131078] ←
      598[164823576]               Поле (колонка) для ввода данных ≡ Дата конечная ∙ 381[131079] ←
 30867469[164823782]           БЛОК • Список подразделений ←
  1507360[164823666]             Отбор данных (по запросу) • Подразделения (нормальные) ←
 12124200[164823297]               From         (Таблицы) ←
 12124204[164823522]                 Таблица • Тов зал ≡ Партнер ∙ 108[4] ←
 12124204[164823523]                 Таблица • Магазин ≡ Партнер ∙ 108[4] ←
 12124215[164823435]               Where      (Ограничения на отбор данных) ←
  1507376[164825060]                 Выражение ←
  1507455[164825001]                   Результат ≡ Тов зал ∙ 12124204[164823522] ←
  1507494[164826094]                     Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[164825268]                   Равно ←
  1507488[164823284]                   Константа (Ограничение по классу, типу, плану счетов) ≡ Товарный склад/секция ∙ 284[14745607] ←
      413[164824623]                 И ←
  1507376[164825061]                 Выражение ←
  1507455[164825002]                   Результат ≡ Тов зал ∙ 12124204[164823522] ←
  1507494[164826095]                     Уточняющий параметр ≡ Организация (Юридическое лицо) ∙ 283[28835910] ←
  1638473[164825269]                   Равно ←
  1507452[164824510]                   Константа ≡ Подразделение ∙ 381[2] ←
      413[164824624]                 И ←
  1507376[164825062]                 Выражение ←
  1507455[164825003]                   Результат ≡ Тов зал ∙ 12124204[164823522] ←
  1507494[164826096]                     Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[164825270]                   Равно ←
  1507455[164825004]                   Результат ≡ Магазин ∙ 12124204[164823523] ←
  1507494[164826097]                     Уточняющий параметр ≡ Партнер ∙ 283[1] ←
      413[164824625]                 И ←
  1507376[164825063]                 Выражение ←
  1507455[164825005]                   Результат ≡ Магазин ∙ 12124204[164823523] ←
  1507494[164826098]                     Уточняющий параметр ≡ Член комиссии по приемке товара ∙ 283[28835854] ←
  1638473[164825571]                   Равно ←
  1638402[164823574]                   NULL ←
 12124213[164823355]               Параметры ←
  1507335[164823715]                 Параметр ≡ Тов зал ∙ 12124204[164823522] ←
  1507494[164826099]                   Уточняющий параметр ≡ Партнер ∙ 283[1] ←
 30867466[164823764]               Выполнить после получения записи ←
 11010080[164829085]                 = ≡ Список подразделений ∙ 65545[164825889] ←
      404[164839742]                   Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823283]                     Список элементов ←
   327700[164828155]                       Выражение ≡ Список подразделений ∙ 65545[164825889] ←
   327700[164828156]                       Выражение ∙ 1507335[164823715] ←
  1507360[164823741]             Отбор данных (по запросу) • Подразделения (комиссионные) ←
 12124200[164823298]               From         (Таблицы) ←
 12124204[164823524]                 Таблица • Тов зал ≡ Партнер ∙ 108[4] ←
 12124204[164823525]                 Таблица • Магазин ≡ Партнер ∙ 108[4] ←
 12124215[164823436]               Where      (Ограничения на отбор данных) ←
  1507376[164825064]                 Выражение ←
  1507455[164825006]                   Результат ≡ Тов зал ∙ 12124204[164823524] ←
  1507494[164826100]                     Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[164825572]                   Равно ←
  1507488[164823285]                   Константа (Ограничение по классу, типу, плану счетов) ≡ Товарный склад/секция ∙ 284[14745607] ←
      413[164824626]                 И ←
  1507376[164825065]                 Выражение ←
  1507455[164825007]                   Результат ≡ Тов зал ∙ 12124204[164823524] ←
  1507494[164826101]                     Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[164825573]                   Равно ←
  1507455[164825008]                   Результат ≡ Магазин ∙ 12124204[164823525] ←
  1507494[164826102]                     Уточняющий параметр ≡ Партнер ∙ 283[1] ←
      413[164824627]                 И ←
  1507376[164825066]                 Выражение ←
  1507455[164825009]                   Результат ≡ Магазин ∙ 12124204[164823525] ←
  1507494[164826103]                     Уточняющий параметр ≡ Член комиссии по приемке товара ∙ 283[28835854] ←
  1638473[164825574]                   Равно ←
  1507452[164824511]                   Константа ≡ Подразделение ∙ 381[2] ←
 12124213[164823356]               Параметры ←
  1507335[164823716]                 Параметр ≡ Тов зал ∙ 12124204[164823524] ←
  1507494[164826104]                   Уточняющий параметр ≡ Партнер ∙ 283[1] ←
 30867466[164823765]               Выполнить после получения записи ←
 11010080[164829086]                 = ≡ Список подразделений ∙ 65545[164825889] ←
      404[164839743]                   Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823284]                     Список элементов ←
   327700[164828157]                       Выражение ≡ Список подразделений ∙ 65545[164825889] ←
   327700[164828158]                       Выражение ∙ 1507335[164823716] ←
 11010088[164824511]           ВЫПОЛНИТЬ ≡ ShowOkMsg ∙ 127[39780363] ←
 11010095[164823759]             Выражение ←
      404[164839744]               Результат ≡ Поступление (ШТ) (по Списку подразделений) БАЗОВЫЙ ∙ 249[40370266] ←
 32505862[164824842]                 Значения формальных параметров при вызове ←
 32505860[164826953]                   Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[40374841] ←
   327700[164828159]                     Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826954]                   Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[40374843] ←
   327700[164828160]                     Выражение ≡ Дата начальная ∙ 381[131078] ←
 32505860[164826955]                   Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[40374844] ←
   327700[164828161]                     Выражение ≡ Дата конечная ∙ 381[131079] ←
 32505860[164826956]                   Значение параметра при вызове процедуры/функции ≡ Список подразделений ∙ 65545[40374846] ←
   327700[164828162]                     Выражение ≡ Список подразделений ∙ 65545[164825889] ←
      127[164823373]       Процедура • Последнее поступление ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[164823271]         Выполнить действия ←
 12124190[164823175]           Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823183]             Список полей формы ←
      598[164823577]               Поле (колонка) для ввода данных ≡ Подразделение ∙ 381[2] ←
      209[164823251]                 Выбор из списка ≡ Торговые точки (Магазины) + РЦ + ПЦ ∙ 371[144310390] ←
  1507360[164823742]           Отбор данных (по запросу) • Максимальная дата прихода ←
 12124200[164823299]             From         (Таблицы) ←
 12124204[164823526]               Таблица ≡ Проводка ∙ 108[7] ←
 12124204[164823527]               Таблица • Подразделения ≡ Партнер ∙ 108[4] ←
  1507447[164823121]             Выражения ←
  1507449[164823248]               Выражение • Максимальная дата ≡ Дата ∙ 107[3] ←
  1507455[164825010]                 Результат ≡ MAX ∙ 1507471[1507332] ←
  1507476[164823120]                   Значения параметров ←
  1507477[164823153]                     Параметр ≡ Выражение ∙ 1507473[1507332] ←
  1507478[164823153]                       Выражение ∙ 12124204[164823526] ←
  1507494[164826105]                         Уточняющий параметр ≡ Дата ∙ 269[5] ←
 12124213[164823357]             Параметры ←
  1507335[164823717]               Параметр ≡ Максимальная дата ∙ 1507449[164823248] ←
 12124215[164823437]             Where      (Ограничения на отбор данных) ←
  1507376[164825067]               Выражение ←
  1507455[164825011]                 Результат ∙ 12124204[164823526] ←
  1507494[164826106]                   Уточняющий параметр ≡ ЦФО ∙ 269[2] ←
  1638473[164825575]                 Равно ←
  1507452[164824512]                 Константа ≡ Центр финанс. ответственности для ТОВАРНЫХ ПЛАНОВ ∙ 117[45613057] ←
      413[164824628]               И ←
  1507376[164825068]               Выражение ←
  1507455[164825012]                 Результат ∙ 12124204[164823526] ←
  1507494[164826107]                   Уточняющий параметр ≡ Счет дебет ∙ 269[6] ←
  1638473[164825576]                 Равно ←
  1507452[164824513]                 Константа ≡ Количество по партиям (товарный запас) ∙ 131[14417935] ←
      413[164824629]               И ←
  1507376[164825069]               Выражение ←
  1507455[164825013]                 Результат ∙ 12124204[164823526] ←
  1507494[164826108]                   Уточняющий параметр ≡ Аналитика по дебету (1) ∙ 269[7] ←
  1638473[164825577]                 Равно ←
  1507455[164825014]                 Результат ≡ Подразделения ∙ 12124204[164823527] ←
  1507494[164826109]                   Уточняющий параметр ≡ Партнер ∙ 283[1] ←
      413[164824630]               И ←
  1507376[164825070]               Выражение ←
  1507455[164825015]                 Результат ∙ 12124204[164823526] ←
  1507494[164826110]                   Уточняющий параметр ≡ Аналитика по дебету (2) ∙ 269[8] ←
  1638473[164825578]                 Равно ←
  1507452[164824514]                 Константа ≡ <<Продукт>> ∙ 367[3] ←
      413[164824631]               И ←
  1507376[164825071]               Выражение ←
  1507455[164825016]                 Результат ∙ 12124204[164823526] ←
  1507494[164826111]                   Уточняющий параметр ≡ Счет кредит ∙ 269[12] ←
  1638473[164825579]                 Равно ←
  1507452[164824515]                 Константа ≡ Приход/возврат от поставщика ∙ 131[14417931] ←
      413[164824632]               И ←
  1507376[164825072]               Выражение ←
  1507455[164825017]                 Результат ∙ 12124204[164823526] ←
  1507494[164826112]                   Уточняющий параметр ≡ Аналитика по кредиту (1) ∙ 269[13] ←
  1638473[164825580]                 Равно ←
  1507455[164825018]                 Результат ≡ Подразделения ∙ 12124204[164823527] ←
  1507494[164826113]                   Уточняющий параметр ≡ Партнер ∙ 283[1] ←
      413[164824633]               И ←
  1507376[164825073]               Выражение ←
  1507455[164825019]                 Результат ∙ 12124204[164823526] ←
  1507494[164826114]                   Уточняющий параметр ≡ Аналитика по кредиту (2) ∙ 269[14] ←
  1638473[164825581]                 Равно ←
  1507452[164824516]                 Константа ≡ <<Продукт>> ∙ 367[3] ←
      413[164824634]               И ←
  1507376[164825074]               Выражение ←
  1507455[164825020]                 Результат ∙ 12124204[164823526] ←
  1507494[164826115]                   Уточняющий параметр ≡ Валюта ∙ 269[18] ←
  1638473[164825582]                 Равно ←
  1507452[164824517]                 Константа ≡ Штука ∙ 131108[28049409] ←
      413[164824899]               И ←
  1507376[164825075]               Выражение ←
  1507455[164825021]                 Результат ≡ Подразделения ∙ 12124204[164823527] ←
  1507494[164826116]                   Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[164825583]                 Равно ←
  1507452[164824518]                 Константа ≡ Подразделение ∙ 381[2] ←
      413[164824900]               И ←
  1507376[164825076]               Выражение ←
  1507455[164825022]                 Результат ≡ Подразделения ∙ 12124204[164823527] ←
  1507494[164826117]                   Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[164825584]                 Равно ←
  1507488[164823286]                 Константа (Ограничение по классу, типу, плану счетов) ≡ Товарный склад/секция ∙ 284[14745607] ←
 12124222[164823129]             Order By   (Сортировка) ←
  1507464[164823136]               Сортировать по возрастанию ∙ 12124204[164823526] ←
  1507494[164826118]                 Уточняющий параметр ≡ Дата ∙ 269[5] ←
 30867466[164823766]             Выполнить после получения записи ←
 11010088[164824512]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823760]                 Выражение ←
      404[164839745]                   Результат ∙ 1507335[164823717] ←
  1638487[164823451]                   Конкатенировать строки ←
      404[164839746]                   Результат ⁼ ';' ←
  1638487[164823452]                   Конкатенировать строки ←
      404[164839747]                   Результат ⁼ ';' ←
 11010080[164829087]               = ≡ Дата С-Ф (счета-фактуры) ∙ 381[10223618] ←
      404[164839748]                 Результат ∙ 1507335[164823717] ←
  1507360[164823743]               Отбор данных (по запросу) ←
 12124200[164823300]                 From         (Таблицы) ←
 12124204[164823528]                   Таблица ≡ Проводка ∙ 108[7] ←
 12124204[164823529]                   Таблица • Подразделения ≡ Партнер ∙ 108[4] ←
 12124215[164823438]                 Where      (Ограничения на отбор данных) ←
  1507376[164825077]                   Выражение ←
  1507455[164825023]                     Результат ∙ 12124204[164823528] ←
  1507494[164826119]                       Уточняющий параметр ≡ ЦФО ∙ 269[2] ←
  1638473[164825585]                     Равно ←
  1507452[164824519]                     Константа ≡ Центр финанс. ответственности для ТОВАРНЫХ ПЛАНОВ ∙ 117[45613057] ←
      413[164824901]                   И ←
  1507376[164825078]                   Выражение ←
  1507455[164825024]                     Результат ∙ 12124204[164823528] ←
  1507494[164826120]                       Уточняющий параметр ≡ Дата ∙ 269[5] ←
  1638473[164825586]                     Равно ←
  1507452[164824520]                     Константа ≡ Дата С-Ф (счета-фактуры) ∙ 381[10223618] ←
      413[164824902]                   И ←
  1507376[164825079]                   Выражение ←
  1507455[164825025]                     Результат ∙ 12124204[164823528] ←
  1507494[164826121]                       Уточняющий параметр ≡ Счет дебет ∙ 269[6] ←
  1638473[164825587]                     Равно ←
  1507452[164824521]                     Константа ≡ Количество по партиям (товарный запас) ∙ 131[14417935] ←
      413[164824903]                   И ←
  1507376[164825080]                   Выражение ←
  1507455[164825026]                     Результат ∙ 12124204[164823528] ←
  1507494[164826122]                       Уточняющий параметр ≡ Аналитика по дебету (1) ∙ 269[7] ←
  1638473[164825588]                     Равно ←
  1507455[164825423]                     Результат ≡ Подразделения ∙ 12124204[164823529] ←
  1507494[164826123]                       Уточняющий параметр ≡ Партнер ∙ 283[1] ←
      413[164824904]                   И ←
  1507376[164825081]                   Выражение ←
  1507455[164825424]                     Результат ∙ 12124204[164823528] ←
  1507494[164826124]                       Уточняющий параметр ≡ Аналитика по дебету (2) ∙ 269[8] ←
  1638473[164825589]                     Равно ←
  1507452[164824522]                     Константа ≡ <<Продукт>> ∙ 367[3] ←
      413[164824905]                   И ←
  1507376[164825082]                   Выражение ←
  1507455[164825425]                     Результат ∙ 12124204[164823528] ←
  1507494[164826125]                       Уточняющий параметр ≡ Счет кредит ∙ 269[12] ←
  1638473[164825590]                     Равно ←
  1507452[164824523]                     Константа ≡ Приход/возврат от поставщика ∙ 131[14417931] ←
      413[164824906]                   И ←
  1507376[164825083]                   Выражение ←
  1507455[164825426]                     Результат ∙ 12124204[164823528] ←
  1507494[164826126]                       Уточняющий параметр ≡ Аналитика по кредиту (1) ∙ 269[13] ←
  1638473[164825591]                     Равно ←
  1507455[164825427]                     Результат ≡ Подразделения ∙ 12124204[164823529] ←
  1507494[164826127]                       Уточняющий параметр ≡ Партнер ∙ 283[1] ←
      413[164824907]                   И ←
  1507376[164825084]                   Выражение ←
  1507455[164825428]                     Результат ∙ 12124204[164823528] ←
  1507494[164826128]                       Уточняющий параметр ≡ Аналитика по кредиту (2) ∙ 269[14] ←
  1638473[164825592]                     Равно ←
  1507452[164824524]                     Константа ≡ <<Продукт>> ∙ 367[3] ←
      413[164824908]                   И ←
  1507376[164825085]                   Выражение ←
  1507455[164825429]                     Результат ∙ 12124204[164823528] ←
  1507494[164826129]                       Уточняющий параметр ≡ Валюта ∙ 269[18] ←
  1638473[164825593]                     Равно ←
  1507452[164824525]                     Константа ≡ Штука ∙ 131108[28049409] ←
      413[164824909]                   И ←
  1507376[164825086]                   Выражение ←
  1507455[164825430]                     Результат ≡ Подразделения ∙ 12124204[164823529] ←
  1507494[164826130]                       Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[164825594]                     Равно ←
  1507452[164824526]                     Константа ≡ Подразделение ∙ 381[2] ←
      413[164824910]                   И ←
  1507376[164825087]                   Выражение ←
  1507455[164825431]                     Результат ≡ Подразделения ∙ 12124204[164823529] ←
  1507494[164826131]                       Уточняющий параметр ≡ Тип ∙ 283[4] ←
  1638473[164825595]                     Равно ←
  1507488[164823287]                     Константа (Ограничение по классу, типу, плану счетов) ≡ Товарный склад/секция ∙ 284[14745607] ←
 12124213[164823358]                 Параметры ←
  1507335[164823718]                   Параметр • Дата ∙ 12124204[164823528] ←
  1507494[164826132]                     Уточняющий параметр ≡ Дата ∙ 269[5] ←
  1507335[164823719]                   Параметр • Сумма ∙ 12124204[164823528] ←
  1507494[164826133]                     Уточняющий параметр ≡ Сумма ∙ 269[19] ←
 30867466[164823847]                 Выполнить после получения записи ←
 11010088[164824513]                   ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823761]                     Выражение ←
      404[164839749]                       Результат ⁼ '     ' ←
  1638487[164823453]                       Конкатенировать строки ←
      404[164839750]                       Результат ≡ Дата ∙ 1507335[164823718] ←
  1638487[164823454]                       Конкатенировать строки ←
      404[164839751]                       Результат ⁼ ';' ←
  1638487[164823455]                       Конкатенировать строки ←
      404[164839752]                       Результат ≡ Сумма ∙ 1507335[164823719] ←
      103[164823182]       Команда ≡ ------------ ∙ 102[57343] ←
      432[164823085]         Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1572889[164823065]           Определена роль ≡ Системный администратор Домино ∙ 233[2818071] ←
      127[164823374]       Процедура • Страна производства ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[164823272]         Выполнить действия ←
 11010088[164824514]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823762]             Выражение ←
      404[164839753]               Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[164827616]                 Уточняющий параметр ≡ Страна производства ∙ 305[14745604] ←
      411[164827617]                   Уточняющий параметр ≡ Имя ∙ 249[262146] ←
  1638487[164823456]               Конкатенировать строки ←
      404[164839754]               Результат ⁼ ' ' ←
  1638487[164823457]               Конкатенировать строки ←
      404[164839755]               Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[164827618]                 Уточняющий параметр ≡ Страна производства ∙ 305[14745604] ←
      411[164827619]                   Уточняющий параметр ≡ Аббревиатура ∙ 249[65542] ←
  1638487[164823458]               Конкатенировать строки ←
      404[164839756]               Результат ⁼ ' ' ←
  1638487[164823459]               Конкатенировать строки ←
      404[164839757]               Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[164827620]                 Уточняющий параметр ≡ Страна производства ∙ 305[14745604] ←
      411[164827621]                   Уточняющий параметр ≡ Значение ∙ 249[262147] ←
      103[164823183]       Команда ≡ ------------ ∙ 102[57343] ←
      432[164823086]         Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1572889[164823066]           Определена роль ≡ Системный администратор Домино ∙ 233[2818071] ←
      127[164823375]       Процедура • Параметр ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[164823237]         Локальные переменные ←
    65545[164825890]           Локальная переменная • Количество дней наличия ≡ Целое ∙ 107[2] ←
    65545[164825891]           Локальная переменная • Количество реализации ≡ Количество ∙ 107[15] ←
 30867463[164823273]         Выполнить действия ←
 12124190[164823176]           Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823184]             Список полей формы ←
      598[164823578]               Поле (колонка) для ввода данных ≡ Дата начальная ∙ 381[131078] ←
      598[164823579]               Поле (колонка) для ввода данных ≡ Дата конечная ∙ 381[131079] ←
      598[164823580]               Поле (колонка) для ввода данных ≡ <<Партнер>> ∙ 367[4] ←
      209[164823252]                 Выбор из списка ≡ Выбор товарного подразделения по наименованию ∙ 371[17104897] ←
 11010088[164824515]           ВЫПОЛНИТЬ ≡ Количество дней наличия, Реализация (два варианта расчета) ∙ 249[40042812] ←
 32505862[164824843]             Значения формальных параметров при вызове ←
 32505860[164826957]               Значение параметра при вызове процедуры/функции ≡ Список подразделений ∙ 65545[40054695] ←
   327700[164828163]                 Выражение ≡ <<Партнер>> ∙ 367[4] ←
 32505860[164826958]               Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[40054696] ←
   327700[164828164]                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826959]               Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[40054697] ←
   327700[164828165]                 Выражение ≡ Дата начальная ∙ 381[131078] ←
 32505860[164826960]               Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[40054698] ←
   327700[164828166]                 Выражение ≡ Дата, конец дня ∙ 249[30867475] ←
 32505862[164824844]                   Значения формальных параметров при вызове ←
 32505860[164826961]                     Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
   327700[164828167]                       Выражение ≡ Дата конечная ∙ 381[131079] ←
 32505860[164826962]               Значение параметра при вызове процедуры/функции ≡ Количество дней наличия ∙ 65545[40054699] ←
   327700[164828168]                 Выражение ≡ Количество дней наличия ∙ 65545[164825890] ←
 32505860[164826963]               Значение параметра при вызове процедуры/функции ≡ Общая реализация за период (штук) ∙ 65545[40054701] ←
   327700[164828169]                 Выражение ≡ Количество реализации ∙ 65545[164825891] ←
 11010088[164824516]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823763]             Выражение ←
      404[164839758]               Результат ≡ Количество дней наличия ∙ 65545[164825890] ←
      404[164839759]               Результат ⁼ ';' ←
      404[164839760]               Результат ≡ Количество реализации ∙ 65545[164825891] ←
      127[164823376]       Процедура • Постоянная цена ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[164823274]         Выполнить действия ←
  1507360[164823744]           Отбор данных (по запросу) ≡ ПРОВОДКИ ∙ 12124205[48431274] ←
 32505862[164824845]             Значения формальных параметров при вызове ←
 32505860[164826964]               Значение параметра при вызове процедуры/функции ≡ Список ЦФО ∙ 65545[48433455] ←
   327700[164828170]                 Выражение ≡ Центр финанс. ответственности для ТОВАРНЫХ ПЛАНОВ ∙ 117[45613057] ←
 32505860[164826965]               Значение параметра при вызове процедуры/функции ≡ Счета по дебету ∙ 65545[48433459] ←
   327700[164828171]                 Выражение ≡ Постоянная цена товара ∙ 131[13565976] ←
 32505860[164826966]               Значение параметра при вызове процедуры/функции ≡ Счета по кредиту ∙ 65545[48433460] ←
   327700[164828172]                 Выражение ∙ 394[13566448] ←
 32505860[164826967]               Значение параметра при вызове процедуры/функции ≡ Дт [1] ∙ 65545[48433462] ←
   327700[164828173]                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
 12124222[164823130]             Order By   (Сортировка) ←
  1507464[164823137]               Сортировать по возрастанию ≡ Дата из проводки ∙ 1507335[48432397] ←
 30867466[164823848]             Выполнить после получения записи ←
 11010088[164824517]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823764]                 Выражение ←
      404[164839761]                   Результат ≡ Дата из проводки ∙ 1507335[48432397] ←
      404[164839762]                   Результат ⁼ ';' ←
      404[164839763]                   Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      404[164839764]                   Результат ⁼ ';' ←
      404[164839765]                   Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      411[164827622]                     Уточняющий параметр ≡ Код ∙ 331[6] ←
      404[164839766]                   Результат ⁼ ';' ←
      404[164839767]                   Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      411[164827623]                     Уточняющий параметр ≡ Имя типа документа ∙ 249[45940737] ←
      404[164839768]                   Результат ⁼ ';' ←
      404[164839769]                   Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      411[164827624]                     Уточняющий параметр ≡ Дата ∙ 331[8] ←
      404[164839770]                   Результат ⁼ ';' ←
      404[164839771]                   Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      411[164827625]                     Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
      404[164839772]                   Результат ⁼ ';' ←
      404[164839773]                   Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      411[164827626]                     Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
      404[164839774]                   Результат ⁼ ';' ←
      404[164839775]                   Результат ≡ Документ из проводки ∙ 1507335[48432413] ←
      411[164827627]                     Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[164827628]                       Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      404[164839776]                   Результат ⁼ ';' ←
      404[164839777]                   Результат ≡ Строка из проводки ∙ 1507335[48432632] ←
      411[164827629]                     Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
      127[164823377]       Процедура • Партии продукта ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[164823275]         Выполнить действия ←
 30867464[164823045]           Отбор данных ≡ ПРОДУКТЫ ПО ДАТЕ ∙ 592[30867462] ←
       71[164823045]             Обратный порядок ←
 41746466[164823050]             Ограничения по классам/типам ←
   262158[164823079]               Ограничение на класс/тип объектов ≡ Партия товара ∙ 306[14745602] ←
   262158[164823084]               Ограничение на класс/тип объектов ≡ Партия комиссионного товара ∙ 306[15073283] ←
   262158[164823085]               Ограничение на класс/тип объектов ≡ Партия изделия (Готового изделия) ∙ 306[14745609] ←
  1638448[164823095]             Список ограничений на поля объектов ←
   262159[164823221]               Ограничение на поле объекта ≡ Родитель ∙ 305[2] ←
   327700[164828174]                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
 30867466[164823849]             Выполнить после получения записи ←
  1507728[164823311]               Начало многострочного комментария ←
 11010099[164823175]               CONTINUE ←
      116[164824483]                 Выражение ←
  1638464[164824451]                   Ноль (0.0), если NULL ≡ Сальдо по счету (ЦФО) ∙ 249[262149] ←
      324[164823059]                     ЦФО ≡ Центр финанс. ответственности для ТОВАРНЫХ ПЛАНОВ ∙ 117[45613057] ←
      327[164823045]                     Дата ≡ Текущие дата-время ∙ 249[42467332] ←
      325[164823061]                     Валюта ≡ Штука ∙ 131108[28049409] ←
      265[164823046]                     Счет ≡ Количество по партиям (товарный запас) ∙ 131[14417935] ←
    65573[164823046]                       Подразделение ⁼ 4:0:0:488867 ←
    65572[164823046]                       Продукт ≡ <<Продукт>> ∙ 367[3] ←
   131111[164823044]                       Партия ≡ Продукт ∙ 305[1] ←
  1638475[164823175]                   Меньше или равно ←
      404[164839778]                   Результат ⁼ 0 ←
  1507729[164823308]               Конец многострочного комментария ←
 11010088[164824518]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823765]                 Выражение ←
      404[164839779]                   Результат ≡ Продукт ∙ 305[1] ←
      404[164839780]                   Результат ⁼ ';' ←
      404[164839781]                   Результат ≡ Код ∙ 305[5] ←
      404[164839782]                   Результат ⁼ ';' ←
      404[164839783]                   Результат ≡ Дата ∙ 305[9] ←
      404[164839784]                   Результат ⁼ ';' ←
  1638464[164824452]                   Ноль (0.0), если NULL ≡ Сальдо по счету (ЦФО) ∙ 249[262149] ←
      324[164823060]                     ЦФО ≡ Центр финанс. ответственности для ТОВАРНЫХ ПЛАНОВ ∙ 117[45613057] ←
      327[164823046]                     Дата ≡ Текущие дата-время ∙ 249[42467332] ←
      325[164823062]                     Валюта ≡ Штука ∙ 131108[28049409] ←
      265[164823047]                     Счет ≡ Количество по партиям (товарный запас) ∙ 131[14417935] ←
    65573[164823047]                       Подразделение ⁼ '4:0:0:488867' ←
    65572[164823047]                       Продукт ≡ <<Продукт>> ∙ 367[3] ←
   131111[164823045]                       Партия ≡ Продукт ∙ 305[1] ←
      127[164823378]       Процедура ≡ Удалить все PLU товара ∙ 127[656081723] ←
 32505862[164824846]         Значения формальных параметров при вызове ←
 32505860[164826968]           Значение параметра при вызове процедуры/функции ≡ фп.Товар ∙ 65545[656086998] ←
   327700[164828175]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[164823379]       Процедура • Послать уведомление ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[164823276]         Выполнить действия ←
 11010088[164824519]           ВЫПОЛНИТЬ ≡ Уведомление о создании новой карточки ∙ 220[58392600] ←
 32505862[164824847]             Значения формальных параметров при вызове ←
 32505860[164826969]               Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[58393149] ←
   327700[164828176]                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[656081691]       Процедура • Изменить срок годности без пометки изменения ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[656080988]         Локальные переменные ←
    65545[656084820]           Локальная переменная • Срок годности дней ≡ Целое ∙ 107[2] ←
 30867463[656081190]         Выполнить действия ←
 12124190[656081115]           Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[656081207]             Список полей формы ←
      598[656083138]               Поле (колонка) для ввода данных ≡ Срок годности дней ∙ 65545[656084820] ←
      323[656081161]                 Обязательное для ввода поле ←
 30867470[656083567]           IF ←
  1638463[656084218]             Условие ←
      404[656113660]               Результат ≡ <<Продукт>> ∙ 367[3] ←
 30867472[656083557]             THEN • поменяем срок годности ←
 11010088[656084513]               ВЫПОЛНИТЬ ≡ Конфигурация триггеров.ЗапомнитьУстановки ∙ 387[1507689] ←
 11010088[656084514]               ВЫПОЛНИТЬ ≡ Конфигурация триггеров.Установить режим запрета пометки изменений ∙ 387[48431140] ←
 32505862[656085245]                 Значения формальных параметров при вызове ←
 32505860[656090599]                   Значение параметра при вызове процедуры/функции ≡ Включить ∙ 65545[48431540] ←
   327700[656090994]                     Выражение ≡ true ∙ 117[30867468] ←
 11010088[656084515]               ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[656081090]                 Объект ≡ <<Продукт>> ∙ 367[3] ←
      377[656081137]                 Начальные значения полей объекта ←
   131095[656082020]                   Начальное значение поля ≡ Срок реализации, дней ∙ 305[28835888] ←
   327700[656091003]                     Выражение ≡ Срок годности дней ∙ 65545[656084820] ←
 11010088[656084516]               ВЫПОЛНИТЬ ≡ Конфигурация триггеров.ВернутьУстановки ∙ 387[1507690] ←
      127[656082418]       Процедура ≡ Создание объектов Ставка НДС ∙ 127[656082415] ←
 32505862[656086698]         Значения формальных параметров при вызове ←
 32505860[656092097]           Значение параметра при вызове процедуры/функции ≡ ~Товар ∙ 65545[656090673] ←
   327700[656100074]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[656081437]       Процедура • Найти и записать в карточку товара документ Минимальный квант отгрузки ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[656081948]         Выполнить действия ←
 11010088[656083021]           ВЫПОЛНИТЬ ≡ Найти и записать в карточку товара документ Минимальный квант отгрузки ∙ 127[170459262] ←
 32505862[656086488]             Значения формальных параметров при вызове ←
 32505860[656093139]               Значение параметра при вызове процедуры/функции ≡ фп Товар_поиск ∙ 65545[170460314] ←
   327700[656099452]                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[656093140]               Значение параметра при вызове процедуры/функции ≡ воз Документ ∙ 65545[170460316] ←
   327700[656099453]                 Выражение ≡ Документ ∙ 381[5] ←
 11010088[656083020]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[656081944]             Выражение ←
      404[656100391]               Результат ≡ Документ ∙ 381[5] ←
      127[171311286]       Процедура • Срок годности в часах ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[171311162]         Выполнить действия ←
 11010088[171311142]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[171311123]             Выражение ←
      404[171311821]               Результат ≡ Срок годности в часах ∙ 249[170459177] ←
 32505862[171311666]                 Значения формальных параметров при вызове ←
 32505860[171312027]                   Значение параметра при вызове процедуры/функции ≡ фп Срок годности ЕИ ∙ 65545[170462367] ←
   327700[171312270]                     Выражение ≡ <<Продукт>> ∙ 367[3] ←
      411[171311936]                       Уточняющий параметр ≡ Валюта контракта ∙ 305[15007756] ←
 32505860[171312028]                   Значение параметра при вызове процедуры/функции ≡ фп Срок годности количество ∙ 65545[170462368] ←
   327700[171312271]                     Выражение ≡ <<Продукт>> ∙ 367[3] ←
      411[171311937]                       Уточняющий параметр ≡ Срок реализации, дней ∙ 305[28835888] ←
      103[164823184]       Команда ≡ ------------ ∙ 102[57343] ←
      127[164823380]       Процедура • Последняя дата изменения цены ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[164823277]         Выполнить действия ←
 11010088[164824520]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823766]             Выражение ←
      404[164839785]               Результат ≡ Текущие дата-время ∙ 249[42467332] ←
 11010105[164823235]           Индикатор ⁼ Выбор... ←
  1507360[164823745]           Отбор данных (по запросу) ≡ ПРОВОДКИ ПО УБЫВАНИЮ ДАТЫ ∙ 12124205[48431294] ←
 48431168[164823057]             Автоматический подбор индексов ≡ Нет ∙ 534[40566786] ←
  1507673[164823181]             Ключи оптимизации ←
  1507675[164823224]               Использовать индекс ∙ 12124204[48431826] ←
  1507676[164823231]                 Уточняющий параметр ≡ План --> Дата ∙ 1507445[1507412] ←
 32505862[164824848]             Значения формальных параметров при вызове ←
 32505860[164826970]               Значение параметра при вызове процедуры/функции ≡ Список ЦФО ∙ 65545[48433455] ←
   327700[164828177]                 Выражение ≡ Центр финанс. ответственности для ТОВАРНЫХ ПЛАНОВ ∙ 117[45613057] ←
 32505860[164826971]               Значение параметра при вызове процедуры/функции ≡ Валюты ∙ 65545[48433458] ←
   327700[164828178]                 Выражение ≡ Российский рубль ∙ 131203081[28114945] ←
 32505860[164826972]               Значение параметра при вызове процедуры/функции ≡ Счета по дебету ∙ 65545[48433459] ←
   327700[164828179]                 Выражение ≡ Прайс поставщика ∙ 131[40370178] ←
 32505860[164826973]               Значение параметра при вызове процедуры/функции ≡ Счета по кредиту ∙ 65545[48433460] ←
   327700[164828180]                 Выражение ≡ Прайс поставщика ∙ 131[40370178] ←
 32505860[164826974]               Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[48433457] ←
   327700[164828181]                 Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 32505860[164826975]               Значение параметра при вызове процедуры/функции ≡ Дт [3] ∙ 65545[48433464] ←
   327700[164828182]                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826976]               Значение параметра при вызове процедуры/функции ≡ Кт [3] ∙ 65545[48433469] ←
   327700[164828183]                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
 12124215[164823439]             Where      (Ограничения на отбор данных) ←
  1507381[164823164]               <Наследуемые ограничения> ←
      413[164824911]               И ←
  1507376[164825088]               Выражение ←
  1507455[164825432]                 Результат ∙ 12124204[48431826] ←
  1507494[164826134]                   Уточняющий параметр ≡ Сумма ∙ 269[19] ←
  1638478[164823180]                 Больше ←
  1507452[164824527]                 Константа ⁼ 0 ←
 30867466[164823850]             Выполнить после получения записи ←
 11010088[164824521]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823767]                 Выражение ←
      404[164839786]                   Результат ≡ Дата из проводки ∙ 1507335[48432397] ←
      404[164839787]                   Результат ⁼ ; ←
      404[164839788]                   Результат ≡ Сумма из проводки ∙ 1507335[48432401] ←
 11010088[164824522]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823768]             Выражение ←
      404[164839789]               Результат ≡ Текущие дата-время ∙ 249[42467332] ←
      127[164365503]       Процедура ≡ Перерасчет ценового сегмента товаров ∙ 127[164365502] ←
 32505862[164370467]         Значения формальных параметров при вызове ←
 32505860[164377183]           Значение параметра при вызове процедуры/функции ≡ ФП Товар ∙ 65545[164372514] ←
   327700[164382502]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
      103[164823185]     Команда ≡ ------------ ∙ 102[57343] ←
      432[164823087]       Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1572889[164823067]         Определена роль ≡ Системный администратор Домино ∙ 233[2818071] ←
      113[164823067]     Сценарий (Меню) • Розничные цены ←
      432[164823088]       Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[164823528]         Если истинно выражение ≡ Видимость розн. цены на магазине ∙ 117[164430104] ←
      371[164823084]       Вид просмотра ≡ Цены по товару по активным Ком отделам ∙ 371[57868532] ←
 32505862[164824849]         Значения формальных параметров при вызове ←
 32505860[164826977]           Значение параметра при вызове процедуры/функции ≡ ~Uid товара _вп ∙ 65545[57869198] ←
   327700[164828184]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 30867533[164823044]         Подсказка (ToolTip) ←
      127[164823381]       Процедура ≡ Постоянные цены по товару (проводки) в текст ∙ 127[57868508] ←
      371[164823085]       Вид просмотра ≡ Приказы на пост. цену по товару ∙ 371[57868441] ←
 32505862[164824850]         Значения формальных параметров при вызове ←
 32505860[164826978]           Значение параметра при вызове процедуры/функции ≡ ~Uid товара _вп ∙ 65545[57869450] ←
   327700[164828185]             Выражение ≡ Продукт ∙ 305[1] ←
 30867533[164823045]         Подсказка (ToolTip) ⁼ Приказы на пост. цену по товару ←
      103[164823186]     Команда ≡ ------------ ∙ 102[57343] ←
      432[164823089]       Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[164823529]         Если истинно выражение ≡ Текущий узел является консолидированной базой ∙ 249[1507768] ←
      113[164823068]     Сценарий (Меню) • Дополнительно ←
      432[164823055]       Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1507508[164823483]         Если истинно выражение ≡ Текущий узел является консолидированной базой ∙ 249[1507768] ←
  1507508[164364606]         Если истинно выражение ≡ Текущий узел - дискаунтер ∙ 249[164364415] ←
      127[164823257]       Процедура • Блокировка товара ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[164823196]         Локальные переменные ←
    65545[164825819]           Локальная переменная • Строка документа блокировки ≡ Строка (объект БД) ∙ 107[10] ←
    65545[164825820]           Локальная переменная • Заказывать ≡ bool ∙ 107[1507344] ←
    65545[164825821]           Локальная переменная • Отображать в заказе ≡ bool ∙ 107[1507344] ←
 30867463[164823219]         Выполнить действия ←
 12124190[164823131]           Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164823139]             Список полей формы ←
      598[164823486]               Поле (колонка) для ввода данных ≡ Подразделение ∙ 381[2] ←
      209[164823213]                 Выбор из списка ≡ ЦО (магазины) ∙ 371[656080927] ←
      598[164823487]               Поле (колонка) для ввода данных ≡ Партнер ∙ 381[3] ←
      209[164823214]                 Выбор из списка ≡ Торговые партнеры по наименованию ∙ 371[11141135] ←
      598[164823488]               Поле (колонка) для ввода данных ≡ Дата начальная ∙ 381[131078] ←
 11010080[164828990]           = ≡ Отображать в заказе ∙ 65545[164825821] ←
      404[164839234]             Результат ≡ true ∙ 117[30867468] ←
 30867470[164824352]           IF ←
  1638463[164824573]             Условие ←
      404[164839235]               Результат ≡ Товар заблокирован поставщиком (БЛОКИРОВКА ТОВАРА) ∙ 117[164430115] ←
 32505862[164824642]                 Значения формальных параметров при вызове ←
 32505860[164826458]                   Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164431518] ←
   327700[164827536]                     Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826470]                   Значение параметра при вызове процедуры/функции ≡ Поставщик ∙ 65545[164431520] ←
   327700[164827537]                     Выражение ≡ Партнер ∙ 381[3] ←
 32505860[164826472]                   Значение параметра при вызове процедуры/функции ≡ ЦО ∙ 65545[164431793] ←
   327700[164827538]                     Выражение ≡ Подразделение ∙ 381[2] ←
 32505860[164826545]                   Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164431521] ←
   327700[164827539]                     Выражение ≡ Дата начальная ∙ 381[131078] ←
 32505860[164826549]                   Значение параметра при вызове процедуры/функции ≡ Строка блокировки~ ∙ 65545[164431522] ←
   327700[164827540]                     Выражение ≡ Строка документа блокировки ∙ 65545[164825819] ←
 32505860[164826554]                   Значение параметра при вызове процедуры/функции ≡ Заказывать?~ ∙ 65545[164431523] ←
   327700[164827541]                     Выражение ≡ Заказывать ∙ 65545[164825820] ←
 32505860[164826555]                   Значение параметра при вызове процедуры/функции ≡ Отображать?~ ∙ 65545[164431524] ←
   327700[164827542]                     Выражение ≡ Отображать в заказе ∙ 65545[164825821] ←
 32505860[164826556]                   Значение параметра при вызове процедуры/функции ≡ Тип сети ∙ 65545[164431795] ←
   327700[164827543]                     Выражение ≡ Вернуть тип сети по ЦО, ТТ, ТЗ, текущему узлу ∙ 249[164364412] ←
 32505862[164824675]                       Значения формальных параметров при вызове ←
 32505860[164826557]                         Значение параметра при вызове процедуры/функции ≡ Подразделение ∙ 65545[164370752] ←
   327700[164827544]                           Выражение ≡ Подразделение ∙ 381[2] ←
 30867472[164824349]             THEN • позиция заблокирована ←
 11010088[164824317]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823615]                 Выражение ←
      404[164839236]                   Результат ⁼ 'Есть блокировка!' ←
 30867473[164823493]             ELSE ←
 11010088[164824318]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823616]                 Выражение ←
      404[164839237]                   Результат ⁼ 'Нет блокировки!' ←
  1507728[164823307]           Начало многострочного комментария ←
 30867470[164824353]           IF ←
  1638463[164824574]             Условие ←
      404[164839238]               Результат ≡ Товар заблокирован поставщиком ∙ 117[655294697] ←
 32505862[164824677]                 Значения формальных параметров при вызове ←
 32505860[164826558]                   Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[655298495] ←
   327700[164827545]                     Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826559]                   Значение параметра при вызове процедуры/функции ≡ Поставщик ∙ 65545[655298496] ←
   327700[164827546]                     Выражение ≡ Партнер ∙ 381[3] ←
 32505860[164826560]                   Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[655298497] ←
   327700[164827547]                     Выражение ≡ Дата начальная ∙ 381[131078] ←
 32505860[164826561]                   Значение параметра при вызове процедуры/функции ≡ Строка блокировки~ ∙ 65545[58393278] ←
   327700[164827548]                     Выражение ≡ Строка документа блокировки ∙ 65545[164825819] ←
 32505860[164826562]                   Значение параметра при вызове процедуры/функции ≡ Заказывать?~ ∙ 65545[655295390] ←
   327700[164827549]                     Выражение ≡ Заказывать ∙ 65545[164825820] ←
 32505860[164826563]                   Значение параметра при вызове процедуры/функции ≡ Отображать?~ ∙ 65545[58393264] ←
   327700[164827550]                     Выражение ≡ Отображать в заказе ∙ 65545[164825821] ←
 30867472[164824350]             THEN • позиция заблокирована ←
 11010088[164824409]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823630]                 Выражение ←
      404[164839239]                   Результат ⁼ 'Есть блокировка!' ←
 30867473[164823494]             ELSE ←
 11010088[164824410]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823631]                 Выражение ←
      404[164839240]                   Результат ⁼ 'Нет блокировки!' ←
  1507729[164823304]           Конец многострочного комментария ←
 11010088[164824411]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823632]             Выражение ←
      404[164839241]               Результат ≡ Дата начальная ∙ 381[131078] ←
 11010088[164824412]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823633]             Выражение ←
      404[164839465]               Результат ≡ Партнер ∙ 381[3] ←
      411[164827198]                 Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 11010088[164824414]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164823634]             Выражение ←
      404[164839466]               Результат ≡ Строка документа блокировки ∙ 65545[164825819] ←
      404[164839467]               Результат ⁼ ';' ←
      404[164839468]               Результат ≡ Заказывать ∙ 65545[164825820] ←
      404[164839469]               Результат ⁼ ';' ←
      404[164839470]               Результат ≡ Отображать в заказе ∙ 65545[164825821] ←
      127[164823321]       Процедура ≡ Определение МРЦ алкоголя по товару и дате ∙ 127[656081151] ←
 32505862[164824797]         Значения формальных параметров при вызове ←
 32505860[164826832]           Значение параметра при вызове процедуры/функции ≡ ~Товар ∙ 65545[656081859] ←
   327700[164828022]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164826833]           Значение параметра при вызове процедуры/функции ≡ ~Вывести лог ∙ 65545[656081864] ←
   327700[164828023]             Выражение ≡ true ∙ 117[30867468] ←
 32505860[164826834]           Значение параметра при вызове процедуры/функции ≡ МРЦ~ ∙ 65545[656081861] ←
   327700[164828024]             Выражение ≡ NULL ∙ 117[30670850] ←
      371[656081002]       Вид просмотра ≡ Приказ на назначение ценовой схемы ∙ 371[656081001] ←
      127[656081802]       Процедура • Приказ на назначение ЦС ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[656081330]         Выполнить действия ←
 11010088[656084376]           ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[656082819]             Выражение ←
      404[656112525]               Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[656089904]                 Уточняющий параметр ≡ Ценовая схема ∙ 305[3342344] ←
      404[656112526]               Результат ⁼ ';' ←
      404[656112527]               Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[656089905]                 Уточняющий параметр ≡ Приказ на назначение ценовой схемы ∙ 305[43122715] ←
      113[164364381]       Сценарий (Меню) • Тесты ←
      432[164364485]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1572889[164364410]           Определена роль ≡ Тесты ∙ 233[135266319] ←
      127[164365220]         Процедура • Цена из ДУЦ ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[164364841]           Локальные переменные ←
    65545[164370934]             Локальная переменная • Формат магазина ≡ Партнер ∙ 107[5] ←
    65545[164370935]             Локальная переменная • Цена из ДУЦ ≡ Число ∙ 107[4] ←
    65545[164372428]             Локальная переменная • Дата ≡ Дата ∙ 107[3] ←
 30867463[164365154]           Выполнить действия ←
  1507360[164365991]             Отбор данных (по запросу) • Форматы ценообразования ≡ ПАРТНЕРЫ ∙ 12124205[18546727] ←
 32505862[164364393]               Значения формальных параметров при вызове ←
 32505860[164373986]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547202] ←
   327700[164378551]                   Выражение ≡ Ценовой формат ∙ 284[4653058] ←
 30867466[164366296]               Выполнить после получения записи ←
 11010080[164376334]                 = ≡ Формат магазина ∙ 65545[164370934] ←
      404[164400868]                   Результат ≡ з.Партнёр_UID ∙ 1507335[18547014] ←
 11010080[164376335]                 = ≡ Цена из ДУЦ ∙ 65545[164370935] ←
      404[164400869]                   Результат ≡ Цена из ДУЦ на дату ∙ 249[164364356] ←
 32505862[164364394]                     Значения формальных параметров при вызове ←
 32505860[164373988]                       Значение параметра при вызове процедуры/функции ≡ Товар из реестра ∙ 65545[164368290] ←
   327700[164378553]                         Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164374220]                       Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164368299] ←
   327700[164378554]                         Выражение ≡ Формат магазина ∙ 65545[164370934] ←
 32505860[164376381]                       Значение параметра при вызове процедуры/функции ≡ Дата цены ∙ 65545[164372427] ←
   327700[164381509]                         Выражение ≡ Дата ∙ 65545[164372428] ←
 11010099[164365034]                 CONTINUE ←
      116[164368875]                   Выражение ←
  1638460[164365584]                     НЕ ←
      404[164400870]                     Результат ≡ Цена из ДУЦ ∙ 65545[164370935] ←
 11010088[164367809]                 ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164365746]                   Выражение ←
      404[164400872]                     Результат ⁼ Формат: ←
      404[164400871]                     Результат ≡ Формат магазина ∙ 65545[164370934] ←
      411[164376336]                       Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      404[164400873]                     Результат ⁼ , цена: ←
      404[164400874]                     Результат ≡ Цена из ДУЦ ∙ 65545[164370935] ←
      404[164407479]                     Результат ⁼ ', дата: ' ←
      404[164407480]                     Результат ≡ Дата ∙ 65545[164372428] ←
      127[164365406]         Процедура • Документы ПРОМО по товару (следующие 20 дней) ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[164365290]           Выполнить действия ←
 39780361[164364965]             ЗАВЕРШИТЬ БЛОК ←
      116[164364858]               Выражение ←
  1638460[164365910]                 НЕ ←
      404[164384224]                 Результат ≡ Есть ПРОМО на товар (период +20 дней) - ДУЦ ∙ 249[164364385] ←
 32505862[164369969]                   Значения формальных параметров при вызове ←
 32505860[164376045]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164369870] ←
   327700[164378591]                       Выражение ≡ <<Продукт>> ∙ 367[3] ←
 12124191[164364349]             Вид просмотра • ПРОМО-акции ≡ ДОКУМЕНТЫ {...} ∙ 371[18546725] ←
   262166[164364304]               Заголовок ≡ Заголовок ∙ 117[656081128] ←
 32505862[164369970]               Значения формальных параметров при вызове ←
 32505860[164376046]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Список типов ∙ 65545[18547219] ←
   327700[164378592]                   Выражение ≡ Перечень товаров для акции ∙ 332[3342383] ←
 32505860[164376047]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Список UID-ов ∙ 65545[1510082] ←
   327700[164378593]                   Выражение ≡ Есть ПРОМО на товар (период +20 дней) - ДУЦ ∙ 249[164364385] ←
 32505862[164369971]                     Значения формальных параметров при вызове ←
 32505860[164376048]                       Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164369870] ←
   327700[164378594]                         Выражение ≡ <<Продукт>> ∙ 367[3] ←
      247[164364470]               Список полей просмотра ←
      117[164365122]                 Выражение • * ←
  1638461[164364438]                   Условный оператор (IF) ←
  1638463[164368694]                     Условие ←
      404[164384225]                       Результат ≡ <<Документ>> ∙ 367[5] ←
      411[164378508]                         Уточняющий параметр ≡ Состояние документа ∙ 331[14] ←
      105[164364444]                     То ←
      404[164384226]                       Результат ⁼ * ←
      424[164364439]                     Иначе ←
  1638402[164366031]                       NULL ←
      590[164366037]                 Поле (колонка), являющееся параметром объекта ≡ * ∙ 117[164365122] ←
      326[164365014]                   Минимально возможная ширина ⁼ 3 ←
      351[164364363]                   Максимально возможная ширина ⁼ 3 ←
      605[164364438]                   Выравнивание ≡ По центру ∙ 607[4] ←
      590[164366038]                 Поле (колонка), являющееся параметром объекта • Код ≡ <<Документ>> ∙ 367[5] ←
      411[164378509]                   Уточняющий параметр ≡ Код ∙ 331[6] ←
      326[164365015]                   Минимально возможная ширина ⁼ 15 ←
      605[164364439]                   Выравнивание ≡ По левой границе ∙ 607[1] ←
      590[164366039]                 Поле (колонка), являющееся параметром объекта • Дата ≡ Дата ∙ 331[8] ←
   131097[164365047]                   Формат ≡ Дата без времени ∙ 131096[131073] ←
      326[164365016]                   Минимально возможная ширина ⁼ 20 ←
      605[164364440]                   Выравнивание ≡ По левой границе ∙ 607[1] ←
      590[164366040]                 Поле (колонка), являющееся параметром объекта ≡ Дата начальная ∙ 331[14745601] ←
   131097[164365048]                   Формат ≡ Дата без времени ∙ 131096[131073] ←
      605[164364441]                   Выравнивание ≡ По левой границе ∙ 607[1] ←
      590[164366041]                 Поле (колонка), являющееся параметром объекта ≡ Дата конечная ∙ 331[14745602] ←
   131097[164365049]                   Формат ≡ Дата без времени ∙ 131096[131073] ←
      605[164364442]                   Выравнивание ≡ По левой границе ∙ 607[1] ←
      590[164366042]                 Поле (колонка), являющееся параметром объекта • Подразделение ≡ <<Документ>> ∙ 367[5] ←
      411[164378510]                   Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[164378511]                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
      326[164365017]                   Минимально возможная ширина ⁼ 35 ←
      605[164364443]                   Выравнивание ≡ По левой границе ∙ 607[1] ←
      590[164366043]                 Поле (колонка), являющееся параметром объекта • Тип ≡ Условия оплаты ∙ 331[14352404] ←
      326[164365018]                   Минимально возможная ширина ⁼ 20 ←
      411[164378514]                   Уточняющий параметр ≡ Имя ∙ 249[262146] ←
      590[164366044]                 Поле (колонка), являющееся параметром объекта ≡ Комментарий ∙ 331[11] ←
      212[164364400]               Сценарий ←
      103[164364744]                 Команда • Назад ≡ Назад ∙ 102[57089] ←
       12[164364651]                   Иконка ≡ Back ∙ 90[24] ←
      127[164430132]         Процедура • Вывести срок годности минимальный ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[164430030]           Локальные переменные ←
    65545[164431721]             Локальная переменная • Подразделение ≡ Партнер ∙ 107[5] ←
 30867463[164430113]           Выполнить действия ←
 12124190[164429897]             Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164429958]               Список полей формы ←
      598[164430649]                 Поле (колонка) для ввода данных • Подразделение ≡ Подразделение ∙ 65545[164431721] ←
      209[164430136]                   Выбор из списка ≡ ПАРТНЕРЫ {...} ∙ 371[18546706] ←
 11010088[164430807]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164430090]               Выражение ←
      404[164439055]                 Результат ⁼ Начало работы: ←
      404[164439056]                 Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   131097[164430152]                   Формат ≡ Дата + Время (DD-MM-YYYY HH:NN:SS) ∙ 131096[32505857] ←
   327700[164433390]                   Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 11010088[164430806]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164430089]               Выражение ←
      404[164439053]                 Результат ≡ Срок годности (минимальный) ∙ 249[655294512] ←
 32505862[164430657]                   Значения формальных параметров при вызове ←
 32505860[164431613]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[655296337] ←
   327700[164433393]                       Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164431614]                     Значение параметра при вызове процедуры/функции ≡ Подразделения ∙ 65545[655296338] ←
   327700[164433392]                       Выражение ≡ Подразделение ∙ 65545[164431721] ←
 11010088[164430808]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164430091]               Выражение ←
      404[164439090]                 Результат ⁼ Окончание работы: ←
      404[164439094]                 Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   131097[164430153]                   Формат ≡ Дата + Время (DD-MM-YYYY HH:NN:SS) ∙ 131096[32505857] ←
   327700[164433391]                   Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 11010088[164430809]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164430092]               Выражение ←
      404[164439095]                 Результат ≡ Срок годности (минимальный) по оборотам ∙ 249[164429871] ←
 32505862[164430697]                   Значения формальных параметров при вызове ←
 32505860[164431615]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164431718] ←
   327700[164433394]                       Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164431616]                     Значение параметра при вызове процедуры/функции ≡ Подразделения ∙ 65545[164431719] ←
   327700[164433395]                       Выражение ≡ Подразделение ∙ 65545[164431721] ←
 11010088[164430810]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164430093]               Выражение ←
      404[164439097]                 Результат ⁼ Окончание работы: ←
      404[164439118]                 Результат ≡ ФОРМАТ ∙ 387[32505869] ←
   131097[164430154]                   Формат ≡ Дата + Время (DD-MM-YYYY HH:NN:SS) ∙ 131096[32505857] ←
   327700[164433396]                   Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
      127[164365422]         Процедура ≡ Проверка параметров ценообразования для товара ∙ 127[164365421] ←
 32505862[164370126]           Значения формальных параметров при вызове ←
 32505860[164376435]             Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164372435] ←
   327700[164381562]               Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[164365428]         Процедура • Автоматическое создание реестров на переоценку товаров с остатком, но без цены - КЯ ≡ Автоматическое создание реестров на переоценку товаров с остатком, но без цены ∙ 127[164365412] ←
 32505862[164370185]           Значения формальных параметров при вызове ←
 32505860[164376503]             Значение параметра при вызове процедуры/функции ≡ ~Товар ∙ 65545[164372383] ←
   327700[164381660]               Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164376544]             Значение параметра при вызове процедуры/функции ≡ ~Тип сети ∙ 65545[164372430] ←
   327700[164381713]               Выражение ≡ Супермаркет ∙ 164364327[164364289] ←
      127[164365429]         Процедура • Автоматическое создание реестров на переоценку товаров с остатком, но без цены - Д ≡ Автоматическое создание реестров на переоценку товаров с остатком, но без цены ∙ 127[164365412] ←
 32505862[164367014]           Значения формальных параметров при вызове ←
 32505860[164369909]             Значение параметра при вызове процедуры/функции ≡ ~Товар ∙ 65545[164372383] ←
   327700[164372392]               Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164369910]             Значение параметра при вызове процедуры/функции ≡ ~Тип сети ∙ 65545[164372430] ←
   327700[164372393]               Выражение ≡ Дискаунтер ∙ 164364327[164364290] ←
      113[164298773]       Сценарий (Меню) • Плю ←
      432[164298796]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[164299220]           Если истинно выражение ≡ Разрешено создание ПЛЮ-кода ∙ 117[164299014] ←
      127[164299072]         Процедура ≡ Назначить плю-код на продукт ∙ 127[164299071] ←
 32505862[164300300]           Значения формальных параметров при вызове ←
 32505860[164302032]             Значение параметра при вызове процедуры/функции ≡ ~Продукт Ид ∙ 65545[164302176] ←
   327700[164303785]               Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[164299078]         Процедура ≡ Отчет Список PLU ∙ 127[164298972] ←
      127[164298761]       Процедура • Сертификаты ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[164298759]         Выполнить действия ←
 12124191[164298753]           Вид просмотра ≡ Пакет документов ∙ 371[164298840] ←
 32505862[164298798]             Значения формальных параметров при вызове ←
 32505860[164298863]               Значение параметра при вызове процедуры/функции ≡ ~Товар ∙ 65545[164301256] ←
   327700[164298884]                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[171114593]       Процедура • Проверить и исправить сертификат ≡ Проверить наличие документа-сертификата у продукта и создать при отсутствии ∙ 127[171114590] ←
 32505862[171115086]         Значения формальных параметров при вызове ←
 32505860[171115590]           Значение параметра при вызове процедуры/функции ≡ ~Продукт ∙ 65545[171115220] ←
   327700[171116277]             Выражение ≡ Продукт ∙ 305[1] ←
      127[170983456]       Процедура • Показать сертификаты по товару ≡ Печать сертификатов по товару ∙ 127[170983455] ←
      127[170983462]       Процедура • Печать сертификатов по товару ≡ Печать сертификатов по товару PowerShell && Acrobat ∙ 127[170983494] ←
 32505862[170983814]         Значения формальных параметров при вызове ←
 32505860[170984065]           Значение параметра при вызове процедуры/функции ≡ Печатать автоматически ∙ 65545[170983931] ←
   327700[170984187]             Выражение ⁼ 1 ←
      371[164823278]       Вид просмотра • Регулярный контроль качества ≡ Реестр регулярного контроля качества ∙ 371[164823269] ←
 32505862[164827259]         Значения формальных параметров при вызове ←
 32505860[164832205]           Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[164824270] ←
   327700[164835701]             Выражение ≡ Продукт ∙ 305[1] ←
      371[164823281]       Вид просмотра • Открыть проект СТМ ≡ Реестр ротируемых/ротирующих позиций ∙ 371[164823282] ←
      432[164823296]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[164824663]           Если истинно выражение ≡ Ценовая группа ∙ 305[40042540] ←
      411[164833284]             Уточняющий параметр ≡ Размер ∙ 359[3342349] ←
      411[164833285]               Уточняющий параметр ≡ Документ ∙ 359[5] ←
 32505862[164827309]         Значения формальных параметров при вызове ←
 32505860[164832281]           Значение параметра при вызове процедуры/функции ≡ Фильтр.  UID документа(ов) ∙ 65545[1510142] ←
   327700[164836024]             Выражение ≡ Ценовая группа ∙ 305[40042540] ←
      411[164826469]               Уточняющий параметр ≡ Размер ∙ 359[3342349] ←
      411[164833283]                 Уточняющий параметр ≡ Документ ∙ 359[5] ←
      127[164495392]       Процедура • печать (тест) ≡ Печать палетного/банетного ценника (вер 2) не исп ∙ 127[164495391] ←
      127[164495518]       Процедура • Заказы по товару (тест) ≡ Просмотр заказов продукта ∙ 127[164495517] ←
      127[164495536]       Процедура ≡ Печать ценника (Элтрон) (тест) ∙ 127[164495534] ←
      127[164495580]       Процедура ≡ Отчёт по возвратам/списаниям ∙ 127[164495578] ←
      371[164429967]       Вид просмотра ≡ Таблица БЛОКИРОВКА ТОВАРА ∙ 371[164429980] ←
 32505862[164430080]         Значения формальных параметров при вызове ←
 32505860[164430370]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Товар ∙ 65545[164431516] ←
   327700[164431165]             Выражение ≡ Продукт ∙ 305[1] ←
      371[164823155]       Вид просмотра • Спецификации по товару на дату ≡ Спецификации по товару на дату ∙ 371[164823156] ←
 32505862[164826172]         Значения формальных параметров при вызове ←
 32505860[164829963]           Значение параметра при вызове процедуры/функции ≡ ~Uid товара _вп ∙ 65545[164827488] ←
   327700[164831771]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
 30867533[164823046]         Подсказка (ToolTip) ⁼ Спецификации по товару ←
      127[164365504]       Процедура ≡ Перерасчет ценового сегмента товаров ∙ 127[164365502] ←
 32505862[164370468]         Значения формальных параметров при вызове ←
 32505860[164377184]           Значение параметра при вызове процедуры/функции ≡ ФП Товар ∙ 65545[164372514] ←
   327700[164382523]             Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[164889102]       Процедура • Выгрузка партий с лог. затратами ≡ Выгрузка партий с затратами по продуктам ∙ 127[164889101] ←
 32505862[164890676]         Значения формальных параметров при вызове ←
  1507727[164888626]           <Наследуемые значения> ←
 32505860[164892942]           Значение параметра при вызове процедуры/функции ≡ фп_Продукт ∙ 65545[164891930] ←
   327700[164894566]             Выражение ≡ Продукт ∙ 305[1] ←
      127[164823452]     Процедура ≡ Анализ движения по SKU ∙ 127[164823451] ←
      432[164823101]       Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1507508[164824082]         Если истинно выражение ≡ Текущий пользователь - Карасёв ∙ 117[164823123] ←
  1507508[164824145]         Если истинно выражение ≡ Текущий сотрудник из группы "Руководитель КРО" или специалист отдела КРО ∙ 117[164888768] ←
      127[170918085]     Процедура • Отправить все акции по товару в лоймакс ≡ Выгрузка акций в лоймакс - новая версия ∙ 127[170918146] ←
      432[170917998]       Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1507508[170917895]         Если истинно выражение ≡ Текущий пользователь - Жуков ∙ 117[165347329] ←
  1507508[170917896]         Если истинно выражение ≡ Текущий пользователь - Шубин ∙ 117[165806084] ←
 32505862[170918013]       Значения формальных параметров при вызове ←
 32505860[170918115]         Значение параметра при вызове процедуры/функции ≡ фп Товар  ∙ 65545[170919721] ←
   327700[170918273]           Выражение ≡ <<Продукт>> ∙ 367[3] ←
      127[171115039]     Процедура • Выгрузить товар в электронные ценники ≡ Выгрузить товар в электронные ценники ∙ 127[171115038] ←
      432[171114633]       Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1507508[171115842]         Если истинно выражение ≡ Текущий пользователь - Шубин ∙ 117[165806084] ←
 32505862[171117497]       Значения формальных параметров при вызове ←
 32505860[171117765]         Значение параметра при вызове процедуры/функции ≡ ~Продукт ∙ 65545[171118051] ←
   327700[171119070]           Выражение ≡ Продукт ∙ 305[1] ←
      127[171115043]     Процедура • Выгрузить товар в электронные ценники (отладка) ≡ Выгрузить товар в электронные ценники ∙ 127[171115038] ←
      432[171114635]       Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[3] ←
  1507508[171115850]         Если истинно выражение ≡ Текущий пользователь - Шубин ∙ 117[165806084] ←
 32505862[171117510]       Значения формальных параметров при вызове ←
 32505860[171120379]         Значение параметра при вызове процедуры/функции ≡ ~Продукт ∙ 65545[171118051] ←
   327700[171122289]           Выражение ≡ Продукт ∙ 305[1] ←
 32505860[171120380]         Значение параметра при вызове процедуры/функции ≡ ~Отладка ∙ 65545[171118055] ←
   327700[171122290]           Выражение ⁼ 1 ←
