ETK\Admin

      371[164364432]   Вид просмотра • Строки документа управления ценообразованием (для наследования) ≡ СТРОКИ (ТОРГОВАЯ СЕТЬ) ∙ 371[40044060] ←
      262[164364399]     Наследуемые атрибуты ≡ Локальные таблицы ∙ 1[30867483] ←
      262[164364406]     Наследуемые атрибуты ≡ Подстановки виртуальных блоков ∙ 1[1507531] ←
      262[164364407]     Наследуемые атрибуты ≡ Блоки действий ∙ 1[1507413] ←
      262[164364413]     Наследуемые атрибуты ≡ Отбор данных ∙ 1[1507614] ←
      262[164364416]     Наследуемые атрибуты ≡ Обработка команд ∙ 1[1507618] ←
  1507710[164364305]     Цвет фона ≡ Цвет фона ∙ 65545[164367481] ←
  1507708[164364311]     Цвет шрифта ≡ Цвет шрифта ∙ 65545[164367470] ←
  1507709[164364303]     Шрифт ≡ Шрифт ∙ 117[164365010] ←
 32505862[164366356]     Значения формальных параметров при вызове ←
 32505860[164368554]       Значение параметра при вызове процедуры/функции ≡ Фильтр.  UID документа(ов) ∙ 65545[1510142] ←
   327700[164366805]         Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164368555]       Значение параметра при вызове процедуры/функции ≡ Список типов создаваемых объектов ∙ 65545[1510123] ←
   327700[164366806]         Выражение ≡ Строка документа управления ценообразованием ∙ 360[164364311] ←
 32505861[164364450]     Формальные параметры ←
      246[164364365]       <Наследуемые поля, колонки> ←
    65545[164368094]       Локальная переменная • Искать цены конкурентов в партионных строках? ≡ Целое ∙ 107[2] ←
      355[164365091]         Начальное значение ⁼ 0 ←
    65545[164370630]       Локальная переменная • Вид просмотра нескольких ДУЦ ≡ Целое ∙ 107[2] ←
      355[164365583]         Начальное значение ⁼ 0 ←
 32505863[164364531]     Локальные переменные ←
 30867495[164364503]       Группа локальных переменных • Цвета ←
    65545[164367470]         Локальная переменная • Цвет шрифта ≡ Объект ∙ 107[19] ←
      117[164365010]         Выражение • Шрифт ≡ Объект ∙ 107[19] ←
  1638461[164365086]           Условный оператор (IF) ←
  1638463[164366286]             Условие ←
      404[164402942]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164370836]                 Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[164371233]                   Уточняющий параметр ≡ Ценовая ниша ∙ 305[28835913] ←
  1638473[164367324]               Равно ←
      404[164402938]               Результат ≡ СТМ ∙ 117[164365009] ←
      105[164365088]             То ←
      404[164402941]               Результат ∙ 262167[48431105] ←
    65545[164367481]         Локальная переменная • Цвет фона ≡ Объект ∙ 107[19] ←
    65545[164368565]         Локальная переменная • Цвет фона кода ≡ Объект ∙ 107[19] ←
    65545[164826459]         Локальная переменная • Цвет фона ШК ≡ Объект ∙ 107[19] ←
    65545[164234047]         Локальная переменная • Цвет фона наименования ≡ Объект ∙ 107[19] ←
    65545[164827281]         Локальная переменная • Цвет фона мониторинга ≡ Объект ∙ 107[19] ←
    65545[164372293]         Локальная переменная • Причина подсветки ≡ Наименование объекта (80) ∙ 107[262147] ←
    65545[164233969]         Локальная переменная • Цвет шрифта кода ≡ Объект ∙ 107[19] ←
 30867495[164364504]       Группа локальных переменных • Поля вида просмотра ←
    65545[164367485]         Локальная переменная • Итоговая розничная цена ≡ Сумма ∙ 107[12] ←
    65545[164367486]         Локальная переменная • Наценка итоговая ≡ Число ∙ 107[4] ←
    65545[164368433]         Локальная переменная • Наценка по приказу ≡ Число ∙ 107[4] ←
    65545[164367489]         Локальная переменная • Наименование ≡ Наименование объекта (80) ∙ 107[262147] ←
    65545[164367558]         Локальная переменная • Категория ≡ Объект ∙ 107[19] ←
      355[164364994]           Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164368135]         Локальная переменная • Закупочная цена ≡ Число ∙ 107[4] ←
    65545[164368434]         Локальная переменная • Поставщик ≡ Партнер ∙ 107[5] ←
    65545[164368137]         Локальная переменная • Текущая розничная цена ≡ Число ∙ 107[4] ←
      355[164365111]           Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164371936]         Локальная переменная • Расчетная цена ≡ Число ∙ 107[4] ←
      355[164365911]           Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164370631]         Локальная переменная • Средние продажи ≡ Число ∙ 107[4] ←
      355[164365584]           Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164368282]         Локальная переменная • Счетчик строк ≡ Целое ∙ 107[2] ←
      355[164365132]           Начальное значение ⁼ 0 ←
    65545[164370632]         Локальная переменная • Маржа ≡ Число ∙ 107[4] ←
      355[164365585]           Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164370642]         Локальная переменная • Остаток по сети ≡ Число ∙ 107[4] ←
      355[164365589]           Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164367852]         Локальная переменная • Реализованная наценка ≡ Число ∙ 107[4] ←
      355[164365040]           Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164368271]         Локальная переменная • Есть в прайс-листе? ≡ Целое ∙ 107[2] ←
    65545[164234116]         Локальная переменная • Ставка НДС ≡ Объект ∙ 107[19] ←
 30867495[164364505]       Группа локальных переменных • Подразделения ←
    65545[164368133]         Локальная переменная • Первый ТЗ ≡ Партнер ∙ 107[5] ←
    65545[164368278]         Локальная переменная • ЦО ≡ Партнер ∙ 107[5] ←
    65545[164368280]         Локальная переменная • ЦО данного формата ≡ Партнер ∙ 107[5] ←
    65545[164368136]         Локальная переменная • Список подразделений с данным форматом ≡ Список партнеров ∙ 107[1507332] ←
      355[164365131]           Начальное значение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 32505863[164364606]             Локальные переменные ←
    65545[164368281]               Локальная переменная • Список ЦО ≡ Список партнеров ∙ 107[1507332] ←
 30867463[164364749]             Выполнить действия ←
 11010080[164371871]               = ≡ Список ЦО ∙ 65545[164368281] ←
      404[164387035]                 Результат ≡ Список ЦО с данной моделью ценообразования ∙ 249[164364312] ←
 32505862[164366930]                   Значения формальных параметров при вызове ←
 32505860[164369745]                     Значение параметра при вызове процедуры/функции ≡ Модель ценообразования ∙ 65545[164367472] ←
   327700[164372114]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164371785]                         Уточняющий параметр ≡ Список подразделений ∙ 331[43122689] ←
 32505860[164377296]                     Значение параметра при вызове процедуры/функции ≡ Группа товаров ∙ 65545[164371903] ←
   327700[164382748]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164379599]                         Уточняющий параметр ≡ Группа товаров ∙ 331[14286851] ←
 39780366[164364831]               RETURN ≡ Список ЦО ∙ 65545[164368281] ←
    65545[164368279]         Локальная переменная • Подразделение для розничных цен ≡ Партнер ∙ 107[5] ←
 30867495[164364506]       Группа локальных переменных • Дополнительные строки и параметры ←
    65545[164369878]         Локальная переменная • ПРОМО ≡ Список документов ∙ 107[1507335] ←
    65545[164370264]         Локальная переменная • Строка промо-реестра ≡ Строка (объект БД) ∙ 107[10] ←
    65545[164371104]         Локальная переменная • Строка действующего промо-реестра ≡ Строка (объект БД) ∙ 107[10] ←
    65545[164370641]         Локальная переменная • Строка рейтинга ≡ Строка (объект БД) ∙ 107[10] ←
    65545[164371672]         Локальная переменная • Строка мониторинга ≡ Строка (объект БД) ∙ 107[10] ←
    65545[164371673]         Локальная переменная • Документ мониторинга ≡ Документ ∙ 107[8] ←
 30867495[164364507]       Группа локальных переменных • Проверка корректности цен ←
    65545[164371544]         Локальная переменная • Цена некорректна ≡ bool ∙ 107[1507344] ←
    65545[164371545]         Локальная переменная • Количество некорректных цен ≡ Число ∙ 107[4] ←
      355[164365834]           Начальное значение ⁼ 0 ←
    65545[164371547]         Локальная переменная • Процент некорректных цен ≡ Число ∙ 107[4] ←
      355[164365835]           Начальное значение ⁼ 0 ←
      249[164364425]         Функция • Проверка цены на корректность ввода ≡ { ... скрипт ... } ∙ 249[39780357] ←
      262[164364400]           Наследуемые атрибуты ≡ Значения формальных параметров при вызове ∙ 1[32505862] ←
 32505861[164364610]           Формальные параметры ←
    65545[164371546]             Локальная переменная • Входная розничная цена ≡ Число ∙ 107[4] ←
    65545[164371543]             Локальная переменная • Товар ≡ Продукт ∙ 107[7] ←
 32505863[164364883]           Локальные переменные ←
    65545[164371549]             Локальная переменная • Копейки ≡ Целое ∙ 107[2] ←
    65545[164371550]             Локальная переменная • Десятки копеек ≡ Целое ∙ 107[2] ←
    65545[164371551]             Локальная переменная • Рубли ≡ Целое ∙ 107[2] ←
    65545[164371552]             Локальная переменная • Десятки рублей ≡ Целое ∙ 107[2] ←
 30867463[164365226]           Выполнить действия ←
 11010080[164377603]             = ≡ Копейки ∙ 65545[164371549] ←
      404[164403936]               Результат ≡ Значение разряда цены ∙ 249[164364345] ←
 32505862[164369106]                 Значения формальных параметров при вызове ←
 32505860[164374289]                   Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[164367529] ←
   327700[164378051]                     Выражение ≡ Входная розничная цена ∙ 65545[164371546] ←
 32505860[164374290]                   Значение параметра при вызове процедуры/функции ≡ Искомый разряд ∙ 65545[164367530] ←
   327700[164378052]                     Выражение ⁼ 1 ←
 30867470[164365924]             IF ←
  1638463[164368486]               Условие ←
      116[164366335]                 Выражение ←
      404[164403882]                   Результат ≡ Копейки ∙ 65545[164371549] ←
  1638476[164364540]                   Меньше ←
      404[164403911]                   Результат ⁼ 6 ←
      413[164367014]                 И ←
      116[164366336]                 Выражение ←
      404[164403917]                   Результат ≡ Копейки ∙ 65545[164371549] ←
  1638478[164364646]                   Больше ←
      404[164403919]                   Результат ⁼ 0 ←
 30867472[164365914]               THEN ←
 39780366[164365391]                 RETURN ≡ NULL ∙ 117[30670850] ←
 30867473[164365469]               ELSE ←
 30867470[164367548]                 IF ←
  1638463[164368491]                   Условие ←
      404[164403924]                     Результат ≡ Копейки ∙ 65545[164371549] ←
  1638473[164367529]                     Равно ←
      404[164403925]                     Результат ⁼ 0 ←
 30867472[164367532]                   THEN ←
 11010079[164364599]                     CASE ←
  1572877[164364636]                       Условие ←
      404[164403926]                         Результат ≡ Товар ∙ 65545[164371543] ←
      411[164376683]                           Уточняющий параметр ≡ ЕИ ∙ 305[14745607] ←
 11010081[164365504]                       OF ≡ Штука ∙ 131108[28049409] ←
 39780366[164365395]                         RETURN ≡ NULL ∙ 117[30670850] ←
 11010080[164377604]             = ≡ Десятки копеек ∙ 65545[164371550] ←
      404[164403937]               Результат ≡ Значение разряда цены ∙ 249[164364345] ←
 32505862[164369107]                 Значения формальных параметров при вызове ←
 32505860[164374291]                   Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[164367529] ←
   327700[164378053]                     Выражение ≡ Входная розничная цена ∙ 65545[164371546] ←
 32505860[164374292]                   Значение параметра при вызове процедуры/функции ≡ Искомый разряд ∙ 65545[164367530] ←
   327700[164378065]                     Выражение ⁼ 2 ←
 30867470[164367545]             IF ←
  1638463[164368488]               Условие ←
      404[164403915]                 Результат ≡ Десятки копеек ∙ 65545[164371550] ←
  1638476[164364541]                 Меньше ←
      404[164403916]                 Результат ⁼ 6 ←
 30867472[164367529]               THEN ←
 39780366[164365393]                 RETURN ≡ NULL ∙ 117[30670850] ←
 30867470[164367542]             IF ←
  1638463[164368487]               Условие ←
      404[164403912]                 Результат ≡ Десятки копеек ∙ 65545[164371550] ←
  1638473[164367186]                 Равно ←
      404[164403913]                 Результат ⁼ 9 ←
 30867472[164367526]               THEN ←
 30867470[164367546]                 IF ←
  1638463[164368489]                   Условие ←
      404[164403920]                     Результат ≡ Копейки ∙ 65545[164371549] ←
  1638473[164367527]                     Равно ←
      404[164403921]                     Результат ⁼ 9 ←
 30867472[164367530]                   THEN ←
 39780366[164365392]                     RETURN ≡ NULL ∙ 117[30670850] ←
 11010079[164364596]                 CASE ←
  1572877[164364633]                   Условие ←
      404[164403914]                     Результат ≡ Товар ∙ 65545[164371543] ←
      411[164376682]                       Уточняющий параметр ≡ ЕИ ∙ 305[14745607] ←
 11010081[164365502]                   OF ≡ Штука ∙ 131108[28049409] ←
 30867470[164367547]                     IF ←
  1638463[164368490]                       Условие ←
      404[164403922]                         Результат ≡ Копейки ∙ 65545[164371549] ←
  1638473[164367528]                         Равно ←
      404[164403923]                         Результат ⁼ 0 ←
 30867472[164367531]                       THEN ←
 39780366[164365394]                         RETURN ≡ NULL ∙ 117[30670850] ←
 11010081[164365503]                   OF ≡ Килограмм ∙ 131108[28049411] ←
 11010080[164377605]             = ≡ Рубли ∙ 65545[164371551] ←
      404[164403938]               Результат ≡ Значение разряда цены ∙ 249[164364345] ←
 32505862[164369448]                 Значения формальных параметров при вызове ←
 32505860[164374293]                   Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[164367529] ←
   327700[164378141]                     Выражение ≡ Входная розничная цена ∙ 65545[164371546] ←
 32505860[164374294]                   Значение параметра при вызове процедуры/функции ≡ Искомый разряд ∙ 65545[164367530] ←
   327700[164378142]                     Выражение ⁼ 3 ←
 11010080[164377606]             = ≡ Десятки рублей ∙ 65545[164371552] ←
      404[164403939]               Результат ≡ Значение разряда цены ∙ 249[164364345] ←
 32505862[164369449]                 Значения формальных параметров при вызове ←
 32505860[164374295]                   Значение параметра при вызове процедуры/функции ≡ Число ∙ 65545[164367529] ←
   327700[164378143]                     Выражение ≡ Входная розничная цена ∙ 65545[164371546] ←
 32505860[164374296]                   Значение параметра при вызове процедуры/функции ≡ Искомый разряд ∙ 65545[164367530] ←
   327700[164378144]                     Выражение ⁼ 4 ←
 30867470[164367549]             IF ←
  1638463[164368492]               Условие ←
      404[164403878]                 Результат ≡ Входная розничная цена ∙ 65545[164371546] ←
  1638476[164364542]                 Меньше ←
      404[164403879]                 Результат ⁼ 50 ←
 30867472[164367533]               THEN ←
 30867470[164367555]                 IF ←
  1638463[164368498]                   Условие ←
      404[164403942]                     Результат ≡ Входная розничная цена ∙ 65545[164371546] ←
  1638478[164364648]                     Больше ←
      404[164403944]                     Результат ⁼ 20 ←
 30867472[164367539]                   THEN ←
 11010079[164364594]                     CASE ←
  1572877[164364631]                       Условие ←
      404[164403933]                         Результат ≡ Рубли ∙ 65545[164371551] ←
 11010081[164365494]                       OF ⁼ 0 ←
 39780366[164365398]                         RETURN ≡ NULL ∙ 117[30670850] ←
 11010081[164365495]                       OF ⁼ 1 ←
 39780366[164365399]                         RETURN ≡ NULL ∙ 117[30670850] ←
 11010081[164365505]                       OF ⁼ 5 ←
 39780366[164365400]                         RETURN ≡ NULL ∙ 117[30670850] ←
 11010081[164365506]                       OF ⁼ 6 ←
 39780366[164365401]                         RETURN ≡ NULL ∙ 117[30670850] ←
 30867473[164365471]               ELSE ←
 30867470[164367552]                 IF ←
  1638463[164368495]                   Условие ←
      404[164403931]                     Результат ≡ Рубли ∙ 65545[164371551] ←
  1638476[164364545]                     Меньше ←
      404[164403932]                     Результат ⁼ 6 ←
 30867472[164367535]                   THEN ←
 39780366[164365397]                     RETURN ≡ NULL ∙ 117[30670850] ←
 30867470[164367551]                 IF ←
  1638463[164368494]                   Условие ←
      116[164366337]                     Выражение ←
      404[164403929]                       Результат ≡ Входная розничная цена ∙ 65545[164371546] ←
  1638478[164364647]                       Больше ←
      404[164403930]                       Результат ⁼ 200 ←
      413[164367015]                     И ←
      116[164366338]                     Выражение ←
      404[164403927]                       Результат ≡ Входная розничная цена ∙ 65545[164371546] ←
  1638476[164364543]                       Меньше ←
      404[164403928]                       Результат ⁼ 500 ←
 30867472[164367534]                   THEN ←
 11010079[164364595]                     CASE ←
  1572877[164364632]                       Условие ←
      404[164403934]                         Результат ≡ Десятки рублей ∙ 65545[164371552] ←
 11010081[164365507]                       OF ⁼ 0 ←
 39780366[164365396]                         RETURN ≡ NULL ∙ 117[30670850] ←
 11010081[164365508]                       OF ⁼ 1 ←
 39780366[164365402]                         RETURN ≡ NULL ∙ 117[30670850] ←
 11010081[164365520]                       OF ⁼ 5 ←
 39780366[164365403]                         RETURN ≡ NULL ∙ 117[30670850] ←
 11010081[164365521]                       OF ⁼ 6 ←
 39780366[164365404]                         RETURN ≡ NULL ∙ 117[30670850] ←
 30867473[164365472]                   ELSE ←
 30867470[164367557]                     IF ←
  1638463[164368500]                       Условие ←
      404[164403947]                         Результат ≡ Входная розничная цена ∙ 65545[164371546] ←
  1638478[164364649]                         Больше ←
      404[164403948]                         Результат ⁼ 500 ←
 30867472[164367541]                       THEN ←
 30867470[164367550]                         IF ←
  1638463[164368493]                           Условие ←
      404[164403935]                             Результат ≡ Десятки рублей ∙ 65545[164371552] ←
  1638476[164364544]                             Меньше ←
      404[164403943]                             Результат ⁼ 6 ←
 30867472[164367536]                           THEN ←
 39780366[164365405]                             RETURN ≡ NULL ∙ 117[30670850] ←
 39780366[164365406]             RETURN ⁼ 1 ←
 30867495[164364508]       Группа локальных переменных • Сортировки ←
    65545[164367490]         Локальная переменная • Сортировка (-2 - требует расчета, -1 - помечено к созданию партионных строк, 0 - норм, 1 - относится к другому ДУЦ) ≡ Целое ∙ 107[2] ←
    65545[164368459]         Локальная переменная • Сортировка (основная) ≡ Наименование объекта (80) ∙ 107[262147] ←
    65545[164368134]         Локальная переменная • Торговая марка (для сортировки) ≡ Наименование объекта (80) ∙ 107[262147] ←
    65545[164367580]       Локальная переменная • Изменилась закупочная цена (или новый товар) ≡ Целое ∙ 107[2] ←
    65545[164367743]       Локальная переменная • Приказ на выделение товаров с постоянной ценой ≡ Документ ∙ 107[8] ←
    65545[164367857]       Локальная переменная • Фильтр.Торговая марка ≡ Список каталогов ∙ 107[1507336] ←
    65545[164368151]       Локальная переменная • Фильтр.ШК ≡ Короткая строка (15 символов) ∙ 107[48431107] ←
    65545[164366763]       Локальная переменная • Показывать строки, которых нет в спецификации, но есть на остатке (Д) ≡ Признак (Да/Нет) ∙ 107[131203074] ←
      355[164365119]         Начальное значение ≡ Да ∙ 131203075[131203074] ←
    65545[164368435]       Локальная переменная • Прайс ≡ Документ ∙ 107[8] ←
    65545[164368142]       Локальная переменная • Цена из мониторинга ≡ Сумма ∙ 107[12] ←
    65545[164368141]       Локальная переменная • Диапазонов ≡ Целое ∙ 107[2] ←
    65545[164368152]       Локальная переменная • Флаг ШК ≡ Целое ∙ 107[2] ←
 30867495[164364516]       Группа локальных переменных • ДУЦ 2.0 ←
    65545[171117065]         Локальная переменная • Продукт ≡ Продукт ∙ 107[7] ←
 30867495[164364515]         Группа локальных переменных • Кластер 1 ←
    65545[164371894]           Локальная переменная • Текущая цена 1 ≡ Число ∙ 107[4] ←
    65545[164371895]           Локальная переменная • Расчетная цена 1 ≡ Число ∙ 107[4] ←
    65545[164371896]           Локальная переменная • Итоговая цена 1 ≡ Число ∙ 107[4] ←
    65545[164371897]           Локальная переменная • Наценка 1 ≡ Число ∙ 107[4] ←
    65545[164827714]           Локальная переменная • РЦ 1 ≡ Строка (30) ∙ 107[28835850] ←
 30867495[164364513]         Группа локальных переменных • Кластер 2 ←
    65545[164371325]           Локальная переменная • Текущая цена 2 ≡ Число ∙ 107[4] ←
    65545[164371326]           Локальная переменная • Расчетная цена 2 ≡ Число ∙ 107[4] ←
    65545[164371327]           Локальная переменная • Итоговая цена 2 ≡ Число ∙ 107[4] ←
    65545[164371328]           Локальная переменная • Наценка 2 ≡ Число ∙ 107[4] ←
    65545[164827715]           Локальная переменная • РЦ 2 ≡ Строка (30) ∙ 107[28835850] ←
 30867495[164364514]         Группа локальных переменных • Кластер 3 ←
    65545[164371329]           Локальная переменная • Текущая цена 3 ≡ Число ∙ 107[4] ←
    65545[164371330]           Локальная переменная • Расчетная цена 3 ≡ Число ∙ 107[4] ←
    65545[164371887]           Локальная переменная • Итоговая цена 3 ≡ Число ∙ 107[4] ←
    65545[164371893]           Локальная переменная • Наценка 3 ≡ Число ∙ 107[4] ←
    65545[164827716]           Локальная переменная • РЦ 3 ≡ Строка (30) ∙ 107[28835850] ←
 30867495[164364512]         Группа локальных переменных • Кластер 4 ←
    65545[164369361]           Локальная переменная • Текущая цена 4 ≡ Число ∙ 107[4] ←
    65545[164371323]           Локальная переменная • Расчетная цена 4 ≡ Число ∙ 107[4] ←
    65545[164371322]           Локальная переменная • Итоговая цена 4 ≡ Число ∙ 107[4] ←
    65545[164371324]           Локальная переменная • Наценка 4 ≡ Число ∙ 107[4] ←
    65545[164827717]           Локальная переменная • РЦ 4 ≡ Строка (30) ∙ 107[28835850] ←
    65545[164369358]         Локальная переменная • Фильтр.Новинка или измененная позиция ≡ Целое ∙ 107[2] ←
      355[164365800]           Начальное значение ⁼ 0 ←
    65545[164371937]         Локальная переменная • Номер кластера ≡ Целое ∙ 107[2] ←
    65545[164827719]         Локальная переменная • РЦ ≡ Строка (30) ∙ 107[28835850] ←
 30867495[164364520]         Группа локальных переменных • Линейки в 2.0 ←
    65545[164372028]           Локальная переменная • Основной товар ≡ Продукт ∙ 107[7] ←
    65545[164372314]           Локальная переменная • Основной товар СТМ ≡ Продукт ∙ 107[7] ←
    65545[164372029]           Локальная переменная • Закупочная цена линейки ≡ Число ∙ 107[4] ←
    65545[164372030]           Локальная переменная • Торговая марка линейки ≡ Каталог ∙ 107[9] ←
    65545[164372031]           Локальная переменная • Наименование торговой марки линейки (для сортировки) ≡ Наименование объекта (80) ∙ 107[262147] ←
    65545[164372295]           Локальная переменная • Основной товар для СТМ ≡ Продукт ∙ 107[7] ←
    65545[164372257]         Локальная переменная • ВРД ≡ Число ∙ 107[4] ←
    65545[164372294]         Локальная переменная • ВРД руб ≡ Число ∙ 107[4] ←
    65545[164371678]         Локальная переменная • Строки условий ВРД ≡ Список строк ∙ 107[1507337] ←
    65545[164372258]         Локальная переменная • Поставщик (записанный при добавлении строки) ≡ Партнер ∙ 107[5] ←
    65545[164827280]         Локальная переменная • Дата последнего акцепта ≡ Дата ∙ 107[3] ←
    65545[164824148]         Локальная переменная • Категория ≡ Объект ∙ 107[19] ←
    65545[164372994]         Локальная переменная • Закупочная Д ≡ Число ∙ 107[4] ←
    65545[164372995]         Локальная переменная • Временная закупочная ≡ Число ∙ 107[4] ←
      247[164364373]     Список полей просмотра ←
      598[164823928]       Поле (колонка) для ввода данных ≡ Требует обработки ∙ 359[2818057] ←
      590[164364712]       Поле (колонка), являющееся параметром объекта • Код товара ≡ Продукт ∙ 359[8] ←
      411[164370198]         Уточняющий параметр ≡ Код ∙ 305[5] ←
  1507710[164364322]         Цвет фона ≡ Цвет фона кода ∙ 65545[164368565] ←
      590[164364697]       Поле (колонка), являющееся параметром объекта • Товар ≡ Наименование ∙ 65545[164367489] ←
      590[164364801]       Поле (колонка), являющееся параметром объекта • ШК ≡ Список штрих-кодов по товару ∙ 249[164298781] ←
 32505862[164366882]         Значения формальных параметров при вызове ←
 32505860[164369654]           Значение параметра при вызове процедуры/функции ≡ ~Продукт ∙ 65545[164299631] ←
   327700[164371977]             Выражение ≡ Продукт ∙ 359[8] ←
      590[164364800]       Поле (колонка), являющееся параметром объекта • Товар ≡ Продукт ∙ 359[8] ←
  2621481[164364430]         Доступно (видимо), если: ≡ NULL ∙ 117[30670850] ←
      411[164370284]         Уточняющий параметр ≡ Наименование ∙ 305[6] ←
  1507708[164364314]         Цвет шрифта ≡ Цвет шрифта (выбор строки) ∙ 249[40042595] ←
      590[164365675]       Поле (колонка), являющееся параметром объекта • Группа товара ≡ Продукт ∙ 359[8] ←
  2621481[164364469]         Доступно (видимо), если: ≡ Вид просмотра нескольких ДУЦ ∙ 65545[164370630] ←
      411[164376051]         Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[164376055]           Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[164376056]             Уточняющий параметр ≡ Наименование ∙ 296[6] ←
  1507710[164364404]         Цвет фона ≡ Цвет фона кода ∙ 65545[164368565] ←
      590[164364876]       Поле (колонка), являющееся параметром объекта ≡ Средние продажи ∙ 65545[164370631] ←
   131097[164364849]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
  2621481[164364515]         Доступно (видимо), если: ≡ Вид просмотра нескольких ДУЦ ∙ 65545[164370630] ←
      590[164365666]       Поле (колонка), являющееся параметром объекта ≡ Остаток по сети ∙ 65545[164370642] ←
   131097[164364880]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
  2621481[164364517]         Доступно (видимо), если: ≡ Вид просмотра нескольких ДУЦ ∙ 65545[164370630] ←
      590[164364713]       Поле (колонка), являющееся параметром объекта • Закупочная цена ≡ Цена закупочная ∙ 359[15007745] ←
      326[164364498]         Минимально возможная ширина ⁼ 10 ←
   131097[164364622]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
      590[164365115]       Поле (колонка), являющееся параметром объекта • Текущая розничная цена ≡ Текущая розничная цена ∙ 65545[164368137] ←
      326[164364499]         Минимально возможная ширина ⁼ 10 ←
   131097[164364623]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
      605[164364329]         Выравнивание ≡ По правой границе ∙ 607[2] ←
      590[164364715]       Поле (колонка), являющееся параметром объекта • Расчетная розничная цена ≡ Цена оптовая ∙ 359[15007747] ←
      326[164364500]         Минимально возможная ширина ⁼ 10 ←
   131097[164364624]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
      598[164365159]       Поле (колонка) для ввода данных • Итоговая розничная цена ≡ Итоговая розничная цена ∙ 65545[164367485] ←
      326[164364501]         Минимально возможная ширина ⁼ 10 ←
   131097[164364625]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
  1507709[164364293]         Шрифт ≡ Arial Bold ∙ 262167[40370177] ←
  1507710[164364306]         Цвет фона ≡ Темносерый ∙ 117[164364777] ←
  2621482[164364295]         Только для просмотра (недопустимо для изменения), если: ≡ Нельзя редактировать цену? ∙ 117[164364773] ←
      590[164365151]       Поле (колонка), являющееся параметром объекта • Цена Стандарт ≡ { ... скрипт ... } ∙ 249[39780357] ←
      326[164364509]         Минимально возможная ширина ⁼ 10 ←
 32505863[164364604]         Локальные переменные ←
    65545[164368272]           Локальная переменная • ДУЦ ≡ Документ ∙ 107[8] ←
  2621481[164364443]         Доступно (видимо), если: ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164364478]           Выполнить действия ←
 30867470[164366103]             IF ←
  1638463[164366637]               Условие ←
      116[164368673]                 Выражение ←
      404[164387022]                   Результат ≡ <<Документ>> ∙ 367[5] ←
      411[164371774]                     Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164365888]                   Не равно ←
      404[164387023]                   Результат ≡ Формат "Ценообразование Стандарт" ∙ 117[164364814] ←
      413[164366492]                 И ←
      404[164399531]                 Результат ≡ Обычный вид просмотра ∙ 117[164364982] ←
 30867472[164366093]               THEN • 1 ←
 39780366[164364829]                 RETURN ⁼ 1 ←
   131097[164364651]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
 30867463[164364748]         Выполнить действия ←
 30867470[164366104]           IF ←
  1638463[164366638]             Условие ←
      404[164387024]               Результат ≡ <<Документ>> ∙ 367[5] ←
      411[164371775]                 Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164364722]               Не равно ←
      404[164387025]               Результат ≡ Формат "Ценообразование Стандарт" ∙ 117[164364814] ←
 30867472[164366094]             THEN ←
  1507360[164365261]               Отбор данных (по запросу) ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
 32505862[164366551]                 Значения формальных параметров при вызове ←
 32505860[164368960]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547258] ←
   327700[164371018]                     Выражение ≡ Документ управления ценообразованием ∙ 332[164364309] ←
 32505860[164369739]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Подразделения ∙ 65545[18547259] ←
   327700[164372101]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164371772]                       Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
 12124215[164364751]                 Where      (Ограничения на отбор данных) ←
  1507381[164364663]                   <Наследуемые ограничения> ←
      413[164365458]                   И ←
  1507376[164365332]                   Выражение ←
  1507455[164365315]                     Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164365897]                       Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638473[164365886]                     Равно ←
  1507452[164365085]                     Константа ≡ Формат "Ценообразование Стандарт" ∙ 117[164364814] ←
      413[164365459]                   И ←
  1507376[164365333]                   Выражение ←
  1507455[164365316]                     Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164365898]                       Уточняющий параметр ≡ Группа товаров ∙ 331[14286851] ←
  1638473[164365887]                     Равно ←
  1507452[164365087]                     Константа ≡ <<Документ>> ∙ 367[5] ←
      411[164371773]                       Уточняющий параметр ≡ Группа товаров ∙ 331[14286851] ←
 30867466[164365438]                 Выполнить после получения записи ←
 11010080[164371866]                   = ≡ ДУЦ ∙ 65545[164368272] ←
      404[164387026]                     Результат ≡ з.Документ ∙ 1507335[18547059] ←
  1507360[164365262]                   Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[164366926]                     Значения формальных параметров при вызове ←
 32505860[164369740]                       Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164372102]                         Выражение ≡ ДУЦ ∙ 65545[164368272] ←
 32505860[164374119]                       Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[1510100] ←
   327700[164378446]                         Выражение ≡ Строка документа управления ценообразованием ∙ 360[164364311] ←
 12124215[164364752]                     Where      (Ограничения на отбор данных) ←
  1507381[164364664]                       <Наследуемые ограничения> ←
      413[164365461]                       И ←
  1507376[164365334]                       Выражение ←
  1507455[164365317]                         Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164365899]                           Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[164365888]                         Равно ←
  1638402[164365050]                         NULL ←
      413[164365462]                       И ←
  1507376[164365335]                       Выражение ←
  1507455[164365318]                         Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164365900]                           Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[164365889]                         Равно ←
  1507452[164365089]                         Константа ≡ <<Строка>> ∙ 367[6] ←
      411[164371776]                           Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 30867466[164365439]                     Выполнить после получения записи ←
 39780366[164364830]                       RETURN ←
      404[164387027]                         Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[164371777]                           Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 39780366[164364835]           RETURN ←
      590[164364717]       Поле (колонка), являющееся параметром объекта • Наценка по приказу ≡ Наценка по приказу ∙ 65545[164368433] ←
      326[164364502]         Минимально возможная ширина ⁼ 10 ←
   131097[164364620]         Формат ≡ Целое N2.0 ∙ 131096[33161222] ←
  2621481[164364474]         Доступно (видимо), если: ≡ Обычный вид просмотра ∙ 117[164364982] ←
      590[164364779]       Поле (колонка), являющееся параметром объекта • Наценка итоговая ≡ Наценка итоговая ∙ 65545[164367486] ←
      326[164364503]         Минимально возможная ширина ⁼ 10 ←
   131097[164364621]         Формат ≡ Число N19.1 ∙ 131096[144965634] ←
  1507709[164364295]         Шрифт ≡ Жирный шрифт итоговой наценки ∙ 117[164364783] ←
  1507708[164364294]         Цвет шрифта ≡ Красный цвет шрифта итоговой наценки ∙ 117[164364784] ←
      590[164365665]       Поле (колонка), являющееся параметром объекта ≡ Маржа ∙ 65545[164370632] ←
   131097[164364848]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
  2621481[164364516]         Доступно (видимо), если: ≡ Вид просмотра нескольких ДУЦ ∙ 65545[164370630] ←
      590[164364789]       Поле (колонка), являющееся параметром объекта • Создать расчетные строки ≡ Маркировать ∙ 359[28835848] ←
  2621481[164364435]         Доступно (видимо), если: ≡ Текущий пользователь - Шишков ∙ 117[164364692] ←
  2621481[164364450]         Доступно (видимо), если: ≡ Разрешено согласование ДУЦ ∙ 117[164364819] ←
      326[164364504]         Минимально возможная ширина ⁼ 10 ←
      411[164370239]         Уточняющий параметр ≡ Имя ∙ 249[262146] ←
      590[164365102]       Поле (колонка), являющееся параметром объекта • Командор ≡ { ... скрипт ... } ∙ 249[39780357] ←
      326[164364493]         Минимально возможная ширина ⁼ 10 ←
   131097[164364626]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
 32505863[164364571]         Локальные переменные ←
    65545[164367891]           Локальная переменная • 6 месяцев назад ≡ Дата ∙ 107[3] ←
  1507710[164364310]         Цвет фона ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164364731]           Выполнить действия ←
 30867470[164365691]             IF ←
  1638463[164366154]               Условие ←
      404[164383485]                 Результат ≡ Проверка соответствия розничной цены ∙ 249[164364353] ←
 32505862[164366470]                   Значения формальных параметров при вызове ←
 32505860[164369455]                     Значение параметра при вызове процедуры/функции ≡ Цена расчетная ∙ 65545[164368143] ←
   327700[164370796]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164369489]                     Значение параметра при вызове процедуры/функции ≡ Цена мониторинга ∙ 65545[164368144] ←
   327700[164370821]                       Выражение ≡ Цена из мониторинга ∙ 65545[164368142] ←
 32505860[164369490]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164368145] ←
   327700[164371303]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164370358]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164369531]                     Значение параметра при вызове процедуры/функции ≡ Тип конкурента ∙ 65545[164368146] ←
   327700[164371717]                       Выражение ≡ Супермаркет ∙ 164364293[164364289] ←
 32505860[164369123]                     Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164367494] ←
   327700[164370812]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164370395]                         Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164364616]                 Не равно ←
      404[164382491]                 Результат ⁼ 1 ←
 30867472[164365681]               THEN ←
 11010092[164364449]                 Добавить в локальную таблицу ≡ Некорректные строки ∙ 30867458[164364563] ←
 39780366[164364793]                 RETURN ≡ Синий ∙ 30[917511] ←
 30867473[164364901]               ELSE ←
 39780366[164364794]                 RETURN ≡ NULL ∙ 117[30670850] ←
  1507708[164364296]         Цвет шрифта ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164364732]           Выполнить действия ←
 30867470[164365979]             IF ←
  1638463[164366465]               Условие ←
      404[164375077]                 Результат ≡ Проверка соответствия розничной цены ∙ 249[164364353] ←
 32505862[164366474]                   Значения формальных параметров при вызове ←
 32505860[164369491]                     Значение параметра при вызове процедуры/функции ≡ Цена расчетная ∙ 65545[164368143] ←
   327700[164371304]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164369492]                     Значение параметра при вызове процедуры/функции ≡ Цена мониторинга ∙ 65545[164368144] ←
   327700[164371308]                       Выражение ≡ Цена из мониторинга ∙ 65545[164368142] ←
 32505860[164369530]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164368145] ←
   327700[164371674]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164370359]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164369532]                     Значение параметра при вызове процедуры/функции ≡ Тип конкурента ∙ 65545[164368146] ←
   327700[164371748]                       Выражение ≡ Супермаркет ∙ 164364293[164364289] ←
 32505860[164369124]                     Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164367494] ←
   327700[164370813]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164370396]                         Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164364711]                 Не равно ←
      404[164383290]                 Результат ⁼ 1 ←
 30867472[164365969]               THEN ←
 39780366[164364795]                 RETURN ≡ Белый ∙ 30[917506] ←
 30867473[164364904]               ELSE ←
 39780366[164364796]                 RETURN ≡ NULL ∙ 117[30670850] ←
 30867463[164364700]         Выполнить действия ←
 11010080[164370336]           = ≡ Диапазонов ∙ 65545[164368141] ←
      404[164376254]             Результат ⁼ 0 ←
 11010080[164370540]           = ≡ Цена из мониторинга ∙ 65545[164368142] ←
  1638402[164364861]             NULL ←
 30867470[164365829]           IF ←
  1638463[164366302]             Условие ←
      404[164384851]               Результат ≡ Отпускная цена (категория 1) ∙ 359[42401820] ←
 30867472[164365819]             THEN ←
 11010080[164370538]               = ≡ Цена из мониторинга ∙ 65545[164368142] ←
      404[164383364]                 Результат ≡ Отпускная цена (категория 1) ∙ 359[42401820] ←
 30867473[164364944]             ELSE ←
 30867470[164365910]               IF ←
  1638463[164366394]                 Условие ←
  1638460[164364821]                   НЕ ←
      404[164385851]                   Результат ≡ Искать цены конкурентов в партионных строках? ∙ 65545[164368094] ←
 30867472[164365900]                 THEN ←
 39780366[164364778]                   RETURN ←
 11010080[164371191]               = ≡ 6 месяцев назад ∙ 65545[164367891] ←
      404[164384853]                 Результат ≡ Текущие дата-время ∙ 249[42467332] ←
      406[164364722]                 Вычесть ←
      116[164366146]                 Выражение ←
      404[164384854]                   Результат ⁼ 180 ←
      403[164364526]                   Умножить ←
      404[164384855]                   Результат ≡ Сутки ∙ 117[16843851] ←
  1507360[164365163]               Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
  1507673[164364361]                 Ключи оптимизации ←
  1507675[164364363]                   Использовать индекс ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507676[164364364]                     Уточняющий параметр ≡ По родителю ∙ 1507445[1507403] ←
 32505862[164366658]                 Значения формальных параметров при вызове ←
 32505860[164369162]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510266] ←
   327700[164371312]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
 32505860[164369377]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164371606]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164368831]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата начальная ∙ 65545[1510103] ←
   327700[164371311]                     Выражение ≡ 6 месяцев назад ∙ 65545[164367891] ←
 12124222[164364370]                 Order By   (Сортировка) ←
  1507532[164364359]                   Сортировать по убыванию ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164365771]                     Уточняющий параметр ≡ Дата строки ∙ 359[6] ←
 12124215[164364697]                 Where      (Ограничения на отбор данных) ←
  1507381[164364613]                   <Наследуемые ограничения> ←
      413[164365331]                   И ←
  1507376[164365247]                   Выражение ←
  1507455[164365271]                     Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164365667]                       Уточняющий параметр ≡ Отпускная цена (категория 1) ∙ 359[42401820] ←
  1638479[164364657]                     Не равно ←
  1638402[164365000]                     NULL ←
 30867466[164365242]                 Выполнить после получения записи ←
 11010080[164370648]                   = ≡ Цвет шрифта ∙ 65545[164367470] ←
      404[164384852]                     Результат ≡ Синий ∙ 30[917511] ←
 11010080[164370539]                   = ≡ Цена из мониторинга ∙ 65545[164368142] ←
      404[164383366]                     Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[164370346]                       Уточняющий параметр ≡ Отпускная цена (категория 1) ∙ 359[42401820] ←
 11010100[164364344]                   BREAK ←
 30867470[164365685]           IF ←
  1638463[164366147]             Условие ←
  1638460[164364835]               НЕ ←
      404[164383289]               Результат ≡ Цена из мониторинга ∙ 65545[164368142] ←
 30867472[164365675]             THEN ←
 39780366[164364759]               RETURN ≡ NULL ∙ 117[30670850] ←
 39780366[164364757]           RETURN ←
      404[164383370]             Результат ≡ Цена из мониторинга ∙ 65545[164368142] ←
      590[164365107]       Поле (колонка), являющееся параметром объекта • Спар ≡ { ... скрипт ... } ∙ 249[39780357] ←
      326[164364494]         Минимально возможная ширина ⁼ 10 ←
   131097[164364627]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
  1507710[164364317]         Цвет фона ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164364734]           Выполнить действия ←
 30867470[164366038]             IF ←
  1638463[164366559]               Условие ←
      404[164384786]                 Результат ≡ Проверка соответствия розничной цены ∙ 249[164364353] ←
 32505862[164366823]                   Значения формальных параметров при вызове ←
 32505860[164369545]                     Значение параметра при вызове процедуры/функции ≡ Цена расчетная ∙ 65545[164368143] ←
   327700[164371840]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164369546]                     Значение параметра при вызове процедуры/функции ≡ Цена мониторинга ∙ 65545[164368144] ←
   327700[164371841]                       Выражение ≡ Цена из мониторинга ∙ 65545[164368142] ←
 32505860[164369547]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164368145] ←
   327700[164371842]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164370407]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164369548]                     Значение параметра при вызове процедуры/функции ≡ Тип конкурента ∙ 65545[164368146] ←
   327700[164371843]                       Выражение ≡ Супермаркет ∙ 164364293[164364289] ←
 32505860[164369333]                     Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164367494] ←
   327700[164370815]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164370397]                         Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164364712]                 Не равно ←
      404[164384817]                 Результат ⁼ 1 ←
 30867472[164366028]               THEN ←
 11010092[164364688]                 Добавить в локальную таблицу ≡ Некорректные строки ∙ 30867458[164364563] ←
 39780366[164364800]                 RETURN ≡ Синий ∙ 30[917511] ←
 30867473[164364972]               ELSE ←
 39780366[164364801]                 RETURN ≡ NULL ∙ 117[30670850] ←
  1507708[164364295]         Цвет шрифта ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164364735]           Выполнить действия ←
 30867470[164366039]             IF ←
  1638463[164366560]               Условие ←
      404[164384818]                 Результат ≡ Проверка соответствия розничной цены ∙ 249[164364353] ←
 32505862[164366871]                   Значения формальных параметров при вызове ←
 32505860[164369549]                     Значение параметра при вызове процедуры/функции ≡ Цена расчетная ∙ 65545[164368143] ←
   327700[164371844]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164369552]                     Значение параметра при вызове процедуры/функции ≡ Цена мониторинга ∙ 65545[164368144] ←
   327700[164371845]                       Выражение ≡ Цена из мониторинга ∙ 65545[164368142] ←
 32505860[164369553]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164368145] ←
   327700[164371846]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164370408]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164369556]                     Значение параметра при вызове процедуры/функции ≡ Тип конкурента ∙ 65545[164368146] ←
   327700[164371847]                       Выражение ≡ Супермаркет ∙ 164364293[164364289] ←
 32505860[164369334]                     Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164367494] ←
   327700[164370816]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164370398]                         Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164364713]                 Не равно ←
      404[164384819]                 Результат ⁼ 1 ←
 30867472[164366029]               THEN ←
 39780366[164364802]                 RETURN ≡ Белый ∙ 30[917506] ←
 30867473[164364977]               ELSE ←
 39780366[164364803]                 RETURN ≡ NULL ∙ 117[30670850] ←
 32505863[164364578]         Локальные переменные ←
    65545[164367890]           Локальная переменная • 6 месяцев назад ≡ Дата ∙ 107[3] ←
 30867463[164364706]         Выполнить действия ←
 11010080[164370604]           = ≡ Диапазонов ∙ 65545[164368141] ←
      404[164383523]             Результат ⁼ 0 ←
 11010080[164370630]           = ≡ Цена из мониторинга ∙ 65545[164368142] ←
  1638402[164365002]             NULL ←
 30867470[164365708]           IF ←
  1638463[164366172]             Условие ←
      404[164385612]               Результат ≡ Стоимость перевозки ∙ 359[42401794] ←
 30867472[164365698]             THEN ←
 11010080[164370544]               = ≡ Цена из мониторинга ∙ 65545[164368142] ←
      404[164383291]                 Результат ≡ Стоимость перевозки ∙ 359[42401794] ←
 30867473[164364913]             ELSE ←
 30867470[164365911]               IF ←
  1638463[164366395]                 Условие ←
  1638460[164364822]                   НЕ ←
      404[164385852]                   Результат ≡ Искать цены конкурентов в партионных строках? ∙ 65545[164368094] ←
 30867472[164365901]                 THEN ←
 39780366[164364779]                   RETURN ←
 11010080[164370649]               = ≡ 6 месяцев назад ∙ 65545[164367890] ←
      404[164385613]                 Результат ≡ Текущие дата-время ∙ 249[42467332] ←
      406[164364726]                 Вычесть ←
      116[164366272]                 Выражение ←
      404[164385614]                   Результат ⁼ 180 ←
      403[164364548]                   Умножить ←
      404[164385615]                   Результат ≡ Сутки ∙ 117[16843851] ←
  1507360[164365093]               Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
  1507673[164364362]                 Ключи оптимизации ←
  1507675[164364364]                   Использовать индекс ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507676[164364365]                     Уточняющий параметр ≡ По родителю ∙ 1507445[1507403] ←
 32505862[164366488]                 Значения формальных параметров при вызове ←
 32505860[164369378]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164371607]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164368832]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510266] ←
   327700[164371576]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
 32505860[164368833]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата начальная ∙ 65545[1510103] ←
   327700[164371577]                     Выражение ≡ 6 месяцев назад ∙ 65545[164367890] ←
 12124222[164364355]                 Order By   (Сортировка) ←
  1507532[164364350]                   Сортировать по убыванию ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164365836]                     Уточняющий параметр ≡ Дата строки ∙ 359[6] ←
 12124215[164364722]                 Where      (Ограничения на отбор данных) ←
  1507381[164364636]                   <Наследуемые ограничения> ←
      413[164365389]                   И ←
  1507376[164365177]                   Выражение ←
  1507455[164365272]                     Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164365837]                       Уточняющий параметр ≡ Стоимость перевозки ∙ 359[42401794] ←
  1638479[164364658]                     Не равно ←
  1638402[164365001]                     NULL ←
 30867466[164365243]                 Выполнить после получения записи ←
 11010080[164370650]                   = ≡ Цвет шрифта ∙ 65545[164367470] ←
      404[164385616]                     Результат ≡ Синий ∙ 30[917511] ←
 11010080[164370580]                   = ≡ Цена из мониторинга ∙ 65545[164368142] ←
      404[164383491]                     Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[164370360]                       Уточняющий параметр ≡ Стоимость перевозки ∙ 359[42401794] ←
 11010100[164364381]                   BREAK ←
 30867470[164366034]           IF ←
  1638463[164366555]             Условие ←
  1638460[164364847]               НЕ ←
      404[164383495]               Результат ≡ Цена из мониторинга ∙ 65545[164368142] ←
 30867472[164366024]             THEN ←
 39780366[164364766]               RETURN ≡ NULL ∙ 117[30670850] ←
 39780366[164364767]           RETURN ←
      404[164383496]             Результат ≡ Цена из мониторинга ∙ 65545[164368142] ←
      590[164364798]       Поле (колонка), являющееся параметром объекта • Аллея ≡ { ... скрипт ... } ∙ 249[39780357] ←
      326[164364496]         Минимально возможная ширина ⁼ 10 ←
   131097[164364629]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
  1507710[164364319]         Цвет фона ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164364740]           Выполнить действия ←
 30867470[164366044]             IF ←
  1638463[164366565]               Условие ←
      404[164385327]                 Результат ≡ Проверка соответствия розничной цены ∙ 249[164364353] ←
 32505862[164366878]                   Значения формальных параметров при вызове ←
 32505860[164369643]                     Значение параметра при вызове процедуры/функции ≡ Цена расчетная ∙ 65545[164368143] ←
   327700[164371964]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164369644]                     Значение параметра при вызове процедуры/функции ≡ Цена мониторинга ∙ 65545[164368144] ←
   327700[164371965]                       Выражение ≡ Цена из мониторинга ∙ 65545[164368142] ←
 32505860[164369645]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164368145] ←
   327700[164371966]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164370413]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164369646]                     Значение параметра при вызове процедуры/функции ≡ Тип конкурента ∙ 65545[164368146] ←
   327700[164371967]                       Выражение ≡ Гипермаркет ∙ 164364293[164364290] ←
 32505860[164369335]                     Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164367494] ←
   327700[164370817]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164370399]                         Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164364718]                 Не равно ←
      404[164385337]                 Результат ⁼ 1 ←
 30867472[164366034]               THEN ←
 11010092[164364689]                 Добавить в локальную таблицу ≡ Некорректные строки ∙ 30867458[164364563] ←
 39780366[164364812]                 RETURN ≡ Синий ∙ 30[917511] ←
 30867473[164364982]               ELSE ←
 39780366[164364813]                 RETURN ≡ NULL ∙ 117[30670850] ←
  1507708[164364298]         Цвет шрифта ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164364737]           Выполнить действия ←
 30867470[164366041]             IF ←
  1638463[164366562]               Условие ←
      404[164384822]                 Результат ≡ Проверка соответствия розничной цены ∙ 249[164364353] ←
 32505862[164366875]                   Значения формальных параметров при вызове ←
 32505860[164369627]                     Значение параметра при вызове процедуры/функции ≡ Цена расчетная ∙ 65545[164368143] ←
   327700[164371854]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164369632]                     Значение параметра при вызове процедуры/функции ≡ Цена мониторинга ∙ 65545[164368144] ←
   327700[164371857]                       Выражение ≡ Цена из мониторинга ∙ 65545[164368142] ←
 32505860[164369633]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164368145] ←
   327700[164371858]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164370410]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164369634]                     Значение параметра при вызове процедуры/функции ≡ Тип конкурента ∙ 65545[164368146] ←
   327700[164371951]                       Выражение ≡ Гипермаркет ∙ 164364293[164364290] ←
 32505860[164369336]                     Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164367494] ←
   327700[164370834]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164370400]                         Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164364715]                 Не равно ←
      404[164384823]                 Результат ⁼ 1 ←
 30867472[164366031]               THEN ←
 39780366[164364806]                 RETURN ≡ Белый ∙ 30[917506] ←
 30867473[164364979]               ELSE ←
 39780366[164364807]                 RETURN ≡ NULL ∙ 117[30670850] ←
 32505863[164364580]         Локальные переменные ←
    65545[164367992]           Локальная переменная • 6 месяцев назад ≡ Дата ∙ 107[3] ←
 30867463[164364708]         Выполнить действия ←
 11010080[164370631]           = ≡ Диапазонов ∙ 65545[164368141] ←
      404[164383524]             Результат ⁼ 0 ←
 11010080[164370632]           = ≡ Цена из мониторинга ∙ 65545[164368142] ←
  1638402[164365003]             NULL ←
 30867470[164365891]           IF ←
  1638463[164366370]             Условие ←
      404[164383525]               Результат ≡ Отпускная цена (категория 3) ∙ 359[30736390] ←
 30867472[164365881]             THEN ←
 11010080[164370633]               = ≡ Цена из мониторинга ∙ 65545[164368142] ←
      404[164383526]                 Результат ≡ Отпускная цена (категория 3) ∙ 359[30736390] ←
 30867473[164364964]             ELSE ←
 30867470[164365913]               IF ←
  1638463[164366397]                 Условие ←
  1638460[164364824]                   НЕ ←
      404[164383527]                   Результат ≡ Искать цены конкурентов в партионных строках? ∙ 65545[164368094] ←
 30867472[164365903]                 THEN ←
 39780366[164364770]                   RETURN ←
 11010080[164370651]               = ≡ 6 месяцев назад ∙ 65545[164367992] ←
      404[164383528]                 Результат ≡ Текущие дата-время ∙ 249[42467332] ←
      406[164364728]                 Вычесть ←
      116[164366274]                 Выражение ←
      404[164383529]                   Результат ⁼ 180 ←
      403[164364550]                   Умножить ←
      404[164383530]                   Результат ≡ Сутки ∙ 117[16843851] ←
  1507360[164365072]               Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
  1507673[164364364]                 Ключи оптимизации ←
  1507675[164364366]                   Использовать индекс ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507676[164364367]                     Уточняющий параметр ≡ По родителю ∙ 1507445[1507403] ←
 32505862[164366490]                 Значения формальных параметров при вызове ←
 32505860[164369365]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510266] ←
   327700[164371580]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
 32505860[164369366]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164371581]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164369380]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата начальная ∙ 65545[1510103] ←
   327700[164371609]                     Выражение ≡ 6 месяцев назад ∙ 65545[164367992] ←
 12124222[164364374]                 Order By   (Сортировка) ←
  1507532[164364364]                   Сортировать по убыванию ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164365668]                     Уточняющий параметр ≡ Дата строки ∙ 359[6] ←
 12124215[164364724]                 Where      (Ограничения на отбор данных) ←
  1507381[164364638]                   <Наследуемые ограничения> ←
      413[164365391]                   И ←
  1507376[164365291]                   Выражение ←
  1507455[164365159]                     Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164365838]                       Уточняющий параметр ≡ Отпускная цена (категория 3) ∙ 359[30736390] ←
  1638479[164364660]                     Не равно ←
  1638402[164365036]                     NULL ←
 30867466[164365213]                 Выполнить после получения записи ←
 11010080[164370652]                   = ≡ Цвет шрифта ∙ 65545[164367470] ←
      404[164383532]                     Результат ≡ Синий ∙ 30[917511] ←
 11010080[164370653]                   = ≡ Цена из мониторинга ∙ 65545[164368142] ←
      404[164383533]                     Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[164370387]                       Уточняющий параметр ≡ Отпускная цена (категория 3) ∙ 359[30736390] ←
 11010100[164364380]                   BREAK ←
 30867470[164366036]           IF ←
  1638463[164366557]             Условие ←
  1638460[164364849]               НЕ ←
      404[164383534]               Результат ≡ Цена из мониторинга ∙ 65545[164368142] ←
 30867472[164366026]             THEN ←
 39780366[164364771]               RETURN ≡ NULL ∙ 117[30670850] ←
 39780366[164364781]           RETURN ←
      404[164383535]             Результат ≡ Цена из мониторинга ∙ 65545[164368142] ←
      590[164364797]       Поле (колонка), являющееся параметром объекта • ОК ≡ { ... скрипт ... } ∙ 249[39780357] ←
      326[164364495]         Минимально возможная ширина ⁼ 10 ←
   131097[164364628]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
  1507710[164364318]         Цвет фона ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164364739]           Выполнить действия ←
 30867470[164366043]             IF ←
  1638463[164366564]               Условие ←
      404[164385303]                 Результат ≡ Проверка соответствия розничной цены ∙ 249[164364353] ←
 32505862[164366877]                   Значения формальных параметров при вызове ←
 32505860[164369639]                     Значение параметра при вызове процедуры/функции ≡ Цена расчетная ∙ 65545[164368143] ←
   327700[164371960]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164369640]                     Значение параметра при вызове процедуры/функции ≡ Цена мониторинга ∙ 65545[164368144] ←
   327700[164371961]                       Выражение ≡ Цена из мониторинга ∙ 65545[164368142] ←
 32505860[164369641]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164368145] ←
   327700[164371962]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164370412]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164369642]                     Значение параметра при вызове процедуры/функции ≡ Тип конкурента ∙ 65545[164368146] ←
   327700[164371963]                       Выражение ≡ Гипермаркет ∙ 164364293[164364290] ←
 32505860[164369337]                     Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164367494] ←
   327700[164370835]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164370403]                         Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164364717]                 Не равно ←
      404[164385322]                 Результат ⁼ 1 ←
 30867472[164366033]               THEN ←
 11010092[164364690]                 Добавить в локальную таблицу ≡ Некорректные строки ∙ 30867458[164364563] ←
 39780366[164364810]                 RETURN ≡ Синий ∙ 30[917511] ←
 30867473[164364981]               ELSE ←
 39780366[164364811]                 RETURN ≡ NULL ∙ 117[30670850] ←
  1507708[164364297]         Цвет шрифта ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164364736]           Выполнить действия ←
 30867470[164366040]             IF ←
  1638463[164366561]               Условие ←
      404[164384820]                 Результат ≡ Проверка соответствия розничной цены ∙ 249[164364353] ←
 32505862[164366872]                   Значения формальных параметров при вызове ←
 32505860[164369557]                     Значение параметра при вызове процедуры/функции ≡ Цена расчетная ∙ 65545[164368143] ←
   327700[164371848]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164369596]                     Значение параметра при вызове процедуры/функции ≡ Цена мониторинга ∙ 65545[164368144] ←
   327700[164371849]                       Выражение ≡ Цена из мониторинга ∙ 65545[164368142] ←
 32505860[164369625]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164368145] ←
   327700[164371850]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164370409]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164369626]                     Значение параметра при вызове процедуры/функции ≡ Тип конкурента ∙ 65545[164368146] ←
   327700[164371853]                       Выражение ≡ Гипермаркет ∙ 164364293[164364290] ←
 32505860[164369338]                     Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164367494] ←
   327700[164370836]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164370417]                         Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164364714]                 Не равно ←
      404[164384821]                 Результат ⁼ 1 ←
 30867472[164366030]               THEN ←
 39780366[164364804]                 RETURN ≡ Белый ∙ 30[917506] ←
 30867473[164364978]               ELSE ←
 39780366[164364805]                 RETURN ≡ NULL ∙ 117[30670850] ←
 32505863[164364579]         Локальные переменные ←
    65545[164367991]           Локальная переменная • 6 месяцев назад ≡ Дата ∙ 107[3] ←
 30867463[164364707]         Выполнить действия ←
 11010080[164370581]           = ≡ Диапазонов ∙ 65545[164368141] ←
      404[164383497]             Результат ⁼ 0 ←
 11010080[164370583]           = ≡ Цена из мониторинга ∙ 65545[164368142] ←
  1638402[164364881]             NULL ←
 30867470[164365709]           IF ←
  1638463[164366173]             Условие ←
      404[164383498]               Результат ≡ Отпускная цена (категория 4) ∙ 359[30736391] ←
 30867472[164365699]             THEN ←
 11010080[164370599]               = ≡ Цена из мониторинга ∙ 65545[164368142] ←
      404[164383499]                 Результат ≡ Отпускная цена (категория 4) ∙ 359[30736391] ←
 30867473[164364963]             ELSE ←
 30867470[164365912]               IF ←
  1638463[164366396]                 Условие ←
  1638460[164364823]                   НЕ ←
      404[164383510]                   Результат ≡ Искать цены конкурентов в партионных строках? ∙ 65545[164368094] ←
 30867472[164365902]                 THEN ←
 39780366[164364768]                   RETURN ←
 11010080[164370600]               = ≡ 6 месяцев назад ∙ 65545[164367991] ←
      404[164383511]                 Результат ≡ Текущие дата-время ∙ 249[42467332] ←
      406[164364727]                 Вычесть ←
      116[164366273]                 Выражение ←
      404[164383512]                   Результат ⁼ 180 ←
      403[164364549]                   Умножить ←
      404[164383513]                   Результат ≡ Сутки ∙ 117[16843851] ←
  1507360[164365037]               Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
  1507673[164364363]                 Ключи оптимизации ←
  1507675[164364365]                   Использовать индекс ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507676[164364366]                     Уточняющий параметр ≡ По родителю ∙ 1507445[1507403] ←
 32505862[164366476]                 Значения формальных параметров при вызове ←
 32505860[164368834]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510266] ←
   327700[164371578]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
 32505860[164369316]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164371579]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164369379]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата начальная ∙ 65545[1510103] ←
   327700[164371608]                     Выражение ≡ 6 месяцев назад ∙ 65545[164367991] ←
 12124222[164364353]                 Order By   (Сортировка) ←
  1507532[164364361]                   Сортировать по убыванию ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164365603]                     Уточняющий параметр ≡ Дата строки ∙ 359[6] ←
 12124215[164364723]                 Where      (Ограничения на отбор данных) ←
  1507381[164364637]                   <Наследуемые ограничения> ←
      413[164365390]                   И ←
  1507376[164365178]                   Выражение ←
  1507455[164365126]                     Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164365604]                       Уточняющий параметр ≡ Отпускная цена (категория 1) ∙ 359[42401820] ←
  1638479[164364659]                     Не равно ←
  1638402[164364895]                     NULL ←
 30867466[164365167]                 Выполнить после получения записи ←
 11010080[164370601]                   = ≡ Цвет шрифта ∙ 65545[164367470] ←
      404[164383514]                     Результат ≡ Синий ∙ 30[917511] ←
 11010080[164370602]                   = ≡ Цена из мониторинга ∙ 65545[164368142] ←
      404[164383515]                     Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[164370382]                       Уточняющий параметр ≡ Отпускная цена (категория 4) ∙ 359[30736391] ←
 11010100[164364379]                   BREAK ←
 30867470[164366035]           IF ←
  1638463[164366556]             Условие ←
  1638460[164364848]               НЕ ←
      404[164383520]               Результат ≡ Цена из мониторинга ∙ 65545[164368142] ←
 30867472[164366025]             THEN ←
 39780366[164364769]               RETURN ≡ NULL ∙ 117[30670850] ←
 39780366[164364780]           RETURN ←
      404[164383522]             Результат ≡ Цена из мониторинга ∙ 65545[164368142] ←
      590[164365103]       Поле (колонка), являющееся параметром объекта • Лента ≡ { ... скрипт ... } ∙ 249[39780357] ←
      326[164364497]         Минимально возможная ширина ⁼ 10 ←
   131097[164364630]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
  1507710[164364320]         Цвет фона ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164364741]           Выполнить действия ←
 30867470[164366045]             IF ←
  1638463[164366566]               Условие ←
      404[164385338]                 Результат ≡ Проверка соответствия розничной цены ∙ 249[164364353] ←
 32505862[164366879]                   Значения формальных параметров при вызове ←
 32505860[164369647]                     Значение параметра при вызове процедуры/функции ≡ Цена расчетная ∙ 65545[164368143] ←
   327700[164371968]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164369648]                     Значение параметра при вызове процедуры/функции ≡ Цена мониторинга ∙ 65545[164368144] ←
   327700[164371969]                       Выражение ≡ Цена из мониторинга ∙ 65545[164368142] ←
 32505860[164369649]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164368145] ←
   327700[164371970]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164370416]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164369650]                     Значение параметра при вызове процедуры/функции ≡ Тип конкурента ∙ 65545[164368146] ←
   327700[164371971]                       Выражение ≡ Гипермаркет ∙ 164364293[164364290] ←
 32505860[164369339]                     Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164367494] ←
   327700[164371212]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164370418]                         Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164364719]                 Не равно ←
      404[164385339]                 Результат ⁼ 1 ←
 30867472[164366035]               THEN ←
 11010092[164364691]                 Добавить в локальную таблицу ≡ Некорректные строки ∙ 30867458[164364563] ←
 39780366[164364814]                 RETURN ≡ Синий ∙ 30[917511] ←
 30867473[164364983]               ELSE ←
 39780366[164364815]                 RETURN ≡ NULL ∙ 117[30670850] ←
  1507708[164364299]         Цвет шрифта ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164364738]           Выполнить действия ←
 30867470[164366042]             IF ←
  1638463[164366563]               Условие ←
      404[164384824]                 Результат ≡ Проверка соответствия розничной цены ∙ 249[164364353] ←
 32505862[164366876]                   Значения формальных параметров при вызове ←
 32505860[164369635]                     Значение параметра при вызове процедуры/функции ≡ Цена расчетная ∙ 65545[164368143] ←
   327700[164371952]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164369636]                     Значение параметра при вызове процедуры/функции ≡ Цена мониторинга ∙ 65545[164368144] ←
   327700[164371953]                       Выражение ≡ Цена из мониторинга ∙ 65545[164368142] ←
 32505860[164369637]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164368145] ←
   327700[164371954]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164370411]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164369638]                     Значение параметра при вызове процедуры/функции ≡ Тип конкурента ∙ 65545[164368146] ←
   327700[164371959]                       Выражение ≡ Гипермаркет ∙ 164364293[164364290] ←
 32505860[164369340]                     Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164367494] ←
   327700[164371218]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164370419]                         Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164364716]                 Не равно ←
      404[164385300]                 Результат ⁼ 1 ←
 30867472[164366032]               THEN ←
 39780366[164364808]                 RETURN ≡ Белый ∙ 30[917506] ←
 30867473[164364980]               ELSE ←
 39780366[164364809]                 RETURN ≡ NULL ∙ 117[30670850] ←
 32505863[164364581]         Локальные переменные ←
    65545[164367993]           Локальная переменная • 6 месяцев назад ≡ Дата ∙ 107[3] ←
 30867463[164364709]         Выполнить действия ←
 11010080[164370654]           = ≡ Диапазонов ∙ 65545[164368141] ←
      404[164383536]             Результат ⁼ 0 ←
 11010080[164370655]           = ≡ Цена из мониторинга ∙ 65545[164368142] ←
  1638402[164365004]             NULL ←
 30867470[164365892]           IF ←
  1638463[164366371]             Условие ←
      404[164383537]               Результат ≡ Сумма НДС ∙ 359[15007760] ←
 30867472[164365882]             THEN ←
 11010080[164370656]               = ≡ Цена из мониторинга ∙ 65545[164368142] ←
      404[164383538]                 Результат ≡ Сумма НДС ∙ 359[15007760] ←
 30867473[164364965]             ELSE ←
 30867470[164365914]               IF ←
  1638463[164366398]                 Условие ←
  1638460[164364825]                   НЕ ←
      404[164383539]                   Результат ≡ Искать цены конкурентов в партионных строках? ∙ 65545[164368094] ←
 30867472[164365904]                 THEN ←
 39780366[164364772]                   RETURN ←
 11010080[164371413]               = ≡ 6 месяцев назад ∙ 65545[164367993] ←
      404[164383540]                 Результат ≡ Текущие дата-время ∙ 249[42467332] ←
      406[164364729]                 Вычесть ←
      116[164366275]                 Выражение ←
      404[164383541]                   Результат ⁼ 180 ←
      403[164364551]                   Умножить ←
      404[164383543]                   Результат ≡ Сутки ∙ 117[16843851] ←
  1507360[164365084]               Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
  1507673[164364365]                 Ключи оптимизации ←
  1507675[164364367]                   Использовать индекс ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507676[164364368]                     Уточняющий параметр ≡ По родителю ∙ 1507445[1507403] ←
 32505862[164366491]                 Значения формальных параметров при вызове ←
 32505860[164369367]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510266] ←
   327700[164371582]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
 32505860[164369368]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164371583]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164369381]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата начальная ∙ 65545[1510103] ←
   327700[164371610]                     Выражение ≡ 6 месяцев назад ∙ 65545[164367993] ←
 12124222[164364375]                 Order By   (Сортировка) ←
  1507532[164364365]                   Сортировать по убыванию ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164365839]                     Уточняющий параметр ≡ Дата строки ∙ 359[6] ←
 12124215[164364725]                 Where      (Ограничения на отбор данных) ←
  1507381[164364639]                   <Наследуемые ограничения> ←
      413[164365392]                   И ←
  1507376[164365292]                   Выражение ←
  1507455[164365273]                     Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164365840]                       Уточняющий параметр ≡ Сумма НДС ∙ 359[15007760] ←
  1638479[164364661]                     Не равно ←
  1638402[164365037]                     NULL ←
 30867466[164365214]                 Выполнить после получения записи ←
 11010080[164371615]                   = ≡ Цвет шрифта ∙ 65545[164367470] ←
      404[164383935]                     Результат ≡ Синий ∙ 30[917511] ←
 11010080[164371616]                   = ≡ Цена из мониторинга ∙ 65545[164368142] ←
      404[164384783]                     Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[164370388]                       Уточняющий параметр ≡ Сумма НДС ∙ 359[15007760] ←
 11010100[164364383]                   BREAK ←
 30867470[164366037]           IF ←
  1638463[164366558]             Условие ←
  1638460[164364850]               НЕ ←
      404[164384784]               Результат ≡ Цена из мониторинга ∙ 65545[164368142] ←
 30867472[164366027]             THEN ←
 39780366[164364773]               RETURN ≡ NULL ∙ 117[30670850] ←
 39780366[164364782]           RETURN ←
      404[164384785]             Результат ≡ Цена из мониторинга ∙ 65545[164368142] ←
      590[164365656]       Поле (колонка), являющееся параметром объекта • БигСи ≡ { ... скрипт ... } ∙ 249[39780357] ←
      326[164364777]         Минимально возможная ширина ⁼ 10 ←
   131097[164364846]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
  1507710[164364402]         Цвет фона ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164365071]           Выполнить действия ←
 30867470[164367151]             IF ←
  1638463[164367974]               Условие ←
      404[164398747]                 Результат ≡ Проверка соответствия розничной цены ∙ 249[164364353] ←
 32505862[164368756]                   Значения формальных параметров при вызове ←
 32505860[164373636]                     Значение параметра при вызове процедуры/функции ≡ Цена расчетная ∙ 65545[164368143] ←
   327700[164377729]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164373638]                     Значение параметра при вызове процедуры/функции ≡ Цена мониторинга ∙ 65545[164368144] ←
   327700[164377731]                       Выражение ≡ Цена из мониторинга ∙ 65545[164368142] ←
 32505860[164373639]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164368145] ←
   327700[164377732]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164375827]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164373640]                     Значение параметра при вызове процедуры/функции ≡ Тип конкурента ∙ 65545[164368146] ←
   327700[164377733]                       Выражение ≡ Супермаркет ∙ 164364293[164364289] ←
 32505860[164373641]                     Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164367494] ←
   327700[164377734]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164375828]                         Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164365072]                 Не равно ←
      404[164398748]                 Результат ⁼ 1 ←
 30867472[164367139]               THEN ←
 11010092[164364692]                 Добавить в локальную таблицу ≡ Некорректные строки ∙ 30867458[164364563] ←
 39780366[164365248]                 RETURN ≡ Синий ∙ 30[917511] ←
 30867473[164365311]               ELSE ←
 39780366[164365249]                 RETURN ≡ NULL ∙ 117[30670850] ←
  1507708[164364306]         Цвет шрифта ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164365072]           Выполнить действия ←
 30867470[164367152]             IF ←
  1638463[164367975]               Условие ←
      404[164398749]                 Результат ≡ Проверка соответствия розничной цены ∙ 249[164364353] ←
 32505862[164368757]                   Значения формальных параметров при вызове ←
 32505860[164373642]                     Значение параметра при вызове процедуры/функции ≡ Цена расчетная ∙ 65545[164368143] ←
   327700[164377735]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164373643]                     Значение параметра при вызове процедуры/функции ≡ Цена мониторинга ∙ 65545[164368144] ←
   327700[164377736]                       Выражение ≡ Цена из мониторинга ∙ 65545[164368142] ←
 32505860[164373644]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164368145] ←
   327700[164377737]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164375829]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164373645]                     Значение параметра при вызове процедуры/функции ≡ Тип конкурента ∙ 65545[164368146] ←
   327700[164377738]                       Выражение ≡ Супермаркет ∙ 164364293[164364289] ←
 32505860[164373646]                     Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164367494] ←
   327700[164377739]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164375830]                         Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164365073]                 Не равно ←
      404[164398750]                 Результат ⁼ 1 ←
 30867472[164367140]               THEN ←
 39780366[164365250]                 RETURN ≡ Белый ∙ 30[917506] ←
 30867473[164365312]               ELSE ←
 39780366[164365251]                 RETURN ≡ NULL ∙ 117[30670850] ←
 32505863[164364790]         Локальные переменные ←
    65545[164370535]           Локальная переменная • 6 месяцев назад ≡ Дата ∙ 107[3] ←
 30867463[164365073]         Выполнить действия ←
 11010080[164375653]           = ≡ Диапазонов ∙ 65545[164368141] ←
      404[164398751]             Результат ⁼ 0 ←
 11010080[164375654]           = ≡ Цена из мониторинга ∙ 65545[164368142] ←
  1638402[164365616]             NULL ←
 30867470[164367153]           IF ←
  1638463[164367976]             Условие ←
      404[164398752]               Результат ≡ Отпускная цена (категория 5) ∙ 359[30736392] ←
 30867472[164367141]             THEN ←
 11010080[164375655]               = ≡ Цена из мониторинга ∙ 65545[164368142] ←
      404[164398753]                 Результат ≡ Отпускная цена (категория 5) ∙ 359[30736392] ←
 30867473[164365313]             ELSE ←
 30867470[164367154]               IF ←
  1638463[164367977]                 Условие ←
  1638460[164365462]                   НЕ ←
      404[164398754]                   Результат ≡ Искать цены конкурентов в партионных строках? ∙ 65545[164368094] ←
 30867472[164367142]                 THEN ←
 39780366[164365252]                   RETURN ←
 11010080[164375656]               = ≡ 6 месяцев назад ∙ 65545[164370535] ←
      404[164398755]                 Результат ≡ Текущие дата-время ∙ 249[42467332] ←
      406[164365039]                 Вычесть ←
      116[164368492]                 Выражение ←
      404[164398756]                   Результат ⁼ 180 ←
      403[164364821]                   Умножить ←
      404[164398757]                   Результат ≡ Сутки ∙ 117[16843851] ←
  1507360[164365934]               Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
  1507673[164364555]                 Ключи оптимизации ←
  1507675[164364558]                   Использовать индекс ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507676[164364565]                     Уточняющий параметр ≡ По родителю ∙ 1507445[1507403] ←
 32505862[164368758]                 Значения формальных параметров при вызове ←
 32505860[164373647]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510266] ←
   327700[164377740]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
 32505860[164373648]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164377741]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164373649]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата начальная ∙ 65545[1510103] ←
   327700[164377742]                     Выражение ≡ 6 месяцев назад ∙ 65545[164370535] ←
 12124222[164364458]                 Order By   (Сортировка) ←
  1507532[164364436]                   Сортировать по убыванию ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164367070]                     Уточняющий параметр ≡ Дата строки ∙ 359[6] ←
 12124215[164365077]                 Where      (Ограничения на отбор данных) ←
  1507381[164364956]                   <Наследуемые ограничения> ←
      413[164366499]                   И ←
  1507376[164366164]                   Выражение ←
  1507455[164366114]                     Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164367071]                       Уточняющий параметр ≡ Отпускная цена (категория 5) ∙ 359[30736392] ←
  1638479[164365074]                     Не равно ←
  1638402[164365617]                     NULL ←
 30867466[164366221]                 Выполнить после получения записи ←
 11010080[164375657]                   = ≡ Цвет шрифта ∙ 65545[164367470] ←
      404[164398758]                     Результат ≡ Синий ∙ 30[917511] ←
 11010080[164375658]                   = ≡ Цена из мониторинга ∙ 65545[164368142] ←
      404[164398759]                     Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[164375831]                       Уточняющий параметр ≡ Отпускная цена (категория 5) ∙ 359[30736392] ←
 11010100[164364518]                   BREAK ←
 30867470[164367155]           IF ←
  1638463[164367978]             Условие ←
  1638460[164365465]               НЕ ←
      404[164398760]               Результат ≡ Цена из мониторинга ∙ 65545[164368142] ←
 30867472[164367143]             THEN ←
 39780366[164365253]               RETURN ≡ NULL ∙ 117[30670850] ←
 39780366[164365254]           RETURN ←
      404[164398761]             Результат ≡ Цена из мониторинга ∙ 65545[164368142] ←
      590[164365657]       Поле (колонка), являющееся параметром объекта • Роса ≡ { ... скрипт ... } ∙ 249[39780357] ←
      326[164364778]         Минимально возможная ширина ⁼ 10 ←
   131097[164364847]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
  1507710[164364403]         Цвет фона ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164365074]           Выполнить действия ←
 30867470[164367156]             IF ←
  1638463[164367979]               Условие ←
      404[164398762]                 Результат ≡ Проверка соответствия розничной цены ∙ 249[164364353] ←
 32505862[164368759]                   Значения формальных параметров при вызове ←
 32505860[164373650]                     Значение параметра при вызове процедуры/функции ≡ Цена расчетная ∙ 65545[164368143] ←
   327700[164377743]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164373651]                     Значение параметра при вызове процедуры/функции ≡ Цена мониторинга ∙ 65545[164368144] ←
   327700[164377744]                       Выражение ≡ Цена из мониторинга ∙ 65545[164368142] ←
 32505860[164373652]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164368145] ←
   327700[164377745]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164375832]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164373653]                     Значение параметра при вызове процедуры/функции ≡ Тип конкурента ∙ 65545[164368146] ←
   327700[164377746]                       Выражение ≡ Супермаркет ∙ 164364293[164364289] ←
 32505860[164373654]                     Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164367494] ←
   327700[164377747]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164375833]                         Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164365075]                 Не равно ←
      404[164398763]                 Результат ⁼ 1 ←
 30867472[164367144]               THEN ←
 11010092[164364693]                 Добавить в локальную таблицу ≡ Некорректные строки ∙ 30867458[164364563] ←
 39780366[164365255]                 RETURN ≡ Синий ∙ 30[917511] ←
 30867473[164365314]               ELSE ←
 39780366[164365256]                 RETURN ≡ NULL ∙ 117[30670850] ←
  1507708[164364307]         Цвет шрифта ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164365075]           Выполнить действия ←
 30867470[164367157]             IF ←
  1638463[164367980]               Условие ←
      404[164398764]                 Результат ≡ Проверка соответствия розничной цены ∙ 249[164364353] ←
 32505862[164368760]                   Значения формальных параметров при вызове ←
 32505860[164373655]                     Значение параметра при вызове процедуры/функции ≡ Цена расчетная ∙ 65545[164368143] ←
   327700[164377748]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164373656]                     Значение параметра при вызове процедуры/функции ≡ Цена мониторинга ∙ 65545[164368144] ←
   327700[164377749]                       Выражение ≡ Цена из мониторинга ∙ 65545[164368142] ←
 32505860[164373657]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164368145] ←
   327700[164377750]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164375834]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164373658]                     Значение параметра при вызове процедуры/функции ≡ Тип конкурента ∙ 65545[164368146] ←
   327700[164377751]                       Выражение ≡ Супермаркет ∙ 164364293[164364289] ←
 32505860[164373659]                     Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164367494] ←
   327700[164377752]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164375835]                         Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164365076]                 Не равно ←
      404[164398765]                 Результат ⁼ 1 ←
 30867472[164367145]               THEN ←
 39780366[164365257]                 RETURN ≡ Белый ∙ 30[917506] ←
 30867473[164365315]               ELSE ←
 39780366[164365258]                 RETURN ≡ NULL ∙ 117[30670850] ←
 32505863[164364791]         Локальные переменные ←
    65545[164370536]           Локальная переменная • 6 месяцев назад ≡ Дата ∙ 107[3] ←
 30867463[164365076]         Выполнить действия ←
 11010080[164375659]           = ≡ Диапазонов ∙ 65545[164368141] ←
      404[164398766]             Результат ⁼ 0 ←
 11010080[164375660]           = ≡ Цена из мониторинга ∙ 65545[164368142] ←
  1638402[164365618]             NULL ←
 30867470[164367158]           IF ←
  1638463[164367981]             Условие ←
      404[164398767]               Результат ≡ Цена старая розничная ∙ 359[15007765] ←
 30867472[164367146]             THEN ←
 11010080[164375661]               = ≡ Цена из мониторинга ∙ 65545[164368142] ←
      404[164398768]                 Результат ≡ Цена старая розничная ∙ 359[15007765] ←
 30867473[164365316]             ELSE ←
 30867470[164367159]               IF ←
  1638463[164367982]                 Условие ←
  1638460[164365466]                   НЕ ←
      404[164398769]                   Результат ≡ Искать цены конкурентов в партионных строках? ∙ 65545[164368094] ←
 30867472[164367147]                 THEN ←
 39780366[164365259]                   RETURN ←
 11010080[164375662]               = ≡ 6 месяцев назад ∙ 65545[164370536] ←
      404[164398770]                 Результат ≡ Текущие дата-время ∙ 249[42467332] ←
      406[164365040]                 Вычесть ←
      116[164368493]                 Выражение ←
      404[164398771]                   Результат ⁼ 180 ←
      403[164364822]                   Умножить ←
      404[164398772]                   Результат ≡ Сутки ∙ 117[16843851] ←
  1507360[164365935]               Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
  1507673[164364556]                 Ключи оптимизации ←
  1507675[164364559]                   Использовать индекс ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507676[164364566]                     Уточняющий параметр ≡ По родителю ∙ 1507445[1507403] ←
 32505862[164368761]                 Значения формальных параметров при вызове ←
 32505860[164373660]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510266] ←
   327700[164377753]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
 32505860[164373661]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164377754]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164373662]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата начальная ∙ 65545[1510103] ←
   327700[164377755]                     Выражение ≡ 6 месяцев назад ∙ 65545[164370536] ←
 12124222[164364459]                 Order By   (Сортировка) ←
  1507532[164364437]                   Сортировать по убыванию ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164367072]                     Уточняющий параметр ≡ Дата строки ∙ 359[6] ←
 12124215[164365078]                 Where      (Ограничения на отбор данных) ←
  1507381[164364957]                   <Наследуемые ограничения> ←
      413[164366500]                   И ←
  1507376[164366165]                   Выражение ←
  1507455[164366115]                     Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164367073]                       Уточняющий параметр ≡ Цена старая розничная ∙ 359[15007765] ←
  1638479[164365077]                     Не равно ←
  1638402[164365619]                     NULL ←
 30867466[164366222]                 Выполнить после получения записи ←
 11010080[164375663]                   = ≡ Цвет шрифта ∙ 65545[164367470] ←
      404[164398773]                     Результат ≡ Синий ∙ 30[917511] ←
 11010080[164375664]                   = ≡ Цена из мониторинга ∙ 65545[164368142] ←
      404[164398774]                     Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[164375836]                       Уточняющий параметр ≡ Цена старая розничная ∙ 359[15007765] ←
 11010100[164364519]                   BREAK ←
 30867470[164367160]           IF ←
  1638463[164367983]             Условие ←
  1638460[164365467]               НЕ ←
      404[164398775]               Результат ≡ Цена из мониторинга ∙ 65545[164368142] ←
 30867472[164367148]             THEN ←
 39780366[164365260]               RETURN ≡ NULL ∙ 117[30670850] ←
 39780366[164365261]           RETURN ←
      404[164398776]             Результат ≡ Цена из мониторинга ∙ 65545[164368142] ←
      590[164365605]       Поле (колонка), являющееся параметром объекта • Хороший ≡ { ... скрипт ... } ∙ 249[39780357] ←
      326[164364887]         Минимально возможная ширина ⁼ 10 ←
   131097[164364911]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
  1507710[164364407]         Цвет фона ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164365187]           Выполнить действия ←
 30867470[164367390]             IF ←
  1638463[164368307]               Условие ←
      404[164401784]                 Результат ≡ Проверка соответствия розничной цены ∙ 249[164364353] ←
 32505862[164369185]                   Значения формальных параметров при вызове ←
 32505860[164374462]                     Значение параметра при вызове процедуры/функции ≡ Цена расчетная ∙ 65545[164368143] ←
   327700[164378664]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164374463]                     Значение параметра при вызове процедуры/функции ≡ Цена мониторинга ∙ 65545[164368144] ←
   327700[164378683]                       Выражение ≡ Цена из мониторинга ∙ 65545[164368142] ←
 32505860[164374464]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164368145] ←
   327700[164378966]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164376818]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164374465]                     Значение параметра при вызове процедуры/функции ≡ Тип конкурента ∙ 65545[164368146] ←
   327700[164378967]                       Выражение ≡ Дискаунтер ∙ 164364293[164364291] ←
 32505860[164374466]                     Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164367494] ←
   327700[164378988]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164376819]                         Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164364679]                 Не равно ←
      404[164401785]                 Результат ⁼ 1 ←
 30867472[164367375]               THEN ←
 11010092[164364694]                 Добавить в локальную таблицу ≡ Некорректные строки ∙ 30867458[164364563] ←
 39780366[164365353]                 RETURN ≡ Синий ∙ 30[917511] ←
 30867473[164365245]               ELSE ←
 39780366[164365354]                 RETURN ≡ NULL ∙ 117[30670850] ←
  1507708[164364308]         Цвет шрифта ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164365188]           Выполнить действия ←
 30867470[164367391]             IF ←
  1638463[164368308]               Условие ←
      404[164401788]                 Результат ≡ Проверка соответствия розничной цены ∙ 249[164364353] ←
 32505862[164369186]                   Значения формальных параметров при вызове ←
 32505860[164374467]                     Значение параметра при вызове процедуры/функции ≡ Цена расчетная ∙ 65545[164368143] ←
   327700[164378989]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164374468]                     Значение параметра при вызове процедуры/функции ≡ Цена мониторинга ∙ 65545[164368144] ←
   327700[164378990]                       Выражение ≡ Цена из мониторинга ∙ 65545[164368142] ←
 32505860[164374469]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164368145] ←
   327700[164378991]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164376820]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164374470]                     Значение параметра при вызове процедуры/функции ≡ Тип конкурента ∙ 65545[164368146] ←
   327700[164378992]                       Выражение ≡ Дискаунтер ∙ 164364293[164364291] ←
 32505860[164374471]                     Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164367494] ←
   327700[164378993]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164376821]                         Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164364680]                 Не равно ←
      404[164401789]                 Результат ⁼ 1 ←
 30867472[164367376]               THEN ←
 39780366[164365355]                 RETURN ≡ Белый ∙ 30[917506] ←
 30867473[164365246]               ELSE ←
 39780366[164365356]                 RETURN ≡ NULL ∙ 117[30670850] ←
 32505863[164364857]         Локальные переменные ←
    65545[164371095]           Локальная переменная • 6 месяцев назад ≡ Дата ∙ 107[3] ←
 30867463[164365189]         Выполнить действия ←
 11010080[164375294]           = ≡ Диапазонов ∙ 65545[164368141] ←
      404[164401790]             Результат ⁼ 0 ←
 11010080[164375295]           = ≡ Цена из мониторинга ∙ 65545[164368142] ←
  1638402[164365795]             NULL ←
 30867470[164367392]           IF ←
  1638463[164368309]             Условие ←
      404[164401791]               Результат ≡ Цена старая оптовая ∙ 359[15007766] ←
 30867472[164367377]             THEN ←
 11010080[164375297]               = ≡ Цена из мониторинга ∙ 65545[164368142] ←
      404[164401801]                 Результат ≡ Цена старая оптовая ∙ 359[15007766] ←
 30867473[164365247]             ELSE ←
 30867470[164367393]               IF ←
  1638463[164368310]                 Условие ←
  1638460[164365641]                   НЕ ←
      404[164401805]                   Результат ≡ Искать цены конкурентов в партионных строках? ∙ 65545[164368094] ←
 30867472[164367378]                 THEN ←
 39780366[164365357]                   RETURN ←
 11010080[164375298]               = ≡ 6 месяцев назад ∙ 65545[164371095] ←
      404[164401806]                 Результат ≡ Текущие дата-время ∙ 249[42467332] ←
      406[164365100]                 Вычесть ←
      116[164368940]                 Выражение ←
      404[164401807]                   Результат ⁼ 180 ←
      403[164364902]                   Умножить ←
      404[164401808]                   Результат ≡ Сутки ∙ 117[16843851] ←
  1507360[164366026]               Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
  1507673[164364586]                 Ключи оптимизации ←
  1507675[164364589]                   Использовать индекс ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507676[164364596]                     Уточняющий параметр ≡ По родителю ∙ 1507445[1507403] ←
 32505862[164369187]                 Значения формальных параметров при вызове ←
 32505860[164374472]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510266] ←
   327700[164378994]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
 32505860[164374473]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164378995]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164374474]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата начальная ∙ 65545[1510103] ←
   327700[164378996]                     Выражение ≡ 6 месяцев назад ∙ 65545[164371095] ←
 12124222[164364362]                 Order By   (Сортировка) ←
  1507532[164364356]                   Сортировать по убыванию ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164367300]                     Уточняющий параметр ≡ Дата строки ∙ 359[6] ←
 12124215[164365126]                 Where      (Ограничения на отбор данных) ←
  1507381[164364994]                   <Наследуемые ограничения> ←
      413[164366714]                   И ←
  1507376[164366330]                   Выражение ←
  1507455[164366284]                     Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164367301]                       Уточняющий параметр ≡ Цена старая оптовая ∙ 359[15007766] ←
  1638479[164364681]                     Не равно ←
  1638402[164365796]                     NULL ←
 30867466[164366332]                 Выполнить после получения записи ←
 11010080[164375299]                   = ≡ Цвет шрифта ∙ 65545[164367470] ←
      404[164401811]                     Результат ≡ Синий ∙ 30[917511] ←
 11010080[164375300]                   = ≡ Цена из мониторинга ∙ 65545[164368142] ←
      404[164401812]                     Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[164376822]                       Уточняющий параметр ≡ Цена старая оптовая ∙ 359[15007766] ←
 11010100[164364541]                   BREAK ←
 30867470[164367394]           IF ←
  1638463[164368311]             Условие ←
  1638460[164365642]               НЕ ←
      404[164401813]               Результат ≡ Цена из мониторинга ∙ 65545[164368142] ←
 30867472[164367379]             THEN ←
 39780366[164365358]               RETURN ≡ NULL ∙ 117[30670850] ←
 39780366[164365359]           RETURN ←
      404[164401814]             Результат ≡ Цена из мониторинга ∙ 65545[164368142] ←
      590[164365606]       Поле (колонка), являющееся параметром объекта • Светофор ≡ { ... скрипт ... } ∙ 249[39780357] ←
      326[164364888]         Минимально возможная ширина ⁼ 10 ←
   131097[164364912]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
  1507710[164364408]         Цвет фона ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164365190]           Выполнить действия ←
 30867470[164367395]             IF ←
  1638463[164368312]               Условие ←
      404[164401815]                 Результат ≡ Проверка соответствия розничной цены ∙ 249[164364353] ←
 32505862[164369188]                   Значения формальных параметров при вызове ←
 32505860[164374475]                     Значение параметра при вызове процедуры/функции ≡ Цена расчетная ∙ 65545[164368143] ←
   327700[164378999]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164374476]                     Значение параметра при вызове процедуры/функции ≡ Цена мониторинга ∙ 65545[164368144] ←
   327700[164379000]                       Выражение ≡ Цена из мониторинга ∙ 65545[164368142] ←
 32505860[164374477]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164368145] ←
   327700[164379003]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164376823]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164374478]                     Значение параметра при вызове процедуры/функции ≡ Тип конкурента ∙ 65545[164368146] ←
   327700[164379004]                       Выражение ≡ Дискаунтер ∙ 164364293[164364291] ←
 32505860[164374479]                     Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164367494] ←
   327700[164379005]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164376824]                         Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164364682]                 Не равно ←
      404[164401816]                 Результат ⁼ 1 ←
 30867472[164367380]               THEN ←
 11010092[164364695]                 Добавить в локальную таблицу ≡ Некорректные строки ∙ 30867458[164364563] ←
 39780366[164365360]                 RETURN ≡ Синий ∙ 30[917511] ←
 30867473[164365270]               ELSE ←
 39780366[164365361]                 RETURN ≡ NULL ∙ 117[30670850] ←
  1507708[164364309]         Цвет шрифта ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164365191]           Выполнить действия ←
 30867470[164367396]             IF ←
  1638463[164368313]               Условие ←
      404[164401817]                 Результат ≡ Проверка соответствия розничной цены ∙ 249[164364353] ←
 32505862[164369189]                   Значения формальных параметров при вызове ←
 32505860[164374480]                     Значение параметра при вызове процедуры/функции ≡ Цена расчетная ∙ 65545[164368143] ←
   327700[164379006]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164374481]                     Значение параметра при вызове процедуры/функции ≡ Цена мониторинга ∙ 65545[164368144] ←
   327700[164379007]                       Выражение ≡ Цена из мониторинга ∙ 65545[164368142] ←
 32505860[164374482]                     Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164368145] ←
   327700[164379008]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164376825]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164374483]                     Значение параметра при вызове процедуры/функции ≡ Тип конкурента ∙ 65545[164368146] ←
   327700[164379009]                       Выражение ≡ Дискаунтер ∙ 164364293[164364291] ←
 32505860[164374484]                     Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164367494] ←
   327700[164379010]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164376826]                         Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164364683]                 Не равно ←
      404[164401818]                 Результат ⁼ 1 ←
 30867472[164367381]               THEN ←
 39780366[164365362]                 RETURN ≡ Белый ∙ 30[917506] ←
 30867473[164365285]               ELSE ←
 39780366[164365363]                 RETURN ≡ NULL ∙ 117[30670850] ←
 32505863[164364858]         Локальные переменные ←
    65545[164371096]           Локальная переменная • 6 месяцев назад ≡ Дата ∙ 107[3] ←
 30867463[164365192]         Выполнить действия ←
 11010080[164375301]           = ≡ Диапазонов ∙ 65545[164368141] ←
      404[164401819]             Результат ⁼ 0 ←
 11010080[164375302]           = ≡ Цена из мониторинга ∙ 65545[164368142] ←
  1638402[164365797]             NULL ←
 30867470[164367397]           IF ←
  1638463[164368314]             Условие ←
      404[164401820]               Результат ≡ Цена старая закупочная ∙ 359[15007767] ←
 30867472[164367382]             THEN ←
 11010080[164375303]               = ≡ Цена из мониторинга ∙ 65545[164368142] ←
      404[164401821]                 Результат ≡ Цена старая закупочная ∙ 359[15007767] ←
 30867473[164365420]             ELSE ←
 30867470[164367398]               IF ←
  1638463[164368315]                 Условие ←
  1638460[164365643]                   НЕ ←
      404[164401822]                   Результат ≡ Искать цены конкурентов в партионных строках? ∙ 65545[164368094] ←
 30867472[164367383]                 THEN ←
 39780366[164365364]                   RETURN ←
 11010080[164375423]               = ≡ 6 месяцев назад ∙ 65545[164371096] ←
      404[164401823]                 Результат ≡ Текущие дата-время ∙ 249[42467332] ←
      406[164365101]                 Вычесть ←
      116[164368941]                 Выражение ←
      404[164401824]                   Результат ⁼ 180 ←
      403[164364903]                   Умножить ←
      404[164401825]                   Результат ≡ Сутки ∙ 117[16843851] ←
  1507360[164366029]               Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
  1507673[164364587]                 Ключи оптимизации ←
  1507675[164364590]                   Использовать индекс ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507676[164364597]                     Уточняющий параметр ≡ По родителю ∙ 1507445[1507403] ←
 32505862[164369190]                 Значения формальных параметров при вызове ←
 32505860[164374485]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510266] ←
   327700[164379011]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
 32505860[164374486]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164379012]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164374487]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата начальная ∙ 65545[1510103] ←
   327700[164379013]                     Выражение ≡ 6 месяцев назад ∙ 65545[164371096] ←
 12124222[164364365]                 Order By   (Сортировка) ←
  1507532[164364447]                   Сортировать по убыванию ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164367302]                     Уточняющий параметр ≡ Дата строки ∙ 359[6] ←
 12124215[164365127]                 Where      (Ограничения на отбор данных) ←
  1507381[164364995]                   <Наследуемые ограничения> ←
      413[164366715]                   И ←
  1507376[164366331]                   Выражение ←
  1507455[164366285]                     Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164367303]                       Уточняющий параметр ≡ Цена старая оптовая ∙ 359[15007766] ←
  1638479[164364684]                     Не равно ←
  1638402[164365798]                     NULL ←
 30867466[164366333]                 Выполнить после получения записи ←
 11010080[164375424]                   = ≡ Цвет шрифта ∙ 65545[164367470] ←
      404[164401826]                     Результат ≡ Синий ∙ 30[917511] ←
 11010080[164375425]                   = ≡ Цена из мониторинга ∙ 65545[164368142] ←
      404[164401827]                     Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[164376827]                       Уточняющий параметр ≡ Цена старая закупочная ∙ 359[15007767] ←
 11010100[164364542]                   BREAK ←
 30867470[164367399]           IF ←
  1638463[164368316]             Условие ←
  1638460[164365644]               НЕ ←
      404[164401828]               Результат ≡ Цена из мониторинга ∙ 65545[164368142] ←
 30867472[164367384]             THEN ←
 39780366[164365365]               RETURN ≡ NULL ∙ 117[30670850] ←
 39780366[164365366]           RETURN ←
      404[164401829]             Результат ≡ Цена из мониторинга ∙ 65545[164368142] ←
      590[164365097]       Поле (колонка), являющееся параметром объекта • Торговая марка ≡ Продукт ∙ 359[8] ←
      411[164370813]         Уточняющий параметр ≡ Торговая марка ∙ 305[2818049] ←
      411[164370814]           Уточняющий параметр ≡ Наименование ∙ 296[6] ←
      590[164364799]       Поле (колонка), являющееся параметром объекта • Категория (продукт) ≡ Продукт ∙ 359[8] ←
  2621481[164364514]         Доступно (видимо), если: ≡ Обычный вид просмотра ∙ 117[164364982] ←
      326[164364505]         Минимально возможная ширина ⁼ 10 ←
      411[164370278]         Уточняющий параметр ≡ Допустимые типы скидки ∙ 305[34996227] ←
      411[164370283]           Уточняющий параметр ≡ Имя ∙ 249[262146] ←
  1507710[164364309]         Цвет фона ≡ Красный цвет категории ∙ 117[164364781] ←
      590[164365175]       Поле (колонка), являющееся параметром объекта • Дата изменения ≡ Дата счета-фактуры ∙ 359[42401811] ←
      326[164364522]         Минимально возможная ширина ⁼ 15 ←
      590[164365176]       Поле (колонка), являющееся параметром объекта • Причина изменения ≡ Комментарий ∙ 359[42401830] ←
      326[164364523]         Минимально возможная ширина ⁼ 20 ←
      117[164364760]       Выражение • 90 или 99 копеек? ←
      116[164368719]         Выражение ←
  1638461[164365043]           Условный оператор (IF) ←
  1638463[164368180]             Условие ←
      116[164368720]               Выражение ←
      404[164400128]                 Результат ≡ MOD (остаток от деления, дробные) ∙ 249[164364302] ←
 32505862[164368926]                   Значения формальных параметров при вызове ←
 32505860[164373934]                     Значение параметра при вызове процедуры/функции ≡ Делимое ∙ 65545[164365717] ←
   327700[164378216]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164373935]                     Значение параметра при вызове процедуры/функции ≡ Делитель ∙ 65545[164365721] ←
   327700[164378217]                       Выражение ⁼ 1 ←
  1638473[164367100]                 Равно ←
      404[164400129]                 Результат ⁼ -0.01 ←
      412[164364932]               ИЛИ ←
      116[164368721]               Выражение ←
      404[164400130]                 Результат ≡ MOD (остаток от деления, дробные) ∙ 249[164364302] ←
 32505862[164368927]                   Значения формальных параметров при вызове ←
 32505860[164373936]                     Значение параметра при вызове процедуры/функции ≡ Делимое ∙ 65545[164365717] ←
   327700[164378218]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164373937]                     Значение параметра при вызове процедуры/функции ≡ Делитель ∙ 65545[164365721] ←
   327700[164378219]                       Выражение ⁼ 1 ←
  1638473[164367101]                 Равно ←
      404[164400134]                 Результат ⁼ -0.10 ←
      105[164365046]             То ←
      404[164400132]               Результат ⁼ 0 ←
      424[164364991]             Иначе ←
      404[164400133]               Результат ⁼ 1 ←
      117[164364772]       Выражение • Можно редактировать цену? ≡ bool ∙ 107[1507344] ←
  1638461[164364675]         Условный оператор (IF) ←
  1638463[164366054]           Условие ←
      116[164365869]             Выражение ←
  1638460[164365327]               НЕ ←
      404[164382788]               Результат ≡ Нельзя редактировать цену? ∙ 117[164364773] ←
      105[164364682]           То ←
      404[164382802]             Результат ⁼ 1 ←
      424[164364660]           Иначе ←
      404[164382803]             Результат ⁼ 0 ←
      117[164364773]       Выражение • Нельзя редактировать цену? ≡ bool ∙ 107[1507344] ←
  1638461[164364676]         Условный оператор (IF) ←
  1638463[164366055]           Условие ←
      116[164365872]             Выражение ←
      404[164382794]               Результат ≡ Категория ∙ 359[42401804] ←
  1638473[164365571]               Равно ←
      404[164382795]               Результат ≡ Нет ∙ 131203075[131203073] ←
      412[164365176]             ИЛИ ←
      116[164365873]             Выражение ←
      404[164382796]               Результат ≡ Родитель ∙ 359[2] ←
  1638479[164365570]               Не равно ←
      404[164382797]               Результат ≡ NULL ∙ 117[30670850] ←
      412[164364565]             ИЛИ ←
      116[164365935]             Выражение ←
      404[164383201]               Результат ≡ Продукт ∙ 359[8] ←
      411[164370287]                 Уточняющий параметр ≡ Допустимые типы скидки ∙ 305[34996227] ←
  1638473[164365603]               Равно ←
      404[164383202]               Результат ≡ A ∙ 164364309[164364289] ←
      412[164364560]             ИЛИ ←
      116[164368019]             Выражение ←
      116[164366610]               Выражение ←
      404[164383198]                 Результат ≡ Продукт ∙ 359[8] ←
      411[164375977]                   Уточняющий параметр ≡ Допустимые типы скидки ∙ 305[34996227] ←
  1638473[164367009]                 Равно ←
      404[164383199]                 Результат ≡ B1 ∙ 164364309[164364292] ←
      413[164365207]               И ←
      404[164387509]               Результат ≡ Обычный вид просмотра ∙ 117[164364982] ←
      412[164364928]             ИЛИ ←
      116[164366611]             Выражение ←
      116[164366395]               Выражение ←
      116[164365934]                 Выражение ←
  1638460[164364910]                   НЕ ←
      404[164387518]                   Результат ≡ У пользователя есть права редактирования этого ДУЦ ∙ 117[164364855] ←
      412[164364659]                 ИЛИ ←
      116[164365874]                 Выражение ←
      404[164382798]                   Результат ≡ <<Документ>> ∙ 367[5] ←
      411[164370233]                     Уточняющий параметр ≡ Состояние документа ∙ 331[14] ←
  1638473[164365570]                   Равно ←
      404[164382799]                   Результат ⁼ 1 ←
      413[164365175]               И ←
      404[164382725]               Результат ≡ Обычный вид просмотра ∙ 117[164364982] ←
      412[164364845]             ИЛИ ←
      116[164368020]             Выражение ←
      404[164390201]               Результат ≡ ПРОМО ∙ 65545[164369878] ←
      413[164366200]               И ←
      116[164368021]               Выражение ←
  1638460[164365331]                 НЕ ←
      404[164395367]                 Результат ≡ Новинка? ∙ 249[164364384] ←
 32505862[164368232]                   Значения формальных параметров при вызове ←
 32505860[164372481]                     Значение параметра при вызове процедуры/функции ≡ Строка ДУЦ ∙ 65545[164369869] ←
   327700[164375954]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      412[164364964]             ИЛИ ←
      404[164392222]             Результат ≡ Строка действующего промо-реестра ∙ 65545[164371104] ←
      105[164364681]           То ←
      404[164382800]             Результат ⁼ 1 ←
      424[164364659]           Иначе ←
      404[164382801]             Результат ⁼ 0 ←
      117[164364777]       Выражение • Темносерый ≡ Объект ∙ 107[19] ←
  1638461[164364684]         Условный оператор (IF) ←
  1638463[164366118]           Условие ←
      404[164383196]             Результат ≡ <<Строка>> ∙ 367[6] ←
      413[164365208]             И ←
      116[164365937]             Выражение ←
      404[164383205]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164370301]                 Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[164370308]                   Уточняющий параметр ≡ Допустимые типы скидки ∙ 305[34996227] ←
  1638479[164364558]               Не равно ←
      404[164383206]               Результат ≡ A ∙ 164364309[164364289] ←
      105[164364690]           То ←
      404[164383197]             Результат ≡ Темносерый ∙ 30[917514] ←
      117[164364781]       Выражение • Красный цвет категории ≡ Объект ∙ 107[19] ←
  1638461[164364688]         Условный оператор (IF) ←
  1638463[164366114]           Условие ←
      116[164365925]             Выражение ←
      404[164383163]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164370289]                 Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[164370290]                   Уточняющий параметр ≡ Допустимые типы скидки ∙ 305[34996227] ←
  1638479[164364574]               Не равно ←
      404[164383162]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164370291]                 Уточняющий параметр ≡ Рейтинг ABC (Количество) ∙ 359[3342337] ←
      105[164364694]           То ←
      404[164383172]             Результат ≡ Красный ∙ 30[917510] ←
      117[164364783]       Выражение • Жирный шрифт итоговой наценки ≡ Объект ∙ 107[19] ←
  1638461[164364690]         Условный оператор (IF) ←
  1638463[164366134]           Условие ←
      116[164365960]             Выражение ←
      116[164366476]               Выражение ←
      404[164383311]                 Результат ≡ Наценка по приказу ∙ 65545[164368433] ←
      406[164364742]                 Вычесть ←
      404[164383309]                 Результат ≡ Наценка итоговая ∙ 65545[164367486] ←
  1638478[164364580]               Больше ←
      404[164383371]               Результат ⁼ 0.55 ←
      105[164364696]           То ←
      404[164383312]             Результат ≡ Arial Bold ∙ 262167[40370177] ←
      117[164364784]       Выражение • Красный цвет шрифта итоговой наценки ≡ Объект ∙ 107[19] ←
  1638461[164364694]         Условный оператор (IF) ←
  1638463[164366195]           Условие ←
      116[164366477]             Выражение ←
      116[164366478]               Выражение ←
      404[164386271]                 Результат ≡ Наценка по приказу ∙ 65545[164368433] ←
      406[164364743]                 Вычесть ←
      404[164386270]                 Результат ≡ Наценка итоговая ∙ 65545[164367486] ←
  1638478[164364578]               Больше ←
      404[164386506]               Результат ⁼ 0.55 ←
      105[164364700]           То ←
      404[164383703]             Результат ≡ Красный ∙ 30[917510] ←
      117[164364982]       Выражение • Обычный вид просмотра ≡ Целое ∙ 107[2] ←
      116[164368603]         Выражение ←
  1638460[164365497]           НЕ ←
      404[164399162]           Результат ≡ Вид просмотра нескольких ДУЦ ∙ 65545[164370630] ←
  1507530[164364304]     Виртуальные блоки ←
 30867469[164365610]       БЛОК • Расчет строки ←
 30867469[164365612]       БЛОК • Поиск строки мониторинга ←
 30867469[164365354]       БЛОК • Определение ПРОМО ←
 30867469[164365743]       БЛОК • Расчет закупочной цены (ВРД) ←
 30867469[164365793]       БЛОК • Расчет закупочной цены Д ←
  1507531[164364443]     Подстановки виртуальных блоков ←
 30867469[164365711]       БЛОК ≡ Определение ПРОМО ∙ 30867469[164365354] ←
 11010080[164371613]         = ≡ ПРОМО ∙ 65545[164369878] ←
      404[164390198]           Результат ≡ Есть ПРОМО на товар (период +20 дней) - ДУЦ ∙ 249[164364385] ←
 32505862[164368224]             Значения формальных параметров при вызове ←
 32505860[164369629]               Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164369870] ←
   327700[164371956]                 Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164372924]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 11010080[164375081]         = ≡ Строка промо-реестра ∙ 65545[164370264] ←
      404[164397022]           Результат ≡ Есть листовка на товар (период +27 дней) - ДУЦ ∙ 249[164364396] ←
 32505862[164368486]             Значения формальных параметров при вызове ←
 32505860[164373029]               Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164370258] ←
   327700[164376878]                 Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164375118]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 11010080[164376273]         = ≡ Строка действующего промо-реестра ∙ 65545[164371104] ←
      404[164383389]           Результат ≡ Есть акцептованная листовка на товар - ДУЦ ∙ 249[164364423] ←
 32505862[164369191]             Значения формальных параметров при вызове ←
 32505860[164374498]               Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164371101] ←
   327700[164379029]                 Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164370626]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 30867469[164365512]       БЛОК ≡ Расчет строки ∙ 30867469[164365610] ←
 11010105[164364473]         Индикатор ≡ Счетчик строк ∙ 65545[164368282] ←
 11010080[164371865]         = ≡ Есть в прайс-листе? ∙ 65545[164368271] ←
      404[164387021]           Результат ⁼ 0 ←
 11010080[164371608]         = ≡ Текущая розничная цена ∙ 65545[164368137] ←
  1638402[164365058]           NULL ←
 11010080[164371868]         = ≡ Итоговая розничная цена ∙ 65545[164367485] ←
  1638402[164365059]           NULL ←
 11010080[164371614]         = ≡ ПРОМО ∙ 65545[164369878] ←
      404[164390200]           Результат ≡ NULL ∙ 117[30670850] ←
 11010080[164376422]         = ≡ Строка действующего промо-реестра ∙ 65545[164371104] ←
      404[164392223]           Результат ≡ NULL ∙ 117[30670850] ←
 11010099[164364537]         CONTINUE ←
      116[164366124]           Выражение ←
      116[164366127]             Выражение ←
      404[164383350]               Результат ≡ Фильтр.Торговая марка ∙ 65545[164367857] ←
      413[164365320]             И ←
      116[164366128]             Выражение ←
  1638460[164364770]               НЕ ←
      404[164384746]               Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[164366459]                 Значения формальных параметров при вызове ←
 32505860[164368774]                   Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[164370761]                     Выражение ≡ Фильтр.Торговая марка ∙ 65545[164367857] ←
 32505860[164368775]                   Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[164370762]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164370816]                       Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[164370815]                         Уточняющий параметр ≡ Торговая марка ∙ 305[2818049] ←
 30867470[164366055]         IF ←
  1638463[164366577]           Условие ←
      404[164383701]             Результат ≡ Фильтр.ШК ∙ 65545[164368151] ←
 30867472[164366045]           THEN • Поиск ШК ←
 11010080[164371635]             = ≡ Флаг ШК ∙ 65545[164368152] ←
      404[164386507]               Результат ⁼ 0 ←
  1507360[164365203]             Отбор данных (по запросу) • ШК ≡ ПРОДУКТЫ ∙ 12124205[18546749] ←
 32505862[164366475]               Значения формальных параметров при вызове ←
 32505860[164369534]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Код (вхождение) ∙ 65545[18547178] ←
   327700[164371831]                   Выражение ≡ Фильтр.ШК ∙ 65545[164368151] ←
 32505860[164368799]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547184] ←
   327700[164370802]                   Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164364532]                     Список элементов ←
   327700[164371750]                       Выражение ≡ Штриховой код ∙ 306[14745604] ←
   327700[164371784]                       Выражение ≡ Весовой штриховой код ∙ 306[28835842] ←
 32505860[164369533]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510268] ←
   327700[164371785]                   Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164370474]                     Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 30867466[164365228]               Выполнить после получения записи ←
 11010080[164371634]                 = ≡ Флаг ШК ∙ 65545[164368152] ←
      404[164383702]                   Результат ⁼ 1 ←
 11010100[164364385]                 BREAK ←
 30867470[164366056]             IF ←
  1638463[164366578]               Условие ←
  1638460[164364851]                 НЕ ←
      404[164386511]                 Результат ≡ Флаг ШК ∙ 65545[164368152] ←
 30867472[164366046]               THEN ←
 11010099[164364503]                 CONTINUE ←
 11010080[164370528]         = ≡ Изменилась закупочная цена (или новый товар) ∙ 65545[164367580] ←
      404[164383251]           Результат ⁼ 0 ←
 11010080[164370360]         = ≡ Цвет фона ∙ 65545[164367481] ←
      404[164382722]           Результат ≡ NULL ∙ 117[30670850] ←
 11010080[164372268]         = ≡ Цвет фона кода ∙ 65545[164368565] ←
      404[164387508]           Результат ≡ NULL ∙ 117[30670850] ←
 11010080[164377577]         = ≡ Цвет шрифта ∙ 65545[164367470] ←
      404[164386033]           Результат ≡ NULL ∙ 117[30670850] ←
 11010080[164367674]         = ≡ Причина подсветки ∙ 65545[164372293] ←
      404[164373908]           Результат ≡ NULL ∙ 117[30670850] ←
 11010080[164370373]         = ≡ Наименование ∙ 65545[164367489] ←
      404[164382756]           Результат ≡ Строка.Продукт ∙ 1507335[1508517] ←
      411[164370226]             Уточняющий параметр ≡ Наименование ∙ 305[6] ←
 11010080[164375652]         = ≡ Текущая розничная цена ∙ 65545[164368137] ←
      404[164398746]           Результат ≡ Цена из ДУЦ на дату ∙ 249[164364356] ←
 32505862[164368755]             Значения формальных параметров при вызове ←
 32505860[164373633]               Значение параметра при вызове процедуры/функции ≡ Товар из реестра ∙ 65545[164368290] ←
   327700[164377726]                 Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164375824]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164374489]               Значение параметра при вызове процедуры/функции ≡ Строка ДУЦ ∙ 65545[164371100] ←
   327700[164379020]                 Выражение ≡ <<Строка>> ∙ 367[6] ←
 32505860[164373634]               Значение параметра при вызове процедуры/функции ≡ ДУЦ ∙ 65545[164369353] ←
   327700[164377727]                 Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164375825]                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
 32505860[164373637]               Значение параметра при вызове процедуры/функции ≡ Формат ценообразования ∙ 65545[164368299] ←
   327700[164377730]                 Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164375826]                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164376009]                     Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
 30867470[164367224]         IF ←
  1638463[164368081]           Условие ←
      116[164368605]             Выражение ←
  1638460[164365504]               НЕ ←
      404[164399169]               Результат ≡ Вид просмотра нескольких ДУЦ ∙ 65545[164370630] ←
 30867472[164367212]           THEN • Проверим, есть ли товар в спецификации, наценку ←
 30867470[164366144]             IF ←
  1638463[164366680]               Условие ←
      404[164387365]                 Результат ≡ <<Документ>> ∙ 367[5] ←
      411[164371878]                   Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638473[164365941]                 Равно ←
      404[164387366]                 Результат ≡ Формат "Ценообразование Стандарт" ∙ 117[164364814] ←
 30867472[164366134]               THEN ←
  1507360[164365296]                 Отбор данных (по запросу) • Спецификации ←
 12124200[164364379]                   From         (Таблицы) ←
 12124204[164364394]                     Таблица • Спецификация ≡ СПЕЦИФИКАЦИЯ ПОСТАВЩИКА ∙ 1507433[43122705] ←
 12124215[164364769]                   Where      (Ограничения на отбор данных) ←
  1507381[164364683]                     <Наследуемые ограничения> ←
      413[164365507]                     И ←
  1507376[164365373]                     Выражение ←
  1507455[164365348]                       Результат ≡ Спецификация ∙ 12124204[164364394] ←
  1507494[164365959]                         Уточняющий параметр ≡ ПРОДУКТ ∙ 1507443[43122766] ←
  1638473[164365942]                       Равно ←
  1507452[164365114]                       Константа ≡ <<Строка>> ∙ 367[6] ←
      411[164371886]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      413[164365508]                     И ←
  1507376[164365374]                     Выражение ←
  1507455[164365352]                       Результат ≡ Спецификация ∙ 12124204[164364394] ←
  1507494[164365960]                         Уточняющий параметр ≡ РЕГИОН ∙ 1507443[40043162] ←
  1638473[164365943]                       Равно ←
  1507452[164365115]                       Константа ⁼ '4:0:0:100016' ←
      413[164365818]                     И ←
  1507506[164364647]                       Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164364727]                         Если истинно выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164373100]                           Уточняющий параметр ≡ Список партнеров ∙ 331[43122691] ←
  1507376[164365595]                     Выражение ←
  1507506[164364646]                       Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164364726]                         Если истинно выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164373098]                           Уточняющий параметр ≡ Список партнеров ∙ 331[43122691] ←
  1507455[164365568]                       Результат ≡ Спецификация ∙ 12124204[164364394] ←
  1507494[164366276]                         Уточняющий параметр ≡ ПОСТАВЩИК ∙ 1507443[43122765] ←
  1638473[164366234]                       Равно ←
  1507452[164365265]                       Константа ≡ <<Документ>> ∙ 367[5] ←
      411[164373099]                         Уточняющий параметр ≡ Список партнеров ∙ 331[43122691] ←
      413[164365819]                     И ←
  1507506[164364649]                       Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164364743]                         Если истинно выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164373103]                           Уточняющий параметр ≡ Список партнеров 1 ∙ 331[43122692] ←
  1507376[164365596]                     Выражение ←
  1507506[164364648]                       Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164364742]                         Если истинно выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164373101]                           Уточняющий параметр ≡ Список партнеров 1 ∙ 331[43122692] ←
  1507455[164365569]                       Результат ≡ Спецификация ∙ 12124204[164364394] ←
  1507494[164366277]                         Уточняющий параметр ≡ ПОСТАВЩИК ∙ 1507443[43122765] ←
  1638479[164364886]                       Не равно ←
  1507452[164365266]                       Константа ≡ <<Документ>> ∙ 367[5] ←
      411[164373102]                         Уточняющий параметр ≡ Список партнеров 1 ∙ 331[43122692] ←
 12124213[164364588]                   Параметры ←
  1507335[164364863]                     Параметр • товар ≡ Спецификация ∙ 12124204[164364394] ←
  1507494[164365964]                       Уточняющий параметр ≡ ПРОДУКТ ∙ 1507443[43122766] ←
  1507335[164364864]                     Параметр • прайс-лист ≡ Спецификация ∙ 12124204[164364394] ←
  1507494[164365965]                       Уточняющий параметр ≡ ДОГОВОР ∙ 1507443[50659332] ←
  1507335[164364865]                     Параметр • цена ≡ Спецификация ∙ 12124204[164364394] ←
  1507494[164365966]                       Уточняющий параметр ≡ ЦЕНА ПОСТАВКИ ЗАК ∙ 1507443[43122767] ←
  1507335[164364847]                     Параметр • поставщик ≡ Спецификация ∙ 12124204[164364394] ←
  1507494[164365903]                       Уточняющий параметр ≡ ПОСТАВЩИК ∙ 1507443[43122765] ←
 30867466[164365476]                   Выполнить после получения записи ←
 11010099[164364598]                     CONTINUE ←
      116[164366563]                       Выражение ←
      116[164366773]                         Выражение ←
      116[164366564]                           Выражение ←
      404[164387367]                             Результат ≡ прайс-лист ∙ 1507335[164364864] ←
      411[164371924]                               Уточняющий параметр ≡ Признак 3 ∙ 331[6684706] ←
  1638473[164365946]                             Равно ←
      404[164387380]                             Результат ≡ Да ∙ 131203075[131203074] ←
      413[164365589]                           И ←
      116[164366679]                           Выражение ←
      404[164387721]                             Результат ≡ прайс-лист ∙ 1507335[164364864] ←
      411[164372001]                               Уточняющий параметр ≡ Контрагент ∙ 331[7] ←
  1638479[164364802]                             Не равно ←
      404[164388360]                             Результат ≡ ЦФО (Сеть супермаркетов Красный Яр) ∙ 117[656082726] ←
      412[164364656]                         ИЛИ ←
      116[164366569]                         Выражение ←
      404[164387381]                           Результат ≡ прайс-лист ∙ 1507335[164364864] ←
      411[164371925]                             Уточняющий параметр ≡ Признак 4 ∙ 331[6684707] ←
  1638473[164365947]                           Равно ←
      404[164387382]                           Результат ≡ Да ∙ 131203075[131203074] ←
 11010080[164372000]                     = ≡ Подразделение для розничных цен ∙ 65545[164368279] ←
      404[164387368]                       Результат ≡ Подразделение для ценообразования КЯ38 (для ускорения открытия ДУЦ) ∙ 117[164364811] ←
 11010080[164372019]                     = ≡ Наценка по приказу ∙ 65545[164368433] ←
  1638464[164364930]                       Ноль (0.0), если NULL ≡ Поиск наценки на товар (иерархический Товар/Поставщик(пГр-Гр)/MKU/Пгр/Гр/ЦФО) ∙ 249[57868335] ←
 32505862[164366996]                         Значения формальных параметров при вызове ←
 32505860[164369848]                           Значение параметра при вызове процедуры/функции ≡ ~Товар _func ∙ 65545[57869183] ←
   327700[164372243]                             Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164371927]                               Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164369852]                           Значение параметра при вызове процедуры/функции ≡ ~Ком подр-ие _func ∙ 65545[57869186] ←
   327700[164372244]                             Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164371926]                               Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
 32505860[164369859]                           Значение параметра при вызове процедуры/функции ≡ ~Поставщик _func ∙ 65545[57870122] ←
   327700[164372321]                             Выражение ≡ поставщик ∙ 1507335[164364847] ←
 11010080[164371999]                     = ≡ Есть в прайс-листе? ∙ 65545[164368271] ←
      404[164387383]                       Результат ⁼ 1 ←
 11010080[164372021]                     = ≡ Поставщик ∙ 65545[164368434] ←
      404[164387467]                       Результат ≡ поставщик ∙ 1507335[164364847] ←
 11010080[164372022]                     = ≡ Прайс ∙ 65545[164368435] ←
      404[164387468]                       Результат ≡ прайс-лист ∙ 1507335[164364864] ←
 11010080[164372041]                     = ≡ Закупочная цена ∙ 65545[164368135] ←
      404[164387531]                       Результат ≡ цена ∙ 1507335[164364865] ←
 11010100[164364397]                     BREAK ←
 30867470[164366145]             IF ←
  1638463[164366681]               Условие ←
  1638460[164364890]                 НЕ ←
      404[164387385]                 Результат ≡ Есть в прайс-листе? ∙ 65545[164368271] ←
 30867472[164366135]               THEN • Ищем по другим магазинам ←
  1507360[164365298]                 Отбор данных (по запросу) • Спецификации ←
 12124200[164364380]                   From         (Таблицы) ←
 12124204[164364395]                     Таблица • Спецификация ≡ СПЕЦИФИКАЦИЯ ПОСТАВЩИКА ∙ 1507433[43122705] ←
 12124215[164364770]                   Where      (Ограничения на отбор данных) ←
  1507381[164364684]                     <Наследуемые ограничения> ←
      413[164365509]                     И ←
  1507376[164365375]                     Выражение ←
  1507455[164365353]                       Результат ≡ Спецификация ∙ 12124204[164364395] ←
  1507494[164365967]                         Уточняющий параметр ≡ ПРОДУКТ ∙ 1507443[43122766] ←
  1638473[164365944]                       Равно ←
  1507452[164365116]                       Константа ≡ <<Строка>> ∙ 367[6] ←
      411[164371913]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      413[164365510]                     И ←
  1507376[164365376]                     Выражение ←
  1507455[164365354]                       Результат ≡ Спецификация ∙ 12124204[164364395] ←
  1507494[164365968]                         Уточняющий параметр ≡ РЕГИОН ∙ 1507443[40043162] ←
  1638473[164365945]                       Равно ←
  1507452[164365117]                       Константа ≡ Список подразделений с данным форматом ∙ 65545[164368136] ←
      413[164365816]                     И ←
  1507506[164364632]                       Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164364724]                         Если истинно выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164373096]                           Уточняющий параметр ≡ Список партнеров ∙ 331[43122691] ←
  1507376[164365580]                     Выражение ←
  1507506[164364630]                       Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164364722]                         Если истинно выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164373092]                           Уточняющий параметр ≡ Список партнеров ∙ 331[43122691] ←
  1507455[164365566]                       Результат ≡ Спецификация ∙ 12124204[164364395] ←
  1507494[164366274]                         Уточняющий параметр ≡ ПОСТАВЩИК ∙ 1507443[43122765] ←
  1638473[164366233]                       Равно ←
  1507452[164365263]                       Константа ≡ <<Документ>> ∙ 367[5] ←
      411[164373093]                         Уточняющий параметр ≡ Список партнеров ∙ 331[43122691] ←
      413[164365817]                     И ←
  1507506[164364645]                       Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164364725]                         Если истинно выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164373097]                           Уточняющий параметр ≡ Список партнеров 1 ∙ 331[43122692] ←
  1507376[164365581]                     Выражение ←
  1507506[164364631]                       Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[164364723]                         Если истинно выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164373094]                           Уточняющий параметр ≡ Список партнеров 1 ∙ 331[43122692] ←
  1507455[164365567]                       Результат ≡ Спецификация ∙ 12124204[164364395] ←
  1507494[164366275]                         Уточняющий параметр ≡ ПОСТАВЩИК ∙ 1507443[43122765] ←
  1638479[164364885]                       Не равно ←
  1507452[164365264]                       Константа ≡ <<Документ>> ∙ 367[5] ←
      411[164373095]                         Уточняющий параметр ≡ Список партнеров 1 ∙ 331[43122692] ←
 12124213[164364589]                   Параметры ←
  1507335[164364866]                     Параметр • товар ≡ Спецификация ∙ 12124204[164364395] ←
  1507494[164365969]                       Уточняющий параметр ≡ ПРОДУКТ ∙ 1507443[43122766] ←
  1507335[164364867]                     Параметр • прайс-лист ≡ Спецификация ∙ 12124204[164364395] ←
  1507494[164365970]                       Уточняющий параметр ≡ ДОГОВОР ∙ 1507443[50659332] ←
  1507335[164364868]                     Параметр • цена ≡ Спецификация ∙ 12124204[164364395] ←
  1507494[164365971]                       Уточняющий параметр ≡ ЦЕНА ПОСТАВКИ ЗАК ∙ 1507443[43122767] ←
  1507335[164364869]                     Параметр • цо ≡ Спецификация ∙ 12124204[164364395] ←
  1507494[164365972]                       Уточняющий параметр ≡ РЕГИОН ∙ 1507443[40043162] ←
  1507335[164364848]                     Параметр • поставщик ≡ Спецификация ∙ 12124204[164364395] ←
  1507494[164365904]                       Уточняющий параметр ≡ ПОСТАВЩИК ∙ 1507443[43122765] ←
 30867466[164365478]                   Выполнить после получения записи ←
 11010099[164364599]                     CONTINUE ←
      116[164366570]                       Выражение ←
      116[164366774]                         Выражение ←
      116[164366775]                           Выражение ←
      404[164388361]                             Результат ≡ прайс-лист ∙ 1507335[164364867] ←
      411[164372190]                               Уточняющий параметр ≡ Признак 3 ∙ 331[6684706] ←
  1638473[164365966]                             Равно ←
      404[164388362]                             Результат ≡ Да ∙ 131203075[131203074] ←
      413[164365590]                           И ←
      116[164366776]                           Выражение ←
      404[164388363]                             Результат ≡ прайс-лист ∙ 1507335[164364867] ←
      411[164372191]                               Уточняющий параметр ≡ Контрагент ∙ 331[7] ←
  1638479[164364804]                             Не равно ←
      404[164388364]                             Результат ≡ ЦФО (Сеть супермаркетов Красный Яр) ∙ 117[656082726] ←
      412[164364657]                         ИЛИ ←
      116[164366572]                         Выражение ←
      404[164387371]                           Результат ≡ прайс-лист ∙ 1507335[164364867] ←
      411[164371912]                             Уточняющий параметр ≡ Признак 4 ∙ 331[6684707] ←
  1638473[164365949]                           Равно ←
      404[164387372]                           Результат ≡ Да ∙ 131203075[131203074] ←
 11010080[164372002]                     = ≡ ЦО данного формата ∙ 65545[164368280] ←
      404[164387373]                       Результат ≡ цо ∙ 1507335[164364869] ←
 11010080[164372003]                     = ≡ Первый ТЗ ∙ 65545[164368133] ←
      404[164387374]                       Результат ≡ Первый ТЗ/ПЦ для ЦО/ТТ/Узла (действ. магазины) ∙ 249[655294491] ←
 32505862[164366993]                         Значения формальных параметров при вызове ←
 32505860[164369854]                           Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[655298326] ←
   327700[164372247]                             Выражение ≡ ЦО данного формата ∙ 65545[164368280] ←
 11010080[164372004]                     = ≡ Подразделение для розничных цен ∙ 65545[164368279] ←
      404[164387375]                       Результат ≡ Первый ТЗ ∙ 65545[164368133] ←
      411[164371917]                         Уточняющий параметр ≡ Подразделение для назначения цен ∙ 283[42401850] ←
 11010080[164372020]                     = ≡ Наценка по приказу ∙ 65545[164368433] ←
  1638464[164364931]                       Ноль (0.0), если NULL ≡ Поиск наценки на товар (иерархический Товар/Поставщик(пГр-Гр)/MKU/Пгр/Гр/ЦФО) ∙ 249[57868335] ←
 32505862[164366998]                         Значения формальных параметров при вызове ←
 32505860[164369860]                           Значение параметра при вызове процедуры/функции ≡ ~Товар _func ∙ 65545[57869183] ←
   327700[164372323]                             Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164371928]                               Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164369861]                           Значение параметра при вызове процедуры/функции ≡ ~Ком подр-ие _func ∙ 65545[57869186] ←
   327700[164372324]                             Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164371929]                               Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
 32505860[164369876]                           Значение параметра при вызове процедуры/функции ≡ ~Поставщик _func ∙ 65545[57870122] ←
   327700[164372325]                             Выражение ≡ поставщик ∙ 1507335[164364848] ←
 11010080[164372006]                     = ≡ Есть в прайс-листе? ∙ 65545[164368271] ←
      404[164387384]                       Результат ⁼ 1 ←
 11010080[164372023]                     = ≡ Поставщик ∙ 65545[164368434] ←
      404[164387469]                       Результат ≡ поставщик ∙ 1507335[164364848] ←
 11010080[164372024]                     = ≡ Прайс ∙ 65545[164368435] ←
      404[164387470]                       Результат ≡ прайс-лист ∙ 1507335[164364867] ←
 11010080[164372040]                     = ≡ Закупочная цена ∙ 65545[164368135] ←
      404[164387524]                       Результат ≡ цена ∙ 1507335[164364868] ←
 11010100[164364398]                     BREAK ←
 30867470[164366123]             IF ←
  1638463[164366687]               Условие ←
      404[164387440]                 Результат ≡ Наценка по приказу ∙ 65545[164368433] ←
  1638479[164364740]                 Не равно ←
      404[164387441]                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164370347]                   Уточняющий параметр ≡ Наценка ∙ 359[15138829] ←
 30867472[164366145]               THEN ←
 11010088[164366589]                 ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[164364540]                   Объект ≡ <<Строка>> ∙ 367[6] ←
      377[164364610]                   Начальные значения полей объекта ←
   131095[164365491]                     Начальное значение поля ≡ Наценка ∙ 359[15138829] ←
   327700[164372327]                       Выражение ≡ Наценка по приказу ∙ 65545[164368433] ←
 30867470[164366102]             IF ←
  1638463[164366636]               Условие ←
      116[164366500]                 Выражение ←
  1638460[164364865]                   НЕ ←
      404[164387020]                   Результат ≡ Есть в прайс-листе? ∙ 65545[164368271] ←
 30867472[164366092]               THEN • Делаем строку скрытой ←
 11010088[164366543]                 ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[164364530]                   Объект ≡ <<Строка>> ∙ 367[6] ←
      377[164364592]                   Начальные значения полей объекта ←
   131095[164365431]                     Начальное значение поля ≡ Категория ∙ 359[42401804] ←
   327700[164372107]                       Выражение ≡ Нет ∙ 131203075[131203073] ←
   131095[164365432]                     Начальное значение поля ≡ Реальная приходная накладная ∙ 359[15925249] ←
   327700[164372108]                       Выражение ≡ NULL ∙ 117[30670850] ←
   131095[164365437]                     Начальное значение поля ≡ Предпочтительный поставщик ∙ 359[15204353] ←
   327700[164372113]                       Выражение ≡ NULL ∙ 117[30670850] ←
   131095[164365598]                     Начальное значение поля ≡ Дата оплаты ∙ 359[6684690] ←
   327700[164373748]                       Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 11010099[164364591]                 CONTINUE ←
  1507728[172097639]                 Начало многострочного комментария • проверка появятся ли строки ←
  1507729[172097638]                 Конец многострочного комментария ←
 30867473[164365018]               ELSE • Если строка была раньше скрыта - оживляем ←
 30867470[164366147]                 IF ←
  1638463[164366688]                   Условие ←
      404[164387442]                     Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164370364]                       Уточняющий параметр ≡ Категория ∙ 359[42401804] ←
  1638473[164365903]                     Равно ←
      404[164387443]                     Результат ≡ Нет ∙ 131203075[131203073] ←
 30867472[164366113]                   THEN ←
 11010088[164366597]                     ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[164364551]                       Объект ≡ <<Строка>> ∙ 367[6] ←
      377[164364613]                       Начальные значения полей объекта ←
   131095[164365450]                         Начальное значение поля ≡ Категория ∙ 359[42401804] ←
   327700[164372326]                           Выражение ≡ NULL ∙ 117[30670850] ←
   131095[164365493]                         Начальное значение поля ≡ Реальная приходная накладная ∙ 359[15925249] ←
   327700[164372328]                           Выражение ≡ Прайс ∙ 65545[164368435] ←
   131095[164365494]                         Начальное значение поля ≡ Цена закупочная ∙ 359[15007745] ←
   327700[164372329]                           Выражение ≡ Закупочная цена ∙ 65545[164368135] ←
   131095[164365498]                         Начальное значение поля ≡ Предпочтительный поставщик ∙ 359[15204353] ←
   327700[164372333]                           Выражение ≡ Поставщик ∙ 65545[164368434] ←
   131095[164365599]                         Начальное значение поля ≡ Дата оплаты ∙ 359[6684690] ←
   327700[164373749]                           Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 30867470[164366430]                     IF ←
  1638463[164367053]                       Условие ←
      404[164391051]                         Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164372997]                           Уточняющий параметр ≡ Маркировать ∙ 359[28835848] ←
  1638473[164366198]                         Равно ←
      404[164391052]                         Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[164366420]                       THEN ←
 11010088[164366787]                         ВЫПОЛНИТЬ ≡ Объект.Деакцепт ∙ 249[1507435] ←
 30867474[164364614]                           Объект ≡ <<Документ>> ∙ 367[5] ←
 30867470[164366148]             IF ←
  1638463[164366684]               Условие ←
      404[164387377]                 Результат ≡ Текущая розничная цена ∙ 65545[164368137] ←
 30867472[164366138]               THEN ←
 30867470[164366149]                 IF ←
  1638463[164366685]                   Условие ←
      404[164387378]                     Результат ≡ Текущая розничная цена ∙ 65545[164368137] ←
  1638479[164364734]                     Не равно ←
      404[164387379]                     Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164371923]                       Уточняющий параметр ≡ Цена продажная (фактическая) ∙ 359[15007748] ←
 30867472[164366139]                   THEN ←
 11010088[164366592]                     ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[164364552]                       Объект ≡ <<Строка>> ∙ 367[6] ←
      377[164364611]                       Начальные значения полей объекта ←
   131095[164365468]                         Начальное значение поля ≡ Цена продажная (фактическая) ∙ 359[15007748] ←
   327700[164372306]                           Выражение ≡ Текущая розничная цена ∙ 65545[164368137] ←
 11010080[164370482]         = ≡ Сортировка (-2 - требует расчета, -1 - помечено к созданию партионных строк, 0 - норм, 1 - относится к другому ДУЦ) ∙ 65545[164367490] ←
      404[164383117]           Результат ⁼ 0 ←
 30867470[164365607]         IF ←
  1638463[164366050]           Условие ←
      404[164382723]             Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164370138]               Уточняющий параметр ≡ Бартер ∙ 359[40566785] ←
  1638473[164365565]             Равно ←
      404[164382724]             Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[164365597]           THEN • Сортировка - в самый верх. И сразу выделяем ←
 30867470[164365667]             IF ←
  1638463[164366123]               Условие ←
      116[164365940]                 Выражение ←
      404[164383211]                   Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164370304]                     Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[164370307]                       Уточняющий параметр ≡ Допустимые типы скидки ∙ 305[34996227] ←
  1638479[164364577]                   Не равно ←
      404[164383212]                   Результат ≡ A ∙ 164364309[164364289] ←
 30867472[164365657]               THEN ←
 11010080[164370561]                 = ≡ Сортировка (-2 - требует расчета, -1 - помечено к созданию партионных строк, 0 - норм, 1 - относится к другому ДУЦ) ∙ 65545[164367490] ←
      404[164383318]                   Результат ⁼ 0 ←
  1507418[164364305]                 Добавить в таблицу ≡ ВЫБРАННЫЕ СТРОКИ ∙ 1507433[40042581] ←
  1507571[164364313]                   Начальные значения полей объекта ←
  1507573[164364328]                     Начальное значение поля ≡ СТРОКА ∙ 1507443[40042995] ←
   327700[164370805]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
 11010080[164370483]             = ≡ Изменилась закупочная цена (или новый товар) ∙ 65545[164367580] ←
      404[164383249]               Результат ⁼ 1 ←
 30867470[164365601]         IF ←
  1638463[164366044]           Условие ←
      404[164382495]             Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164370215]               Уточняющий параметр ≡ Маркировать ∙ 359[28835848] ←
  1638473[164365556]             Равно ←
      404[164382496]             Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[164365591]           THEN ←
 30867470[164365735]             IF ←
  1638463[164366200]               Условие ←
      116[164366021]                 Выражение ←
      404[164383707]                   Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164370430]                     Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[164370431]                       Уточняющий параметр ≡ Допустимые типы скидки ∙ 305[34996227] ←
  1638479[164364600]                   Не равно ←
      404[164383708]                   Результат ≡ A ∙ 164364309[164364289] ←
 30867472[164365725]               THEN ←
 11010080[164370339]                 = ≡ Цвет фона ∙ 65545[164367481] ←
      404[164382666]                   Результат ≡ Желтый ∙ 30[917509] ←
 11010080[164372270]                 = ≡ Цвет фона кода ∙ 65545[164368565] ←
      404[164388332]                   Результат ≡ Желтый ∙ 30[917509] ←
 11010080[164367061]                 = ≡ Причина подсветки ∙ 65545[164372293] ←
      404[164373909]                   Результат ⁼ 'Изменение цены' ←
 11010080[164370499]                 = ≡ Сортировка (-2 - требует расчета, -1 - помечено к созданию партионных строк, 0 - норм, 1 - относится к другому ДУЦ) ∙ 65545[164367490] ←
      404[164383129]                   Результат ⁼ 0 ←
 30867470[164364919]         IF ←
  1638463[164365112]           Условие ←
      404[164374357]             Результат ≡ Проверка блокировки товара (ДУЦ) ∙ 249[164364357] ←
 32505862[164366939]               Значения формальных параметров при вызове ←
 32505860[164369779]                 Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164365807] ←
   327700[164372142]                   Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164367515]                     Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[164364756]             Равно ←
      404[164374348]             Результат ⁼ 1 ←
 30867472[164364913]           THEN • Подсвечиваем (но уже не запрещаем редактировать) ←
 11010080[164372117]             = ≡ Цвет фона ∙ 65545[164367481] ←
      404[164387156]               Результат ≡ Белый ∙ 30[917506] ←
 11010080[164377576]             = ≡ Цвет шрифта ∙ 65545[164367470] ←
      404[164386032]               Результат ≡ Серый ∙ 30[917512] ←
 30867470[164365730]         IF ←
  1638463[164366194]           Условие ←
      404[164383696]             Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164370473]               Уточняющий параметр ≡ Категория ∙ 359[42401804] ←
  1638473[164365652]             Равно ←
      404[164383697]             Результат ≡ Нет ∙ 131203075[131203073] ←
 30867472[164365720]           THEN ←
 11010080[164370678]             = ≡ Цвет фона ∙ 65545[164367481] ←
      404[164383698]               Результат ≡ Светлосерый ∙ 30[917516] ←
 11010080[164370679]             = ≡ Сортировка (-2 - требует расчета, -1 - помечено к созданию партионных строк, 0 - норм, 1 - относится к другому ДУЦ) ∙ 65545[164367490] ←
      404[164383700]               Результат ⁼ 1 ←
 11010080[164370366]         = ≡ Итоговая розничная цена ∙ 65545[164367485] ←
      404[164382738]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164368525]             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 30867470[164366877]         IF ←
  1638463[164367635]           Условие ←
      404[164395293]             Результат ≡ Новинка? ∙ 249[164364384] ←
 32505862[164368221]               Значения формальных параметров при вызове ←
 32505860[164372462]                 Значение параметра при вызове процедуры/функции ≡ Строка ДУЦ ∙ 65545[164369869] ←
   327700[164375929]                   Выражение ≡ <<Строка>> ∙ 367[6] ←
 30867472[164366866]           THEN ←
 11010080[164374554]             = ≡ Цвет фона ∙ 65545[164367481] ←
      404[164395294]               Результат ≡ Blue ∙ 30[4587530] ←
 30867470[164367219]         IF ←
  1638463[164368076]           Условие ←
      116[164365870]             Выражение ←
      404[164382789]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164370227]                 Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[164370232]                   Уточняющий параметр ≡ Допустимые типы скидки ∙ 305[34996227] ←
  1638473[164365568]               Равно ←
      404[164382791]               Результат ≡ B1 ∙ 164364309[164364292] ←
      413[164365174]             И ←
      116[164365871]             Выражение ←
      404[164382792]               Результат ≡ Цвет фона ∙ 65545[164367481] ←
  1638479[164364559]               Не равно ←
      404[164382793]               Результат ≡ Белый ∙ 30[917506] ←
      413[164365515]             И ←
      116[164368604]             Выражение ←
  1638460[164365503]               НЕ ←
      404[164399168]               Результат ≡ Вид просмотра нескольких ДУЦ ∙ 65545[164370630] ←
 30867472[164367207]           THEN ←
 11010080[164375864]             = ≡ Цвет фона ∙ 65545[164367481] ←
      404[164382790]               Результат ≡ Orange ∙ 30[4587532] ←
 30867470[171311346]         IF ←
  1638463[171311417]           Условие ←
      116[171311166]             Выражение ←
      116[171311163]               Выражение ←
      404[171313897]                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[171311192]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[171311193]                     Уточняющий параметр ≡ Допустимые типы скидки ∙ 305[34996227] ←
  1638473[171311836]                 Равно ←
      404[171313898]                 Результат ≡ A ∙ 164364309[164364289] ←
      412[171311242]               ИЛИ ←
      116[171311411]               Выражение ←
      404[171313903]                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[171311971]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[171311972]                     Уточняющий параметр ≡ Допустимые типы скидки ∙ 305[34996227] ←
  1638473[171311837]                 Равно ←
      404[171313904]                 Результат ≡ B ∙ 164364309[164364290] ←
      413[171311132]             И ←
      116[171311164]             Выражение ←
      404[171313899]               Результат ≡ Цвет фона ∙ 65545[164367481] ←
  1638479[171311183]               Не равно ←
      404[171313900]               Результат ≡ Белый ∙ 30[917506] ←
      413[171311172]             И ←
      116[171311165]             Выражение ←
  1638460[171311199]               НЕ ←
      404[171313901]               Результат ≡ Вид просмотра нескольких ДУЦ ∙ 65545[164370630] ←
 30867472[171311355]           THEN ←
 11010080[171311719]             = ≡ Цвет фона ∙ 65545[164367481] ←
      404[171313902]               Результат ≡ Red_soft ∙ 30[4587533] ←
 11010080[164372036]         = ≡ Приказ на выделение товаров с постоянной ценой ∙ 65545[164367743] ←
      404[164386133]           Результат ≡ Поиск приказа на назначение постоянной цены ∙ 249[164364351] ←
 32505862[164366461]             Значения формальных параметров при вызове ←
 32505860[164368780]               Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164367744] ←
   327700[164370797]                 Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164370427]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1507410[164365406]         ВЫПОЛНИТЬ БЛОК ≡ Определение ПРОМО ∙ 30867469[164365354] ←
 30867470[164365770]         IF ←
  1638463[164366221]           Условие ←
      404[164387507]             Результат ≡ Приказ на выделение товаров с постоянной ценой ∙ 65545[164367743] ←
      412[164364844]             ИЛИ ←
      404[164390197]             Результат ≡ ПРОМО ∙ 65545[164369878] ←
      412[164364963]             ИЛИ ←
      404[164392221]             Результат ≡ Строка действующего промо-реестра ∙ 65545[164371104] ←
 30867472[164365760]           THEN ←
 11010080[164370858]             = ≡ Цвет фона ∙ 65545[164367481] ←
      404[164383933]               Результат ≡ Зеленый ∙ 30[917507] ←
  1507728[164364831]             Начало многострочного комментария ←
 11010088[164367535]             ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164365582]               Выражение ←
      404[164397577]                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164375317]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      404[164397578]                 Результат ⁼ ; ←
      404[164397574]                 Результат ≡ ПРОМО ∙ 65545[164369878] ←
      404[164397579]                 Результат ⁼ ; ←
      404[164397575]                 Результат ≡ Приказ на выделение товаров с постоянной ценой ∙ 65545[164367743] ←
      404[164397580]                 Результат ⁼ ; ←
      404[164397576]                 Результат ≡ Строка промо-реестра ∙ 65545[164370264] ←
  1507729[164364831]             Конец многострочного комментария ←
 30867470[164365255]             IF ←
  1638463[164365569]               Условие ←
  1638460[164365351]                 НЕ ←
      404[164372018]                 Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[164368260]                   Значения формальных параметров при вызове ←
 32505860[164372548]                     Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[164376055]                       Выражение ≡ Группы ФРОВ + Зелень ∙ 117[656081721] ←
 32505860[164372549]                     Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[164376056]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164371795]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[164374658]                           Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[164374661]                             Уточняющий параметр ≡ Родитель ∙ 296[2] ←
 30867472[164365247]               THEN ←
 11010080[164374530]                 = ≡ Итоговая розничная цена ∙ 65545[164367485] ←
      404[164395079]                   Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164374657]                     Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 11010080[164374531]                 = ≡ Итоговая розничная цена ∙ 65545[164367485] ←
      404[164395080]                   Результат ≡ Текущая розничная цена ∙ 65545[164368137] ←
 30867470[164366985]         IF ←
  1638463[164367772]           Условие ←
      404[164397025]             Результат ≡ Строка промо-реестра ∙ 65545[164370264] ←
 30867472[164366974]           THEN ←
 11010080[164375082]             = ≡ Цвет фона ∙ 65545[164367481] ←
      404[164397026]               Результат ≡ Зеленый ∙ 30[917507] ←
 11010080[164370367]         = ≡ Наценка итоговая ∙ 65545[164367486] ←
      116[164365863]           Выражение ←
  1638461[164364691]             Условный оператор (IF) ←
  1638463[164366156]               Условие ←
      404[164383440]                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164370219]                   Уточняющий параметр ≡ Цена закупочная ∙ 359[15007745] ←
      105[164364697]               То ←
      116[164365977]                 Выражение ←
      116[164365864]                   Выражение ←
      404[164382739]                     Результат ≡ Итоговая розничная цена ∙ 65545[164367485] ←
      402[164364359]                     Делить ←
      404[164382740]                     Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164370201]                       Уточняющий параметр ≡ Цена закупочная ∙ 359[15007745] ←
      406[164364684]                   Вычесть ←
      404[164382741]                   Результат ⁼ 1 ←
      403[164364434]                 Умножить ←
      404[164382742]                 Результат ⁼ 100 ←
      424[164364671]               Иначе ←
      404[164383441]                 Результат ⁼ 0 ←
 11010080[164370496]         = ≡ Категория ∙ 65545[164367558] ←
      404[164382755]           Результат ≡ Строка.Продукт ∙ 1507335[1508517] ←
      411[164370223]             Уточняющий параметр ≡ Допустимые типы скидки ∙ 305[34996227] ←
 11010080[164371606]         = ≡ Торговая марка (для сортировки) ∙ 65545[164368134] ←
      404[164386496]           Результат ≡ Строка.Продукт ∙ 1507335[1508517] ←
      411[164371547]             Уточняющий параметр ≡ Торговая марка ∙ 305[2818049] ←
      411[164371548]               Уточняющий параметр ≡ Наименование ∙ 296[6] ←
 11010080[164371607]         = ≡ Закупочная цена ∙ 65545[164368135] ←
      404[164386497]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164371549]             Уточняющий параметр ≡ Цена закупочная ∙ 359[15007745] ←
 11010080[164372269]         = ≡ Маржа ∙ 65545[164370632] ←
      404[164395365]           Результат ≡ Итоговая розничная цена ∙ 65545[164367485] ←
      406[164365069]           Вычесть ←
      404[164395753]           Результат ≡ Закупочная цена ∙ 65545[164368135] ←
 11010080[164375870]         = ≡ Строка рейтинга ∙ 65545[164370641] ←
      404[164399165]           Результат ≡ Получить строку документа рейтинга для товара ∙ 249[164364374] ←
 32505862[164368793]             Значения формальных параметров при вызове ←
 32505860[164373709]               Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164369261] ←
   327700[164377811]                 Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164375983]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 11010080[164375871]         = ≡ Средние продажи ∙ 65545[164370631] ←
      404[164399166]           Результат ≡ Строка рейтинга ∙ 65545[164370641] ←
      411[164375984]             Уточняющий параметр ≡ Отпускная цена (категория 1) ∙ 359[42401820] ←
      402[164364552]           Делить ←
      404[164399167]           Результат ⁼ 14 ←
 11010079[164364537]         CASE ←
  1572877[164364570]           Условие ≡ Сортировка ∙ 65545[1510125] ←
 11010081[164365166]           OF ≡ По наименованию ∙ 1507640[164364291] ←
 11010080[164371236]             = ≡ Сортировка (основная) ∙ 65545[164368459] ←
      404[164384952]               Результат ≡ Наименование ∙ 65545[164367489] ←
 11010081[164365167]           OF ≡ По торговой марке ∙ 1507640[164364292] ←
 11010080[164371237]             = ≡ Сортировка (основная) ∙ 65545[164368459] ←
      404[164384953]               Результат ≡ Торговая марка (для сортировки) ∙ 65545[164368134] ←
 11010081[164365572]           OF ≡ По группе ∙ 1507640[164364317] ←
 11010080[164376081]             = ≡ Сортировка (основная) ∙ 65545[164368459] ←
      404[164399888]               Результат ≡ Строка.Продукт ∙ 1507335[1508517] ←
      411[164376187]                 Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[164376188]                   Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[164376189]                     Уточняющий параметр ≡ Наименование ∙ 296[6] ←
 11010081[164365168]           OF ≡ По ценовой категории (A,B,C) ∙ 1507640[164364293] ←
 11010080[164371238]             = ≡ Сортировка (основная) ∙ 65545[164368459] ←
      404[164384954]               Результат ≡ Категория ∙ 65545[164367558] ←
      411[164370914]                 Уточняющий параметр ≡ Имя ∙ 249[262146] ←
 11010081[164365169]           OF ≡ По закупочной цене ∙ 1507640[164364294] ←
 11010080[164371247]             = ≡ Сортировка (основная) ∙ 65545[164368459] ←
      404[164387557]               Результат ≡ Дополнить символами слева ∙ 387[1507468] ←
 32505862[164366681]                 Значения формальных параметров при вызове ←
 32505860[164369211]                   Значение параметра при вызове процедуры/функции ≡ Дополнить до длины ∙ 65545[1511659] ←
   327700[164370914]                     Выражение ⁼ 8 ←
 32505860[164369212]                   Значение параметра при вызове процедуры/функции ≡ Cимвол-заполнитель ∙ 65545[1511660] ←
   327700[164371052]                     Выражение ⁼ 0 ←
 32505860[164369213]                   Значение параметра при вызове процедуры/функции ≡ Выражение ∙ 65545[1511658] ←
   327700[164371390]                     Выражение ≡ Закупочная цена ∙ 65545[164368135] ←
 11010081[164365170]           OF ≡ Сложная сортировка (категория-ТМ-закуп-наименование) ∙ 1507640[164364295] ←
 11010080[164371248]             = ≡ Сортировка (основная) ∙ 65545[164368459] ←
      404[164385024]               Результат ⁼ '' ←
 30867473[164365020]           ELSE ←
 11010080[164376082]             = ≡ Сортировка (основная) ∙ 65545[164368459] ←
      404[164399889]               Результат ≡ Строка.Продукт ∙ 1507335[1508517] ←
      411[164376190]                 Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[164376191]                   Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[164376192]                     Уточняющий параметр ≡ Наименование ∙ 296[6] ←
 30867470[164367553]         IF ←
  1638463[164368496]           Условие ←
  1638460[164365593]             НЕ ←
      404[164403940]             Результат ≡ Проверка цены на корректность ввода ∙ 249[164364425] ←
 32505862[164369105]               Значения формальных параметров при вызове ←
 32505860[164374259]                 Значение параметра при вызове процедуры/функции ≡ Входная розничная цена ∙ 65545[164371546] ←
   327700[164378050]                   Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164374297]                 Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164371543] ←
   327700[164378145]                   Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164371402]                     Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 30867472[164367537]           THEN ←
 11010092[164364696]             Добавить в локальную таблицу ≡ Некорректные строки ∙ 30867458[164364563] ←
 30867473[164365473]           ELSE ←
 39780356[164364292]             Удалить из локальной таблицы ≡ Некорректные строки ∙ 30867458[164364563] ←
 11010092[164364443]         Добавить в локальную таблицу ≡ Строки ∙ 30867458[164364404] ←
 48431134[164364417]         ++ ≡ Счетчик строк ∙ 65545[164368282] ←
 30867469[164365613]       БЛОК ≡ Поиск строки мониторинга ∙ 30867469[164365612] ←
 30867470[164823469]         IF ←
  1638463[164823555]           Условие ←
  1638460[164823860]             НЕ ←
      404[164825555]             Результат ≡ Дата последнего акцепта ∙ 65545[164827280] ←
 30867472[164823464]           THEN ←
  1507360[164824023]             Отбор данных (по запросу) ≡ ПРОТОКОЛ ∙ 12124205[1507664] ←
 48431168[164823042]               Автоматический подбор индексов ≡ Нет ∙ 534[40566786] ←
  1507673[164823061]               Ключи оптимизации ←
  1507675[164823069]                 Использовать индекс ≡ ПРОТОКОЛ ∙ 12124204[1507881] ←
  1507676[164823067]                   Уточняющий параметр ≡ Объект ∙ 1507445[1507380] ←
 32505862[164824904]               Значения формальных параметров при вызове ←
 32505860[164824738]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Объект ∙ 65545[1510494] ←
   327700[164828327]                   Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164827764]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
 32505860[164825827]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата с ∙ 65545[1510504] ←
   327700[164828331]                   Выражение ≡ Добавить месяц к дате ∙ 249[164298778] ←
 32505862[164824112]                     Значения формальных параметров при вызове ←
 32505860[164825208]                       Значение параметра при вызове процедуры/функции ≡ ~Дата к которой добавить ∙ 65545[164299492] ←
   327700[164828332]                         Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 32505860[164825209]                       Значение параметра при вызове процедуры/функции ≡ ~Кол-во месяцев ∙ 65545[164299493] ←
   327700[164830414]                         Выражение ⁼ -3 ←
 32505860[164828991]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[1510496] ←
   327700[164831363]                   Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164823379]                     Список элементов ←
   327700[164831364]                       Выражение ≡ Акцепт объекта почтой ∙ 41746440[42401796] ←
   327700[164831366]                       Выражение ≡ Акцепт объекта ∙ 41746440[45940737] ←
 12124222[164823319]               Order By   (Сортировка) ←
  1507532[164823179]                 Сортировать по убыванию ≡ Дата ∙ 1507335[1508681] ←
 30867466[164824165]               Выполнить после получения записи ←
 11010080[164829264]                 = ≡ Дата последнего акцепта ∙ 65545[164827280] ←
      404[164840269]                   Результат ≡ Дата ∙ 1507335[1508681] ←
 11010100[164823192]                 BREAK ←
  1507728[171114814]         Начало многострочного комментария ←
  1507360[164366165]         Отбор данных (по запросу) • Мониторинг ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
 32505862[164368477]           Значения формальных параметров при вызове ←
 32505860[164373012]             Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547258] ←
   327700[164376855]               Выражение ≡ Прайс-листы конкурентов ∙ 332[28835935] ←
 32505860[164825205]             Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа начальная ∙ 65545[18547260] ←
   327700[164829493]               Выражение ≡ Добавить месяц к дате ∙ 249[164298778] ←
 32505862[164824109]                 Значения формальных параметров при вызове ←
 32505860[164825206]                   Значение параметра при вызове процедуры/функции ≡ ~Дата к которой добавить ∙ 65545[164299492] ←
   327700[164829494]                     Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 32505860[164825207]                   Значение параметра при вызове процедуры/функции ≡ ~Кол-во месяцев ∙ 65545[164299493] ←
   327700[164829495]                     Выражение ⁼ -3 ←
 32505860[164374382]             Значение параметра при вызове процедуры/функции ≡ Фильтр.Состояние ∙ 65545[11600041] ←
   327700[164376857]               Выражение ⁼ 1 ←
 12124215[164365207]           Where      (Ограничения на отбор данных) ←
  1507381[164365061]             <Наследуемые ограничения> ←
      413[164367048]             И ←
  1507376[164366702]             Выражение ←
  1507455[164366689]               Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164367782]                 Уточняющий параметр ≡ Передан в кассу ∙ 331[28835861] ←
  1638473[164367611]               Равно ←
  1507452[164365987]               Константа ≡ Нет ∙ 131203075[131203073] ←
      413[164367619]             И ←
  1507376[164367297]             Выражение ←
  1507376[164367298]               Выражение ←
  1507455[164367327]                 Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164368584]                   Уточняющий параметр ≡ Категория ∙ 331[42401833] ←
  1638473[164368314]                 Равно ←
  1507452[164366408]                 Константа ≡ Нет ∙ 131203075[131203073] ←
      412[164365199]               ИЛИ ←
  1507376[164367299]               Выражение ←
  1507455[164367328]                 Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164368585]                   Уточняющий параметр ≡ Категория ∙ 331[42401833] ←
  1638473[164368315]                 Равно ←
  1507452[164366409]                 Константа ≡ NULL ∙ 117[30670850] ←
 12124222[164364479]           Order By   (Сортировка) ←
  1507532[164364450]             Сортировать по убыванию ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164367781]               Уточняющий параметр ≡ Дата ∙ 331[8] ←
 30867466[164366474]           Выполнить после получения записи ←
 11010080[164377720]             = ≡ Строка мониторинга ∙ 65545[164371672] ←
  1638402[164365937]               NULL ←
 11010080[164377716]             = ≡ Документ мониторинга ∙ 65545[164371673] ←
      404[164396941]               Результат ≡ з.Документ ∙ 1507335[18547059] ←
 11010099[164365145]             CONTINUE ←
      116[164366694]               Выражение ←
      116[164369402]                 Выражение ←
  1638460[164365782]                   НЕ ←
      404[164396942]                   Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[164369598]                     Значения формальных параметров при вызове ←
 32505860[164375284]                       Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[164380091]                         Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164371539]                           Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
 32505860[164375285]                       Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[164380092]                         Выражение ≡ Документ мониторинга ∙ 65545[164371673] ←
      411[164377942]                           Уточняющий параметр ≡ Список партнеров ∙ 331[43122691] ←
      413[164367082]                 И ←
      116[164369458]                 Выражение ←
  1638460[164365810]                   НЕ ←
      404[164404736]                   Результат ≡ Пересечение множеств ∙ 387[1507545] ←
 32505862[164369131]                     Значения формальных параметров при вызове ←
 32505860[164373797]                       Значение параметра при вызове процедуры/функции ≡ Множество 1 ∙ 65545[1517763] ←
   327700[164371316]                         Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164378032]                           Уточняющий параметр ≡ Список подразделений ∙ 331[43122689] ←
 32505860[164373798]                       Значение параметра при вызове процедуры/функции ≡ Множество 2 ∙ 65545[1517764] ←
   327700[164371317]                         Выражение ≡ Документ мониторинга ∙ 65545[164371673] ←
      411[164378033]                           Уточняющий параметр ≡ Список партнеров ∙ 331[43122691] ←
  1507360[164366166]             Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[164369587]               Значения формальных параметров при вызове ←
 32505860[164375279]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164380085]                   Выражение ≡ Документ мониторинга ∙ 65545[164371673] ←
 32505860[164375286]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт ∙ 65545[1510111] ←
   327700[164380093]                   Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164371540]                     Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 12124215[164365206]               Where      (Ограничения на отбор данных) ←
  1507381[164364992]                 <Наследуемые ограничения> ←
      413[164367049]                 И ←
  1507376[164366701]                 Выражение ←
  1507455[164366688]                   Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164367780]                     Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[164366797]                   Равно ←
  1638402[164365934]                   NULL ←
 30867466[164366475]               Выполнить после получения записи ←
 11010080[164377744]                 = ≡ Строка мониторинга ∙ 65545[164371672] ←
      404[164396945]                   Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 30867470[164367637]                 IF ←
  1638463[164368628]                   Условие ←
      404[164405978]                     Результат ≡ Строка мониторинга ∙ 65545[164371672] ←
  1638479[164365212]                     Не равно ←
      404[164405979]                     Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164378240]                       Уточняющий параметр ≡ Дополнительная строка ∙ 359[11534337] ←
 30867472[164367620]                   THEN ←
 11010088[164368110]                     ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[164364807]                       Объект ≡ <<Строка>> ∙ 367[6] ←
      377[164364927]                       Начальные значения полей объекта ←
   131095[164366924]                         Начальное значение поля ≡ Дополнительная строка ∙ 359[11534337] ←
   327700[164380517]                           Выражение ≡ Строка мониторинга ∙ 65545[164371672] ←
 30867470[164824547]                 IF ←
  1638463[164824773]                   Условие ←
      404[164840268]                     Результат ≡ Документ мониторинга ∙ 65545[164371673] ←
      411[164827763]                       Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638477[164823363]                     Больше или равно ←
      404[164840270]                     Результат ≡ Дата последнего акцепта ∙ 65545[164827280] ←
 30867472[164824522]                   THEN ←
 11010080[164829265]                     = ≡ Цвет фона мониторинга ∙ 65545[164827281] ←
      404[164840271]                       Результат ≡ Серый_30 ∙ 30[4587526] ←
 30867473[164823881]                   ELSE ←
 11010080[164832473]                     = ≡ Цвет фона мониторинга ∙ 65545[164827281] ←
      404[164850238]                       Результат ≡ Цвет фона ∙ 65545[164367481] ←
 11010100[164364564]                 BREAK ←
 11010100[164364565]             BREAK ≡ Строка мониторинга ∙ 65545[164371672] ←
  1507729[171114814]         Конец многострочного комментария ←
 11010080[171118709]         = ≡ Строка мониторинга ∙ 65545[164371672] ←
  1638402[171115168]           NULL ←
  1507360[171115037]         Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
 12124213[171114989]           Параметры ←
  1507380[171114552]             <Наследуемые пункты> ←
  1507335[171115871]             Параметр • з.Документ.Дата ≡ ДОКУМЕНТЫ ∙ 12124204[1507791] ←
  1507494[171119060]               Уточняющий параметр ≡ Дата ∙ 331[8] ←
 32505862[171116693]           Значения формальных параметров при вызове ←
 32505860[171118638]             Значение параметра при вызове процедуры/функции ≡ Фильтр.Документ.Список типов ∙ 65545[1510110] ←
   327700[171120170]               Выражение ≡ Прайс-листы конкурентов ∙ 332[28835935] ←
 32505860[171118640]             Значение параметра при вызове процедуры/функции ≡ Фильтр.Документ.Дата начальная ∙ 65545[48432261] ←
   327700[171120173]               Выражение ≡ Добавить месяц к дате ∙ 249[164298778] ←
 32505862[171116694]                 Значения формальных параметров при вызове ←
 32505860[171118641]                   Значение параметра при вызове процедуры/функции ≡ ~Дата к которой добавить ∙ 65545[164299492] ←
   327700[171120174]                     Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 32505860[171118642]                   Значение параметра при вызове процедуры/функции ≡ ~Кол-во месяцев ∙ 65545[164299493] ←
   327700[171120175]                     Выражение ⁼ -3 ←
 32505860[171118639]             Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт ∙ 65545[1510111] ←
   327700[171120171]               Выражение ≡ <<Продукт>> ∙ 367[3] ←
 12124215[171115038]           Where      (Ограничения на отбор данных) ←
  1507381[171114718]             <Наследуемые ограничения> ←
  1507376[171117116]             Выражение ←
  1507455[171117335]               Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[171119052]                 Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[171116802]               Равно ←
  1638402[171115167]               NULL ←
  1507376[171117117]             Выражение ←
  1507455[171117336]               Результат ≡ ДОКУМЕНТЫ ∙ 12124204[1507791] ←
  1507494[171119053]                 Уточняющий параметр ≡ Состояние документа ∙ 331[14] ←
  1638473[171116803]               Равно ←
  1507452[171116282]               Константа ⁼ 1 ←
 12124222[171114634]           Order By   (Сортировка) ←
  1507465[171114564]             Блок (Сортировка с генерацией события) • Документ ←
  1507560[171114502]               Сортировать по убыванию ≡ з.Документ.Дата ∙ 1507335[171115871] ←
  1507559[171114604]               Сортировать по возрастанию ≡ Строка.Документ ∙ 1507335[1508505] ←
  1507467[171114561]           Выполнить перед обработкой блока ≡ Документ ∙ 1507465[171114564] ←
 11010080[171118708]             = ≡ Документ мониторинга ∙ 65545[164371673] ←
      404[171128640]               Результат ≡ Строка.Документ ∙ 1507335[1508505] ←
 11010099[171114671]             CONTINUE ←
      116[171115835]               Выражение ←
      116[171115836]                 Выражение ←
  1638460[171115037]                   НЕ ←
      404[171128641]                   Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[171116695]                     Значения формальных параметров при вызове ←
 32505860[171118643]                       Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[171120176]                         Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[171116637]                           Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
 32505860[171118644]                       Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[171120177]                         Выражение ≡ Документ мониторинга ∙ 65545[164371673] ←
      411[171116640]                           Уточняющий параметр ≡ Список партнеров ∙ 331[43122691] ←
      413[171114938]                 И ←
      116[171115837]                 Выражение ←
  1638460[171115038]                   НЕ ←
      404[171128642]                   Результат ≡ Пересечение множеств ∙ 387[1507545] ←
 32505862[171116696]                     Значения формальных параметров при вызове ←
 32505860[171118645]                       Значение параметра при вызове процедуры/функции ≡ Множество 1 ∙ 65545[1517763] ←
   327700[171120178]                         Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[171116641]                           Уточняющий параметр ≡ Список подразделений ∙ 331[43122689] ←
 32505860[171118646]                       Значение параметра при вызове процедуры/функции ≡ Множество 2 ∙ 65545[1517764] ←
   327700[171120179]                         Выражение ≡ Документ мониторинга ∙ 65545[164371673] ←
      411[171116642]                           Уточняющий параметр ≡ Список партнеров ∙ 331[43122691] ←
 30867466[171115074]           Выполнить после получения записи ←
 11010080[171118705]             = ≡ Строка мониторинга ∙ 65545[164371672] ←
      404[171128633]               Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 30867470[171115771]             IF ←
  1638463[171116078]               Условие ←
      404[171128634]                 Результат ≡ Строка мониторинга ∙ 65545[164371672] ←
  1638479[171114770]                 Не равно ←
      404[171128635]                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[171116638]                   Уточняющий параметр ≡ Дополнительная строка ∙ 359[11534337] ←
 30867472[171115765]               THEN ←
 11010088[171116228]                 ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[171114583]                   Объект ≡ <<Строка>> ∙ 367[6] ←
      377[171114597]                   Начальные значения полей объекта ←
   131095[171114953]                     Начальное значение поля ≡ Дополнительная строка ∙ 359[11534337] ←
   327700[171120172]                       Выражение ≡ Строка мониторинга ∙ 65545[164371672] ←
 30867470[171115772]             IF ←
  1638463[171116079]               Условие ←
      404[171128636]                 Результат ≡ Документ мониторинга ∙ 65545[164371673] ←
      411[171116639]                   Уточняющий параметр ≡ Дата ∙ 331[8] ←
  1638477[171114653]                 Больше или равно ←
      404[171128637]                 Результат ≡ Дата последнего акцепта ∙ 65545[164827280] ←
 30867472[171115766]               THEN ←
 11010080[171118706]                 = ≡ Цвет фона мониторинга ∙ 65545[164827281] ←
      404[171128638]                   Результат ≡ Серый_30 ∙ 30[4587526] ←
 30867473[171114852]               ELSE ←
 11010080[171118707]                 = ≡ Цвет фона мониторинга ∙ 65545[164827281] ←
      404[171128639]                   Результат ≡ Цвет фона ∙ 65545[164367481] ←
 11010100[171114569]             BREAK ←
  1507413[164364331]     Блоки действий ←
 30867469[164365210]       БЛОК • Выбор всех строк ←
  1507417[164364298]         Удалить из таблицы ≡ ВЫБРАННЫЕ СТРОКИ ∙ 1507433[40042581] ←
  1507360[164365241]         Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[164366867]           Значения формальных параметров при вызове ←
 32505860[164369592]             Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164371911]               Выражение ≡ <<Документ>> ∙ 367[5] ←
 12124215[164364745]           Where      (Ограничения на отбор данных) ←
  1507381[164364655]             <Наследуемые ограничения> ←
      413[164365277]             И ←
  1507376[164365324]             Выражение ←
  1507455[164365307]               Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164365916]                 Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[164365859]               Равно ←
  1638402[164365035]               NULL ←
 30867466[164365420]           Выполнить после получения записи ←
 11010105[164364480]             Индикатор ←
      116[164366065]               Выражение ←
      404[164386495]                 Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
  1507418[164364310]             Добавить в таблицу ≡ ВЫБРАННЫЕ СТРОКИ ∙ 1507433[40042581] ←
  1507571[164364322]               Начальные значения полей объекта ←
  1507573[164364369]                 Начальное значение поля ≡ СТРОКА ∙ 1507443[40042995] ←
   327700[164371910]                   Выражение ≡ Строка.Строка ∙ 1507335[1508504] ←
  1507412[164364356]         Закрыть индикатор ←
 11010080[164371605]         = ≡ Есть выбранные строки ∙ 65545[40054728] ←
      404[164383394]           Результат ⁼ 1 ←
 39780366[164364791]         RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
 30867469[164365244]       БЛОК • Отмена выбора всех строк ←
  1507360[164365293]         Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[164366982]           Значения формальных параметров при вызове ←
 32505860[164369946]             Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164372409]               Выражение ≡ <<Документ>> ∙ 367[5] ←
 12124215[164364782]           Where      (Ограничения на отбор данных) ←
  1507381[164364687]             <Наследуемые ограничения> ←
      413[164365500]             И ←
  1507376[164365390]             Выражение ←
  1507455[164365367]               Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164365945]                 Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[164365980]               Равно ←
  1638402[164365079]               NULL ←
 30867466[164365472]           Выполнить после получения записи ←
 11010105[164364492]             Индикатор ←
      116[164366653]               Выражение ←
      404[164387633]                 Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 11010080[164372107]             = ≡ Созданная строка ∙ 381[12189697] ←
      404[164386494]               Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
  1507417[164364290]             Удалить из таблицы ≡ ВЫБРАННЫЕ СТРОКИ ∙ 1507433[40042581] ←
 12124215[164364783]               Where      (Ограничения на отбор данных) ←
  1507376[164365391]                 Выражение ←
  1507455[164365369]                   Результат ≡ ВЫБРАННЫЕ СТРОКИ ∙ 1507433[40042581] ←
  1507494[164365946]                     Уточняющий параметр ≡ СТРОКА ∙ 1507443[40042995] ←
  1638473[164365987]                   Равно ←
  1507452[164365106]                   Константа ≡ Созданная строка ∙ 381[12189697] ←
 11010088[164366623]             ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[164364560]               Объект ≡ Созданная строка ∙ 381[12189697] ←
      377[164364604]               Начальные значения полей объекта ←
   131095[164365463]                 Начальное значение поля ≡ Бартер ∙ 359[40566785] ←
   327700[164372410]                   Выражение ≡ Нет ∙ 131203075[131203073] ←
 11010080[164372106]         = ≡ Есть выбранные строки ∙ 65545[40054728] ←
  1638402[164365078]           NULL ←
 39780366[164364839]         RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
  1507714[164364291]     Список не сохраняемых переменных ←
  1507716[164364387]       Переменная ≡ Счетчик строк ∙ 65545[164368282] ←
  1507716[164364391]       Переменная ≡ Реализованная наценка ∙ 65545[164367852] ←
  1507716[164364393]       Переменная ≡ Сумма выручки ∙ 65545[164370643] ←
  1507716[164364392]       Переменная ≡ Сумма закупа ∙ 65545[164370644] ←
  1507782[164364305]     Список полей фильтра ←
      598[164365220]       Поле (колонка) для ввода данных • Наименование продукта ≡ Фильтр.Продукт.Наименование (вхождение) ∙ 65545[1515477] ←
      355[164365038]         Начальное значение ≡ Фильтр.Продукт.Наименование (вхождение) ∙ 65545[1515477] ←
      598[164365221]       Поле (колонка) для ввода данных • Код продукта ≡ Фильтр.Продукт.Код (вхождение) ∙ 65545[1515478] ←
      355[164365039]         Начальное значение ≡ Фильтр.Продукт.Код (вхождение) ∙ 65545[1515478] ←
      598[164365203]       Поле (колонка) для ввода данных • Продукт ≡ Фильтр.UID продукта ∙ 65545[1510152] ←
      355[164365021]         Начальное значение ≡ Фильтр.UID продукта ∙ 65545[1510152] ←
 29163536[164364409]         Отображаемый текст для объектов БД ≡ Наименование ∙ 305[6] ←
      209[164364450]         Выбор из списка ≡ ПРОДУКТЫ {...} ∙ 371[6881757] ←
   262165[164364395]           Выбор нескольких объектов из списка ←
      598[164365217]       Поле (колонка) для ввода данных • Группа ≡ Фильтр.Список групп/категорий продукта ∙ 65545[1510158] ←
      355[164365035]         Начальное значение ≡ Фильтр.Список групп/категорий продукта ∙ 65545[1510158] ←
      209[164364596]         Выбор из списка ≡ Группы продуктов, по наименованию (иерархия, нижний уровень) ∙ 371[65642] ←
      598[164364821]       Поле (колонка) для ввода данных • Поставщик ≡ Фильтр.Поставщик базового продукта ∙ 65545[48432652] ←
      355[164365019]         Начальное значение ≡ Фильтр.Поставщик базового продукта ∙ 65545[48432652] ←
      209[164364587]         Выбор из списка ≡ Выбор торгового партнера по наименованию ∙ 371[11141132] ←
      598[164365219]       Поле (колонка) для ввода данных • Торговая марка ≡ Фильтр.Торговая марка ∙ 65545[164367857] ←
      209[164364595]         Выбор из списка ≡ Торговые марки ∙ 371[2820063] ←
   262165[164364398]           Выбор нескольких объектов из списка ←
      598[164365244]       Поле (колонка) для ввода данных • ШК ≡ Фильтр.ШК ∙ 65545[164368151] ←
      598[164366578]       Поле (колонка) для ввода данных ≡ Показывать строки, которых нет в спецификации, но есть на остатке (Д) ∙ 65545[164366763] ←
 30867483[164364361]     Локальные таблицы ←
 30867458[164364404]       Локальная таблица • Строки ←
  1507430[164364295]         Внешняя для процедуры/функции таблица ←
 11010090[164364402]         Структура (Поля, сортировка, генерируемые события) ←
 30867475[164364952]           Параметр ≡ Сортировка (-2 - требует расчета, -1 - помечено к созданию партионных строк, 0 - норм, 1 - относится к другому ДУЦ) ∙ 65545[164367490] ←
 30867476[164364527]             Сортировать по возрастанию ←
 30867475[164365137]           Параметр ≡ Сортировка (основная) ∙ 65545[164368459] ←
 30867476[164364592]             Сортировать по возрастанию ←
 30867481[164364540]           Блок (при отборе данных будет генерироваться это событие) • Линейка ←
 30867475[164365989]             Параметр ≡ Наименование торговой марки линейки (для сортировки) ∙ 65545[164372031] ←
 30867476[164364897]               Сортировать по возрастанию ←
 30867475[164365987]             Параметр ≡ Закупочная цена линейки ∙ 65545[164372029] ←
 30867476[164364899]               Сортировать по возрастанию ←
 30867475[164365988]             Параметр ≡ Торговая марка линейки ∙ 65545[164372030] ←
 30867476[164364900]               Сортировать по возрастанию ←
 30867475[164366064]           Параметр ≡ Основной товар СТМ ∙ 65545[164372314] ←
 30867476[164364923]             Сортировать по возрастанию ←
 30867481[164364386]           Блок (при отборе данных будет генерироваться это событие) • Категория ←
 30867475[164364946]             Параметр ≡ Категория ∙ 65545[164367558] ←
 30867476[164364525]               Сортировать по возрастанию ←
 30867475[164365053]           Параметр ≡ Торговая марка (для сортировки) ∙ 65545[164368134] ←
 30867476[164364564]             Сортировать по возрастанию ←
 30867475[164365054]           Параметр ≡ Закупочная цена ∙ 65545[164368135] ←
 11010106[164364298]             Сортировать по убыванию ←
 30867475[164366028]           Параметр ≡ ВРД ∙ 65545[164372257] ←
 30867475[164366059]           Параметр ≡ ВРД руб ∙ 65545[164372294] ←
 30867475[164366157]           Параметр ≡ Закупочная Д ∙ 65545[164372994] ←
 30867475[164366029]           Параметр ≡ Строки условий ВРД ∙ 65545[164371678] ←
 30867475[164364948]           Параметр ≡ Наименование ∙ 65545[164367489] ←
 30867476[164364526]             Сортировать по возрастанию ←
 30867475[164364953]           Параметр ≡ Изменилась закупочная цена (или новый товар) ∙ 65545[164367580] ←
 11010106[164364297]             Сортировать по убыванию ←
 30867475[164364945]           Параметр ≡ <<Строка>> ∙ 367[6] ←
 30867476[164364760]             Сортировать по возрастанию ←
 30867475[164365986]           Параметр ≡ Основной товар ∙ 65545[164372028] ←
 30867476[164364898]             Сортировать по возрастанию ←
 30867475[164233353]           Параметр ≡ Ставка НДС ∙ 65545[164234116] ←
 30867475[164365912]           Параметр ≡ Текущая цена 1 ∙ 65545[164371894] ←
 30867475[164365969]           Параметр ≡ Текущая цена 2 ∙ 65545[164371325] ←
 30867475[164365970]           Параметр ≡ Текущая цена 3 ∙ 65545[164371329] ←
 30867475[164365971]           Параметр ≡ Текущая цена 4 ∙ 65545[164369361] ←
 30867475[164365913]           Параметр ≡ Расчетная цена 1 ∙ 65545[164371895] ←
 30867475[164365972]           Параметр ≡ Расчетная цена 2 ∙ 65545[164371326] ←
 30867475[164365976]           Параметр ≡ Расчетная цена 3 ∙ 65545[164371330] ←
 30867475[164365980]           Параметр ≡ Расчетная цена 4 ∙ 65545[164371323] ←
 30867475[164365914]           Параметр ≡ Итоговая цена 1 ∙ 65545[164371896] ←
 30867475[164365974]           Параметр ≡ Итоговая цена 2 ∙ 65545[164371327] ←
 30867475[164365978]           Параметр ≡ Итоговая цена 3 ∙ 65545[164371887] ←
 30867475[164365981]           Параметр ≡ Итоговая цена 4 ∙ 65545[164371322] ←
 30867475[164365915]           Параметр ≡ Наценка 1 ∙ 65545[164371897] ←
 30867475[164365975]           Параметр ≡ Наценка 2 ∙ 65545[164371328] ←
 30867475[164365979]           Параметр ≡ Наценка 3 ∙ 65545[164371893] ←
 30867475[164365982]           Параметр ≡ Наценка 4 ∙ 65545[164371324] ←
 30867475[164365916]           Параметр ≡ Номер кластера ∙ 65545[164371937] ←
 30867475[164365245]           Параметр ≡ <<Продукт>> ∙ 367[3] ←
 30867475[171114736]           Параметр ≡ Продукт ∙ 65545[171117065] ←
 30867475[164364947]           Параметр ≡ Цвет фона ∙ 65545[164367481] ←
 30867475[164364949]           Параметр ≡ Наценка итоговая ∙ 65545[164367486] ←
 30867475[164365132]           Параметр ≡ Наценка по приказу ∙ 65545[164368433] ←
 30867475[164364950]           Параметр ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 30867475[164365123]           Параметр ≡ Текущая розничная цена ∙ 65545[164368137] ←
 30867475[164365134]           Параметр ≡ Приказ на выделение товаров с постоянной ценой ∙ 65545[164367743] ←
 30867475[164365526]           Параметр ≡ ПРОМО ∙ 65545[164369878] ←
 30867475[164365772]           Параметр ≡ Строка промо-реестра ∙ 65545[164370264] ←
 30867475[164365773]           Параметр ≡ Строка действующего промо-реестра ∙ 65545[164371104] ←
 30867475[164365889]           Параметр ≡ Строка мониторинга ∙ 65545[164371672] ←
 30867475[164365098]           Параметр ≡ Цвет фона кода ∙ 65545[164368565] ←
 30867475[164233222]           Параметр ≡ Цвет шрифта кода ∙ 65545[164233969] ←
 30867475[164365726]           Параметр ≡ Средние продажи ∙ 65545[164370631] ←
 30867475[164365730]           Параметр ≡ Остаток по сети ∙ 65545[164370642] ←
 30867475[164365725]           Параметр ≡ Маржа ∙ 65545[164370632] ←
 30867475[164824004]           Параметр ≡ Цвет фона ШК ∙ 65545[164826459] ←
 30867475[164824233]           Параметр ≡ Цвет фона мониторинга ∙ 65545[164827281] ←
 30867475[164824341]           Параметр ≡ РЦ 1 ∙ 65545[164827714] ←
 30867475[164824342]           Параметр ≡ РЦ 2 ∙ 65545[164827715] ←
 30867475[164824343]           Параметр ≡ РЦ 3 ∙ 65545[164827716] ←
 30867475[164824344]           Параметр ≡ РЦ 4 ∙ 65545[164827717] ←
 30867475[164823078]           Параметр ≡ Категория ∙ 65545[164824148] ←
 30867458[164364563]       Локальная таблица • Некорректные строки ←
  1507430[164364298]         Внешняя для процедуры/функции таблица ←
 11010103[164364407]         Исключать дублирующиеся записи ←
 11010090[164364561]         Структура (Поля, сортировка, генерируемые события) ←
 30867475[164365873]           Параметр ≡ <<Строка>> ∙ 367[6] ←
 30867476[164364857]             Сортировать по возрастанию ←
      310[164364291]     Итоги (Totals) ←
      590[164365095]       Поле (колонка), являющееся параметром объекта • Всего строк ≡ Счетчик строк ∙ 65545[164368282] ←
   131097[164364931]         Формат ≡ Целое N2.0 ∙ 131096[33161222] ←
      590[164365814]       Поле (колонка), являющееся параметром объекта • Количество некорректных строк ≡ { ... скрипт ... } ∙ 249[39780357] ←
   131097[164364932]         Формат ≡ Целое N2.0 ∙ 131096[33161222] ←
 30867463[164365224]         Выполнить действия ←
 30867477[164364611]           Отбор данных из локальной таблицы ≡ Некорректные строки ∙ 30867458[164364563] ←
 30867465[164364416]             Выполнить при старте ←
 11010080[164371888]               = ≡ Количество некорректных цен ∙ 65545[164371545] ←
      404[164387106]                 Результат ⁼ 0 ←
 30867466[164366306]             Выполнить после получения записи ←
 48431134[164364513]               ++ ≡ Количество некорректных цен ∙ 65545[164371545] ←
 11010080[164377591]           = ≡ Процент некорректных цен ∙ 65545[164371547] ←
      116[164366340]             Выражение ←
      116[164366339]               Выражение ←
      404[164403945]                 Результат ⁼ 1 ←
      406[164365115]                 Вычесть ←
      116[164366341]                 Выражение ←
  1638464[164403948]                   Ноль (0.0), если NULL ≡ Количество некорректных цен ∙ 65545[164371545] ←
      402[164364578]                   Делить ←
  1638464[164403949]                   Ноль (0.0), если NULL ≡ Счетчик строк ∙ 65545[164368282] ←
      403[164364992]               Умножить ←
      404[164403950]               Результат ⁼ 100 ←
 39780366[164365390]           RETURN ≡ Количество некорректных цен ∙ 65545[164371545] ←
      590[164365815]       Поле (колонка), являющееся параметром объекта • Процент корректных цен ≡ Процент некорректных цен ∙ 65545[164371547] ←
   131097[164364933]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
  1507710[164364410]         Цвет фона ≡ Черный ∙ 30[917505] ←
  1507708[164364312]         Цвет шрифта ≡ Желтый ∙ 30[917509] ←
  1507642[164364290]     Кодификаторы ←
  1507639[164364290]       Кодификатор • Поддерживаемые сортировки (дополнительно) ←
  1507640[164364291]         Элемент кодификатора • По наименованию ←
  1507640[164364292]         Элемент кодификатора • По торговой марке ←
  1507640[164364317]         Элемент кодификатора • По группе ←
  1507640[164364293]         Элемент кодификатора • По ценовой категории (A,B,C) ←
  1507640[164364294]         Элемент кодификатора • По закупочной цене ←
  1507640[164364295]         Элемент кодификатора • Сложная сортировка (категория-ТМ-закуп-наименование) ←
  1507640[164364330]         Элемент кодификатора • Линейка ←
  1507614[164364342]     Отбор данных ←
  1507360[164365034]       Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[164366364]         Значения формальных параметров при вызове ←
 32505860[164368571]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164370425]             Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164368572]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[1510100] ←
   327700[164370426]             Выражение ≡ Строка документа управления ценообразованием ∙ 360[164364311] ←
 32505860[164368984]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Код (вхождение) ∙ 65545[1515476] ←
   327700[164371055]             Выражение ≡ Фильтр.Продукт.Код (вхождение) ∙ 65545[1515478] ←
 32505860[164368988]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Наименование (вхождение) ∙ 65545[1515475] ←
   327700[164371059]             Выражение ≡ Фильтр.Продукт.Наименование (вхождение) ∙ 65545[1515477] ←
 32505860[164368987]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт ∙ 65545[1510111] ←
   327700[164371058]             Выражение ≡ Фильтр.UID продукта ∙ 65545[1510152] ←
 32505860[164368986]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Список групп/категорий ∙ 65545[1510117] ←
   327700[164371057]             Выражение ≡ Фильтр.Список групп/категорий продукта ∙ 65545[1510158] ←
 32505860[164368985]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Поставщик базового продукта ∙ 65545[48432653] ←
   327700[164371056]             Выражение ≡ Фильтр.Поставщик базового продукта ∙ 65545[48432652] ←
  1507673[164364360]         Ключи оптимизации ←
  1507675[164364362]           Использовать индекс ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507676[164364363]             Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
 12124215[164364613]         Where      (Ограничения на отбор данных) ←
  1507381[164364542]           <Наследуемые ограничения> ←
      413[164365169]           И ←
  1507376[164365095]           Выражение ←
  1507455[164365058]             Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164365520]               Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[164365559]             Равно ←
  1638402[164364849]             NULL ←
      413[164366469]           И ←
  1507376[164366134]           Выражение ←
  1507376[164366133]             Выражение ←
  1507455[164366084]               Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164367033]                 Уточняющий параметр ≡ Категория ∙ 359[42401804] ←
  1638473[164366950]               Равно ←
  1638402[164365601]               NULL ←
      412[164364912]             ИЛИ ←
  1507376[164366135]             Выражение ←
  1507455[164366085]               Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164367034]                 Уточняющий параметр ≡ Категория ∙ 359[42401804] ←
  1638473[164366951]               Равно ←
  1507452[164365626]               Константа ≡ Да ∙ 131203075[131203074] ←
 30867465[164364369]         Выполнить при старте ←
 11010104[164364322]           Очистить локальную таблицу ≡ Строки ∙ 30867458[164364404] ←
 11010104[164364448]           Очистить локальную таблицу ≡ Некорректные строки ∙ 30867458[164364563] ←
 11010080[164377602]           = ≡ Количество некорректных цен ∙ 65545[164371545] ←
      404[164403918]             Результат ⁼ 0 ←
 30867466[164365168]         Выполнить после получения записи ←
 11010080[164370337]           = ≡ <<Строка>> ∙ 367[6] ←
      404[164382492]             Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 11010080[164372808]           = ≡ <<Продукт>> ∙ 367[3] ←
      404[164390906]             Результат ≡ Строка.Продукт ∙ 1507335[1508517] ←
  1507410[164365099]           ВЫПОЛНИТЬ БЛОК ≡ Расчет строки ∙ 30867469[164365610] ←
 30867477[164364426]       Отбор данных из локальной таблицы ≡ Строки ∙ 30867458[164364404] ←
 30867465[164364406]         Выполнить при старте ←
 30867466[164365202]         Выполнить после получения записи ←
 11010099[164364502]           CONTINUE ←
      116[164365933]             Выражение ←
  1638460[164364709]               НЕ ←
      404[164382757]               Результат ≡ <<Строка>> ∙ 367[6] ←
 11010088[164366145]           ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
  1507412[164364350]       Закрыть индикатор ←
  1507618[164364300]     Обработка команд ←
  1507410[164364883]       ВЫПОЛНИТЬ БЛОК ≡ Дополнительный обработчик команд ∙ 30867469[40045431] ←
 11010079[164364487]       CASE ←
  1572877[164364517]         Условие ←
      404[164382493]           Результат ≡ Список данных.Команда ∙ 387[1507439] ←
 11010081[164364937]         OF • Выбрать/Отм. выбор ≡ USER 1 ∙ 102[57201] ←
  1507410[164364884]           ВЫПОЛНИТЬ БЛОК ≡ Выбор строки ∙ 30867469[40045635] ←
 11010081[164364938]         OF • Выбрать все ≡ USER 2 ∙ 102[57202] ←
  1507410[164364885]           ВЫПОЛНИТЬ БЛОК ≡ Выбор всех строк ∙ 30867469[164365210] ←
 11010081[164364939]         OF • Отменить выбор ≡ USER 3 ∙ 102[57203] ←
  1507410[164364886]           ВЫПОЛНИТЬ БЛОК ≡ Отмена выбора всех строк ∙ 30867469[164365244] ←
 11010081[164364940]         OF • Отмена фильтров ≡ USER 10 ∙ 102[57210] ←
  1507410[164364887]           ВЫПОЛНИТЬ БЛОК ≡ Отмена фильтров ∙ 30867469[40044141] ←
  1507410[164364888]           ВЫПОЛНИТЬ БЛОК ≡ Отмена фильтров (Дополнительно 1) ∙ 30867469[40045227] ←
 39780366[164364498]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
 11010081[164364941]         OF ≡ Ввод в ячейку ∙ 102[53308] ←
 11010080[164370368]           = ≡ Наценка итоговая ∙ 65545[164367486] ←
      116[164365865]             Выражение ←
      116[164365866]               Выражение ←
      404[164382743]                 Результат ≡ Итоговая розничная цена ∙ 65545[164367485] ←
      402[164364363]                 Делить ←
      404[164382744]                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164370202]                   Уточняющий параметр ≡ Цена закупочная ∙ 359[15007745] ←
      406[164364685]               Вычесть ←
      404[164382745]               Результат ⁼ 1 ←
      403[164364435]             Умножить ←
      404[164382746]             Результат ⁼ 100 ←
 30867470[164365809]           IF ←
  1638463[164366282]             Условие ←
      116[164829524]               Выражение ←
      404[164832222]                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164824977]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[164826194]                     Уточняющий параметр ≡ ЕИ ∙ 305[14745607] ←
  1638473[164365708]                 Равно ←
      404[164832225]                 Результат ≡ Килограмм ∙ 131108[28049411] ←
      413[164828360]               И ←
      116[164829526]               Выражение ←
      404[164839355]                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164826273]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[164828213]                     Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[164840314]                       Уточняющий параметр ≡ Возможен возврат ∙ 296[42401803] ←
  1638473[164830481]                 Равно ←
      404[164835462]                 Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[164365799]             THEN ←
 11010080[164371115]               = ≡ Итоговая розничная цена ∙ 65545[164367485] ←
      404[164384700]                 Результат ≡ Округление ∙ 249[30867464] ←
 32505862[164366403]                   Значения формальных параметров при вызове ←
 32505860[164368651]                     Значение параметра при вызове процедуры/функции ≡ Округляемое значение ∙ 65545[30867479] ←
   327700[164370552]                       Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164369048]                     Значение параметра при вызове процедуры/функции ≡ Округлять вверх/вниз ∙ 65545[30867481] ←
   327700[164371138]                       Выражение ⁼ 0 ←
 32505860[164369049]                     Значение параметра при вызове процедуры/функции ≡ Округлять до ∙ 65545[30867480] ←
   327700[164371139]                       Выражение ⁼ 0.1 ←
 30867473[164364940]             ELSE ←
 11010088[164366141]           ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[164364461]             Объект ≡ <<Строка>> ∙ 367[6] ←
      377[164364504]             Начальные значения полей объекта ←
   131095[164364538]               Начальное значение поля ≡ Цена розничная ∙ 359[15007746] ←
   327700[164367005]                 Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
   131095[164364534]               Начальное значение поля ≡ Скидка ∙ 359[14286851] ←
   327700[164370428]                 Выражение ≡ Наценка итоговая ∙ 65545[164367486] ←
   131095[164364544]               Начальное значение поля ≡ Маркировать ∙ 359[28835848] ←
   327700[164367006]                 Выражение ≡ Да ∙ 131203075[131203074] ←
   131095[164365547]               Начальное значение поля ≡ Дата счета-фактуры ∙ 359[42401811] ←
   327700[164372576]                 Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
   131095[164365548]               Начальное значение поля ≡ Комментарий ∙ 359[42401830] ←
   327700[164372577]                 Выражение ⁼ Ручное изменение цены ←
 30867470[164367554]           IF ←
  1638463[164368497]             Условие ←
  1638460[164365594]               НЕ ←
      404[164403941]               Результат ≡ Проверка цены на корректность ввода ∙ 249[164364425] ←
 32505862[164369450]                 Значения формальных параметров при вызове ←
 32505860[164374298]                   Значение параметра при вызове процедуры/функции ≡ Входная розничная цена ∙ 65545[164371546] ←
   327700[164378146]                     Выражение ≡ Итоговая розничная цена ∙ 65545[164367485] ←
 32505860[164374299]                   Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164371543] ←
   327700[164378147]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164376686]                       Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 30867472[164367538]             THEN ←
 11010092[164364697]               Добавить в локальную таблицу ≡ Некорректные строки ∙ 30867458[164364563] ←
 30867473[164365474]             ELSE ←
 39780356[164364293]               Удалить из локальной таблицы ≡ Некорректные строки ∙ 30867458[164364563] ←
 39780366[164364725]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ТЕКУЩЕЙ СТРОКИ СПИСКА ∙ 102[53262] ←
  1507410[164364891]       ВЫПОЛНИТЬ БЛОК ≡ Стандартный обработчик команд ∙ 30867469[1510294] ←
   327702[164364296]     Вид просмотра зависимых записей ≡ Партионные строки документа управления ценообразованием ∙ 371[164364433] ←
 32505862[164366375]       Значения формальных параметров при вызове ←
 32505860[164368564]         Значение параметра при вызове процедуры/функции ≡ Родительская строка ∙ 65545[164367488] ←
   327700[164370463]           Выражение ≡ <<Строка>> ∙ 367[6] ←
      212[164364344]     Сценарий ←
      103[164364378]       Команда • Назад ≡ Назад ∙ 102[57089] ←
       12[164364346]         Иконка ≡ Back ∙ 90[24] ←
      103[164364379]       Команда • Вперед ≡ Встать на ребенка текущего объекта ∙ 102[57108] ←
       12[164364347]         Иконка ≡ Forward ∙ 90[22] ←
      103[164364511]       Команда ≡ ------------ ∙ 102[57343] ←
      127[164364820]       Процедура • Сортировка ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
       12[164364345]         Иконка ≡ Сортировка по возрастанию ∙ 90[1507375] ←
 32505863[164364614]         Локальные переменные ←
    65545[164368436]           Локальная переменная • Элемент ≡ Объект ∙ 107[19] ←
 30867463[164364759]         Выполнить действия ←
 11010080[164372026]           = ≡ Элемент ∙ 65545[164368436] ←
      404[164387473]             Результат ≡ Список данных.Выбор сортировки ∙ 249[1507677] ←
 32505862[164366999]               Значения формальных параметров при вызове ←
 32505860[164369885]                 Значение параметра при вызове процедуры/функции ≡ Проектный раздел с сортировками ∙ 65545[1518022] ←
   327700[164372330]                   Выражение ≡ Поддерживаемые сортировки (дополнительно) ∙ 1507639[164364290] ←
 11010100[164364401]           BREAK ←
      116[164366597]             Выражение ←
  1638460[164364900]               НЕ ←
      404[164387474]               Результат ≡ Элемент ∙ 65545[164368436] ←
 11010080[164372027]           = ≡ Сортировка ∙ 65545[1510125] ←
      404[164387475]             Результат ≡ Элемент ∙ 65545[164368436] ←
 39780366[164364367]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
      103[164364377]       Команда • Фильтр ≡ Установить фильтр по полям ∙ 102[53598] ←
      103[164364380]       Команда ≡ ------------ ∙ 102[57343] ←
      127[164364709]       Процедура • Расчет розничных цен ≡ Расчет розничных цен для ДУЦ (выбранные строки) ∙ 127[164364710] ←
       12[164364436]         Иконка ≡ Обновить (синяя) ∙ 90[30867466] ←
 32505862[164366487]         Значения формальных параметров при вызове ←
 32505860[164368827]           Значение параметра при вызове процедуры/функции ≡ ДУЦ ∙ 65545[164367990] ←
   327700[164370839]             Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164369934]           Значение параметра при вызове процедуры/функции ≡ Комментарий для изменения строки ∙ 65545[164368451] ←
   327700[164372346]             Выражение ⁼ Ручной расчет цен в ДУЦ ←
      432[164364351]         Использование (в режиме выполнения) ≡ Нет, если какое либо условие соблюдено ∙ 534[2] ←
  1507508[164364610]           Если истинно выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164370292]             Уточняющий параметр ≡ Состояние документа ∙ 331[14] ←
      103[164364509]       Команда • Выделить все ≡ USER 2 ∙ 102[57202] ←
       12[164364438]         Иконка ≡ Выбрать все ∙ 90[21] ←
      103[164364510]       Команда • Отменить выделение ≡ USER 3 ∙ 102[57203] ←
       12[164364439]         Иконка ≡ Отменить все ∙ 90[786433] ←
      127[164364798]       Процедура • Блокировка ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[164364598]         Локальные переменные ←
    65545[164368173]           Локальная переменная • Список для блокировки ≡ Список продуктов ∙ 107[1507334] ←
      355[164365115]             Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164368174]           Локальная переменная • Строка ≡ Строка (объект БД) ∙ 107[10] ←
    65545[164368175]           Локальная переменная • Поставщик ≡ Партнер ∙ 107[5] ←
    65545[164368705]           Локальная переменная • Заблокировать для поставщика? ≡ Признак (Да/Нет) ∙ 107[131203074] ←
    65545[164368704]           Локальная переменная • Заблокировать для РЦ? ≡ Признак (Да/Нет) ∙ 107[131203074] ←
       12[164364448]         Иконка ≡ Запрещенный ШТРИХКОД ∙ 90[28835841] ←
 30867483[164364373]         Локальные таблицы ←
 30867458[164364425]           Локальная таблица • Продукты ←
 11010090[164364423]             Структура (Поля, сортировка, генерируемые события) ←
 30867481[164364410]               Блок (при отборе данных будет генерироваться это событие) • Поставщик ←
 30867475[164365061]                 Параметр ≡ Поставщик ∙ 65545[164368175] ←
 30867476[164364567]                   Сортировать по возрастанию ←
 30867475[164365062]               Параметр ≡ <<Продукт>> ∙ 367[3] ←
 30867463[164364743]         Выполнить действия ←
 39780361[164364619]           ЗАВЕРШИТЬ БЛОК ←
      116[164366481]             Выражение ←
  1638460[164364853]               НЕ ←
      404[164386534]               Результат ≡ <<Документ>> ∙ 367[5] ←
  1507360[164365246]           Отбор данных (по запросу) ≡ Выбранные строки ∙ 12124205[40043107] ←
 30867466[164365245]             Выполнить после получения записи ←
 11010080[164371661]               = ≡ Строка ∙ 65545[164368174] ←
      404[164386560]                 Результат ≡ СТРОКА ∙ 1507335[40045956] ←
 11010099[164365334]               CONTINUE ←
      116[164370033]                 Выражение ←
      404[164409183]                   Результат ≡ Строка.Документ ∙ 1507335[1508505] ←
  1638479[164365291]                   Не равно ←
      404[164409184]                   Результат ≡ <<Документ>> ∙ 367[5] ←
 11010080[164371662]               = ≡ <<Продукт>> ∙ 367[3] ←
      404[164386561]                 Результат ≡ Строка ∙ 65545[164368174] ←
      411[164371622]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 11010080[164371663]               = ≡ Список для блокировки ∙ 65545[164368173] ←
      404[164386562]                 Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164364555]                   Список элементов ←
   327700[164371982]                     Выражение ≡ Список для блокировки ∙ 65545[164368173] ←
   327700[164371983]                     Выражение ≡ <<Продукт>> ∙ 367[3] ←
 12124190[164364403]           Форма ввода • Товары для блокировки ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
   262166[164364316]             Заголовок ⁼ Выберите товары для блокировки ←
      245[164364471]             Список полей формы ←
      598[164365245]               Поле (колонка) для ввода данных • Товары ≡ Список для блокировки ∙ 65545[164368173] ←
      209[164364603]                 Выбор из списка ≡ ПРОДУКТЫ {...} ∙ 371[6881757] ←
      247[164364381]                   Список полей просмотра ←
      590[164365117]                     Поле (колонка), являющееся параметром объекта ≡ <<Продукт>> ∙ 367[3] ←
      411[164371626]                       Уточняющий параметр ≡ Отображаемый текст (Код + Наименование) ∙ 117[10423751] ←
   262165[164364401]                   Выбор нескольких объектов из списка ≡ Да ∙ 534[40566785] ←
  1507614[164364351]                   Отбор данных ←
  1507360[164365245]                     Отбор данных (по запросу) ≡ Выбранные строки ∙ 12124205[40043107] ←
 32505862[164366883]                       Значения формальных параметров при вызове ←
  1507727[164364364]                         <Наследуемые значения> ←
 32505860[164369655]                         Значение параметра при вызове процедуры/функции ≡ Фильтр.  UID документа(ов) ∙ 65545[1510142] ←
   327700[164371978]                           Выражение ≡ <<Документ>> ∙ 367[5] ←
 30867466[164365244]                       Выполнить после получения записи ←
 11010080[164371658]                         = ≡ Строка ∙ 65545[164368174] ←
      404[164386536]                           Результат ≡ СТРОКА ∙ 1507335[40045956] ←
 11010080[164371659]                         = ≡ <<Продукт>> ∙ 367[3] ←
      404[164386537]                           Результат ≡ Строка ∙ 65545[164368174] ←
      411[164371618]                             Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 11010088[164366379]                         ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
      355[164365116]                 Начальное значение ≡ Список для блокировки ∙ 65545[164368173] ←
      598[164365468]               Поле (колонка) для ввода данных ≡ Заблокировать для поставщика? ∙ 65545[164368705] ←
      355[164365275]                 Начальное значение ≡ Да ∙ 131203075[131203074] ←
      598[164365469]               Поле (колонка) для ввода данных ≡ Заблокировать для РЦ? ∙ 65545[164368704] ←
      355[164365276]                 Начальное значение ≡ Да ∙ 131203075[131203074] ←
 39780361[164364620]           ЗАВЕРШИТЬ БЛОК ←
      116[164366482]             Выражение ←
  1638460[164364854]               НЕ ←
      404[164386535]               Результат ≡ Список для блокировки ∙ 65545[164368173] ←
  1507360[164365243]           Отбор данных (по запросу) ≡ ПРОДУКТЫ ∙ 12124205[18546749] ←
 32505862[164366884]             Значения формальных параметров при вызове ←
 32505860[164369656]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Список UID-ов ∙ 65545[1510087] ←
   327700[164371979]                 Выражение ≡ Список для блокировки ∙ 65545[164368173] ←
 30867466[164365236]             Выполнить после получения записи ←
 11010080[164371657]               = ≡ <<Продукт>> ∙ 367[3] ←
      404[164386538]                 Результат ≡ з.Продукт ∙ 1507335[18546999] ←
 11010080[164371660]               = ≡ Поставщик ∙ 65545[164368175] ←
      404[164386539]                 Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[164371627]                   Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
 11010092[164364479]               Добавить в локальную таблицу ≡ Продукты ∙ 30867458[164364425] ←
 30867470[164366293]           IF ←
  1638463[164366920]             Условие ←
      404[164390953]               Результат ≡ Заблокировать для поставщика? ∙ 65545[164368705] ←
  1638473[164366204]               Равно ←
      404[164390954]               Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[164366283]             THEN ←
 30867477[164364431]               Отбор данных из локальной таблицы ≡ Продукты ∙ 30867458[164364425] ←
 30867484[164364349]                 Выполнить перед обработкой блока ≡ Поставщик ∙ 30867481[164364410] ←
 11010080[164371665]                   = ≡ Созданный документ ∙ 381[30670850] ←
      404[164386566]                     Результат ≡ Объект.Создание ∙ 249[30670863] ←
  6422553[164364389]                       Таблица базы данных ≡ Документ ∙ 108[5] ←
   262178[164364406]                       Тип объекта ≡ Блокировка товара поставщика ∙ 332[655294525] ←
      377[164364580]                       Начальные значения полей объекта ←
   131095[164365273]                         Начальное значение поля ≡ Подразделение ∙ 331[5] ←
   327700[164371987]                           Выражение ≡ Коммерческое подразделение для всех подразделений (Договора) ∙ 117[655294743] ←
   131095[164365274]                         Начальное значение поля ≡ Контрагент ∙ 331[7] ←
   327700[164371988]                           Выражение ≡ Поставщик ∙ 65545[164368175] ←
   131095[164365279]                         Начальное значение поля ≡ Признак 1 ∙ 331[6684704] ←
   327700[164371989]                           Выражение ≡ Нет ∙ 131203075[131203073] ←
   131095[164365350]                         Начальное значение поля ≡ Признак 2 ∙ 331[6684705] ←
   327700[164371990]                           Выражение ≡ Нет ∙ 131203075[131203073] ←
   131095[164364560]                         Начальное значение поля ≡ Признак 10 ∙ 331[6684719] ←
   327700[164366560]                           Выражение ≡ Да ∙ 131203075[131203074] ←
   131095[164365409]                         Начальное значение поля ≡ Комментарий ∙ 331[11] ←
   327700[164371991]                           Выражение ⁼ Заблокировано из ДУЦ ←
 30867466[164365422]                 Выполнить после получения записи ←
 11010080[164371666]                   = ≡ Созданная строка ∙ 381[12189697] ←
      404[164386567]                     Результат ≡ Объект.Создание ∙ 249[30670863] ←
  6422553[164364390]                       Таблица базы данных ≡ Строка (объект БД) ∙ 108[6] ←
   262178[164364407]                       Тип объекта ≡ Блокировка товара поставщика ∙ 360[655294495] ←
      377[164364581]                       Начальные значения полей объекта ←
   131095[164365410]                         Начальное значение поля ≡ Документ ∙ 359[5] ←
   327700[164371992]                           Выражение ≡ Созданный документ ∙ 381[30670850] ←
   131095[164365413]                         Начальное значение поля ≡ Продукт ∙ 359[8] ←
   327700[164372011]                           Выражение ≡ <<Продукт>> ∙ 367[3] ←
   131095[164365412]                         Начальное значение поля ≡ Дата начала ∙ 359[14745601] ←
   327700[164372010]                           Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
   131095[164365414]                         Начальное значение поля ≡ Дата окончания ∙ 359[14745602] ←
   327700[164371980]                           Выражение ≡ Далёкая конечная дата ∙ 117[164364803] ←
   131095[164365411]                         Начальное значение поля ≡ Комментарий ∙ 359[42401830] ←
   327700[164372009]                           Выражение ⁼ Заблокировано из ДУЦ ←
 11010107[164364322]                 Выполнить после обработки блока ≡ Поставщик ∙ 30867481[164364410] ←
 30867470[164366063]                   IF ←
  1638463[164366588]                     Условие ←
      404[164386541]                       Результат ≡ Созданная строка ∙ 381[12189697] ←
 30867472[164366053]                     THEN ←
 11010088[164366378]                       ВЫПОЛНИТЬ ≡ Объект.Акцепт ∙ 249[1507433] ←
 30867474[164364519]                         Объект ≡ Созданный документ ∙ 381[30670850] ←
 30867470[164366196]           IF ←
  1638463[164366739]             Условие ←
      404[164390948]               Результат ≡ Заблокировать для РЦ? ∙ 65545[164368704] ←
  1638473[164366199]               Равно ←
      404[164390949]               Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[164366186]             THEN ←
 30867477[164364497]               Отбор данных из локальной таблицы ≡ Продукты ∙ 30867458[164364425] ←
 30867465[164364381]                 Выполнить при старте ←
 11010080[164372839]                   = ≡ Созданный документ ∙ 381[30670850] ←
      404[164390950]                     Результат ≡ Объект.Создание ∙ 249[30670863] ←
  6422553[164364363]                       Таблица базы данных ≡ Документ ∙ 108[5] ←
   262178[164364375]                       Тип объекта ≡ Блокировка товара поставщика ∙ 332[655294525] ←
      377[164364603]                       Начальные значения полей объекта ←
   131095[164364995]                         Начальное значение поля ≡ Подразделение ∙ 331[5] ←
   327700[164373262]                           Выражение ≡ Коммерческое подразделение для всех подразделений (Договора) ∙ 117[655294743] ←
   131095[164364996]                         Начальное значение поля ≡ Контрагент ∙ 331[7] ←
   327700[164373268]                           Выражение ≡ Товары на складе РЦ ∙ 249[164364330] ←
   131095[164365001]                         Начальное значение поля ≡ Признак 1 ∙ 331[6684704] ←
   327700[164373269]                           Выражение ≡ Нет ∙ 131203075[131203073] ←
   131095[164365003]                         Начальное значение поля ≡ Признак 2 ∙ 331[6684705] ←
   327700[164373270]                           Выражение ≡ Нет ∙ 131203075[131203073] ←
   131095[164365004]                         Начальное значение поля ≡ Признак 10 ∙ 331[6684719] ←
   327700[164373271]                           Выражение ≡ Да ∙ 131203075[131203074] ←
   131095[164365005]                         Начальное значение поля ≡ Комментарий ∙ 331[11] ←
   327700[164373272]                           Выражение ⁼ Заблокировано из ДУЦ (РЦ) ←
 30867466[164365701]                 Выполнить после получения записи ←
 11010080[164372947]                   = ≡ Созданная строка ∙ 381[12189697] ←
      404[164390951]                     Результат ≡ Объект.Создание ∙ 249[30670863] ←
  6422553[164364391]                       Таблица базы данных ≡ Строка (объект БД) ∙ 108[6] ←
   262178[164364414]                       Тип объекта ≡ Блокировка товара поставщика ∙ 360[655294495] ←
      377[164364620]                       Начальные значения полей объекта ←
   131095[164365006]                         Начальное значение поля ≡ Документ ∙ 359[5] ←
   327700[164373273]                           Выражение ≡ Созданный документ ∙ 381[30670850] ←
   131095[164365007]                         Начальное значение поля ≡ Продукт ∙ 359[8] ←
   327700[164373274]                           Выражение ≡ <<Продукт>> ∙ 367[3] ←
   131095[164365008]                         Начальное значение поля ≡ Дата начала ∙ 359[14745601] ←
   327700[164373275]                           Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
   131095[164365009]                         Начальное значение поля ≡ Дата окончания ∙ 359[14745602] ←
   327700[164373276]                           Выражение ≡ Далёкая конечная дата ∙ 117[164364803] ←
   131095[164365010]                         Начальное значение поля ≡ Комментарий ∙ 359[42401830] ←
   327700[164373277]                           Выражение ⁼ Заблокировано из ДУЦ ←
 30867467[164364353]                 Выполнить при завершении ←
 30867470[164366197]                   IF ←
  1638463[164366877]                     Условие ←
      404[164390952]                       Результат ≡ Созданная строка ∙ 381[12189697] ←
 30867472[164366187]                     THEN ←
 11010088[164366780]                       ВЫПОЛНИТЬ ≡ Объект.Акцепт ∙ 249[1507433] ←
 30867474[164364409]                         Объект ≡ Созданный документ ∙ 381[30670850] ←
      103[164364387]       Команда ≡ ------------ ∙ 102[57343] ←
      127[164364821]       Процедура • Скопировать из Стандарта ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
       12[164364348]         Иконка ≡ Copy record ∙ 90[73] ←
 32505863[164364615]         Локальные переменные ←
    65545[164368437]           Локальная переменная • ДУЦ Стандарт ≡ Документ ∙ 107[8] ←
    65545[164368438]           Локальная переменная • Строка ДУЦ Стандарт ≡ Строка (объект БД) ∙ 107[10] ←
    65545[164368439]           Локальная переменная • Строка текущего ДУЦ ≡ Строка (объект БД) ∙ 107[10] ←
      432[164364379]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[164364635]           Если истинно выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164364761]             Выполнить действия ←
 30867470[164366152]               IF ←
  1638463[164366691]                 Условие ←
      404[164387480]                   Результат ≡ <<Документ>> ∙ 367[5] ←
      411[164371941]                     Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638479[164364742]                   Не равно ←
      404[164387481]                   Результат ≡ Формат "Ценообразование Стандарт" ∙ 117[164364814] ←
 30867472[164366141]                 THEN ←
 39780366[164364792]                   RETURN ⁼ 1 ←
 39780366[164364832]               RETURN ←
 30867463[164364760]         Выполнить действия ←
  1507360[164365265]           Отбор данных (по запросу) ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
 32505862[164367000]             Значения формальных параметров при вызове ←
 32505860[164369886]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547258] ←
   327700[164372331]                 Выражение ≡ Документ управления ценообразованием ∙ 332[164364309] ←
 12124215[164364754]             Where      (Ограничения на отбор данных) ←
  1507381[164364666]               <Наследуемые ограничения> ←
      413[164365476]               И ←
  1507376[164365338]               Выражение ←
  1507455[164365321]                 Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164365905]                   Уточняющий параметр ≡ Причина списания ∙ 331[28835845] ←
  1638473[164365904]                 Равно ←
  1507452[164365092]                 Константа ≡ Формат "Ценообразование Стандарт" ∙ 117[164364814] ←
      413[164365511]               И ←
  1507376[164365339]               Выражение ←
  1507455[164365322]                 Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164365906]                   Уточняющий параметр ≡ Группа товаров ∙ 331[14286851] ←
  1638473[164365950]                 Равно ←
  1507452[164365093]                 Константа ≡ <<Документ>> ∙ 367[5] ←
      411[164371938]                   Уточняющий параметр ≡ Группа товаров ∙ 331[14286851] ←
 30867466[164365442]             Выполнить после получения записи ←
 11010080[164372028]               = ≡ ДУЦ Стандарт ∙ 65545[164368437] ←
      404[164387478]                 Результат ≡ з.Документ ∙ 1507335[18547059] ←
 11010100[164364402]               BREAK ←
 30867470[164367522]           IF ←
  1638463[164368460]             Условие ←
      116[164369159]               Выражение ←
  1638460[164365712]                 НЕ ←
      404[164403772]                 Результат ≡ ДУЦ Стандарт ∙ 65545[164368437] ←
 30867472[164367506]             THEN ←
 11010088[164367971]               ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
 11010095[164365858]                 Выражение ←
      404[164403773]                   Результат ⁼ Не найден аналогичный документ формата Стандарт ←
 39780366[164365384]               RETURN ←
  1507360[164365297]           Отбор данных (по запросу) ≡ Выбранные строки ∙ 12124205[40043107] ←
 30867466[164365479]             Выполнить после получения записи ←
 11010080[164372031]               = ≡ Строка текущего ДУЦ ∙ 65545[164368439] ←
      404[164387483]                 Результат ≡ СТРОКА ∙ 1507335[40045956] ←
 11010099[164364605]               CONTINUE ←
      116[164366598]                 Выражение ←
      404[164387484]                   Результат ≡ Строка текущего ДУЦ ∙ 65545[164368439] ←
      411[164371943]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638479[164364743]                   Не равно ←
      404[164387485]                   Результат ≡ <<Документ>> ∙ 367[5] ←
  1507360[164365274]               Отбор данных (по запросу) • Строки ДУЦ Стандарт ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[164367002]                 Значения формальных параметров при вызове ←
 32505860[164369889]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164372335]                     Выражение ≡ ДУЦ Стандарт ∙ 65545[164368437] ←
  1507673[164364603]                 Ключи оптимизации ←
  1507675[164364614]                   Использовать индекс ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507676[164364619]                     Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
 12124215[164364771]                 Where      (Ограничения на отбор данных) ←
  1507381[164364688]                   <Наследуемые ограничения> ←
      413[164365513]                   И ←
  1507376[164365350]                   Выражение ←
  1507455[164365333]                     Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164365929]                       Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[164365952]                     Равно ←
  1638402[164365072]                     NULL ←
      413[164365514]                   И ←
  1507376[164365377]                   Выражение ←
  1507455[164365355]                     Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164365930]                       Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[164365953]                     Равно ←
  1507452[164365098]                     Константа ≡ Строка текущего ДУЦ ∙ 65545[164368439] ←
      411[164371939]                       Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 30867466[164365477]                 Выполнить после получения записи ←
 11010080[164372030]                   = ≡ Строка ДУЦ Стандарт ∙ 65545[164368438] ←
      404[164387477]                     Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 30867470[164366151]                   IF ←
  1638463[164366690]                     Условие ←
      404[164387479]                       Результат ≡ Строка текущего ДУЦ ∙ 65545[164368439] ←
      411[164371930]                         Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
  1638479[164364741]                       Не равно ←
      404[164387482]                       Результат ≡ Строка ДУЦ Стандарт ∙ 65545[164368438] ←
      411[164371940]                         Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 30867472[164366140]                     THEN • Редактируем строку ←
 11010088[164366598]                       ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[164364553]                         Объект ≡ Строка текущего ДУЦ ∙ 65545[164368439] ←
      377[164364614]                         Начальные значения полей объекта ←
   131095[164365495]                           Начальное значение поля ≡ Цена розничная ∙ 359[15007746] ←
   327700[164372336]                             Выражение ≡ Строка ДУЦ Стандарт ∙ 65545[164368438] ←
      411[164371942]                               Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
   131095[164364768]                           Начальное значение поля ≡ Маркировать ∙ 359[28835848] ←
   327700[164372771]                             Выражение ≡ Да ∙ 131203075[131203074] ←
   131095[164364968]                           Начальное значение поля ≡ Дата счета-фактуры ∙ 359[42401811] ←
   327700[164372806]                             Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
   131095[164364969]                           Начальное значение поля ≡ Комментарий ∙ 359[42401830] ←
   327700[164372807]                             Выражение ⁼ Ручное изменение цены (скопировано из Стандарта) ←
 39780366[164364368]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
      127[164364818]       Процедура • Проставить цену ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
       12[164364349]         Иконка ≡ Запрос ∙ 90[12189697] ←
 32505863[164364617]         Локальные переменные ←
    65545[164368445]           Локальная переменная • Строка текущего ДУЦ ≡ Строка (объект БД) ∙ 107[10] ←
    65545[164368443]           Локальная переменная • Новая цена ≡ Число ∙ 107[4] ←
 30867463[164364764]         Выполнить действия ←
 12124190[164364413]           Форма ввода • Новая цена ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164364485]             Список полей формы ←
      598[164365308]               Поле (колонка) для ввода данных • Новая цена ≡ Новая цена ∙ 65545[164368443] ←
  1507360[164365301]           Отбор данных (по запросу) ≡ Выбранные строки ∙ 12124205[40043107] ←
 30867466[164365482]             Выполнить после получения записи ←
 11010080[164372037]               = ≡ Строка текущего ДУЦ ∙ 65545[164368445] ←
      404[164387498]                 Результат ≡ СТРОКА ∙ 1507335[40045956] ←
 11010099[164364606]               CONTINUE ←
      116[164366600]                 Выражение ←
      404[164387499]                   Результат ≡ Строка текущего ДУЦ ∙ 65545[164368445] ←
      411[164371958]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638479[164364745]                   Не равно ←
      404[164387500]                   Результат ≡ <<Документ>> ∙ 367[5] ←
 30867470[164366154]               IF ←
  1638463[164366693]                 Условие ←
      404[164387502]                   Результат ≡ Строка текущего ДУЦ ∙ 65545[164368445] ←
      411[164371960]                     Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
  1638479[164364746]                   Не равно ←
      404[164387495]                   Результат ≡ Новая цена ∙ 65545[164368443] ←
 30867472[164366143]                 THEN • Редактируем строку ←
 11010088[164366601]                   ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[164364554]                     Объект ≡ Строка текущего ДУЦ ∙ 65545[164368445] ←
      377[164364618]                     Начальные значения полей объекта ←
   131095[164365433]                       Начальное значение поля ≡ Цена розничная ∙ 359[15007746] ←
   327700[164372337]                         Выражение ≡ Новая цена ∙ 65545[164368443] ←
   131095[164365735]                       Начальное значение поля ≡ Маркировать ∙ 359[28835848] ←
   327700[164374224]                         Выражение ≡ Да ∙ 131203075[131203074] ←
   131095[164365738]                       Начальное значение поля ≡ Дата счета-фактуры ∙ 359[42401811] ←
   327700[164374266]                         Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
   131095[164365739]                       Начальное значение поля ≡ Комментарий ∙ 359[42401830] ←
   327700[164374267]                         Выражение ⁼ Ручное изменение цены (на несколько позиций) ←
 39780366[164364842]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
      127[164364916]       Процедура • Копировать цену во все ДУЦ ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
       12[164364506]         Иконка ≡ В/П ∙ 90[30670856] ←
 32505863[164364686]         Локальные переменные ←
    65545[164369199]           Локальная переменная • Строка текущего ДУЦ ≡ Строка (объект БД) ∙ 107[10] ←
    65545[164369201]           Локальная переменная • ДУЦ ≡ Документ ∙ 107[8] ←
    65545[164369202]           Локальная переменная • Строка ДУЦ для изменения ≡ Строка (объект БД) ∙ 107[10] ←
    65545[164369203]           Локальная переменная • Список ДУЦ ≡ Список документов ∙ 107[1507335] ←
 30867483[164364399]         Локальные таблицы ←
 30867458[164364479]           Локальная таблица • Строки для изменения ←
 11010090[164364477]             Структура (Поля, сортировка, генерируемые события) ←
 30867481[164364469]               Блок (при отборе данных будет генерироваться это событие) • ДУЦ ←
 30867475[164365391]                 Параметр ≡ ДУЦ ∙ 65545[164369201] ←
 30867476[164364695]                   Сортировать по возрастанию ←
 30867475[164365393]               Параметр ≡ Строка ДУЦ для изменения ∙ 65545[164369202] ←
 30867476[164364698]                 Сортировать по возрастанию ←
 30867475[164365394]               Параметр ≡ Строка текущего ДУЦ ∙ 65545[164369199] ←
 30867463[164364898]         Выполнить действия ←
 11010104[164364359]           Очистить локальную таблицу ≡ Строки для изменения ∙ 30867458[164364479] ←
 11010080[164373558]           = ≡ Список ДУЦ ∙ 65545[164369203] ←
  1638402[164365297]             NULL ←
  1507360[164365560]           Отбор данных (по запросу) ≡ Выбранные строки ∙ 12124205[40043107] ←
 30867466[164365788]             Выполнить после получения записи ←
 11010080[164373552]               = ≡ Строка текущего ДУЦ ∙ 65545[164369199] ←
      404[164392059]                 Результат ≡ СТРОКА ∙ 1507335[40045956] ←
 11010099[164364760]               CONTINUE ←
      116[164367410]                 Выражение ←
      404[164392060]                   Результат ≡ Строка текущего ДУЦ ∙ 65545[164369199] ←
      411[164373452]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638479[164364909]                   Не равно ←
      404[164392061]                   Результат ≡ <<Документ>> ∙ 367[5] ←
  1507360[164365562]               Отбор данных (по запросу) • ДУЦ ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
 32505862[164367722]                 Значения формальных параметров при вызове ←
 32505860[164371363]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547258] ←
   327700[164374225]                     Выражение ≡ Документ управления ценообразованием ∙ 332[164364309] ←
 12124215[164364881]                 Where      (Ограничения на отбор данных) ←
  1507381[164364785]                   <Наследуемые ограничения> ←
      413[164365930]                   И ←
  1507376[164365646]                   Выражение ←
  1507455[164365615]                     Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164366354]                       Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638479[164364914]                     Не равно ←
  1507452[164365304]                     Константа ≡ <<Документ>> ∙ 367[5] ←
      413[164365934]                   И ←
  1507376[164365647]                   Выражение ←
  1507455[164365616]                     Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[164366355]                       Уточняющий параметр ≡ Группа товаров ∙ 331[14286851] ←
  1638473[164366322]                     Равно ←
  1507452[164365305]                     Константа ≡ <<Документ>> ∙ 367[5] ←
      411[164373458]                       Уточняющий параметр ≡ Группа товаров ∙ 331[14286851] ←
 30867466[164365790]                 Выполнить после получения записи ←
 11010080[164373556]                   = ≡ ДУЦ ∙ 65545[164369201] ←
      404[164392069]                     Результат ≡ з.Документ ∙ 1507335[18547059] ←
  1507360[164365563]                   Отбор данных (по запросу) • Строки ДУЦ ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[164367723]                     Значения формальных параметров при вызове ←
 32505860[164371364]                       Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164374226]                         Выражение ≡ ДУЦ ∙ 65545[164369201] ←
 32505860[164371365]                       Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт ∙ 65545[1510111] ←
   327700[164374227]                         Выражение ≡ Строка текущего ДУЦ ∙ 65545[164369199] ←
      411[164373459]                           Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164374120]                       Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[1510100] ←
   327700[164378447]                         Выражение ≡ Строка документа управления ценообразованием ∙ 360[164364311] ←
 12124215[164364882]                     Where      (Ограничения на отбор данных) ←
  1507381[164364786]                       <Наследуемые ограничения> ←
      413[164365935]                       И ←
  1507376[164365648]                       Выражение ←
  1507455[164365617]                         Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164366356]                           Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[164366323]                         Равно ←
  1638402[164365294]                         NULL ←
 30867466[164365791]                     Выполнить после получения записи ←
 11010080[164373557]                       = ≡ Строка ДУЦ для изменения ∙ 65545[164369202] ←
      404[164392072]                         Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 11010092[164364556]                       Добавить в локальную таблицу ≡ Строки для изменения ∙ 30867458[164364479] ←
 30867477[164364513]           Отбор данных из локальной таблицы ≡ Строки для изменения ∙ 30867458[164364479] ←
 11010107[164364376]             Выполнить после обработки блока ≡ ДУЦ ∙ 30867481[164364469] ←
 11010080[164373559]               = ≡ Список ДУЦ ∙ 65545[164369203] ←
      404[164392070]                 Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164364636]                   Список элементов ←
   327700[164374228]                     Выражение ≡ ДУЦ ∙ 65545[164369201] ←
   327700[164374229]                     Выражение ≡ Список ДУЦ ∙ 65545[164369203] ←
 12124190[164364431]           Форма ввода • Новая цена ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164364519]             Список полей формы ←
      598[164365585]               Поле (колонка) для ввода данных ≡ Список ДУЦ ∙ 65545[164369203] ←
      209[164364688]                 Выбор из списка ≡ Документы управления ценообразованием ∙ 371[164364430] ←
   262165[164364420]                   Выбор нескольких объектов из списка ≡ Да ∙ 534[40566785] ←
 32505862[164367724]                   Значения формальных параметров при вызове ←
 32505860[164371367]                     Значение параметра при вызове процедуры/функции ≡ Фильтр.Список UID-ов ∙ 65545[1510082] ←
   327700[164374231]                       Выражение ≡ Список ДУЦ ∙ 65545[164369203] ←
 30867477[164364514]           Отбор данных из локальной таблицы ≡ Строки для изменения ∙ 30867458[164364479] ←
 30867466[164365792]             Выполнить после получения записи ←
 11010099[164364762]               CONTINUE ←
      116[164367415]                 Выражение ←
  1638460[164365095]                   НЕ ←
      404[164392062]                   Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[164367725]                     Значения формальных параметров при вызове ←
 32505860[164371368]                       Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[164374223]                         Выражение ≡ Список ДУЦ ∙ 65545[164369203] ←
 32505860[164371369]                       Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[164374232]                         Выражение ≡ ДУЦ ∙ 65545[164369201] ←
 30867470[164366537]               IF ←
  1638463[164367208]                 Условие ←
      404[164392063]                   Результат ≡ Строка ДУЦ для изменения ∙ 65545[164369202] ←
      411[164373455]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164373460]                       Уточняющий параметр ≡ Состояние документа ∙ 331[14] ←
  1638473[164366324]                   Равно ←
      404[164392071]                   Результат ⁼ 1 ←
 30867472[164366526]                 THEN ←
 11010088[164366874]                   ВЫПОЛНИТЬ ≡ Объект.Деакцепт ∙ 249[1507435] ←
 30867474[164364644]                     Объект ≡ Строка ДУЦ для изменения ∙ 65545[164369202] ←
      411[164373461]                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
 30867470[164366541]               IF ←
  1638463[164367210]                 Условие ←
      404[164392073]                   Результат ≡ Строка ДУЦ для изменения ∙ 65545[164369202] ←
      411[164373462]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164373463]                       Уточняющий параметр ≡ Состояние документа ∙ 331[14] ←
  1638473[164366325]                   Равно ←
      404[164392074]                   Результат ⁼ 0 ←
 30867472[164366530]                 THEN ←
 30867470[164366540]                   IF ←
  1638463[164367209]                     Условие ←
      404[164392064]                       Результат ≡ Строка ДУЦ для изменения ∙ 65545[164369202] ←
      411[164373456]                         Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
  1638479[164364910]                       Не равно ←
      404[164392065]                       Результат ≡ Строка текущего ДУЦ ∙ 65545[164369199] ←
      411[164373457]                         Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 30867472[164366527]                     THEN • Редактируем строку ←
 11010088[164366876]                       ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[164364646]                         Объект ≡ Строка ДУЦ для изменения ∙ 65545[164369202] ←
      377[164364717]                         Начальные значения полей объекта ←
   131095[164365734]                           Начальное значение поля ≡ Цена розничная ∙ 359[15007746] ←
   327700[164374233]                             Выражение ≡ Строка текущего ДУЦ ∙ 65545[164369199] ←
      411[164373464]                               Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
   131095[164365736]                           Начальное значение поля ≡ Маркировать ∙ 359[28835848] ←
   327700[164374234]                             Выражение ≡ Да ∙ 131203075[131203074] ←
   131095[164365737]                           Начальное значение поля ≡ Дата счета-фактуры ∙ 359[42401811] ←
   327700[164374265]                             Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
   131095[164365740]                           Начальное значение поля ≡ Комментарий ∙ 359[42401830] ←
   327700[164374268]                             Выражение ⁼ Ручное изменение цены (скопировано из другого ДУЦ) ←
 39780366[164365044]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
   131079[164364314]     Список горячих клавиш ←
   131082[164364319]       Назначение клавиши ≡ SPACE ∙ 131080[1507329] ←
      103[164364512]         Команда ≡ USER 1 ∙ 102[57201] ←
 32505857[164364305]       Наследуемые назначения клавиш ←
 12124189[164364361]     Выполнить при завершении ←
 11010104[164364425]       Очистить локальную таблицу ≡ Строки ∙ 30867458[164364404] ←
