_etk

      371[144441678]   Вид просмотра • Строки заказа ≡ СТРОКИ (ТОРГОВАЯ СЕТЬ) ∙ 371[40044060] ←
       262[58392584]     Наследуемые атрибуты ≡ Выполнить при завершении ∙ 1[12124189] ←
       262[58392597]     Наследуемые атрибуты ≡ Подстановки виртуальных блоков ∙ 1[1507531] ←
      262[656081107]     Наследуемые атрибуты ≡ Обработка команд ∙ 1[1507618] ←
  1507626[144441353]     Идентификатор объекта ≡ <<Строка>> ∙ 367[6] ←
 32505861[144441472]     Формальные параметры ←
      246[655294499]       <Наследуемые поля, колонки> ←
    65545[144447116]       Локальная переменная • ~Документ ≡ Документ ∙ 107[8] ←
    65545[144447287]       Локальная переменная • ~Тип строки ≡ Тип строки ∙ 107[12189698] ←
    65545[656090094]       Локальная переменная • ~Фильтровать по менеджеру группы ≡ bool ∙ 107[1507344] ←
      355[656083319]         Начальное значение ≡ false ∙ 117[30867469] ←
 32505863[144441574]     Локальные переменные ←
      246[655294500]       <Наследуемые поля, колонки> ←
 30867495[144441858]       Группа локальных переменных • Поля просмотра ←
    65545[655297757]         Локальная переменная • Требует обработки ≡ bool ∙ 107[1507344] ←
     65545[58523749]         Локальная переменная • Продукт ≡ Продукт ∙ 107[7] ←
    65545[144447103]         Локальная переменная • * ≡ Короткая строка (12 символов) ∙ 107[2293761] ←
     65545[58392772]         Локальная переменная • Порядковый номер ≡ Целое без знака ∙ 107[262146] ←
    65545[144447105]         Локальная переменная • Код ≡ Короткая строка (12 символов) ∙ 107[2293761] ←
    65545[144447106]         Локальная переменная • Наименование ≡ Наименование объекта (80) ∙ 107[262147] ←
    65545[655299589]         Локальная переменная • Признак ≡ Короткая строка (12 символов) ∙ 107[2293761] ←
    65545[144447107]         Локальная переменная • Кол-во реализованного ≡ Количество ∙ 107[15] ←
     65545[40375080]         Локальная переменная • Кол-во реал (предыдущие 7 дней) ≡ Количество ∙ 107[15] ←
    65545[144447108]         Локальная переменная • Цена закупочная ≡ Цена ∙ 107[16] ←
    65545[144447109]         Локальная переменная • БЕ ≡ Строка (30) ∙ 107[28835850] ←
    65545[144447110]         Локальная переменная • Вес БЕ ≡ Число ∙ 107[4] ←
    65545[144447111]         Локальная переменная • Кол-во автозаказа ≡ Количество ∙ 107[15] ←
    65545[144447112]         Локальная переменная • Кол-во заказа ≡ Количество ∙ 107[15] ←
    65545[655296752]         Локальная переменная • Кол-во ПРОМО ≡ Количество ∙ 107[15] ←
    65545[655296753]         Локальная переменная • Коэф. ПРОМО ≡ Количество ∙ 107[15] ←
    65545[656081095]         Локальная переменная • Количество разовое ПРОМО ≡ Количество ∙ 107[15] ←
    65545[144447113]         Локальная переменная • Сумма закупочная ≡ Сумма ∙ 107[12] ←
    65545[144447114]         Локальная переменная • СП ≡ Число ∙ 107[4] ←
    65545[655298753]         Локальная переменная • Скорость продаж (СП2) ≡ Число ∙ 107[4] ←
    65545[655298754]         Локальная переменная • Коэф. месяца ≡ Число, точность 4 знака ∙ 107[1507341] ←
     65545[58393144]         Локальная переменная • Коэф. дат ≡ Число, точность 4 знака ∙ 107[1507341] ←
     65545[58393145]         Локальная переменная • Коэф. дней ≡ Число, точность 4 знака ∙ 107[1507341] ←
    65545[144447115]         Локальная переменная • Продажи предыдущего дня ≡ Число ∙ 107[4] ←
     65545[40372010]         Локальная переменная • Остаток ТТ ≡ Число ∙ 107[4] ←
     65545[58392814]         Локальная переменная • Остаток Магазинов (факт) ≡ Число ∙ 107[4] ←
    65545[655298414]         Локальная переменная • Остаток РЦ ≡ Число ∙ 107[4] ←
     65545[58392769]         Локальная переменная • Остаток РЦ на момент расчета ≡ Число ∙ 107[4] ←
     65545[58392768]         Локальная переменная • Ф.Остаток ≡ Число ∙ 107[4] ←
    65545[164499394]         Локальная переменная • Остаток ингредиента ≡ Число ∙ 107[4] ←
    65545[656081614]         Локальная переменная • Реализация он-лайн ≡ Число ∙ 107[4] ←
    65545[164372410]         Локальная переменная • Реализация по ПРОМО ≡ Число ∙ 107[4] ←
    65545[656081707]         Локальная переменная • Остаток он-лайн ≡ Число ∙ 107[4] ←
     65545[40374485]         Локальная переменная • Мин.кол-во ≡ Количество ∙ 107[15] ←
    65545[655296839]         Локальная переменная • ДатаН ≡ Дата ∙ 107[3] ←
    65545[655296840]         Локальная переменная • ДатаК ≡ Дата ∙ 107[3] ←
    65545[655296834]         Локальная переменная • Кол-во мин.дробимое ≡ Количество ∙ 107[15] ←
    65545[656086944]         Локальная переменная • Кол-во в блоке ≡ Количество ∙ 107[15] ←
    65545[655296835]         Локальная переменная • Кол-во в упак ≡ Количество ∙ 107[15] ←
    65545[656088441]         Локальная переменная • Кол-во упаковок ≡ Количество ∙ 107[15] ←
     65545[58392813]         Локальная переменная • Кол-во в паллете ≡ Количество ∙ 107[15] ←
    65545[656088442]         Локальная переменная • Кол-во паллет ≡ Количество ∙ 107[15] ←
     65545[58393146]         Локальная переменная • Срок хранения ≡ Сумма ∙ 107[12] ←
     65545[58393364]         Локальная переменная • Дробится менее 1 кг ≡ Короткая строка (12 символов) ∙ 107[2293761] ←
    65545[655296836]         Локальная переменная • Ф.Приход ≡ Количество ∙ 107[15] ←
     65545[40375153]         Локальная переменная • Срок годности ≡ Дата ∙ 107[3] ←
    65545[655299057]         Локальная переменная • Причина исправления ≡ Объект ∙ 107[19] ←
    65545[655296837]         Локальная переменная • Список ШК ≡ Длинная строка (250) ∙ 107[28835851] ←
    65545[655296838]         Локальная переменная • Предыдущий прогноз ≡ Количество ∙ 107[15] ←
     65545[58392765]         Локальная переменная • Магазин имя ≡ Наименование объекта (80) ∙ 107[262147] ←
     65545[58392770]         Локальная переменная • ТТ ≡ Короткая строка (12 символов) ∙ 107[2293761] ←
     65545[58392766]         Локальная переменная • Объем продаж за период поставки ≡ Сумма ∙ 107[12] ←
     65545[58392767]         Локальная переменная • Объем продаж за период риска ≡ Сумма ∙ 107[12] ←
     65545[58393086]         Локальная переменная • Количество дней наличия ≡ Число ∙ 107[4] ←
     65545[58393087]         Локальная переменная • ПРОМО СП1 ≡ Короткая строка (12 символов) ∙ 107[2293761] ←
     65545[58393088]         Локальная переменная • ПРОМО СП2 ≡ Короткая строка (12 символов) ∙ 107[2293761] ←
     65545[58393340]         Локальная переменная • Цена ПРОМО старая ≡ Сумма ∙ 107[12] ←
     65545[58393341]         Локальная переменная • Цена ПРОМО новая ≡ Сумма ∙ 107[12] ←
     65545[58393342]         Локальная переменная • Скидка по ПРОМО ≡ Число ∙ 107[4] ←
     65545[58393362]         Локальная переменная • Товарный запас на РЦ ≡ Число ∙ 107[4] ←
     65545[58393363]         Локальная переменная • Товарный запас на ТТ ≡ Число ∙ 107[4] ←
    65545[164890125]         Локальная переменная • Товарный запас на ТТ (с учетом заказа) ≡ Число ∙ 107[4] ←
    65545[656081776]         Локальная переменная • Уровень буфера текущий ≡ Число ∙ 107[4] ←
    65545[656081777]         Локальная переменная • Наполнение буфера ≡ Число ∙ 107[4] ←
    65545[656081778]         Локальная переменная • Проникновение в ЗЗ ≡ Число ∙ 107[4] ←
    65545[656081779]         Локальная переменная • Проникновение в КЗ ≡ Число ∙ 107[4] ←
    65545[164890172]         Локальная переменная • Претензии КРО ≡ Строка (40) ∙ 107[1] ←
    65545[164372611]         Локальная переменная • Номер машины ≡ Целое ∙ 107[2] ←
    65545[656084276]         Локальная переменная • Дельта упаковка ≡ Число ∙ 107[4] ←
      117[656082326]         Выражение • Кол заказа/кол в уп ≡ Число ∙ 107[4] ←
  1638464[656081559]           Ноль (0.0), если NULL ≡ Кол-во заказа ∙ 65545[144447112] ←
      402[656081182]           Делить ←
  1638464[656081560]           Ноль (0.0), если NULL ≡ Кол-во в упак ∙ 65545[655296835] ←
    65545[656084278]         Локальная переменная • Дельта паллет ≡ Число ∙ 107[4] ←
      117[656082327]         Выражение • Кол заказа/кол в паллете ≡ Число ∙ 107[4] ←
  1638464[656081562]           Ноль (0.0), если NULL ≡ Кол-во заказа ∙ 65545[144447112] ←
      402[656081183]           Делить ←
  1638464[656081563]           Ноль (0.0), если NULL ≡ Кол-во в паллете ∙ 65545[58392813] ←
    65545[164891023]         Локальная переменная • ABC ≡ Короткая строка (2 символа) ∙ 107[48431110] ←
    65545[165806830]         Локальная переменная • Наличие регулярной матрицы ≡ Короткая строка (1 символ) ∙ 107[48431106] ←
 30867495[655294612]       Группа локальных переменных • Для работы с упаковками ←
    65545[655297162]         Локальная переменная • Кратно упаковке ≡ Целое без знака ∙ 107[262146] ←
    65545[655297163]         Локальная переменная • Количество рекомендуемое ≡ Количество ∙ 107[15] ←
    65545[655297164]         Локальная переменная • Количество в упаковке ≡ Количество ∙ 107[15] ←
    65545[656088448]         Локальная переменная • Строка товар-исключение ≡ Строка (объект БД) ∙ 107[10] ←
 30867495[655294709]       Группа локальных переменных • Подсветка ←
    65545[655299269]         Локальная переменная • Подсвечивать ≡ bool ∙ 107[1507344] ←
       355[58523699]           Начальное значение ≡ false ∙ 117[30867469] ←
    65545[655299271]         Локальная переменная • Документы промо ≡ Документ ∙ 107[8] ←
     65545[58392806]         Локальная переменная • Количество из промо-документов ≡ Число ∙ 107[4] ←
 30867495[655294574]       Группа локальных переменных • Сортировки ←
      117[655294557]         Выражение • Сортировать по коду ТТ ≡ Целое без знака ∙ 107[262146] ←
      116[655296013]           Выражение ←
      404[655308957]             Результат ≡ Сортировка ∙ 65545[1510125] ←
  1638473[655297242]             Равно ←
      404[655308958]             Результат ≡ По коду ТТ ∙ 1507640[655294494] ←
      117[655294770]         Выражение • Сортировать по имени ТТ ≡ Целое без знака ∙ 107[262146] ←
      116[655296129]           Выражение ←
      404[655308959]             Результат ≡ Сортировка ∙ 65545[1510125] ←
  1638473[655297243]             Равно ←
      404[655308960]             Результат ≡ По Имени ТТ ∙ 1507640[655294495] ←
      117[656082394]         Выражение • По возрастанию : Если по коду ТТ ≡ Целое ∙ 107[2] ←
      116[656085625]           Выражение ←
      404[656130922]             Результат ≡ Сортировка ∙ 65545[1510125] ←
  1638473[656086575]             Равно ←
      404[656130923]             Результат ≡ По коду ТТ ∙ 1507640[655294494] ←
      413[656084956]           И ←
      116[656085631]           Выражение ←
  1638460[656082068]             НЕ ←
      404[656130924]             Результат ≡ Список данных.Обратный порядок отбора ∙ 387[1507437] ←
      117[656082395]         Выражение • По убыванию : Если по коду ТТ ≡ Целое ∙ 107[2] ←
      116[656085632]           Выражение ←
      404[656130925]             Результат ≡ Сортировка ∙ 65545[1510125] ←
  1638473[656086577]             Равно ←
      404[656130926]             Результат ≡ По коду ТТ ∙ 1507640[655294494] ←
      413[656084958]           И ←
      404[656130932]           Результат ≡ Список данных.Обратный порядок отбора ∙ 387[1507437] ←
    65545[165544754]       Локальная переменная • Фасовочный цех? ≡ bool ∙ 107[1507344] ←
    65545[656088414]       Локальная переменная • Тип_сети_заказа ≡ Объект ∙ 107[19] ←
      355[656083570]         Начальное значение ≡ NULL ∙ 117[30670850] ←
      117[656082393]       Выражение • Фон ТТ-РЦ-П ≡ Объект ∙ 107[19] ←
  1638461[656081987]         Условный оператор (IF) ←
  1638463[656086084]           Условие ←
      404[656117262]             Результат ≡ <<Строка>> ∙ 367[6] ←
      105[656082006]           То ←
  1638461[656081991]             Условный оператор (IF) ←
  1638463[656086091]               Условие ←
  1638464[656081574]                 Ноль (0.0), если NULL ≡ Дельта упаковка ∙ 65545[656084276] ←
  1638479[656082473]                 Не равно ←
      404[656117263]                 Результат ⁼ 0 ←
      105[656082010]               То ←
      404[656117283]                 Результат ≡ Красный ∙ 30[917510] ←
      424[656081962]               Иначе ←
  1638461[656081992]                 Условный оператор (IF) ←
  1638463[656086092]                   Условие ←
  1638464[656081575]                     Ноль (0.0), если NULL ≡ Дельта паллет ∙ 65545[656084278] ←
  1638479[656082474]                     Не равно ←
      404[656117282]                     Результат ⁼ 0 ←
      105[656082011]                   То ←
      404[656117276]                     Результат ≡ Серо-голубой ∙ 30[8847361] ←
      424[656081963]                   Иначе ←
      404[656117145]                     Результат ≡ Цвет фона (ввод в ячейку значения) ∙ 249[40042791] ←
 32505862[656086031]                       Значения формальных параметров при вызове ←
  1507727[656080958]                         <Наследуемые значения> ←
 32505860[656092371]                         Значение параметра при вызове процедуры/функции ≡ Проверять состояние документа ∙ 65545[40053778] ←
   327700[656098471]                           Выражение ⁼ 1 ←
      424[656081961]           Иначе ←
  1638402[656083996]             NULL ←
     65545[58392959]       Локальная переменная • Список спецификаций ≡ Список документов ∙ 107[1507335] ←
       117[58392694]       Выражение • Проверка специфиций (РЦ и не РЦ) ≡ bool ∙ 107[1507344] ←
       404[58396245]         Результат ≡ { ... скрипт ... } ∙ 249[39780357] ←
  32505863[58392612]           Локальные переменные ←
     65545[58392960]             Локальная переменная • Есть через РЦ ≡ bool ∙ 107[1507344] ←
       355[58392724]               Начальное значение ≡ false ∙ 117[30867469] ←
  30867463[58392658]           Выполнить действия ←
  30867470[58392870]             IF ←
   1638463[58393012]               Условие ←
       404[58396246]                 Результат ≡ Список спецификаций ∙ 65545[58392959] ←
  30867472[58392866]               THEN ←
   1507360[58392663]                 Отбор данных (по запросу) ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
  32505862[58392974]                   Значения формальных параметров при вызове ←
  32505860[58393477]                     Значение параметра при вызове процедуры/функции ≡ Фильтр.Список UID-ов ∙ 65545[1510083] ←
    327700[58393964]                       Выражение ≡ Список спецификаций ∙ 65545[58392959] ←
  30867466[58392675]                   Выполнить после получения записи ←
  30867470[58392871]                     IF ←
   1638463[58393013]                       Условие ←
       404[58396247]                         Результат ≡ з.Документ ∙ 1507335[18547059] ←
       411[58393798]                           Уточняющий параметр ≡ Способ доставки ∙ 331[28835862] ←
   1638473[58393180]                         Равно ←
       404[58396248]                         Результат ≡ Распределительный центр ∙ 28835864[655294466] ←
  30867472[58392867]                       THEN ←
  11010080[58393203]                         = ≡ Есть через РЦ ∙ 65545[58392960] ←
       404[58396249]                           Результат ≡ true ∙ 117[30867468] ←
  11010100[58392593]                         BREAK ⁼ 1 ←
  39780366[58392696]             RETURN ≡ Есть через РЦ ∙ 65545[58392960] ←
    65545[144447117]       Локальная переменная • Цвет ≡ Цвет (алкоголя) ∙ 107[7602180] ←
       117[40371377]       Выражение • Шрифт ≡ Объект ∙ 107[19] ←
  1638461[655294821]         Условный оператор (IF) ←
  1638463[655296700]           Условие ←
      116[655297641]             Выражение ←
      404[655309194]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655300395]                 Уточняющий параметр ≡ Маркировать ∙ 359[28835848] ←
  1638473[655297256]               Равно ←
      404[655309198]               Результат ≡ Да ∙ 131203075[131203074] ←
      412[655294650]             ИЛИ ←
      116[655297642]             Выражение ←
      404[655308623]               Результат ≡ Код ∙ 65545[144447105] ←
  1638473[655296848]               Равно ←
  1638402[655295140]               NULL ←
      105[655294824]           То ←
      404[655309199]             Результат ∙ 262167[48431105] ←
      424[655294822]           Иначе ←
   1638461[40370396]             Условный оператор (IF) ←
   1638463[40373582]               Условие ←
       404[40378695]                 Результат ≡ Является ТОПом для данного магазина ∙ 117[40371378] ←
  32505862[40371973]                   Значения формальных параметров при вызове ←
  32505860[40370744]                     Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[40371932] ←
    327700[40372579]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[40373090]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  32505860[40370745]                     Значение параметра при вызове процедуры/функции ≡ Магазины ∙ 65545[40371933] ←
    327700[40372584]                       Выражение ≡ Список Магазинов ∙ 65545[655299270] ←
 32505860[655295935]                     Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[655294858] ←
   327700[655295430]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[655294741]                         Уточняющий параметр ≡ Дата ∙ 331[8] ←
   1638473[40374806]                 Равно ←
       404[40378699]                 Результат ≡ Да ∙ 131203075[131203074] ←
       105[40370397]               То ←
      404[655296027]                 Результат ≡ Arial Bold ∙ 262167[40370177] ←
       424[40370415]               Иначе ←
   1638402[40370373]                 NULL ←
      117[655294602]       Выражение • Фон ≡ Объект ∙ 107[19] ←
  1638461[165543964]         Условный оператор (IF) ←
  1638463[165544291]           Условие ←
      116[165544219]             Выражение ←
      404[165547507]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[165544754]                 Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[165544755]                   Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[165544752]                     Уточняющий параметр ≡ Код ∙ 296[5] ←
  1638473[165544630]               Равно ←
      404[165547506]               Результат ⁼ '3101' ←
      412[165543972]             ИЛИ ←
      116[165544221]             Выражение ←
      404[165547510]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[165544758]                 Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[165544759]                   Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[165544760]                     Уточняющий параметр ≡ Код ∙ 296[5] ←
  1638473[165544632]               Равно ←
      404[165547511]               Результат ⁼ '3105' ←
      105[165543964]           То ←
      404[165547508]             Результат ≡ светлозеленый 50% ∙ 30[34996229] ←
  1638461[656081615]         Условный оператор (IF) ←
  1638463[656082145]           Условие ←
      404[656081916]             Результат ≡ <<Строка>> ∙ 367[6] ←
      105[656081631]           То ←
       19[656080927]             Выбор (CASE) ←
  1572877[656081076]               Условие ←
  1638464[656081336]                 Ноль (0.0), если NULL ≡ <<Строка>> ∙ 367[6] ←
      411[656087282]                   Уточняющий параметр ≡ Начало ∙ 359[6684674] ←
      416[656080918]               Если равно ⁼ 1 ←
      404[656088315]                 Результат ≡ небесно-голубой ∙ 30[18415617] ←
      416[656080919]               Если равно ⁼ 2 ←
      404[656088316]                 Результат ≡ Pink ∙ 30[4587534] ←
      416[656080920]               Если равно ⁼ 3 ←
      404[656088317]                 Результат ≡ Серый_35 ∙ 30[4587527] ←
      416[656080921]               Если равно ⁼ 4 ←
      404[656088318]                 Результат ≡ Болотный ∙ 30[4587541] ←
      424[656081640]               Иначе ←
  1638461[656081830]                 Условный оператор (IF) ←
  1638463[656082192]                   Условие ←
      116[656085906]                     Выражение ←
      116[656085907]                       Выражение ←
  1638464[656081337]                         Ноль (0.0), если NULL ≡ <<Строка>> ∙ 367[6] ←
      411[656087283]                           Уточняющий параметр ≡ Коэффициент промо ∙ 359[28835875] ←
  1638479[656082117]                         Не равно ←
      404[656088320]                         Результат ⁼ 1 ←
      413[656081519]                       И ←
      116[656085908]                       Выражение ←
      404[656088321]                         Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656087284]                           Уточняющий параметр ≡ Коэффициент промо ∙ 359[28835875] ←
  1638479[656082118]                         Не равно ←
  1638402[656081888]                         NULL ←
      412[656081385]                     ИЛИ ←
      116[656085909]                     Выражение ←
  1638464[656081338]                       Ноль (0.0), если NULL ≡ <<Строка>> ∙ 367[6] ←
      411[656087285]                         Уточняющий параметр ≡ Количество палет [факт] ∙ 359[2818052] ←
  1638479[656082119]                       Не равно ←
      404[656088322]                       Результат ⁼ 0 ←
      412[656081386]                     ИЛИ ←
      116[656085910]                     Выражение ←
  1638464[656081339]                       Ноль (0.0), если NULL ≡ <<Строка>> ∙ 367[6] ←
      411[656087286]                         Уточняющий параметр ≡ Количество упаковок [док] ∙ 359[2818050] ←
  1638479[656082122]                       Не равно ←
      404[656088323]                       Результат ⁼ 0 ←
      412[656081387]                     ИЛИ ←
      116[656085911]                     Выражение ←
  1638464[656081340]                       Ноль (0.0), если NULL ≡ <<Строка>> ∙ 367[6] ←
      411[656087287]                         Уточняющий параметр ≡ Окончание ∙ 359[6684675] ←
  1638479[656082263]                       Не равно ←
      404[656088324]                       Результат ⁼ 0 ←
      105[656081849]                   То ←
      404[656088325]                     Результат ≡ Желтый ∙ 30[917509] ←
      424[656081796]                   Иначе ←
  1638461[656081831]                     Условный оператор (IF) ←
  1638463[656082194]                       Условие ←
      404[656088326]                         Результат ≡ Подсвечивать ∙ 65545[655299269] ←
      105[656081850]                       То ←
      404[656088327]                         Результат ≡ Lilac ∙ 30[4587539] ←
      424[656081797]                       Иначе ←
  1638461[656081832]                         Условный оператор (IF) ←
  1638463[656082196]                           Условие ←
      404[656088328]                             Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656087288]                               Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[656087289]                                 Уточняющий параметр ≡ Ценовая ниша ∙ 305[28835913] ←
  1638473[656081929]                             Равно ←
      404[656088329]                             Результат ≡ СТМ ∙ 117[164365009] ←
      105[656081851]                           То ←
      404[656088330]                             Результат ≡ Orange ∙ 30[4587532] ←
      424[656081798]                           Иначе ←
  1638402[656082850]                             NULL ←
      424[656081880]           Иначе ←
  1638402[656082917]             NULL ←
      117[164888908]       Выражение • Фон АВС ≡ Объект ∙ 107[19] ←
  1638461[164888892]         Условный оператор (IF) ←
  1638463[164890133]           Условие ←
      404[164901586]             Результат ≡ ABC ∙ 65545[164891023] ←
  1638473[164890165]             Равно ←
      404[164901587]             Результат ⁼ 'A0' ←
      105[164888894]           То ←
      404[164901588]             Результат ≡ Pink ∙ 30[4587534] ←
      117[164888948]       Выражение • Шрифт поля "тов запас" ≡ Объект ∙ 107[19] ←
  1638461[164888956]         Условный оператор (IF) ←
  1638463[164890350]           Условие ←
      116[164890076]             Выражение ←
      404[164903074]               Результат ≡ <<Документ>> ∙ 367[5] ←
      411[164892959]                 Уточняющий параметр ≡ Способ оплаты ∙ 331[15073281] ←
  1638473[164890312]               Равно ←
      404[164903075]               Результат ≡ Дискаунтер ∙ 164364327[164364290] ←
      413[164890003]             И ←
      116[164890077]             Выражение ←
      404[164903076]               Результат ≡ Тов.запас с учетом заказа ∙ 117[164888947] ←
  1638478[164888592]               Больше ←
      404[164903077]               Результат ⁼ 14 ←
      105[164888958]           То ←
      404[164903072]             Результат ←
      117[164888956]       Выражение • Фон наименования в базовых строках ≡ Объект ∙ 107[19] ←
  1638461[164888959]         Условный оператор (IF) ←
  1638463[164890449]           Условие ←
      404[164903835]             Результат ≡ В дочерних строках есть промо ∙ 249[164888628] ←
 32505862[164890291]               Значения формальных параметров при вызове ←
 32505860[164892091]                 Значение параметра при вызове процедуры/функции ≡ Родительская строка ∙ 65545[164891433] ←
   327700[164893566]                   Выражение ≡ <<Строка>> ∙ 367[6] ←
      105[164888961]           То ←
      404[164903836]             Результат ≡ Желтый ∙ 30[917509] ←
    65545[144447118]       Локальная переменная • Всего строк ≡ Целое без знака ∙ 107[262146] ←
      355[144442525]         Начальное значение ⁼ 0 ←
    65545[144447119]       Локальная переменная • Общее количество ≡ Количество ∙ 107[15] ←
      355[144442526]         Начальное значение ⁼ 0 ←
    65545[144447120]       Локальная переменная • Общая сумма ≡ Сумма ∙ 107[12] ←
      355[144442527]         Начальное значение ⁼ 0 ←
    65545[164299533]       Локальная переменная • Общий вес ≡ Количество ∙ 107[15] ←
      355[164298800]         Начальное значение ⁼ 0 ←
    65545[656081838]       Локальная переменная • Количество упаковок ≡ Число ∙ 107[4] ←
    65545[656081834]       Локальная переменная • Общее количество упаковок ≡ Число ∙ 107[4] ←
      355[656081287]         Начальное значение ⁼ 0 ←
     65545[58392773]       Локальная переменная • Количество заказа общее ≡ Количество ∙ 107[15] ←
    65545[144447126]       Локальная переменная • Созданная строка ≡ Строка (объект БД) ∙ 107[10] ←
     65545[58392771]       Локальная переменная • Строка родитель ≡ Строка (объект БД) ∙ 107[10] ←
      117[655294722]       Выражение • Спецификация ≡ Документ ∙ 107[8] ←
      404[655317218]         Результат ≡ <<Документ>> ∙ 367[5] ←
      411[655304635]           Уточняющий параметр ≡ Список подгрупп ∙ 331[42401911] ←
      117[165478985]       Выражение • Сводный заказ закрыт ? ≡ bool ∙ 107[1507344] ←
  1638461[165478566]         Условный оператор (IF) ←
  1638463[165479127]           Условие ←
      116[165479138]             Выражение ←
      116[165479137]               Выражение ←
      404[165486487]                 Результат ≡ <<Документ>> ∙ 367[5] ←
      411[165479573]                   Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[165480925]                 Равно ←
      404[165486488]                 Результат ≡ ПроектныйЭлемент.Индекс ∙ 249[42467331] ←
 11010064[165478427]                   Выражение ≡ Сводный заказ товаров поставщику (ТТ) ∙ 332[656080908] ←
      412[165478548]               ИЛИ ←
      116[165479139]               Выражение ←
      404[165486489]                 Результат ≡ <<Документ>> ∙ 367[5] ←
      411[165479577]                   Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[165480927]                 Равно ←
      404[165486490]                 Результат ≡ ПроектныйЭлемент.Индекс ∙ 249[42467331] ←
 11010064[165478428]                   Выражение ≡ Сводный заказ товаров поставщику (РЦ) ∙ 332[656080904] ←
      412[165478549]               ИЛИ ←
      116[165479136]               Выражение ←
      404[165486491]                 Результат ≡ <<Документ>> ∙ 367[5] ←
      411[165479578]                   Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[165480928]                 Равно ←
      404[165486492]                 Результат ≡ ПроектныйЭлемент.Индекс ∙ 249[42467331] ←
 11010064[165478429]                   Выражение ≡ Сводный заказ на склад (РЦ) по торговым точкам ∙ 332[43122750] ←
      412[165478552]               ИЛИ ←
      116[165479186]               Выражение ←
      404[165486178]                 Результат ≡ <<Документ>> ∙ 367[5] ←
      411[165479657]                   Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[165480985]                 Равно ←
      404[165486179]                 Результат ≡ ПроектныйЭлемент.Индекс ∙ 249[42467331] ←
 11010064[165478431]                   Выражение ≡ Заказ товаров поставщику [магазин] ∙ 332[28836002] ←
      412[165478553]               ИЛИ ←
      116[165479187]               Выражение ←
      404[165486395]                 Результат ≡ <<Документ>> ∙ 367[5] ←
      411[165479658]                   Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[165480986]                 Равно ←
      404[165486396]                 Результат ≡ ПроектныйЭлемент.Индекс ∙ 249[42467331] ←
 11010064[165478432]                   Выражение ≡ Заказ товаров поставщику [РЦ] ∙ 332[14352385] ←
      412[165478554]               ИЛИ ←
      116[165479188]               Выражение ←
      404[165486581]                 Результат ≡ <<Документ>> ∙ 367[5] ←
      411[165479659]                   Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[165480987]                 Равно ←
      404[165486630]                 Результат ≡ ПроектныйЭлемент.Индекс ∙ 249[42467331] ←
 11010064[165478433]                   Выражение ≡ Заказ на склад (РЦ) с торговых точек (ТТ) ∙ 332[40042595] ←
      413[165479515]             И ←
      116[165479140]             Выражение ←
      404[165486493]               Результат ≡ <<Документ>> ∙ 367[5] ←
      411[165479579]                 Уточняющий параметр ≡ Состояние заказа поставщика ∙ 331[15204354] ←
  1638473[165480929]               Равно ←
      404[165486494]               Результат ≡ Закрыт ∙ 15204353[18022402] ←
      105[165478566]           То ←
      404[165486495]             Результат ≡ true ∙ 117[30867468] ←
      424[165478545]           Иначе ←
      404[165486496]             Результат ≡ false ∙ 117[30867469] ←
      117[655294728]       Выражение • Права на редактирование строки (true - только для просмотра) ≡ bool ∙ 107[1507344] ←
  1638461[655295296]         Условный оператор (IF) ←
  1638463[655296050]           Условие ←
      404[655306620]             Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655297731]               Уточняющий параметр ≡ Состояние строки ∙ 359[11] ←
      105[655295305]           То ←
      404[655306621]             Результат ≡ Сводный заказ закрыт ? ∙ 117[165478985] ←
      424[655295647]           Иначе ←
  1638461[655295341]             Условный оператор (IF) ←
  1638463[655298687]               Условие ←
      116[655297787]                 Выражение ←
      404[655322669]                   Результат ≡ <<Документ>> ∙ 367[5] ←
      411[655307197]                     Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[655298777]                   Равно ←
      404[655322670]                   Результат ≡ ПроектныйЭлемент.Индекс ∙ 249[42467331] ←
 11010064[655294769]                     Выражение ≡ Заказ на склад (РЦ) с торговой точки (ТТ) ∙ 332[28835998] ←
       412[58392733]                 ИЛИ ←
       116[58393569]                 Выражение ←
       404[58399903]                   Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58395262]                     Уточняющий параметр ≡ Тип ∙ 331[4] ←
   1638473[58393710]                   Равно ←
       404[58399904]                   Результат ≡ ПроектныйЭлемент.Индекс ∙ 249[42467331] ←
  11010064[58392670]                     Выражение ≡ Сводный заказ товаров поставщику (ТТ) ∙ 332[656080908] ←
       412[58392734]                 ИЛИ ←
       116[58393572]                 Выражение ←
       404[58399934]                   Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58395277]                     Уточняющий параметр ≡ Тип ∙ 331[4] ←
   1638473[58393720]                   Равно ←
       404[58399935]                   Результат ≡ ПроектныйЭлемент.Индекс ∙ 249[42467331] ←
  11010064[58392671]                     Выражение ≡ Сводный заказ на склад (РЦ) по торговым точкам ∙ 332[43122750] ←
      105[655295350]               То ←
      404[655322671]                 Результат ≡ false ∙ 117[30867469] ←
      424[655295331]               Иначе ←
  1638461[655294655]                 Условный оператор (IF) ←
  1638463[655296542]                   Условие ←
      116[655295991]                     Выражение ←
      404[655308041]                       Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655299693]                         Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[655299694]                           Уточняющий параметр ≡ Признак 1 ∙ 331[6684704] ←
  1638473[655297074]                       Равно ←
      404[655308042]                       Результат ≡ Да ∙ 131203075[131203074] ←
      412[655294733]                     ИЛИ ←
      116[655295992]                     Выражение ←
      404[655308043]                       Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655299695]                         Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[655299696]                           Уточняющий параметр ≡ Признак 1 ∙ 331[6684704] ←
  1638473[655297075]                       Равно ←
  1638402[655294691]                       NULL ←
      105[655294657]                   То ←
      404[655308046]                     Результат ≡ false ∙ 117[30867469] ←
      424[655294653]                   Иначе ←
  1638461[655295050]                     Условный оператор (IF) ←
  1638463[655297384]                       Условие ←
      116[655296862]                         Выражение ←
      404[655317219]                           Результат ≡ Спецификация ∙ 117[655294722] ←
      411[655304638]                             Уточняющий параметр ≡ Признак 3 ∙ 331[6684706] ←
  1638473[655298037]                           Равно ←
      404[655317220]                           Результат ≡ Да ∙ 131203075[131203074] ←
      105[655295057]                       То ←
      404[655317248]                         Результат ≡ false ∙ 117[30867469] ←
      424[655295055]                       Иначе ←
  1638461[655295051]                         Условный оператор (IF) ←
  1638463[655297764]                           Условие ←
      404[655308040]                             Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655300240]                               Уточняющий параметр ≡ Флаги "действительность компонент (число) ∙ 359[28246018] ←
  1638473[655297078]                             Равно ←
      404[655308045]                             Результат ⁼ 1 ←
      105[655295058]                           То ←
      404[655308047]                             Результат ≡ false ∙ 117[30867469] ←
      424[655295056]                           Иначе ←
      404[655313817]                             Результат ≡ true ∙ 117[30867468] ←
      117[655294945]       Выражение • Видимость СП2 ≡ bool ∙ 107[1507344] ←
  1638461[655295111]         Условный оператор (IF) ←
  1638463[655297937]           Условие ←
      116[655296967]             Выражение ←
      404[655318337]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655305057]                 Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[655305058]                   Уточняющий параметр ≡ Признак 3 ∙ 331[6684706] ←
  1638473[655298141]               Равно ←
      404[655318338]               Результат ≡ Да ∙ 131203075[131203074] ←
      105[655295118]           То ←
      404[655318340]             Результат ≡ true ∙ 117[30867468] ←
      424[655295108]           Иначе ←
      404[655318339]             Результат ≡ false ∙ 117[30867469] ←
    65545[655298358]       Локальная переменная • Штрих-код ≡ Строка (40) ∙ 107[1] ←
    65545[655298359]       Локальная переменная • Включить доп окно ≡ bool ∙ 107[1507344] ←
    65545[656085178]       Локальная переменная • МинСум ≡ Сумма ∙ 107[12] ←
    65545[656088725]       Локальная переменная • МаксСум ≡ Сумма ∙ 107[12] ←
    65545[656081833]       Локальная переменная • МинКолУпкв ≡ Число ∙ 107[4] ←
    65545[656088726]       Локальная переменная • МинКолПаллет ≡ Число ∙ 107[4] ←
    65545[164372408]       Локальная переменная • Общее количество паллет ≡ Число ∙ 107[4] ←
      355[164365999]         Начальное значение ⁼ 0 ←
    65545[655296833]       Локальная переменная • Группа имя ≡ Наименование объекта (80) ∙ 107[262147] ←
    65545[655299282]       Локальная переменная • Первый ТЗ для магазина ≡ Партнер ∙ 107[5] ←
    65545[655299270]       Локальная переменная • Список Магазинов ≡ Список партнеров ∙ 107[1507332] ←
     65545[58392759]       Локальная переменная • ЦО ≡ Партнер ∙ 107[5] ←
     65545[58393133]       Локальная переменная • Ограничение редактирования заказа ≡ Целое без знака ∙ 107[262146] ←
    65545[164889938]       Локальная переменная • Минимальный заказ по документу ограничения ≡ Число ∙ 107[4] ←
     65545[58523776]       Локальная переменная • Более ранний поставщик ≡ Партнер ∙ 107[5] ←
     65545[58393141]       Локальная переменная • Менеджер блокировки ≡ Партнер ∙ 107[5] ←
    65545[164303217]       Локальная переменная • Строка Ид темп ≡ Строка (объект БД) ∙ 107[10] ←
    65545[656090036]       Локальная переменная • Для ПЦ ≡ bool ∙ 107[1507344] ←
    65545[656082061]       Локальная переменная • Список групп менеджера ≡ Список каталогов ∙ 107[1507336] ←
      355[656082299]         Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164499523]       Локальная переменная • Произв. цех. ≡ Партнер ∙ 107[5] ←
    65545[165544738]       Локальная переменная • Предыдущие 7 дней ≡ Количество ∙ 107[15] ←
 30867495[165478649]       Группа локальных переменных • ЛТ : Строки ←
    65545[165482875]         Локальная переменная • ЛТ.Кол-во реализации (предыдущие 7 дней) ≡ Количество ∙ 107[15] ←
    65545[165482876]         Локальная переменная • ЛТ.Кол-во реализованного ≡ Количество ∙ 107[15] ←
    65545[165482877]         Локальная переменная • ЛТ.СП ≡ Количество ∙ 107[15] ←
    65545[165482879]       Локальная переменная • Есть промаркированные строки ≡ bool ∙ 107[1507344] ←
    65545[165806831]       Локальная переменная • Сводный заказ на РЦ ≡ bool ∙ 107[1507344] ←
  1507642[655294473]     Кодификаторы ←
  1507639[655294475]       Кодификатор • Поддерживаемые сортировки ←
  1507640[655294494]         Элемент кодификатора • По коду ТТ ←
  1507640[655294495]         Элемент кодификатора • По Имени ТТ ←
  1507531[655294545]     Подстановки виртуальных блоков ←
  30867469[58392728]       БЛОК ≡ Отбор данных.Начало ∙ 30867469[1511645] ←
  11010088[58393239]         ВЫПОЛНИТЬ ≡ WriteStatusText ∙ 127[12124167] ←
  11010095[58392950]           Выражение ←
       404[58397695]             Результат ⁼ 'Отбор данных.Начало' ←
  11010080[58393045]         = ≡ Порядковый номер ∙ 65545[58392772] ←
       404[58394857]           Результат ⁼ 0 ←
 11010080[164300336]         = ≡ Общий вес ∙ 65545[164299533] ←
      404[164302766]           Результат ⁼ 0 ←
 11010080[656097878]         = ≡ <<Строка>> ∙ 367[6] ←
  1638402[656083597]           NULL ←
 30867469[655295058]       БЛОК ≡ ОТБОР ДАННЫХ : Расчет переменных ∙ 30867469[1508852] ←
 30867470[165480155]         IF ←
  1638463[165480757]           Условие ←
      404[165502738]             Результат ≡ Отладка (BUGS) ∙ 249[165478456] ←
 32505862[165481518]               Значения формальных параметров при вызове ←
 32505860[165483755]                 Значение параметра при вызове процедуры/функции ≡ ID ∙ 65545[165480002] ←
   327700[165485346]                   Выражение ⁼ #456828 ←
 30867472[165480116]           THEN • Сбор показателей перенести в базовый запрос ←
 30867473[165479083]           ELSE • Сбор показателей отдельным запросом ←
  11010080[40378454]             = ≡ Кол-во реал (предыдущие 7 дней) ∙ 65545[40375080] ←
       404[40395913]               Результат ≡ <<Строка>> ∙ 367[6] ←
       411[40379288]                 Уточняющий параметр ≡ Количество палет [док] ∙ 359[2818049] ←
 11010080[144452328]             = ≡ Кол-во реализованного ∙ 65545[144447107] ←
       404[40392033]               Результат ≡ <<Строка>> ∙ 367[6] ←
       411[40377396]                 Уточняющий параметр ≡ Количество последней поставки ∙ 359[15204356] ←
 11010080[144452333]             = ≡ СП ∙ 65545[144447114] ←
      404[144465779]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[144445924]                 Уточняющий параметр ≡ Скорость реализации ∙ 359[15204355] ←
  1507360[165544114]             Отбор данных (по запросу) • Сбор показателей из магазинов Зарубина ←
  1507673[165543991]               Ключи оптимизации ←
  1507675[165543999]                 Использовать индекс ≡ Строка магазина ∙ 12124204[165544107] ←
  1507676[165543998]                   Уточняющий параметр ≡ По родителю ∙ 1507445[1507403] ←
 12124213[165544060]               Параметры ←
  1507335[165544222]                 Параметр • Стр маг ≡ Строка магазина ∙ 12124204[165544107] ←
  1507494[165544947]                   Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
 12124200[165544057]               From         (Таблицы) ←
 12124204[165544107]                 Таблица • Строка магазина ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[165544074]               Where      (Ограничения на отбор данных) ←
  1507455[165544707]                 Результат ≡ Строка магазина ∙ 12124204[165544107] ←
  1507494[165544974]                   Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[165544652]                 Равно ←
  1507452[165544412]                 Константа ≡ <<Строка>> ∙ 367[6] ←
      411[165544784]                   Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
 30867465[165543981]               Выполнить при старте ←
 11010080[165545653]                 = ≡ Кол-во реал (предыдущие 7 дней) ∙ 65545[40375080] ←
      404[165547593]                   Результат ⁼ 0 ←
 11010080[165545654]                 = ≡ Кол-во реализованного ∙ 65545[144447107] ←
      404[165547594]                   Результат ⁼ 0 ←
 11010080[165545655]                 = ≡ СП ∙ 65545[144447114] ←
      404[165547595]                   Результат ⁼ 0 ←
 30867466[165544136]               Выполнить после получения записи ←
 48431132[165544103]                 += ≡ Кол-во реал (предыдущие 7 дней) ∙ 65545[40375080] ←
  1638464[165544463]                   Ноль (0.0), если NULL ≡ Стр маг ∙ 1507335[165544222] ←
      411[165544781]                     Уточняющий параметр ≡ Количество палет [док] ∙ 359[2818049] ←
 48431132[165544104]                 += ≡ Кол-во реализованного ∙ 65545[144447107] ←
  1638464[165544470]                   Ноль (0.0), если NULL ≡ Стр маг ∙ 1507335[165544222] ←
      411[165544782]                     Уточняющий параметр ≡ Количество последней поставки ∙ 359[15204356] ←
 48431132[165544105]                 += ≡ СП ∙ 65545[144447114] ←
  1638464[165544471]                   Ноль (0.0), если NULL ≡ Стр маг ∙ 1507335[165544222] ←
      411[165544780]                     Уточняющий параметр ≡ Скорость реализации ∙ 359[15204355] ←
  11010093[58392659]         Комментарий • ----  из строки ←
 11010080[144452325]         = ≡ * ∙ 65545[144447103] ←
      404[144465771]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[144445918]             Уточняющий параметр ≡ * ∙ 117[1638401] ←
  48431132[58392587]         += ≡ Порядковый номер ∙ 65545[58392772] ←
       404[58394820]           Результат ⁼ 1 ←
 11010080[656093063]         = ≡ Тип_сети_заказа ∙ 65545[656088414] ←
  1638461[656082095]           Условный оператор (IF) ←
  1638463[656085435]             Условие ←
      404[656115146]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656089743]                 Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[656089744]                   Уточняющий параметр ≡ Способ оплаты ∙ 331[15073281] ←
      105[656082114]             То ←
      404[656115147]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656089745]                 Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[656090749]                   Уточняющий параметр ≡ Способ оплаты ∙ 331[15073281] ←
      424[656082065]             Иначе ←
      404[656124346]               Результат ≡ Вернуть тип сети по ЦО, ТТ, ТЗ, текущему узлу ∙ 249[164364412] ←
 32505862[656086292]                 Значения формальных параметров при вызове ←
 32505860[656091767]                   Значение параметра при вызове процедуры/функции ≡ Подразделение ∙ 65545[164370752] ←
   327700[656096998]                     Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[656081747]                       Выполнить действия ←
 39780366[656081650]                         RETURN ←
  1638461[656082096]                           Условный оператор (IF) ←
  1638463[656085436]                             Условие ←
      404[656124347]                               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656091981]                                 Уточняющий параметр ≡ Партнер ∙ 359[9] ←
      105[656082115]                             То ←
      404[656124348]                               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656091982]                                 Уточняющий параметр ≡ Партнер ∙ 359[9] ←
      424[656082066]                             Иначе ←
      404[656124349]                               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656092039]                                 Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[656092579]                                   Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  11010080[58393021]         = ≡ Магазин имя ∙ 65545[58392765] ←
       404[58394826]           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58393263]             Уточняющий параметр ≡ Партнер ∙ 359[9] ←
       411[58393264]               Уточняющий параметр ≡ Наименование ∙ 283[5] ←
  11010080[58393026]         = ≡ ТТ ∙ 65545[58392770] ←
       404[58394831]           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58393269]             Уточняющий параметр ≡ Партнер ∙ 359[9] ←
       411[58393270]               Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
  11010080[40377408]         = ≡ Мин.кол-во ∙ 65545[40374485] ←
       404[40392140]           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[40377504]             Уточняющий параметр ≡ Минимальная цена закупки ∙ 359[15204354] ←
 11010080[144452329]         = ≡ Цена закупочная ∙ 65545[144447108] ←
      404[144465776]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655300225]             Уточняющий параметр ≡ Цена закупочная ∙ 359[15007745] ←
 11010080[144452330]         = ≡ Кол-во автозаказа ∙ 65545[144447111] ←
      404[144465777]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[144445922]             Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
 11010080[144452331]         = ≡ Кол-во заказа ∙ 65545[144447112] ←
      404[655308854]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655300227]             Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
 11010080[655298363]         = ≡ Кол-во ПРОМО ∙ 65545[655296752] ←
      404[655305201]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655297846]             Уточняющий параметр ≡ Количество палет [факт] ∙ 359[2818052] ←
 11010080[655298442]         = ≡ Коэф. ПРОМО ∙ 65545[655296753] ←
      404[655305202]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655297847]             Уточняющий параметр ≡ Коэффициент промо ∙ 359[28835875] ←
 11010080[656081151]         = ≡ Количество разовое ПРОМО ∙ 65545[656081095] ←
      404[656081663]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656081434]             Уточняющий параметр ≡ Количество упаковок [факт] ∙ 359[2818053] ←
  11010080[58394225]         = ≡ Цена ПРОМО старая ∙ 65545[58393340] ←
       404[58400124]           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395372]             Уточняющий параметр ≡ Цена старая розничная ∙ 359[15007765] ←
  11010080[58394226]         = ≡ Цена ПРОМО новая ∙ 65545[58393341] ←
       404[58400125]           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395373]             Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
  30867470[58393222]         IF ←
   1638463[58393574]           Условие ←
       116[58393619]             Выражение ←
   1638464[58392977]               Ноль (0.0), если NULL ≡ Цена старая розничная ∙ 359[15007765] ←
   1638479[58392834]               Не равно ←
       404[58400130]               Результат ⁼ 0 ←
       413[58393306]             И ←
       116[58393620]             Выражение ←
   1638464[58392978]               Ноль (0.0), если NULL ≡ Цена розничная ∙ 359[15007746] ←
   1638479[58392835]               Не равно ←
       404[58400131]               Результат ⁼ 0 ←
  30867472[58393218]           THEN • находим скидку покупателю ←
  11010080[58394227]             = ≡ Скидка по ПРОМО ∙ 65545[58393342] ←
       116[58393618]               Выражение ←
       404[58400127]                 Результат ⁼ 1 ←
       406[58392736]                 Вычесть ←
       116[58393617]                 Выражение ←
       404[58400126]                   Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395374]                     Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
       402[58392622]                   Делить ←
       404[58400128]                   Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395375]                     Уточняющий параметр ≡ Цена старая розничная ∙ 359[15007765] ←
       403[58392765]               Умножить ←
       404[58400129]               Результат ⁼ 100 ←
  30867473[58392829]           ELSE • иначе скидка = нул ←
  11010080[58394228]             = ≡ Скидка по ПРОМО ∙ 65545[58393342] ←
   1638402[58392967]               NULL ←
 11010080[655303037]         = ≡ Ф.Приход ∙ 65545[655296836] ←
      404[655308643]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655305577]             Уточняющий параметр ≡ Кол-во единиц во фьючерсном приходе ∙ 359[28835874] ←
  11010080[58393574]         = ≡ Количество дней наличия ∙ 65545[58393086] ←
       404[58397774]           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58394584]             Уточняющий параметр ≡ Количество дней наличия ∙ 359[14352390] ←
 11010080[655302390]         = ≡ Скорость продаж (СП2) ∙ 65545[655298753] ←
      404[655318335]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655305047]             Уточняющий параметр ≡ Скорость реализации за предыдущий год ∙ 359[14352385] ←
  11010080[58393022]         = ≡ Объем продаж за период поставки ∙ 65545[58392766] ←
       404[58394827]           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58393265]             Уточняющий параметр ≡ Сумма подтвержденная ∙ 359[40042519] ←
  11010080[58393023]         = ≡ Объем продаж за период риска ∙ 65545[58392767] ←
       404[58394828]           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58393266]             Уточняющий параметр ≡ Сумма дополнительных расходов ∙ 359[42401834] ←
 11010080[655302391]         = ≡ Коэф. месяца ∙ 65545[655298754] ←
      404[655318336]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655305048]             Уточняющий параметр ≡ Коэффициент порогового значения ∙ 359[43122690] ←
  11010080[58393759]         = ≡ Коэф. дат ∙ 65545[58393144] ←
       404[58398412]           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58394778]             Уточняющий параметр ≡ Объем топлива ∙ 359[15073286] ←
  11010080[58393760]         = ≡ Коэф. дней ∙ 65545[58393145] ←
       404[58398413]           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58394779]             Уточняющий параметр ≡ Объем водоэмульсионнго слоя ∙ 359[15073291] ←
 11010080[144452334]         = ≡ Продажи предыдущего дня ∙ 65545[144447115] ←
      404[144465780]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[144445925]             Уточняющий параметр ≡ Продажи предыдущего дня ∙ 359[28835878] ←
 11010080[655299226]         = ≡ Остаток ТТ ∙ 65545[40372010] ←
      404[655308856]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655300228]             Уточняющий параметр ≡ Сколько сейчас есть у покупателя (ТТ, Магазина, Филиала) в наличии ∙ 359[40566787] ←
  11010080[58393072]         = ≡ Остаток Магазинов (факт) ∙ 65545[58392814] ←
       404[58395104]           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58393444]             Уточняющий параметр ≡ Количество упаковок [факт] ∙ 359[2818053] ←
 11010080[655301718]         = ≡ Остаток РЦ ∙ 65545[655298414] ←
      404[655315966]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655304148]             Уточняющий параметр ≡ Расхождение с накладной поставщика за счет округления ∙ 359[14286864] ←
  11010080[58393025]         = ≡ Остаток РЦ на момент расчета ∙ 65545[58392769] ←
       404[58394830]           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58393268]             Уточняющий параметр ≡ Текущий фактический остаток ∙ 359[14352391] ←
  11010080[58393024]         = ≡ Ф.Остаток ∙ 65545[58392768] ←
       404[58394829]           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58393267]             Уточняющий параметр ≡ Сколько сейчас уже заказано покупателем (ТТ, Магазин, Филиал) ∙ 359[40566786] ←
 11010080[656081970]         = ≡ Реализация он-лайн ∙ 65545[656081614] ←
      404[656084121]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656082294]             Уточняющий параметр ≡ Продажи предыдущего дня ∙ 359[28835878] ←
 11010080[656081971]         = ≡ Остаток он-лайн ∙ 65545[656081707] ←
      404[656084122]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656082295]             Уточняющий параметр ≡ Объем продукции ∙ 359[14483469] ←
 11010080[655303043]         = ≡ ДатаН ∙ 65545[655296839] ←
      404[655308658]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655300396]             Уточняющий параметр ≡ Дата начала ∙ 359[14745601] ←
 11010080[655303044]         = ≡ ДатаК ∙ 65545[655296840] ←
      404[655308659]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655300397]             Уточняющий параметр ≡ Дата окончания ∙ 359[14745602] ←
 11010080[655302745]         = ≡ Причина исправления ∙ 65545[655299057] ←
      404[655320132]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655305996]             Уточняющий параметр ≡ Способ оплаты ∙ 359[6684673] ←
 11010080[655303039]         = ≡ Предыдущий прогноз ∙ 65545[655296838] ←
      404[655308657]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655305984]             Уточняющий параметр ≡ Сумма оплаты ∙ 359[14876682] ←
  11010080[58393071]         = ≡ БЕ ∙ 65545[144447109] ←
       404[58395103]           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58393443]             Уточняющий параметр ≡ ЕИ ∙ 359[14745603] ←
       411[58393447]               Уточняющий параметр ≡ Имя ∙ 249[262146] ←
  11010080[58393575]         = ≡ ПРОМО СП1 ∙ 65545[58393087] ←
   1638461[58392783]           Условный оператор (IF) ←
   1638463[58393238]             Условие ←
       404[58397775]               Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58394585]                 Уточняющий параметр ≡ Ставка НСП поставщика ∙ 359[28835852] ←
   1638473[58393387]               Равно ←
       404[58397784]               Результат ⁼ 1 ←
       105[58392784]             То ←
       404[58397785]               Результат ⁼ 'Да' ←
       424[58392794]             Иначе ←
       404[58397786]               Результат ⁼ '' ←
  11010080[58393576]         = ≡ ПРОМО СП2 ∙ 65545[58393088] ←
   1638461[58392786]           Условный оператор (IF) ←
   1638463[58393241]             Условие ←
       404[58397787]               Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58394586]                 Уточняющий параметр ≡ Ставка НСП магазина ∙ 359[42401833] ←
   1638473[58393388]               Равно ←
       404[58397788]               Результат ⁼ 1 ←
       105[58392787]             То ←
       404[58397789]               Результат ⁼ 'Да' ←
       424[58392798]             Иначе ←
       404[58397790]               Результат ⁼ '' ←
  11010079[40370222]         CASE ←
   1572877[40370287]           Условие ←
       404[40383075]             Результат ≡ <<Строка>> ∙ 367[6] ←
       411[40374580]               Уточняющий параметр ≡ Флаги "действительность компонент (число) ∙ 359[28246018] ←
  11010081[40370410]           OF • Если кол-во = 0 ⁼ 1 ←
  11010080[40374733]             = ≡ Цвет ∙ 65545[144447117] ←
       404[40383076]               Результат ≡ Красный ∙ 30[917510] ←
  11010081[40370411]           OF • Если не обработана ⁼ 2 ←
  11010080[40374734]             = ≡ Цвет ∙ 65545[144447117] ←
       404[40383077]               Результат ≡ Зеленый ∙ 30[917507] ←
  11010081[40370685]           OF • Не нужен заказ ⁼ 3 ←
  11010080[40379215]             = ≡ Цвет ∙ 65545[144447117] ←
       404[40397830]               Результат ≡ Синий ∙ 30[917511] ←
  11010081[40370646]           OF • Нужен заказ! Кол-во равно минимальному ⁼ 4 ←
  11010080[40379440]             = ≡ Цвет ∙ 65545[144447117] ←
       404[40398411]               Результат ≡ Малиновый ∙ 30[917515] ←
 11010081[655295059]           OF • Заблокированный товар ⁼ 5 ←
 11010080[655302821]             = ≡ Цвет ∙ 65545[144447117] ←
      404[655320356]               Результат ≡ Темносерый ∙ 30[917514] ←
  30867473[40370554]           ELSE • Если обработана ←
  11010080[40374735]             = ≡ Цвет ∙ 65545[144447117] ←
       404[40383078]               Результат ≡ Черный ∙ 30[917505] ←
 11010080[656082045]         = ≡ Уровень буфера текущий ∙ 65545[656081776] ←
      404[656084409]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656082645]             Уточняющий параметр ≡ Заказано поставщику для торговой точки ∙ 359[40042518] ←
 11010080[656082046]         = ≡ Наполнение буфера ∙ 65545[656081777] ←
      404[656084410]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656082646]             Уточняющий параметр ≡ Сумма по цене по накладной поставщика (док.) ∙ 359[15073284] ←
 11010080[656082048]         = ≡ Проникновение в ЗЗ ∙ 65545[656081778] ←
      404[656084412]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656082648]             Уточняющий параметр ≡ Сумма без налогов по накладной поставщика ∙ 359[28835853] ←
 11010080[656082047]         = ≡ Проникновение в КЗ ∙ 65545[656081779] ←
      404[656084411]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656082647]             Уточняющий параметр ≡ Сумма по цене по накладной поставщика ВАЛ. ∙ 359[6619137] ←
 11010080[164890953]         = ≡ Претензии КРО ∙ 65545[164890172] ←
      404[164897274]           Результат ≡ SubString ∙ 249[1507580] ←
 32505862[164889520]             Значения формальных параметров при вызове ←
 32505860[164890459]               Значение параметра при вызове процедуры/функции ≡ Строка ∙ 65545[1517295] ←
   327700[164891201]                 Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164890959]                   Уточняющий параметр ≡ Платежная система - файл слипа ∙ 359[16842763] ←
 32505860[164890460]               Значение параметра при вызове процедуры/функции ≡ Позиция ∙ 65545[1517296] ←
   327700[164891199]                 Выражение ⁼ 1 ←
 32505860[164890461]               Значение параметра при вызове процедуры/функции ≡ Ширина ∙ 65545[1517297] ←
   327700[164891200]                 Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164888783]                   Выполнить действия ←
 39780366[164888939]                     RETURN ←
      116[164890128]                       Выражение ←
      404[164897275]                         Результат ≡ POS ∙ 387[1507422] ←
 11010095[164888952]                           Выражение ←
      404[164897278]                             Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164890958]                               Уточняющий параметр ≡ Платежная система - файл слипа ∙ 359[16842763] ←
  1507510[164888587]                           Искомая подстрока ←
      404[164897276]                             Результат ⁼ # ←
 11010073[164888594]                           Позиция ⁼ 1 ←
      406[164888717]                         Вычесть ←
      404[164897277]                         Результат ⁼ 1 ←
 11010080[164378954]         = ≡ Реализация по ПРОМО ∙ 65545[164372410] ←
      404[164407367]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164373068]             Уточняющий параметр ≡ Фактическая сумма. ВАЛ ∙ 359[1966085] ←
  11010093[58392660]         Комментарий • ----  из продукта ←
  11010080[58523912]         = ≡ Продукт ∙ 65545[58523749] ←
       404[58524640]           Результат ≡ <<Продукт>> ∙ 367[3] ←
 11010080[144452326]         = ≡ Код ∙ 65545[144447105] ←
      404[144465773]           Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[144445919]             Уточняющий параметр ≡ Код ∙ 305[5] ←
 11010080[144452327]         = ≡ Наименование ∙ 65545[144447106] ←
      404[144981978]           Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[144969891]             Уточняющий параметр ≡ Наименование ∙ 305[6] ←
 11010080[655303035]         = ≡ Кол-во мин.дробимое ∙ 65545[655296834] ←
      404[655308638]           Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[655306733]             Уточняющий параметр ≡ Количество в упаковке ∙ 305[14745601] ←
 11010080[656093561]         = ≡ Кол-во в блоке ∙ 65545[656086944] ←
      404[656129054]           Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[656095670]             Уточняющий параметр ≡ Ставка налога с продаж поставщика (партия) ∙ 305[42401835] ←
 11010080[655303036]         = ≡ Кол-во в упак ∙ 65545[655296835] ←
      404[655308639]           Результат ≡ <<Продукт>> ∙ 367[3] ←
       411[40379670]             Уточняющий параметр ≡ Количество в ед. изм.  в упаковке ∙ 305[2818058] ←
  11010080[58393070]         = ≡ Кол-во в паллете ∙ 65545[58392813] ←
       404[58395102]           Результат ≡ <<Продукт>> ∙ 367[3] ←
       411[58393442]             Уточняющий параметр ≡ Количество упаковок на палете ∙ 305[2818056] ←
  11010080[58393766]         = ≡ Срок хранения ∙ 65545[58393146] ←
  1638461[164495723]           Условный оператор (IF) ←
  1638463[164497309]             Условие ←
  1638460[164495651]               НЕ ←
      404[164509103]               Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[164500560]                 Уточняющий параметр ≡ Валюта контракта ∙ 305[15007756] ←
      105[164495720]             То ←
       404[58398422]               Результат ≡ <<Продукт>> ∙ 367[3] ←
       411[58394783]                 Уточняющий параметр ≡ Срок реализации, дней ∙ 305[28835888] ←
      424[164495670]             Иначе ←
      404[164516833]               Результат ≡ Получить срок годности в днях ∙ 249[164298829] ←
 32505862[164497180]                 Значения формальных параметров при вызове ←
 32505860[164497225]                   Значение параметра при вызове процедуры/функции ≡ Продукт Ид ∙ 65545[164299139] ←
   327700[164499371]                     Выражение ≡ <<Продукт>> ∙ 367[3] ←
  11010080[58394272]         = ≡ Дробится менее 1 кг ∙ 65545[58393364] ←
       404[58400057]           Результат ≡ <<Продукт>> ∙ 367[3] ←
       411[58394700]             Уточняющий параметр ≡ Учет партий по сериям ∙ 305[40042537] ←
       411[58394701]               Уточняющий параметр ≡ Имя ∙ 249[262146] ←
  1507410[656082419]         ВЫПОЛНИТЬ БЛОК ≡ Расчёт количества упаковок и количества паллет ∙ 30867469[656084389] ←
  11010093[58392661]         Комментарий • ----  расчетные ←
 11010080[164503272]         = ≡ Произв. цех. ∙ 65545[164499523] ←
       19[656081012]           Выбор (CASE) ←
  1572877[656081268]             Условие ←
      404[656117957]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656095892]                 Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[656095893]                   Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[656095894]                     Уточняющий параметр ≡ UID типа ∙ 249[45940739] ←
      416[656081307]             Если равно ≡ Торговая точка (Магазин) ∙ 284[40566786] ←
      404[164509865]               Результат ≡ Список ТЗ списка ЦО v.2 ∙ 249[58392588] ←
 32505862[164496562]                 Значения формальных параметров при вызове ←
 32505860[164497724]                   Значение параметра при вызове процедуры/функции ≡ ЦО ∙ 65545[58392848] ←
   327700[164498670]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164496737]                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164499099]                         Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[164499174]                           Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
 32505860[164497725]                   Значение параметра при вызове процедуры/функции ≡ Только действующие магазины ∙ 65545[58392850] ←
   327700[164498694]                     Выражение ≡ Да ∙ 131203075[131203074] ←
 32505860[164497748]                   Значение параметра при вызове процедуры/функции ≡ Назначение подразделения ∙ 65545[58392851] ←
   327700[164498695]                     Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[164495608]                       Список элементов ←
   327700[164498696]                         Выражение ≡ Подразделение для производства ∙ 15073289[20774914] ←
      416[656081308]             Если равно ≡ Центр ответственности ∙ 284[40370180] ←
      404[656117958]               Результат ≡ Список ТЗ списка ЦО v.2 ∙ 249[58392588] ←
 32505862[656084481]                 Значения формальных параметров при вызове ←
 32505860[656088557]                   Значение параметра при вызове процедуры/функции ≡ ЦО ∙ 65545[58392848] ←
   327700[656092572]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[656095895]                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[656095896]                         Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
 32505860[656088558]                   Значение параметра при вызове процедуры/функции ≡ Только действующие магазины ∙ 65545[58392850] ←
   327700[656092573]                     Выражение ≡ Да ∙ 131203075[131203074] ←
 32505860[656088559]                   Значение параметра при вызове процедуры/функции ≡ Назначение подразделения ∙ 65545[58392851] ←
   327700[656092574]                     Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[656081309]                       Список элементов ←
   327700[656092575]                         Выражение ≡ Подразделение для производства ∙ 15073289[20774914] ←
      424[656081556]             Иначе ←
  1638402[656082529]               NULL ←
 30867470[656082099]         IF ←
  1638463[656082361]           Условие ←
      404[656117905]             Результат ≡ Произв. цех. ∙ 65545[164499523] ←
 30867472[656082109]           THEN • есть пц, считаем остататок ингредиента ←
 11010080[164503186]             = ≡ Остаток ингредиента ∙ 65545[164499394] ←
      404[164519304]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164499998]                 Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[164499999]                   Уточняющий параметр ≡ Ингредиент ∙ 305[28835851] ←
      411[164500000]                     Уточняющий параметр ≡ Остатки баз. товара (ШТ)                   [по Списку подразделений] ∙ 249[40370223] ←
 32505862[164497444]                       Значения формальных параметров при вызове ←
 32505860[164500021]                         Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[40373217] ←
   327700[164501757]                           Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164500003]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164500004]                               Уточняющий параметр ≡ Дата ∙ 331[8] ←
 32505860[164500022]                         Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[40373218] ←
   327700[164501758]                           Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164500005]                             Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[164500006]                               Уточняющий параметр ≡ Ингредиент ∙ 305[28835851] ←
 32505860[164500035]                         Значение параметра при вызове процедуры/функции ≡ Список подразделений ∙ 65545[40373216] ←
   327700[164498693]                           Выражение ≡ Произв. цех. ∙ 65545[164499523] ←
      402[164495668]               Делить ←
      404[164519365]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164500019]                 Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[164500020]                   Уточняющий параметр ≡ Коэффициент пересчета ∙ 305[28835852] ←
 11010080[144452332]         = ≡ Сумма закупочная ∙ 65545[144447113] ←
  1638461[655294804]           Условный оператор (IF) ←
  1638463[655297242]             Условие ←
      404[655313028]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655302631]                 Уточняющий параметр ≡ Сумма по цене по накладной поставщика ∙ 359[14286862] ←
      105[655294806]             То ←
      404[655313029]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655302632]                 Уточняющий параметр ≡ Сумма по цене по накладной поставщика ∙ 359[14286862] ←
      424[655294798]             Иначе ←
      116[655296634]               Выражение ←
      404[144465781]                 Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
      403[144442494]                 Умножить ←
      404[144465782]                 Результат ≡ Цена закупочная ∙ 65545[144447108] ←
 11010080[655303038]         = ≡ Список ШК ∙ 65545[655296837] ←
      404[655308653]           Результат ≡ Список ВСЕХ штрих-кодов товара ∙ 249[144179209] ←
 32505862[655295407]             Значения формальных параметров при вызове ←
 32505860[655296461]               Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[144179705] ←
   327700[655297971]                 Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[655298042]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[655296462]               Значение параметра при вызове процедуры/функции ≡ Разделитель ∙ 65545[144179706] ←
   327700[655297972]                 Выражение ⁼ '/' ←
 32505860[655299419]               Значение параметра при вызове процедуры/функции ≡ Длина строки ∙ 65545[144179707] ←
   327700[655302513]                 Выражение ⁼ 100 ←
  11010080[58394270]         = ≡ Товарный запас на РЦ ∙ 65545[58393362] ←
   1638464[58392987]           Ноль (0.0), если NULL ≡ Остаток РЦ на момент расчета ∙ 65545[58392769] ←
       402[58392623]           Делить ←
       404[58400084]           Результат ≡ СП ∙ 65545[144447114] ←
  11010080[58394271]         = ≡ Товарный запас на ТТ ∙ 65545[58393363] ←
   1638464[58392988]           Ноль (0.0), если NULL ≡ Остаток Магазинов (факт) ∙ 65545[58392814] ←
       402[58392624]           Делить ←
       404[58400085]           Результат ≡ СП ∙ 65545[144447114] ←
 11010080[164892598]         = ≡ Товарный запас на ТТ (с учетом заказа) ∙ 65545[164890125] ←
      116[164890073]           Выражение ←
  1638464[164888833]             Ноль (0.0), если NULL ≡ Ф.Остаток ∙ 65545[58392768] ←
      380[164888663]             Сложить ←
  1638464[164888938]             Ноль (0.0), если NULL ≡ Кол-во заказа ∙ 65545[144447112] ←
      402[164888708]           Делить ←
      404[164903070]           Результат ≡ СП ∙ 65545[144447114] ←
 30867470[655295564]         IF ←
  1638463[655295847]           Условие ←
      404[655303822]             Результат ≡ Первый ТЗ для магазина ∙ 65545[655299282] ←
      413[655295890]             И ←
      404[655303832]             Результат ≡ Текущий узел является точкой ∙ 249[1507771] ←
      413[655296268]             И ←
      116[655295371]             Выражение ←
      404[655303828]               Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[655297054]                 Уточняющий параметр ≡ Контролировать срок годности ∙ 305[28835855] ←
  1638473[655296239]               Равно ←
      404[655303829]               Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[655295557]           THEN • расчитать Срок годности ←
 30867470[655295565]             IF ←
  1638463[655295849]               Условие ←
      404[655303849]                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655297040]                   Уточняющий параметр ≡ Срок годности ∙ 359[14286868] ←
 30867472[655295558]               THEN ←
 11010080[655297717]                 = ≡ Срок годности ∙ 65545[40375153] ←
      404[655303850]                   Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655297066]                     Уточняющий параметр ≡ Срок годности ∙ 359[14286868] ←
 30867473[655294770]               ELSE ←
  1507728[656081016]                 Начало многострочного комментария • ----  убрали расчет срока годности из рассчета строк заказов, так как долго. Убираю в просмотре строк? строки долго открываются? ←
 11010080[655296423]                 = ≡ Срок годности ∙ 65545[40375153] ←
      404[656106347]                   Результат ≡ Срок годности (минимальный) по оборотам ∙ 249[164429871] ←
 32505862[656083326]                     Значения формальных параметров при вызове ←
 32505860[656086050]                       Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164431718] ←
   327700[656088642]                         Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[656086051]                       Значение параметра при вызове процедуры/функции ≡ Подразделения ∙ 65545[164431719] ←
   327700[656088643]                         Выражение ≡ Первый ТЗ для магазина ∙ 65545[655299282] ←
  1507729[656081016]                 Конец многострочного комментария ←
 11010080[655302412]         = ≡ Признак ∙ 65545[655299589] ←
       19[655294565]           Выбор (CASE) ←
  1572877[655294692]             Условие ←
      404[655318557]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655309668]                 Уточняющий параметр ≡ Месяц просрочки ∙ 359[6684696] ←
      416[655294743]             Если равно ⁼ 1 ←
      404[655326766]               Результат ⁼ 'ТПС' ←
      424[655295655]             Иначе ←
      404[655326767]               Результат ⁼ '' ←
 11010080[164824971]         = ≡ Номер машины ∙ 65545[164372611] ←
      404[164850092]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164830019]             Уточняющий параметр ≡ Наценка ∙ 359[15138829] ←
 11010088[164889821]         ВЫПОЛНИТЬ ≡ Параметры АВС для продукта (по ТТ) ∙ 249[164888623] ←
 32505862[164890238]           Значения формальных параметров при вызове ←
 32505860[164892004]             Значение параметра при вызове процедуры/функции ≡ req_Продукт ∙ 65545[164891345] ←
   327700[164893364]               Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[164889349]             Значение параметра при вызове процедуры/функции ≡ req_Подразделение (Склад/ТТ/ЦО) ∙ 65545[164891358] ←
   327700[164891139]               Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164888660]                 Выполнить действия ←
 39780366[164888685]                   RETURN ←
  1638461[164888941]                     Условный оператор (IF) ←
  1638463[164889417]                       Условие ←
      404[164897078]                         Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164892890]                           Уточняющий параметр ≡ Партнер ∙ 359[9] ←
      105[164888943]                       То ←
      404[164897079]                         Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164892891]                           Уточняющий параметр ≡ Партнер ∙ 359[9] ←
      424[164888899]                       Иначе ←
      404[164897083]                         Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164892915]                           Уточняющий параметр ≡ Подразделение документа ∙ 359[7] ←
 32505860[164889348]             Значение параметра при вызове процедуры/функции ≡ Тип сети ∙ 65545[164889148] ←
   327700[164891137]               Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164892907]                 Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164892908]                   Уточняющий параметр ≡ Способ оплаты ∙ 331[15073281] ←
 32505860[164892005]             Значение параметра при вызове процедуры/функции ≡ ret_ABC (строка) ∙ 65545[164891351] ←
   327700[164893371]               Выражение ≡ ABC ∙ 65545[164891023] ←
  1507410[656083175]         ВЫПОЛНИТЬ БЛОК ≡ Расчёт Дельта упаковки и Дельта паллет ∙ 30867469[656083311] ←
  1507410[165806193]         ВЫПОЛНИТЬ БЛОК ≡ Поиск регулярной матрицы ∙ 30867469[165806270] ←
  30867469[58392748]       БЛОК ≡ РЕДАКТИРОВАНИЕ : Расчет переменных ∙ 30867469[1508826] ←
  11010088[58393241]         ВЫПОЛНИТЬ ≡ WriteStatusText ∙ 127[12124167] ←
  11010095[58392952]           Выражение ←
       404[58397697]             Результат ⁼ 'РЕДАКТИРОВАНИЕ: Расчет переменных' ←
  11010080[58393073]         = ≡ Кол-во автозаказа ∙ 65545[144447111] ←
       404[58395105]           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58393445]             Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
  11010080[58393074]         = ≡ Кол-во заказа ∙ 65545[144447112] ←
       404[58395106]           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58393446]             Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
 11010080[656097892]         = ≡ Цена закупочная ∙ 65545[144447108] ←
      404[656132400]           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656095107]             Уточняющий параметр ≡ Цена закупочная ∙ 359[15007745] ←
 11010080[656097893]         = ≡ Сумма закупочная ∙ 65545[144447113] ←
  1638461[656081885]           Условный оператор (IF) ←
  1638463[656086174]             Условие ←
      404[656132401]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656095108]                 Уточняющий параметр ≡ Сумма по цене по накладной поставщика ∙ 359[14286862] ←
      105[656081904]             То ←
      404[656132402]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656095109]                 Уточняющий параметр ≡ Сумма по цене по накладной поставщика ∙ 359[14286862] ←
      424[656081856]             Иначе ←
      116[656085809]               Выражение ←
      404[656132403]                 Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
      403[656081594]                 Умножить ←
      404[656132404]                 Результат ≡ Цена закупочная ∙ 65545[144447108] ←
  1507410[656082418]         ВЫПОЛНИТЬ БЛОК ≡ Расчёт количества упаковок и количества паллет ∙ 30867469[656084389] ←
  1507410[656081716]         ВЫПОЛНИТЬ БЛОК ≡ Расчёт Дельта упаковки и Дельта паллет ∙ 30867469[656083311] ←
  30867469[58392692]       БЛОК • Расчет итогов ≡ Расчет итогов ∙ 30867469[144966421] ←
 30867470[164825393]         IF ←
  1638463[164825897]           Условие ←
      404[164850567]             Результат ≡ Фильтр.Родитель ∙ 65545[1510252] ←
 30867472[164825355]           THEN • если это строки по магазинам, то задан фильтр по родителю строк, будем считать только строки с родителем ←
 11010080[164832574]             = ≡ МинСум ∙ 65545[656085178] ←
  1638402[164824272]               NULL ←
 11010080[656095766]             = ≡ МаксСум ∙ 65545[656088725] ←
  1638402[656084251]               NULL ←
 11010080[164832575]             = ≡ МинКолУпкв ∙ 65545[656081833] ←
  1638402[164824273]               NULL ←
 11010080[656095767]             = ≡ МинКолПаллет ∙ 65545[656088726] ←
  1638402[656084252]               NULL ←
 11010088[656086641]             ВЫПОЛНИТЬ ≡ Подсчёт суммы заказа, количества, веса, количества упаковок и паллет ∙ 127[656081132] ←
 32505862[656081519]               Значения формальных параметров при вызове ←
 32505860[656082330]                 Значение параметра при вызове процедуры/функции ≡ ~Заказ ∙ 65545[656081813] ←
   327700[656084697]                   Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[656089049]                 Значение параметра при вызове процедуры/функции ≡ ~Родтель строк ∙ 65545[656081837] ←
   327700[656099336]                   Выражение ≡ Фильтр.Родитель ∙ 65545[1510252] ←
 32505860[656093003]                 Значение параметра при вызове процедуры/функции ≡ ~Только текущий заказ ∙ 65545[656088729] ←
   327700[656084699]                   Выражение ≡ true ∙ 117[30867468] ←
 32505860[656093004]                 Значение параметра при вызове процедуры/функции ≡ Сумма~ ∙ 65545[656081814] ←
   327700[656093256]                   Выражение ≡ Общая сумма ∙ 65545[144447120] ←
 32505860[656093005]                 Значение параметра при вызове процедуры/функции ≡ Количество упаковок~ ∙ 65545[656081815] ←
   327700[656099331]                   Выражение ≡ Общее количество упаковок ∙ 65545[656081834] ←
 32505860[656093006]                 Значение параметра при вызове процедуры/функции ≡ Количество паллет~ ∙ 65545[656088716] ←
   327700[656099332]                   Выражение ≡ Общее количество паллет ∙ 65545[164372408] ←
 32505860[656093007]                 Значение параметра при вызове процедуры/функции ≡ Количество~ ∙ 65545[656081835] ←
   327700[656099333]                   Выражение ≡ Общее количество ∙ 65545[144447119] ←
 32505860[656093016]                 Значение параметра при вызове процедуры/функции ≡ Вес~ ∙ 65545[656088730] ←
   327700[656099334]                   Выражение ≡ Общий вес ∙ 65545[164299533] ←
 32505860[656093017]                 Значение параметра при вызове процедуры/функции ≡ Всего строк~ ∙ 65545[656081836] ←
   327700[656099335]                   Выражение ≡ Всего строк ∙ 65545[144447118] ←
 32505860[165544543]                 Значение параметра при вызове процедуры/функции ≡ Предыдущие 7 дней~ ∙ 65545[165544737] ←
   327700[165544793]                   Выражение ≡ Предыдущие 7 дней ∙ 65545[165544738] ←
 30867473[164823891]           ELSE • подсчёт итогов в базовых строках, т.е. с родителем = null ←
 11010080[164832583]             = ≡ МинСум ∙ 65545[656085178] ←
      404[164850584]               Результат ≡ <<Документ>> ∙ 367[5] ←
      411[164830310]                 Уточняющий параметр ≡ Сумма по норме ∙ 331[33620492] ←
 11010080[656095769]             = ≡ МаксСум ∙ 65545[656088725] ←
      404[656134429]               Результат ≡ <<Документ>> ∙ 367[5] ←
      411[656089059]                 Уточняющий параметр ≡ Сумма сверх нормы ∙ 331[33620493] ←
 11010080[164832584]             = ≡ МинКолУпкв ∙ 65545[656081833] ←
      404[164850585]               Результат ≡ <<Документ>> ∙ 367[5] ←
      411[164830311]                 Уточняющий параметр ≡ Сумма нераспределенная ∙ 331[33620524] ←
 11010080[656095771]             = ≡ МинКолПаллет ∙ 65545[656088726] ←
      404[656134430]               Результат ≡ <<Документ>> ∙ 367[5] ←
      411[656096018]                 Уточняющий параметр ≡ Сумма нераспределенная, вал. ∙ 331[12058637] ←
 11010088[656086645]             ВЫПОЛНИТЬ ≡ Подсчёт суммы заказа, количества, веса, количества упаковок и паллет ∙ 127[656081132] ←
 32505862[656086349]               Значения формальных параметров при вызове ←
 32505860[656093008]                 Значение параметра при вызове процедуры/функции ≡ ~Заказ ∙ 65545[656081813] ←
   327700[656093300]                   Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[656093009]                 Значение параметра при вызове процедуры/функции ≡ ~Только текущий заказ ∙ 65545[656088729] ←
   327700[656099321]                   Выражение ≡ true ∙ 117[30867468] ←
 32505860[656093010]                 Значение параметра при вызове процедуры/функции ≡ Сумма~ ∙ 65545[656081814] ←
   327700[656099322]                   Выражение ≡ Общая сумма ∙ 65545[144447120] ←
 32505860[656093011]                 Значение параметра при вызове процедуры/функции ≡ Количество упаковок~ ∙ 65545[656081815] ←
   327700[656099323]                   Выражение ≡ Общее количество упаковок ∙ 65545[656081834] ←
 32505860[656093012]                 Значение параметра при вызове процедуры/функции ≡ Количество паллет~ ∙ 65545[656088716] ←
   327700[656099324]                   Выражение ≡ Общее количество паллет ∙ 65545[164372408] ←
 32505860[656093013]                 Значение параметра при вызове процедуры/функции ≡ Количество~ ∙ 65545[656081835] ←
   327700[656099325]                   Выражение ≡ Общее количество ∙ 65545[144447119] ←
 32505860[656093014]                 Значение параметра при вызове процедуры/функции ≡ Вес~ ∙ 65545[656088730] ←
   327700[656099326]                   Выражение ≡ Общий вес ∙ 65545[164299533] ←
 32505860[656093015]                 Значение параметра при вызове процедуры/функции ≡ Всего строк~ ∙ 65545[656081836] ←
   327700[656099327]                   Выражение ≡ Всего строк ∙ 65545[144447118] ←
   1507530[58392577]     Виртуальные блоки ←
 30867469[144966421]       БЛОК • Расчет итогов ←
 30867469[655294989]       БЛОК • Начало ←
  1507413[144441376]     Блоки действий ←
 30867469[655295162]       БЛОК • Выбор строки ←
 39780361[656082199]         ЗАВЕРШИТЬ БЛОК ←
      116[656085808]           Выражение ←
      404[656132350]             Результат ≡ <<Строка>> ∙ 367[6] ←
  1638473[656086718]             Равно ←
  1638402[656083599]             NULL ←
  11010088[58393243]         ВЫПОЛНИТЬ ≡ WriteStatusText ∙ 127[12124167] ←
  11010095[58392954]           Выражение ←
       404[58397699]             Результат ⁼ 'Выбор строки' ←
 30867470[655296211]         IF ←
  1638463[655296699]           Условие ←
      404[655309195]             Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655300394]               Уточняющий параметр ≡ Маркировать ∙ 359[28835848] ←
  1638473[655297254]             Равно ←
      404[655309193]             Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[655296202]           THEN ←
 11010088[655296281]             ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[655294614]               Объект ≡ <<Строка>> ∙ 367[6] ←
      377[655294640]               Начальные значения полей объекта ←
   131095[655295145]                 Начальное значение поля ≡ Маркировать ∙ 359[28835848] ←
   327700[655299635]                   Выражение ≡ Нет ∙ 131203075[131203073] ←
 30867473[655295156]           ELSE ←
 11010088[655296282]             ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[655294615]               Объект ≡ <<Строка>> ∙ 367[6] ←
      377[655294641]               Начальные значения полей объекта ←
   131095[655295146]                 Начальное значение поля ≡ Маркировать ∙ 359[28835848] ←
   327700[655299641]                   Выражение ≡ Да ∙ 131203075[131203074] ←
 39780366[655294894]         RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ТЕКУЩЕЙ СТРОКИ СПИСКА ∙ 102[53262] ←
 30867469[655295163]       БЛОК • Выбор всех строк ←
  11010088[58393244]         ВЫПОЛНИТЬ ≡ WriteStatusText ∙ 127[12124167] ←
  11010095[58392955]           Выражение ←
       404[58397700]             Результат ⁼ 'Выбор всех строк' ←
 11010105[655294895]         Индикатор ⁼ Обновление списка ←
  1507419[655294468]         Изменить таблицу ≡ Строка (объект БД) ∙ 108[6] ←
  1507447[655294556]           Выражения ←
  1507449[655294716]             Выражение • Да ≡ Признак (Да/Нет) ∙ 107[131203074] ←
  1507452[655295858]               Константа ≡ Да ∙ 131203075[131203074] ←
 12124215[655294910]           Where      (Ограничения на отбор данных) ←
  1507376[655295953]             Выражение ←
  1507455[655296180]               Результат ≡ Строка (объект БД) ∙ 108[6] ←
  1507494[655296611]                 Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638473[655297257]               Равно ←
  1507452[655295590]               Константа ≡ <<Документ>> ∙ 367[5] ←
  1507571[655294468]           Начальные значения полей объекта ←
  1507573[655294472]             Начальное значение поля ≡ Маркировать ∙ 359[28835848] ←
  1507659[655294557]               Выражение ≡ Да ∙ 1507449[655294716] ←
  1507412[655294485]         Закрыть индикатор ←
 39780366[655294895]         RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
 30867469[655295165]       БЛОК • Отмена выбора всех строк ←
  11010088[58393245]         ВЫПОЛНИТЬ ≡ WriteStatusText ∙ 127[12124167] ←
  11010095[58392956]           Выражение ←
       404[58397701]             Результат ⁼ 'Отмена выбора всех строк' ←
 11010105[655294896]         Индикатор ⁼ Обновление списка ←
 30867470[655296495]         IF ←
  1638463[655297090]           Условие ←
      404[655312864]             Результат ≡ <<Документ>> ∙ 367[5] ←
      411[655302004]               Уточняющий параметр ≡ Состояние документа ∙ 331[14] ←
  1638473[655297534]             Равно ←
      404[655312865]             Результат ⁼ 0 ←
 30867472[655296487]           THEN ←
 11010080[165488042]             = ≡ Есть промаркированные строки ∙ 65545[165482879] ←
      404[165502757]               Результат ⁼ 0 ←
  1507360[165479123]             Отбор данных (по запросу) ←
  1507673[165478562]               Ключи оптимизации ←
  1507635[165478414]                 Быстрый показ первых записей ←
 12124213[165479562]               Параметры ←
  1507335[165481389]                 Параметр • Ид строки ≡ Строки документа ∙ 12124204[165479660] ←
  1507494[165486226]                   Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
 12124200[165479463]               From         (Таблицы) ←
 12124204[165479660]                 Таблица • Строки документа ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[165479589]               Where      (Ограничения на отбор данных) ←
  1507376[165482825]                 Выражение ←
  1507455[165484234]                   Результат ≡ Строки документа ∙ 12124204[165479660] ←
  1507494[165486225]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638473[165482589]                   Равно ←
  1507452[165481441]                   Константа ≡ <<Документ>> ∙ 367[5] ←
  1507376[165482826]                 Выражение ←
  1507455[165484235]                   Результат ≡ Строки документа ∙ 12124204[165479660] ←
  1507494[165486227]                     Уточняющий параметр ≡ Маркировать ∙ 359[28835848] ←
  1638473[165482590]                   Равно ←
  1507452[165481442]                   Константа ≡ Да ∙ 131203075[131203074] ←
 30867466[165479268]               Выполнить после получения записи ←
 11010080[165488043]                 = ≡ Есть промаркированные строки ∙ 65545[165482879] ←
      404[165502758]                   Результат ⁼ 1 ←
 11010100[165478703]                 BREAK ←
 30867470[165480156]             IF ←
  1638463[165480758]               Условие ←
      404[165502759]                 Результат ≡ Есть промаркированные строки ∙ 65545[165482879] ←
 30867472[165480117]               THEN ←
  1507419[655294470]                 Изменить таблицу ≡ Строка (объект БД) ∙ 108[6] ←
  1507447[655294558]                   Выражения ←
  1507449[655294718]                     Выражение • Нет ≡ Признак (Да/Нет) ∙ 107[131203074] ←
  1507452[655295861]                       Константа ≡ Нет ∙ 131203075[131203073] ←
 12124215[655294912]                   Where      (Ограничения на отбор данных) ←
  1507376[655296327]                     Выражение ←
  1507455[655296684]                       Результат ≡ Строка (объект БД) ∙ 108[6] ←
  1507494[655297308]                         Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638473[655297259]                       Равно ←
  1507452[655295862]                       Константа ≡ <<Документ>> ∙ 367[5] ←
  1507571[655294470]                   Начальные значения полей объекта ←
  1507573[655294474]                     Начальное значение поля ≡ Маркировать ∙ 359[28835848] ←
  1507659[655294559]                       Выражение ≡ Нет ∙ 1507449[655294718] ←
  1507412[655294487]         Закрыть индикатор ←
 39780366[655295220]         RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
 30867469[144442492]       БЛОК • Перечитать строку ←
 39780361[656082198]         ЗАВЕРШИТЬ БЛОК ←
      116[656085803]           Выражение ←
      404[656132349]             Результат ≡ <<Строка>> ∙ 367[6] ←
  1638473[656086717]             Равно ←
  1638402[656083598]             NULL ←
  11010088[58393246]         ВЫПОЛНИТЬ ≡ WriteStatusText ∙ 127[12124167] ←
  11010095[58392957]           Выражение ←
       404[58397702]             Результат ⁼ 'Перечитать строку' ←
  1507360[655295004]         Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[655295845]           Значения формальных параметров при вызове ←
 32505860[655297569]             Значение параметра при вызове процедуры/функции ≡ Фильтр.Строки ∙ 65545[1510098] ←
   327700[655299554]               Выражение ≡ <<Строка>> ∙ 367[6] ←
 30867466[655295199]           Выполнить после получения записи ←
 11010080[655298361]             = ≡ <<Строка>> ∙ 367[6] ←
      404[655305148]               Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 11010080[655298362]             = ≡ <<Продукт>> ∙ 367[3] ←
      404[655305168]               Результат ≡ Строка.Продукт ∙ 1507335[1508517] ←
  1507410[655294945]             ВЫПОЛНИТЬ БЛОК ≡ ОТБОР ДАННЫХ : Расчет переменных ∙ 30867469[1508852] ←
  1507410[655294946]             ВЫПОЛНИТЬ БЛОК ≡ ОБЩИЙ : Расчет переменных ∙ 30867469[1508791] ←
 30867469[655295634]       БЛОК • Найти товары для подсветки (у них есть блокировка ПРОМО) ----  НЕ ИСПОЛЬЗУЕТСЯ С 17/12/2013 ←
  11010088[58393247]         ВЫПОЛНИТЬ ≡ WriteStatusText ∙ 127[12124167] ←
  11010095[58392958]           Выражение ←
       404[58397703]             Результат ⁼ 'Найти товары для подсветки' ←
  39780361[58392577]         ЗАВЕРШИТЬ БЛОК ←
       116[58392848]           Выражение ←
   1638460[58392627]             НЕ ←
       404[58394801]             Результат ≡ Список Магазинов ∙ 65545[655299270] ←
  1507360[655295612]         Отбор данных (по запросу) ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
 32505862[655297724]           Значения формальных параметров при вызове ←
 32505860[655301722]             Значение параметра при вызове процедуры/функции ≡ Фильтр.Классы ∙ 65545[18547257] ←
   327700[655305578]               Выражение ≡ ТОВАРНЫЙ ДОКУМЕНТ ∙ 541[14286849] ←
 32505860[655301723]             Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547258] ←
   327700[655305579]               Выражение ≡ Перечень товаров для акции ∙ 332[3342383] ←
 32505860[655301725]             Значение параметра при вызове процедуры/функции ≡ Фильтр.Подразделения ∙ 65545[18547259] ←
   327700[655305581]               Выражение ≡ Список Магазинов ∙ 65545[655299270] ←
 32505860[655301724]             Значение параметра при вызове процедуры/функции ≡ Фильтр.Состояние ∙ 65545[11600041] ←
   327700[655305580]               Выражение ⁼ 1 ←
 12124215[655295264]           Where      (Ограничения на отбор данных) ←
  1507381[655294736]             <Наследуемые ограничения> ←
      413[655295568]             И ←
  1507376[655295876]             Выражение ←
  1507455[655296085]               Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
  1507494[655296494]                 Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
   1638475[58392588]               Меньше или равно ←
  1507452[655295537]               Константа ≡ Дата, начало дня ∙ 249[30867471] ←
 32505862[655297726]                 Значения формальных параметров при вызове ←
 32505860[655301728]                   Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867497] ←
   327700[655305584]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[655306994]                       Уточняющий параметр ≡ Дата окончания резерва товара ∙ 331[15990785] ←
       413[58392769]             И ←
   1507376[58392869]             Выражение ←
   1507455[58393041]               Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
   1507494[58393032]                 Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
   1638477[58392584]               Больше или равно ←
   1507452[58392855]               Константа ≡ Дата, начало дня ∙ 249[30867471] ←
  32505862[58392696]                 Значения формальных параметров при вызове ←
  32505860[58392854]                   Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867497] ←
    327700[58392957]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
       411[58392952]                       Уточняющий параметр ≡ Дата поставки ∙ 331[14352402] ←
      413[655295575]             И ←
   1507376[58392870]             Выражение ←
   1507455[58393042]               Результат ≡ ДОКУМЕНТЫ ∙ 12124204[18546854] ←
   1507494[58393033]                 Уточняющий параметр ≡ Признак 2 ∙ 331[6684705] ←
   1638473[58392916]               Равно ←
   1507452[58392856]               Константа ≡ Да ∙ 131203075[131203074] ←
 30867466[655295865]           Выполнить после получения записи ←
 11010080[655303181]             = ≡ Документы промо ∙ 65545[655299271] ←
      404[655321996]               Результат ≡ з.Документ ∙ 1507335[18547059] ←
 11010088[655297510]             ВЫПОЛНИТЬ ≡ WriteStatusText ∙ 127[12124167] ←
 11010095[655295419]               Выражение ←
      404[655322005]                 Результат ⁼ 'Поиск товаров для подсветки ... ' ←
      404[655322006]                 Результат ≡ Документы промо ∙ 65545[655299271] ←
  1507360[655295613]             Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[655297725]               Значения формальных параметров при вызове ←
 32505860[655301727]                 Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[655305583]                   Выражение ≡ Документы промо ∙ 65545[655299271] ←
 30867466[655295866]               Выполнить после получения записи ←
 11010080[655303182]                 = ≡ <<Продукт>> ∙ 367[3] ←
      404[655322003]                   Результат ≡ Строка.Продукт ∙ 1507335[1508517] ←
 11010080[655303183]                 = ≡ Подсвечивать ∙ 65545[655299269] ←
      404[655322004]                   Результат ≡ true ∙ 117[30867468] ←
 11010092[655294787]                 Добавить в локальную таблицу ≡ Список товаров для подсветки ∙ 30867458[655294656] ←
 30867469[655294754]       БЛОК • Обнулить переменные ←
 11010080[164306998]         = ≡ Строка Ид темп ∙ 65545[164303217] ←
      404[164319688]           Результат ≡ <<Строка>> ∙ 367[6] ←
 11010080[655296623]         = ≡ <<Строка>> ∙ 367[6] ←
  1638402[655295272]           NULL ←
 11010080[655303034]         = ≡ * ∙ 65545[144447103] ←
  1638402[655295141]           NULL ←
 11010080[655303013]         = ≡ Код ∙ 65545[144447105] ←
  1638402[655295120]           NULL ←
 11010080[655303015]         = ≡ Кол-во реализованного ∙ 65545[144447107] ←
  1638402[655295121]           NULL ←
 11010080[655303016]         = ≡ Кол-во реал (предыдущие 7 дней) ∙ 65545[40375080] ←
  1638402[655295122]           NULL ←
 11010080[655303017]         = ≡ Цена закупочная ∙ 65545[144447108] ←
  1638402[655295123]           NULL ←
 11010080[655303018]         = ≡ БЕ ∙ 65545[144447109] ←
  1638402[655295124]           NULL ←
 11010080[655303019]         = ≡ Вес БЕ ∙ 65545[144447110] ←
  1638402[655295125]           NULL ←
 11010080[655303020]         = ≡ Кол-во автозаказа ∙ 65545[144447111] ←
  1638402[655295126]           NULL ←
 11010080[655303021]         = ≡ Кол-во заказа ∙ 65545[144447112] ←
  1638402[655295127]           NULL ←
 11010080[655303022]         = ≡ Кол-во ПРОМО ∙ 65545[655296752] ←
  1638402[655295128]           NULL ←
 11010080[655303023]         = ≡ Коэф. ПРОМО ∙ 65545[655296753] ←
  1638402[655295129]           NULL ←
 11010080[656081152]         = ≡ Количество разовое ПРОМО ∙ 65545[656081095] ←
  1638402[656080986]           NULL ←
 11010080[655303024]         = ≡ Сумма закупочная ∙ 65545[144447113] ←
  1638402[655295130]           NULL ←
 11010080[655300460]         = ≡ Остаток РЦ на момент расчета ∙ 65545[58392769] ←
  1638402[655294895]           NULL ←
 11010080[655300461]         = ≡ Остаток Магазинов (факт) ∙ 65545[58392814] ←
  1638402[655294897]           NULL ←
 11010080[655303025]         = ≡ СП ∙ 65545[144447114] ←
  1638402[655295131]           NULL ←
 11010080[655303026]         = ≡ Скорость продаж (СП2) ∙ 65545[655298753] ←
  1638402[655295132]           NULL ←
 11010080[655303027]         = ≡ Коэф. месяца ∙ 65545[655298754] ←
  1638402[655295133]           NULL ←
  11010080[58393761]         = ≡ Коэф. дат ∙ 65545[58393144] ←
   1638402[58392842]           NULL ←
  11010080[58393762]         = ≡ Коэф. дней ∙ 65545[58393145] ←
   1638402[58392843]           NULL ←
 11010080[655303028]         = ≡ Продажи предыдущего дня ∙ 65545[144447115] ←
  1638402[655295134]           NULL ←
 11010080[655303029]         = ≡ Остаток ТТ ∙ 65545[40372010] ←
  1638402[655295135]           NULL ←
 11010080[655303030]         = ≡ Остаток РЦ ∙ 65545[655298414] ←
  1638402[655295136]           NULL ←
 11010080[656081972]         = ≡ Реализация он-лайн ∙ 65545[656081614] ←
  1638402[656081259]           NULL ←
 11010080[164378955]         = ≡ Реализация по ПРОМО ∙ 65545[164372410] ←
  1638402[164365018]           NULL ←
 11010080[656081973]         = ≡ Остаток он-лайн ∙ 65545[656081707] ←
  1638402[656081261]           NULL ←
 11010080[655303031]         = ≡ Мин.кол-во ∙ 65545[40374485] ←
  1638402[655295137]           NULL ←
 11010080[655303032]         = ≡ Срок годности ∙ 65545[40375153] ←
  1638402[655295138]           NULL ←
 11010080[164307000]         = ≡ Срок хранения ∙ 65545[58393146] ←
  1638402[164300253]           NULL ←
 11010080[655303033]         = ≡ Причина исправления ∙ 65545[655299057] ←
  1638402[655295139]           NULL ←
 11010080[655303040]         = ≡ Ф.Приход ∙ 65545[655296836] ←
  1638402[655295142]           NULL ←
 11010080[655303045]         = ≡ ДатаН ∙ 65545[655296839] ←
  1638402[655295145]           NULL ←
 11010080[655303046]         = ≡ ДатаК ∙ 65545[655296840] ←
  1638402[655295146]           NULL ←
 11010080[655303041]         = ≡ Список ШК ∙ 65545[655296837] ←
  1638402[655295143]           NULL ←
 11010080[655303042]         = ≡ Предыдущий прогноз ∙ 65545[655296838] ←
  1638402[655295144]           NULL ←
 11010080[655303048]         = ≡ Кол-во мин.дробимое ∙ 65545[655296834] ←
  1638402[655295147]           NULL ←
 11010080[656093562]         = ≡ Кол-во в блоке ∙ 65545[656086944] ←
  1638402[656084148]           NULL ←
 11010080[655303049]         = ≡ Кол-во в упак ∙ 65545[655296835] ←
  1638402[655295148]           NULL ←
 11010080[655300462]         = ≡ Кол-во в паллете ∙ 65545[58392813] ←
  1638402[655294898]           NULL ←
 11010080[655298730]         = ≡ Скидка по ПРОМО ∙ 65545[58393342] ←
  1638402[655294815]           NULL ←
 11010080[655298731]         = ≡ Цена ПРОМО новая ∙ 65545[58393341] ←
  1638402[655295273]           NULL ←
 11010080[655298962]         = ≡ Дробится менее 1 кг ∙ 65545[58393364] ←
  1638402[655294828]           NULL ←
 11010080[164892217]         = ≡ ABC ∙ 65545[164891023] ←
  1638402[164889226]           NULL ←
 30867469[656083311]       БЛОК • Расчёт Дельта упаковки и Дельта паллет ←
 11010080[656086833]         = ≡ Дельта упаковка ∙ 65545[656084276] ←
  1638461[656081994]           Условный оператор (IF) ←
  1638463[656086104]             Условие ←
      404[656117287]               Результат ≡ Кол-во в упак ∙ 65545[655296835] ←
      413[656084077]               И ←
      404[656117147]               Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
      105[656082013]             То ←
  1638461[656081990]               Условный оператор (IF) ←
  1638463[656086090]                 Условие ←
      116[656086503]                   Выражение ←
  1638464[656081581]                     Ноль (0.0), если NULL ≡ Кол-во заказа ∙ 65545[144447112] ←
      402[656081187]                     Делить ←
      404[656117277]                     Результат ≡ Кол-во в упак ∙ 65545[655296835] ←
  1638476[656081180]                   Меньше ←
      404[656117278]                   Результат ⁼ 1 ←
      105[656082009]                 То ←
      116[656086504]                   Выражение ←
      404[656117279]                     Результат ⁼ -1 ←
      403[656081368]                     Умножить ←
      116[656086505]                     Выражение ←
  1638464[656081582]                       Ноль (0.0), если NULL ≡ Кол-во заказа ∙ 65545[144447112] ←
      406[656081073]                       Вычесть ←
  1638464[656081583]                       Ноль (0.0), если NULL ≡ Кол-во в упак ∙ 65545[655296835] ←
      424[656081959]                 Иначе ←
      116[656086506]                   Выражение ←
  1638464[656081584]                     Ноль (0.0), если NULL ≡ Кол-во в упак ∙ 65545[655296835] ←
      403[656081399]                     Умножить ←
      404[656117280]                     Результат ≡ Округление ∙ 249[30867464] ←
 32505862[656086034]                       Значения формальных параметров при вызове ←
 32505860[656092391]                         Значение параметра при вызове процедуры/функции ≡ Округляемое значение ∙ 65545[30867479] ←
   327700[656098478]                           Выражение ≡ Кол заказа/кол в уп ∙ 117[656082326] ←
 32505860[656092392]                         Значение параметра при вызове процедуры/функции ≡ Вид округления ∙ 65545[30867505] ←
   327700[656098479]                           Выражение ≡ До 1.0 вверх ∙ 1638433[30670849] ←
      406[656081087]                     Вычесть ←
  1638464[656081585]                     Ноль (0.0), если NULL ≡ Кол-во заказа ∙ 65545[144447112] ←
      424[656081964]             Иначе ←
      404[656117288]               Результат ⁼ 0 ←
 11010080[656086834]         = ≡ Дельта паллет ∙ 65545[656084278] ←
  1638461[656081995]           Условный оператор (IF) ←
  1638463[656086105]             Условие ←
      404[656117289]               Результат ≡ Кол-во в паллете ∙ 65545[58392813] ←
      413[656084078]               И ←
      404[656117148]               Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
      105[656082014]             То ←
  1638461[656081993]               Условный оператор (IF) ←
  1638463[656086103]                 Условие ←
      116[656086507]                   Выражение ←
  1638464[656081586]                     Ноль (0.0), если NULL ≡ Кол-во заказа ∙ 65545[144447112] ←
      402[656081188]                     Делить ←
      404[656117281]                     Результат ≡ Кол-во в паллете ∙ 65545[58392813] ←
  1638476[656081181]                   Меньше ←
      404[656117284]                   Результат ⁼ 1 ←
      105[656082012]                 То ←
      116[656086508]                   Выражение ←
      404[656117285]                     Результат ⁼ -1 ←
      403[656081403]                     Умножить ←
      116[656086509]                     Выражение ←
  1638464[656081587]                       Ноль (0.0), если NULL ≡ Кол-во заказа ∙ 65545[144447112] ←
      406[656081088]                       Вычесть ←
  1638464[656081588]                       Ноль (0.0), если NULL ≡ Кол-во в паллете ∙ 65545[58392813] ←
      424[656081960]                 Иначе ←
      116[656086510]                   Выражение ←
  1638464[656081589]                     Ноль (0.0), если NULL ≡ Кол-во в паллете ∙ 65545[58392813] ←
      403[656081407]                     Умножить ←
      404[656117286]                     Результат ≡ Округление ∙ 249[30867464] ←
 32505862[656086035]                       Значения формальных параметров при вызове ←
 32505860[656092393]                         Значение параметра при вызове процедуры/функции ≡ Округляемое значение ∙ 65545[30867479] ←
   327700[656098480]                           Выражение ≡ Кол заказа/кол в паллете ∙ 117[656082327] ←
 32505860[656092394]                         Значение параметра при вызове процедуры/функции ≡ Вид округления ∙ 65545[30867505] ←
   327700[656098481]                           Выражение ≡ До 1.0 вверх ∙ 1638433[30670849] ←
      406[656081089]                     Вычесть ←
  1638464[656081590]                     Ноль (0.0), если NULL ≡ Кол-во заказа ∙ 65545[144447112] ←
      424[656081965]             Иначе ←
      404[656117290]               Результат ⁼ 0 ←
 30867469[656084389]       БЛОК • Расчёт количества упаковок и количества паллет ←
 11010093[656084990]         Комментарий • ----  ТЗ 180781 ←
 11010080[656095562]         = ≡ Кол-во упаковок ∙ 65545[656088441] ←
      404[656132314]           Результат ≡ Округление ∙ 249[30867464] ←
 32505862[656086316]             Значения формальных параметров при вызове ←
 32505860[656090043]               Значение параметра при вызове процедуры/функции ≡ Округляемое значение ∙ 65545[30867479] ←
   327700[656094417]                 Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[656081758]                   Выполнить действия ←
 39780366[656081659]                     RETURN ←
      404[656132315]                       Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
      402[656081195]                       Делить ←
      404[656132351]                       Результат ≡ Кол-во в упак ∙ 65545[655296835] ←
 32505860[656092945]               Значение параметра при вызове процедуры/функции ≡ Округлять до ∙ 65545[30867480] ←
   327700[656098748]                 Выражение ⁼ 0.01 ←
 11010080[656095563]         = ≡ Кол-во паллет ∙ 65545[656088442] ←
      404[656132352]           Результат ≡ Округление ∙ 249[30867464] ←
 32505862[656086317]             Значения формальных параметров при вызове ←
 32505860[656092946]               Значение параметра при вызове процедуры/функции ≡ Округляемое значение ∙ 65545[30867479] ←
   327700[656098749]                 Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[656081759]                   Выполнить действия ←
 39780366[656081660]                     RETURN ←
      404[656132353]                       Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
      402[656081196]                       Делить ←
      404[656132354]                       Результат ≡ Кол-во в паллете ∙ 65545[58392813] ←
 32505860[656092947]               Значение параметра при вызове процедуры/функции ≡ Округлять до ∙ 65545[30867480] ←
   327700[656098750]                 Выражение ⁼ 0.01 ←
 30867469[165806270]       БЛОК • Поиск регулярной матрицы ←
 30867470[165806552]         IF ←
  1638463[165806709]           Условие ←
      404[165812719]             Результат ≡ Фильтр.Родитель ∙ 65545[1510252] ←
 30867472[165806547]           THEN ←
 11010080[165807780]             = ≡ Сводный заказ на РЦ ∙ 65545[165806831] ←
      116[165806851]               Выражение ←
      404[165812735]                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[165807902]                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[165807903]                     Уточняющий параметр ≡ UID типа ∙ 249[2621446] ←
  1638473[165806893]                 Равно ←
      404[165812736]                 Результат ≡ Сводный заказ на склад (РЦ) по торговым точкам ∙ 332[43122750] ←
 11010080[165807775]             = ≡ Наличие регулярной матрицы ∙ 65545[165806830] ←
      404[165812715]               Результат ⁼ '-' ←
  1507360[165806344]             Отбор данных (по запросу) • Активные прайс-листы ←
  1507673[165806128]               Ключи оптимизации ←
  1507675[165806145]                 Использовать индекс ≡ Спецификация ∙ 12124204[165806270] ←
  1507676[165806145]                   Уточняющий параметр ≡ РЕГИОН, ПОСТАВЩИК ∙ 1507445[656080948] ←
  1507506[165806371]                   Использование (в режиме выполнения) ≡ Нет, только если все условия соблюдены ∙ 534[11599879] ←
  1507508[165806492]                     Если истинно выражение ≡ Сводный заказ на РЦ ∙ 65545[165806831] ←
  1507675[165806147]                 Использовать индекс ≡ Спецификация ∙ 12124204[165806270] ←
  1507676[165806148]                   Уточняющий параметр ≡ ПРОДУКТ ∙ 1507445[54919247] ←
  1507506[165806375]                   Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[165806496]                     Если истинно выражение ≡ Сводный заказ на РЦ ∙ 65545[165806831] ←
  1507675[165806146]                 Использовать индекс ≡ Док. спецификации ∙ 12124204[165806271] ←
  1507676[165806146]                   Уточняющий параметр ≡ ID ∙ 1507445[1507432] ←
  1507675[165806148]                 Использовать индекс ≡ Склад ∙ 12124204[165806273] ←
  1507676[165806149]                   Уточняющий параметр ≡ ID ∙ 1507445[1507430] ←
  1507506[165806381]                   Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[165806502]                     Если истинно выражение ≡ Сводный заказ на РЦ ∙ 65545[165806831] ←
 12124200[165806208]               From         (Таблицы) ←
 12124204[165806270]                 Таблица • Спецификация ≡ СПЕЦИФИКАЦИЯ ПОСТАВЩИКА ∙ 1507433[43122705] ←
 12124204[165806271]                 Таблица • Док. спецификации ≡ Документ ∙ 108[5] ←
 12124204[165806273]                 Таблица • Склад ≡ Партнер ∙ 108[4] ←
  1507506[165806378]                   Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[165806499]                     Если истинно выражение ≡ Сводный заказ на РЦ ∙ 65545[165806831] ←
 12124215[165806307]               Where      (Ограничения на отбор данных) ←
  1507376[165806843]                 Выражение ←
  1507506[165806373]                   Использование (в режиме выполнения) ≡ Нет, только если все условия соблюдены ∙ 534[11599879] ←
  1507508[165806494]                     Если истинно выражение ≡ Сводный заказ на РЦ ∙ 65545[165806831] ←
  1507455[165806873]                   Результат ≡ Спецификация ∙ 12124204[165806270] ←
  1507494[165807933]                     Уточняющий параметр ≡ РЕГИОН ∙ 1507443[40043162] ←
  1638473[165806887]                   Равно ←
  1507452[165807008]                   Константа ≡ <<Строка>> ∙ 367[6] ←
      411[165807891]                     Уточняющий параметр ≡ Партнер ∙ 359[9] ←
  1507376[165806842]                 Выражение ←
  1507506[165806372]                   Использование (в режиме выполнения) ≡ Нет, только если все условия соблюдены ∙ 534[11599879] ←
  1507508[165806493]                     Если истинно выражение ≡ Сводный заказ на РЦ ∙ 65545[165806831] ←
  1507455[165806872]                   Результат ≡ Спецификация ∙ 12124204[165806270] ←
  1507494[165807931]                     Уточняющий параметр ≡ ПОСТАВЩИК ∙ 1507443[43122765] ←
  1638473[165806886]                   Равно ←
  1507452[165807007]                   Константа ≡ <<Строка>> ∙ 367[6] ←
      411[165807887]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[165807888]                       Уточняющий параметр ≡ Контрагент ∙ 331[7] ←
  1507376[165806841]                 Выражение ←
  1507455[165806871]                   Результат ≡ Спецификация ∙ 12124204[165806270] ←
  1507494[165807930]                     Уточняющий параметр ≡ ПРОДУКТ ∙ 1507443[43122766] ←
  1638473[165806885]                   Равно ←
  1507452[165807006]                   Константа ≡ <<Строка>> ∙ 367[6] ←
      411[165807886]                     Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1507376[165806844]                 Выражение ←
  1507455[165806874]                   Результат ≡ Спецификация ∙ 12124204[165806270] ←
  1507494[165807934]                     Уточняющий параметр ≡ ДАТА НАЧАЛЬНАЯ ∙ 1507443[57868335] ←
  1638475[165806197]                   Меньше или равно ←
  1507452[165807009]                   Константа ≡ <<Строка>> ∙ 367[6] ←
      411[165807892]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[165807893]                       Уточняющий параметр ≡ Дата поставки ∙ 331[14352402] ←
  1507376[165806845]                 Выражение ←
  1507455[165806875]                   Результат ≡ Спецификация ∙ 12124204[165806270] ←
  1507494[165807935]                     Уточняющий параметр ≡ ДАТА КОНЕЧНАЯ ∙ 1507443[57868336] ←
  1638477[165806157]                   Больше или равно ←
  1507452[165807010]                   Константа ≡ <<Строка>> ∙ 367[6] ←
      411[165807894]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[165807895]                       Уточняющий параметр ≡ Дата поставки ∙ 331[14352402] ←
  1507376[165806850]                 Выражение ←
  1507455[165806880]                   Результат ≡ Док. спецификации ∙ 12124204[165806271] ←
  1507494[165807940]                     Уточняющий параметр ≡ Документ ∙ 331[1] ←
  1638473[165806891]                   Равно ←
  1507455[165806879]                   Результат ≡ Спецификация ∙ 12124204[165806270] ←
  1507494[165807939]                     Уточняющий параметр ≡ ДОГОВОР ∙ 1507443[50659332] ←
  1507376[165806851]                 Выражение ←
  1507506[165806374]                   Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[165806495]                     Если истинно выражение ≡ Сводный заказ на РЦ ∙ 65545[165806831] ←
  1507455[165806881]                   Результат ≡ Док. спецификации ∙ 12124204[165806271] ←
  1507494[165807941]                     Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1638473[165806894]                   Равно ←
  1507452[165807017]                   Константа ≡ Коммерческое подразделение для всех подразделений (Договора, Дискаунтер или Экспресс по типу сети) ∙ 249[164364416] ←
 32505862[165806723]                     Значения формальных параметров при вызове ←
 32505860[165807506]                       Значение параметра при вызове процедуры/функции ≡ Тип сети ∙ 65545[164370833] ←
   327700[165808579]                         Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[165807915]                           Уточняющий параметр ≡ Партнер ∙ 359[9] ←
      411[165807916]                             Уточняющий параметр ≡ Ранг партнера ∙ 283[28835905] ←
  1507376[165806846]                 Выражение ←
  1507376[165806849]                   Выражение ←
  1507455[165806878]                     Результат ≡ Док. спецификации ∙ 12124204[165806271] ←
  1507494[165807938]                       Уточняющий параметр ≡ Коэффициент ∙ 331[42401810] ←
  1638473[165806890]                     Равно ←
  1507452[165807012]                     Константа ⁼ 0 ←
      412[165806210]                   ИЛИ ←
  1507376[165806848]                   Выражение ←
  1507455[165806877]                     Результат ≡ Док. спецификации ∙ 12124204[165806271] ←
  1507494[165807937]                       Уточняющий параметр ≡ Коэффициент ∙ 331[42401810] ←
  1638473[165806889]                     Равно ←
  1638402[165806339]                     NULL ←
  1507376[165806852]                 Выражение ←
  1507506[165806376]                   Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[165806497]                     Если истинно выражение ≡ Сводный заказ на РЦ ∙ 65545[165806831] ←
  1507455[165806885]                   Результат ≡ Склад ∙ 12124204[165806273] ←
  1507494[165807945]                     Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1638473[165806895]                   Равно ←
  1507455[165806882]                   Результат ≡ Док. спецификации ∙ 12124204[165806271] ←
  1507494[165807942]                     Уточняющий параметр ≡ Зона приемки ∙ 331[40042506] ←
  1507376[165806854]                 Выражение ←
  1507506[165806380]                   Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[165806501]                     Если истинно выражение ≡ Сводный заказ на РЦ ∙ 65545[165806831] ←
  1507455[165806887]                   Результат ≡ Склад ∙ 12124204[165806273] ←
  1507494[165807947]                     Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  1638473[165806897]                   Равно ←
  1507452[165807016]                   Константа ≡ <<Строка>> ∙ 367[6] ←
      411[165807912]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[165807913]                       Уточняющий параметр ≡ Контрагент ∙ 331[7] ←
 12124213[165806267]               Параметры ←
  1507335[165806651]                 Параметр • з.Документ ≡ Спецификация ∙ 12124204[165806270] ←
  1507494[165807932]                   Уточняющий параметр ≡ ДОГОВОР ∙ 1507443[50659332] ←
 12124224[165806124]               Group By  (Группировка) ←
  1507533[165806213]                 Группировать по параметру ≡ Спецификация ∙ 12124204[165806270] ←
  1507494[165807948]                   Уточняющий параметр ≡ ДОГОВОР ∙ 1507443[50659332] ←
 30867466[165806381]               Выполнить после получения записи ←
 11010080[165807779]                 = ≡ Наличие регулярной матрицы ∙ 65545[165806830] ←
      404[165812725]                   Результат ⁼ '+' ←
 11010100[165806120]                 BREAK ←
 30867483[655294584]     Локальные таблицы ←
 30867458[655294652]       Локальная таблица • Строки ←
 11010090[655294651]         Структура (Поля, сортировка, генерируемые события) ←
 30867481[655294642]           Блок (при отборе данных будет генерироваться это событие) • Требует обработки ←
 30867475[655294705]             Параметр ≡ Требует обработки ∙ 65545[655297757] ←
 11010106[655294467]               Сортировать по убыванию ←
 30867481[655294622]           Блок (при отборе данных будет генерироваться это событие) • Группа ←
 30867475[655295570]             Параметр ≡ Группа имя ∙ 65545[655296833] ←
 30867476[655294683]               Сортировать по возрастанию ←
 30867475[655295573]           Параметр ≡ Наименование ∙ 65545[144447106] ←
 30867476[655294830]             Сортировать по возрастанию ←
 30867475[655295571]           Параметр ≡ <<Строка>> ∙ 367[6] ←
 30867475[655295572]           Параметр ≡ <<Продукт>> ∙ 367[3] ←
 30867475[165478945]           Параметр ≡ ЛТ.Кол-во реализации (предыдущие 7 дней) ∙ 65545[165482875] ←
 30867475[165478946]           Параметр ≡ ЛТ.Кол-во реализованного ∙ 65545[165482876] ←
 30867475[165478947]           Параметр ≡ ЛТ.СП ∙ 65545[165482877] ←
 30867458[655294656]       Локальная таблица • Список товаров для подсветки ←
  11010103[58392577]         Исключать дублирующиеся записи ←
 11010090[655294655]         Структура (Поля, сортировка, генерируемые события) ←
 30867475[655295589]           Параметр ≡ <<Продукт>> ∙ 367[3] ←
 30867476[655294835]             Сортировать по возрастанию ←
 30867475[655295590]           Параметр ≡ Подсвечивать ∙ 65545[655299269] ←
  1507637[655294468]     Выполнить при старте ←
  1507410[655295171]       ВЫПОЛНИТЬ БЛОК ≡ Начало ∙ 30867469[655294989] ←
 11010093[656081333]       Комментарий • ----  проверка все ли дети записаны в сводный ←
 30867470[656082133]       IF ←
  1638463[656083632]         Условие ←
      116[656082147]           Выражение ←
      404[656086476]             Результат ≡ <<Документ>> ∙ 367[5] ←
      411[656091439]               Уточняющий параметр ≡ Число дней ∙ 331[14745614] ←
  1638479[656082358]             Не равно ←
  1638402[656083820]             NULL ←
      413[656081691]           И ←
      116[656082213]           Выражение ←
  1638464[656086477]             Ноль (0.0), если NULL ≡ <<Документ>> ∙ 367[5] ←
      411[656091440]               Уточняющий параметр ≡ Год ∙ 331[33620499] ←
  1638476[656081052]             Меньше ←
  1638464[656081184]             Ноль (0.0), если NULL ≡ <<Документ>> ∙ 367[5] ←
      411[656091441]               Уточняющий параметр ≡ Число дней ∙ 331[14745614] ←
 30867472[656082125]         THEN • сообщим, что не все дети записаны в сводный ←
 11010088[656082217]           ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
 11010095[656081454]             Выражение ←
      404[656086477]               Результат ⁼ 'Внимание! Не все заказы-дети записали свои данные в строки этого сводного заказа, возможна взаимная блокировка сессий при одновременной записи данных планировщиком и менеджером.' ←
  11010093[58392877]       Комментарий • ----  проверка при входе в заказ тт-п: акептованы ли заказы тт-рц ←
  30867470[58393190]       IF ←
   1638463[58393533]         Условие ←
       116[58393565]           Выражение ←
       404[58399879]             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58395252]               Уточняющий параметр ≡ UID типа ∙ 249[2621444] ←
   1638473[58393706]             Равно ←
       404[58399880]             Результат ≡ Заказ товаров поставщику [магазин] ∙ 332[28836002] ←
       413[58393245]           И ←
       116[58393566]           Выражение ←
   1638460[58392791]             НЕ ←
       404[58399881]             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58395253]               Уточняющий параметр ≡ Состояние документа ∙ 331[14] ←
       413[58523695]           И ←
       116[58523707]           Выражение ←
       404[58524178]             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58523862]               Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
       411[58523863]                 Уточняющий параметр ≡ Запрет поставщика ∙ 283[2818052] ←
   1638473[58523715]             Равно ←
       404[58524179]             Результат ≡ Да ∙ 131203075[131203074] ←
      413[655296180]           И ←
      404[655306672]           Результат ≡ Текущий узел является точкой ∙ 249[1507771] ←
  30867472[58393186]         THEN • заказ тт-п и он не акцептован, ищем каталог настройки системы и заказы рц ←
  11010080[58394309]           = ≡ Ограничение редактирования заказа ∙ 65545[58393133] ←
   1638402[58392594]             NULL ←
  11010105[58392634]           Индикатор ⁼ Проверка неакцептованных заказов... ←
   1507603[58392579]             Запретить прерывание ←
  30867470[58393280]           IF ←
   1638463[58393631]             Условие ←
   1638460[58392805]               НЕ ←
       404[58400408]               Результат ≡ Ограничение редактирования заказа ∙ 65545[58393133] ←
  30867472[58393276]             THEN • проверка каталогов настройки ←
   1507360[58392780]               Отбор данных (по запросу) ≡ КАТАЛОГИ ∙ 12124205[1507737] ←
  32505862[58393389]                 Значения формальных параметров при вызове ←
  32505860[58394315]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[1511948] ←
    327700[58395262]                     Выражение ≡ Настройка системы ∙ 297[655294471] ←
  12124215[58392703]                 Where      (Ограничения на отбор данных) ←
   1507381[58392643]                   <Наследуемые ограничения> ←
       413[58393246]                   И ←
   1507376[58393321]                   Выражение ←
   1507455[58393502]                     Результат ≡ КАТАЛОГИ ∙ 12124204[1508204] ←
   1507494[58393649]                       Уточняющий параметр ≡ Счет учета ∙ 296[15138823] ←
   1638473[58393707]                     Равно ←
   1507452[58393109]                     Константа ≡ Ограничение на вход в строки ∙ 655294509[655294465] ←
       413[58393247]                   И ←
   1507376[58393322]                   Выражение ←
   1507455[58393503]                     Результат ≡ КАТАЛОГИ ∙ 12124204[1508204] ←
   1507494[58393650]                       Уточняющий параметр ≡ Тип документа ∙ 296[28835847] ←
   1638473[58393708]                     Равно ←
   1507452[58393110]                     Константа ≡ Документ.Тип как UID ∙ 249[1507419] ←
   1507588[58392589]                       Класс или тип ≡ <<Документ>> ∙ 367[5] ←
       411[58395254]                         Уточняющий параметр ≡ Тип ∙ 331[4] ←
  30867466[58392807]                 Выполнить после получения записи ←
  11010080[58394186]                   = ≡ Индекс места ∙ 381[1966090] ←
       404[58399882]                     Результат ⁼ 0 ←
   1507360[58392781]                   Отбор данных (по запросу) ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
  32505862[58393390]                     Значения формальных параметров при вызове ←
  32505860[58394316]                       Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547258] ←
    327700[58395263]                         Выражение ≡ Заказ на склад (РЦ) с торговой точки (ТТ) ∙ 332[28835998] ←
  32505860[58394317]                       Значение параметра при вызове процедуры/функции ≡ Фильтр.Подразделения ∙ 65545[18547259] ←
    327700[58395264]                         Выражение ≡ <<Документ>> ∙ 367[5] ←
       411[58395255]                           Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
       411[58395256]                             Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
  32505860[58394318]                       Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа начальная ∙ 65545[18547260] ←
    327700[58395265]                         Выражение ≡ Дата, начало дня ∙ 249[30867471] ←
  32505862[58393391]                           Значения формальных параметров при вызове ←
  32505860[58394319]                             Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867497] ←
    327700[58395266]                               Выражение ≡ <<Документ>> ∙ 367[5] ←
       411[58395257]                                 Уточняющий параметр ≡ Дата ∙ 331[8] ←
 32505860[656087460]                       Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа конечная ∙ 65545[18547261] ←
   327700[656090868]                         Выражение ≡ Дата, конец дня ∙ 249[30867475] ←
 32505862[656083974]                           Значения формальных параметров при вызове ←
 32505860[656087461]                             Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
   327700[656090869]                               Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[656094088]                                 Уточняющий параметр ≡ Дата ∙ 331[8] ←
  32505860[58394320]                       Значение параметра при вызове процедуры/функции ≡ Фильтр.Состояние ∙ 65545[11600041] ←
    327700[58395267]                         Выражение ⁼ 0 ←
  30867466[58392808]                     Выполнить после получения записи ←
  11010080[58394187]                       = ≡ Индекс места ∙ 381[1966090] ←
       404[58399883]                         Результат ⁼ 1 ←
  11010100[58392620]                       BREAK ←
  30867470[58393191]                   IF ←
   1638463[58393534]                     Условие ←
       116[58393567]                       Выражение ←
       404[58399884]                         Результат ≡ Каталог.Справочник ∙ 1507335[1509198] ←
       411[58395258]                           Уточняющий параметр ≡ Время начала действия ∙ 296[3342341] ←
   1638476[58392605]                         Меньше ←
       404[58399885]                         Результат ≡ ВРЕМЯ ∙ 387[1638418] ←
    327700[58395268]                           Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
       413[58393248]                       И ←
       404[58399886]                       Результат ≡ Индекс места ∙ 381[1966090] ←
  30867472[58393187]                     THEN • выход, строки не показывать ←
  11010080[58394311]                       = ≡ Ограничение редактирования заказа ∙ 65545[58393133] ←
       404[58400397]                         Результат ⁼ 1 ←
  11010100[58392630]                       BREAK ←
  30867470[58393281]           IF ←
   1638463[58393636]             Условие ←
   1638460[58392806]               НЕ ←
       404[58400409]               Результат ≡ Ограничение редактирования заказа ∙ 65545[58393133] ←
  30867472[58393277]             THEN • проверка заказов по поставщикам ←
   1507360[58392790]               Отбор данных (по запросу) ≡ ДОКУМЕНТЫ ∙ 12124205[18546758] ←
  32505862[58393481]                 Значения формальных параметров при вызове ←
  32505860[58394517]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[18547258] ←
    327700[58395505]                     Выражение ≡ Заказ товаров поставщику [магазин] ∙ 332[28836002] ←
  32505860[58394518]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Подразделения ∙ 65545[18547259] ←
    327700[58395506]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
       411[58395457]                       Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  32505860[58394519]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа начальная ∙ 65545[18547260] ←
    327700[58395507]                     Выражение ≡ Дата, начало дня ∙ 249[30867471] ←
  32505862[58393482]                       Значения формальных параметров при вызове ←
  32505860[58394520]                         Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867497] ←
    327700[58395508]                           Выражение ≡ <<Документ>> ∙ 367[5] ←
       411[58395459]                             Уточняющий параметр ≡ Дата ∙ 331[8] ←
 32505860[656087453]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата документа конечная ∙ 65545[18547261] ←
   327700[656090866]                     Выражение ≡ Дата, конец дня ∙ 249[30867475] ←
 32505862[656083973]                       Значения формальных параметров при вызове ←
 32505860[656087454]                         Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
   327700[656090867]                           Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[656090172]                             Уточняющий параметр ≡ Дата ∙ 331[8] ←
  32505860[58394521]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Состояние ∙ 65545[11600041] ←
    327700[58395511]                     Выражение ⁼ 0 ←
  30867466[58392820]                 Выполнить после получения записи ←
  11010080[58394312]                   = ≡ Партнер ∙ 381[3] ←
       404[58400401]                     Результат ≡ з.Контрагент ∙ 1507335[18547062] ←
  30867470[58393285]                   IF ←
   1638463[58393656]                     Условие ←
       116[58392675]                       Выражение ←
       404[58400507]                         Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58395476]                           Уточняющий параметр ≡ Контрагент ∙ 331[7] ←
       411[58395477]                             Уточняющий параметр ≡ Использовать ПБУ №18 ∙ 283[33620487] ←
   1638473[58392854]                         Равно ←
       404[58400509]                         Результат ≡ Да ∙ 131203075[131203074] ←
       413[58392725]                       И ←
       116[58392677]                       Выражение ←
       404[58400510]                         Результат ≡ Партнер ∙ 381[3] ←
       411[58395479]                           Уточняющий параметр ≡ Использовать ПБУ №18 ∙ 283[33620487] ←
   1638473[58392855]                         Равно ←
       404[58400511]                         Результат ≡ Да ∙ 131203075[131203074] ←
  30867472[58393281]                     THEN • два партнера с ограничением макс.времени акцепта ←
  30867470[58393286]                       IF ←
   1638463[58393657]                         Условие ←
       116[58392678]                           Выражение ←
       404[58400517]                             Результат ≡ Партнер ∙ 381[3] ←
       411[58395480]                               Уточняющий параметр ≡ Время начала действия ∙ 283[3342343] ←
   1638479[58392856]                             Не равно ←
   1638402[58392825]                             NULL ←
       413[58392995]                           И ←
       116[58392676]                           Выражение ←
       404[58400516]                             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58395483]                               Уточняющий параметр ≡ Контрагент ∙ 331[7] ←
       411[58395484]                                 Уточняющий параметр ≡ Время начала действия ∙ 283[3342343] ←
   1638479[58392859]                             Не равно ←
   1638402[58392826]                             NULL ←
       413[58392726]                           И ←
       116[58392679]                           Выражение ←
       404[58400518]                             Результат ≡ Партнер ∙ 381[3] ←
       411[58395481]                               Уточняющий параметр ≡ Время начала действия ∙ 283[3342343] ←
   1638476[58392608]                             Меньше ←
       404[58400515]                             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58395478]                               Уточняющий параметр ≡ Контрагент ∙ 331[7] ←
       411[58395485]                                 Уточняющий параметр ≡ Время начала действия ∙ 283[3342343] ←
       413[58523997]                           И ←
       116[58524372]                           Выражение ←
       404[58527592]                             Результат ≡ Партнер ∙ 381[3] ←
       411[58525523]                               Уточняющий параметр ≡ Время начала действия ∙ 283[3342343] ←
   1638476[58523656]                             Меньше ←
       404[58527593]                             Результат ≡ ВРЕМЯ ∙ 387[1638418] ←
    327700[58524965]                               Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
       413[58393334]                           И ←
       116[58392680]                           Выражение ←
       404[58400520]                             Результат ≡ <<Документ>> ∙ 367[5] ←
   1638479[58392857]                             Не равно ←
       404[58400521]                             Результат ≡ з.Документ ∙ 1507335[18547059] ←
       413[58393335]                           И ←
       116[58392681]                           Выражение ←
       404[58400522]                             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58395482]                               Уточняющий параметр ≡ Контрагент ∙ 331[7] ←
   1638479[58392858]                             Не равно ←
       404[58400523]                             Результат ≡ Партнер ∙ 381[3] ←
  30867472[58393282]                         THEN • есть неакцептованный заказ поставщика, который должен уже быть акцептован ←
  11010080[58394330]                           = ≡ Ограничение редактирования заказа ∙ 65545[58393133] ←
       404[58400524]                             Результат ⁼ 3 ←
  11010100[58392635]                           BREAK ←
  30867473[58392838]                     ELSE • проверка поставщика по заказу ←
  30867470[58393279]                       IF ←
   1638463[58393630]                         Условие ←
       116[58392657]                           Выражение ←
       404[58400402]                             Результат ≡ Партнер ∙ 381[3] ←
       411[58395458]                               Уточняющий параметр ≡ Использовать ПБУ №18 ∙ 283[33620487] ←
   1638473[58392849]                             Равно ←
       404[58400403]                             Результат ≡ Да ∙ 131203075[131203074] ←
       413[58392721]                           И ←
       116[58392658]                           Выражение ←
       404[58400404]                             Результат ≡ Партнер ∙ 381[3] ←
       411[58395460]                               Уточняющий параметр ≡ Время начала действия ∙ 283[3342343] ←
   1638479[58392847]                             Не равно ←
   1638402[58392596]                             NULL ←
       413[58392722]                           И ←
       116[58392665]                           Выражение ←
       404[58400405]                             Результат ≡ Партнер ∙ 381[3] ←
       411[58395461]                               Уточняющий параметр ≡ Время начала действия ∙ 283[3342343] ←
   1638476[58392606]                             Меньше ←
       404[58400406]                             Результат ≡ ВРЕМЯ ∙ 387[1638418] ←
    327700[58395512]                               Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
       413[58392723]                           И ←
       116[58392666]                           Выражение ←
       404[58400410]                             Результат ≡ <<Документ>> ∙ 367[5] ←
   1638479[58392848]                             Не равно ←
       404[58400411]                             Результат ≡ з.Документ ∙ 1507335[18547059] ←
       413[58392724]                           И ←
       116[58392667]                           Выражение ←
       404[58400412]                             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58395462]                               Уточняющий параметр ≡ Контрагент ∙ 331[7] ←
   1638479[58392849]                             Не равно ←
       404[58400413]                             Результат ≡ Партнер ∙ 381[3] ←
  30867472[58393275]                         THEN • есть неакцептованный заказ поставщика, который должен уже быть акцептован ←
  11010080[58394313]                           = ≡ Ограничение редактирования заказа ∙ 65545[58393133] ←
       404[58400407]                             Результат ⁼ 2 ←
  11010100[58392632]                           BREAK ←
   1507412[58392584]           Закрыть индикатор ←
  30867470[58393278]           IF ←
   1638463[58393629]             Условие ←
       404[58400396]               Результат ≡ Ограничение редактирования заказа ∙ 65545[58393133] ←
  30867472[58393274]             THEN • были запреты на вход ←
  11010079[58392621]               CASE ←
   1572877[58392619]                 Условие ←
       404[58400508]                   Результат ≡ Ограничение редактирования заказа ∙ 65545[58393133] ←
  11010081[58392737]                 OF ⁼ 1 ←
  11010088[58393487]                   ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
  11010095[58393043]                     Выражение ←
       404[58399887]                       Результат ⁼ Запрет на вход в содержимое, пока есть неакцептованные документы "Заказ с ТТ на РЦ" ! ←
  11010081[58392738]                 OF ⁼ 2 ←
  11010088[58393566]                   ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
  11010095[58393079]                     Выражение ←
       404[58400512]                       Результат ⁼ Запрет на вход в содержимое, пока есть неакцептованные заказы поставщику с ограничением максимального времени акцепта! ←
       404[58524805]                       Результат ≡ Партнер ∙ 381[3] ←
       411[58524193]                         Уточняющий параметр ≡ Наименование ∙ 283[5] ←
  11010081[58392739]                 OF ⁼ 3 ←
  11010088[58393568]                   ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
  11010095[58393081]                     Выражение ←
       404[58400514]                       Результат ⁼ Запрет на вход в содержимое, пока есть неакцептованные заказы поставщику с меньшим максимальным временем акцепта! ←
       404[58524804]                       Результат ≡ Партнер ∙ 381[3] ←
       411[58524192]                         Уточняющий параметр ≡ Наименование ∙ 283[5] ←
  30867473[58392839]                 ELSE • все ←
  11010088[58393567]                   ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
  11010095[58393080]                     Выражение ←
       404[58400513]                       Результат ⁼ Запрет на вход в содержимое, пока есть неакцептованные документы "Заказ с ТТ на РЦ" или заказы поставщику с ограничением максимального времени акцепта! ←
 30867470[164497014]               IF ←
  1638463[164497632]                 Условие ←
      404[164519311]                   Результат ≡ Пользователь Григорий ∙ 117[164495453] ←
 30867472[164496999]                 THEN • Надоело ждать под дня, пока магазин акцептует все документы по времени ←
 30867473[164496134]                 ELSE ←
 11010101[164495446]                   EXIT ←
  11010080[58394310]           = ≡ Ограничение редактирования заказа ∙ 65545[58393133] ←
   1638402[58392595]             NULL ←
  11010093[58392684]       Комментарий • ----  отличие в количестве строк подсчитанном и сформированном ←
  30867470[58392821]       IF ←
   1638463[58392910]         Условие ←
       116[58392897]           Выражение ←
       404[58395199]             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58393520]               Уточняющий параметр ≡ Начальное значение нумератора ∙ 331[15859724] ←
   1638479[58392640]             Не равно ←
   1638402[58392647]             NULL ←
       413[58392859]           И ←
       116[58392899]           Выражение ←
       404[58395204]             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58393524]               Уточняющий параметр ≡ Номер протокола после слива ∙ 331[15073287] ←
   1638479[58392642]             Не равно ←
   1638402[58392649]             NULL ←
       413[58392860]           И ←
       116[58392898]           Выражение ←
       404[58395200]             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58393521]               Уточняющий параметр ≡ Начальное значение нумератора ∙ 331[15859724] ←
   1638479[58392641]             Не равно ←
       404[58395201]             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58393522]               Уточняющий параметр ≡ Номер протокола после слива ∙ 331[15073287] ←
  30867472[58392817]         THEN • не совпадает количество строк ←
  11010088[58392962]           ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
  11010095[58392786]             Выражение ←
       404[58395202]               Результат ⁼ 'Количество строк не совпадает с прописанным!' ←
  11010093[58392685]       Комментарий • ----  проверка способа доставки ←
  11010080[58393205]       = ≡ Список спецификаций ∙ 65545[58392959] ←
       404[58396254]         Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58393799]           Уточняющий параметр ≡ Список подгрупп ∙ 331[42401911] ←
  30867470[58392873]       IF ←
   1638463[58393015]         Условие ←
       404[58396253]           Результат ≡ Проверка специфиций (РЦ и не РЦ) ∙ 117[58392694] ←
       413[58392949]           И ←
       116[58393025]           Выражение ←
       404[58396250]             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58393800]               Уточняющий параметр ≡ Контрагент ∙ 331[7] ←
       411[58393801]                 Уточняющий параметр ≡ UID типа ∙ 249[45940739] ←
   1638473[58393181]             Равно ←
       404[58396252]             Результат ≡ Торговый партнер ∙ 284[14745610] ←
       413[58392952]           И ←
       116[58393036]           Выражение ←
       404[58396334]             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58393850]               Уточняющий параметр ≡ UID типа ∙ 249[2621444] ←
   1638479[58392683]             Не равно ←
       404[58396335]             Результат ≡ Заказ товаров поставщику [РЦ] ∙ 332[14352385] ←
  30867472[58392869]         THEN • сообщить о том что есть спецификации с доставкой через РЦ ←
  30867470[58392874]           IF ←
   1638463[58393016]             Условие ←
   1638460[58392661]               НЕ ←
       404[58396255]               Результат ≡ ShowYesNoMessage ∙ 249[39780368] ←
  11010095[58392875]                 Выражение ←
       404[58396256]                   Результат ⁼ 'Одна из спецификаций имеет способ доставки через РЦ, нужен ли вам такой заказ?' ←
  30867472[58392870]             THEN • выход ←
  11010101[58392602]               EXIT ←
  11010093[58392712]       Комментарий • ----  инициализируем признак для пц ←
 11010080[656092400]       = ≡ Для ПЦ ∙ 65545[656090036] ←
      404[656106483]         Результат ≡ <<Документ>> ∙ 367[5] ←
      411[656094280]           Уточняющий параметр ≡ Проверка на признак "Для ПЦ/Кулинарии" (по заказу) ∙ 249[656080925] ←
 32505862[656085716]             Значения формальных параметров при вызове ←
 32505860[656091294]               Значение параметра при вызове процедуры/функции ≡ Документ-заказ _фп ∙ 65545[656083434] ←
   327700[656096386]                 Выражение ≡ <<Документ>> ∙ 367[5] ←
 11010093[656084510]       Комментарий • ---- ←
 11010080[656088763]       = ≡ МинСум ∙ 65545[656085178] ←
      404[656100485]         Результат ≡ <<Документ>> ∙ 367[5] ←
      411[656086420]           Уточняющий параметр ≡ Сумма по норме ∙ 331[33620492] ←
 11010080[656095772]       = ≡ МаксСум ∙ 65545[656088725] ←
      404[656134431]         Результат ≡ <<Документ>> ∙ 367[5] ←
      411[656096019]           Уточняющий параметр ≡ Сумма сверх нормы ∙ 331[33620493] ←
 11010080[656081799]       = ≡ МинКолУпкв ∙ 65545[656081833] ←
      404[656083730]         Результат ≡ <<Документ>> ∙ 367[5] ←
      411[656082946]           Уточняющий параметр ≡ Сумма нераспределенная ∙ 331[33620524] ←
 11010080[656095774]       = ≡ МинКолПаллет ∙ 65545[656088726] ←
      404[656134432]         Результат ≡ <<Документ>> ∙ 367[5] ←
      411[656096020]           Уточняющий параметр ≡ Сумма нераспределенная, вал. ∙ 331[12058637] ←
  11010079[58392584]       CASE ←
   1572877[58392586]         Условие ←
       404[58394712]           Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58393190]             Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
       411[58393191]               Уточняющий параметр ≡ Тип ∙ 283[4] ←
  11010081[58392599]         OF ≡ ПроектныйЭлемент.Индекс ∙ 249[42467331] ←
  11010064[58392597]           Выражение ≡ Центр ответственности ∙ 284[40370180] ←
  11010080[58523920]           = ≡ Первый ТЗ для магазина ∙ 65545[655299282] ←
       404[58524666]             Результат ≡ Первый ТЗ/ПЦ для ЦО/ТТ/Узла (действ. магазины) ∙ 249[655294491] ←
  32505862[58523737]               Значения формальных параметров при вызове ←
  32505860[58523819]                 Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[655298326] ←
    327700[58524001]                   Выражение ≡ <<Документ>> ∙ 367[5] ←
       411[58524128]                     Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  11010080[58392981]           = ≡ Список Магазинов ∙ 65545[655299270] ←
       404[58394714]             Результат ≡ Список ТТ списка ЦО ∙ 249[655294480] ←
  32505862[58392744]               Значения формальных параметров при вызове ←
  32505860[58392965]                 Значение параметра при вызове процедуры/функции ≡ Список ЦО ∙ 65545[655297435] ←
    327700[58393246]                   Выражение ≡ <<Документ>> ∙ 367[5] ←
       411[58393193]                     Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  11010080[58392986]           = ≡ ЦО ∙ 65545[58392759] ←
       404[58394719]             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58393201]               Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  11010081[58392600]         OF ≡ ПроектныйЭлемент.Индекс ∙ 249[42467331] ←
  11010064[58392598]           Выражение ≡ Торговая точка (Магазин) ∙ 284[40566786] ←
 11010080[655296627]           = ≡ Первый ТЗ для магазина ∙ 65545[655299282] ←
      404[655299880]             Результат ≡ Найти первого партнера ∙ 249[39780361] ←
   262158[655294553]               Ограничение на класс/тип объектов ≡ Товарный склад/секция ∙ 284[14745607] ←
  1638448[655294680]               Список ограничений на поля объектов ←
   262159[655294779]                 Ограничение на поле объекта ≡ Родитель ∙ 283[2] ←
   327700[655302665]                   Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[655295872]                     Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
   262159[655294780]                 Ограничение на поле объекта ≡ Назначение подразделения ∙ 283[15073286] ←
   327700[655302666]                   Выражение ≡ Подразделение для прихода и розничной продажи товаров: Склад-Торговый Зал ∙ 15073289[28835846] ←
  11010080[58392983]           = ≡ Список Магазинов ∙ 65545[655299270] ←
       404[58394716]             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58393197]               Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  11010080[58392987]           = ≡ ЦО ∙ 65545[58392759] ←
       404[58394720]             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58393202]               Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
       411[58393203]                 Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
  11010081[58392626]         OF ≡ ПроектныйЭлемент.Индекс ∙ 249[42467331] ←
  11010064[58392619]           Выражение ≡ Производственный цех (завод, производство) ∙ 284[16318466] ←
  11010080[58523921]           = ≡ Первый ТЗ для магазина ∙ 65545[655299282] ←
       404[58524667]             Результат ≡ Первый ТЗ/ПЦ для ЦО/ТТ/Узла (действ. магазины) ∙ 249[655294491] ←
  32505862[58523738]               Значения формальных параметров при вызове ←
  32505860[58523820]                 Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[655298326] ←
    327700[58524002]                   Выражение ≡ <<Документ>> ∙ 367[5] ←
       411[58524129]                     Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
       411[58524131]                       Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
  11010080[58393200]           = ≡ Список Магазинов ∙ 65545[655299270] ←
       404[58396164]             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58393763]               Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  11010080[58393201]           = ≡ ЦО ∙ 65545[58392759] ←
       404[58396165]             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58393764]               Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
       411[58393765]                 Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
  11010081[58392601]         OF ≡ ПроектныйЭлемент.Индекс ∙ 249[42467331] ←
  11010064[58392599]           Выражение ≡ Товарный склад/секция ∙ 284[14745607] ←
  11010080[58392984]           = ≡ Первый ТЗ для магазина ∙ 65545[655299282] ←
       404[58394718]             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58393200]               Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  11010080[58392985]           = ≡ Список Магазинов ∙ 65545[655299270] ←
       404[58394717]             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58393198]               Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
       411[58393199]                 Уточняющий параметр ≡ Родитель ∙ 283[2] ←
  11010080[58392988]           = ≡ ЦО ∙ 65545[58392759] ←
       404[58394721]             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58393204]               Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
       411[58393205]                 Уточняющий параметр ≡ Родитель ∙ 283[2] ←
       411[58393206]                   Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
  11010081[58392617]         OF ≡ ПроектныйЭлемент.Индекс ∙ 249[42467331] ←
  11010064[58392602]           Выражение ≡ Распределительный центр ∙ 284[40566785] ←
  11010080[58393017]           = ≡ Первый ТЗ для магазина ∙ 65545[655299282] ←
   1638402[58392628]             NULL ←
  11010080[58393018]           = ≡ Список Магазинов ∙ 65545[655299270] ←
   1638402[58392629]             NULL ←
  11010080[58393020]           = ≡ ЦО ∙ 65545[58392759] ←
       404[58394802]             Результат ≡ <<Документ>> ∙ 367[5] ←
       411[58393252]               Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  11010081[58392707]         OF ≡ ПроектныйЭлемент.Индекс ∙ 249[42467331] ←
  11010064[58392667]           Выражение ≡ Предприятие (Компания, Организация) ∙ 284[14745601] ←
  11010080[58394088]           = ≡ Первый ТЗ для магазина ∙ 65545[655299282] ←
   1638402[58392916]             NULL ←
  11010080[58394089]           = ≡ Список Магазинов ∙ 65545[655299270] ←
   1638402[58392917]             NULL ←
  11010080[58394090]           = ≡ ЦО ∙ 65545[58392759] ←
   1638402[58392918]             NULL ←
  30867473[58392637]         ELSE • выход ←
  11010101[58392577]           EXIT ←
 11010093[656081723]       Комментарий • ----  группы товаров текущего пользователя ←
 11010080[656082499]       = ≡ Список групп менеджера ∙ 65545[656082061] ←
  1638402[656082816]         NULL ←
 30867470[656081594]       IF ←
  1638463[656081900]         Условие ←
      404[656087391]           Результат ≡ ~Фильтровать по менеджеру группы ∙ 65545[656090094] ←
      413[656081490]           И ←
      116[656086051]           Выражение ←
      404[656101030]             Результат ≡ Партнер для документа (глоб.перем.) ∙ 381[131077] ←
  1638479[656082316]             Не равно ←
  1638402[656082920]             NULL ←
 30867472[656081590]         THEN • перебираем группы товаров и составляем список групп данного пользователя ←
  1507360[656081195]           Отбор данных (по запросу) ≡ КАТАЛОГИ ∙ 12124205[1507737] ←
 32505862[656081885]             Значения формальных параметров при вызове ←
 32505860[656083413]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[1511948] ←
   327700[656089114]                 Выражение ≡ Товарная группа ∙ 297[14745601] ←
 12124215[656081050]             Where      (Ограничения на отбор данных) ←
  1507381[656081131]               <Наследуемые ограничения> ←
      413[656081481]               И ←
  1507376[656081465]               Выражение ←
  1507455[656081506]                 Результат ≡ КАТАЛОГИ ∙ 12124204[1508204] ←
  1507494[656081662]                   Уточняющий параметр ≡ Подразделение для продажи ∙ 296[15073281] ←
  1638473[656081749]                 Равно ←
  1507452[656082349]                 Константа ≡ Партнер для документа (глоб.перем.) ∙ 381[131077] ←
 30867466[656081162]             Выполнить после получения записи ←
 11010080[656082500]               = ≡ Список групп менеджера ∙ 65545[656082061] ←
      404[656087392]                 Результат ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[656081147]                   Список элементов ←
   327700[656089115]                     Выражение ≡ Список групп менеджера ∙ 65545[656082061] ←
   327700[656089116]                     Выражение ≡ Каталог.Справочник ∙ 1507335[1509198] ←
 30867470[165544244]       IF ←
  1638463[165544292]         Условие ←
      116[165544255]           Выражение ←
      404[165547564]             Результат ≡ <<Документ>> ∙ 367[5] ←
      411[165544774]               Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1638473[165544647]             Равно ←
      404[165547565]             Результат ≡ Фасовочный цех ∙ 117[170459296] ←
      412[165543979]           ИЛИ ←
      116[165544256]           Выражение ←
      404[165547566]             Результат ≡ <<Документ>> ∙ 367[5] ←
      411[165544775]               Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  1638473[165544648]             Равно ←
      404[165547567]             Результат ⁼ 4:0:0:1883508 ←
 30867472[165544243]         THEN • Фасовочный цех ←
 11010080[165545644]           = ≡ Фасовочный цех? ∙ 65545[165544754] ←
      404[165547568]             Результат ≡ true ∙ 117[30867468] ←
 30867473[165544030]         ELSE • Не ФЦ ←
 11010080[165545645]           = ≡ Фасовочный цех? ∙ 65545[165544754] ←
      404[165547569]             Результат ≡ false ∙ 117[30867469] ←
 11010093[656081724]       Комментарий • ---- ←
  1507410[655294949]       ВЫПОЛНИТЬ БЛОК ≡ Отмена выбора всех строк ∙ 30867469[655295165] ←
  1507614[144441354]     Отбор данных ←
   1507410[58392642]       ВЫПОЛНИТЬ БЛОК ≡ Отбор данных.Начало ∙ 30867469[1511645] ←
  1507410[144965997]       ВЫПОЛНИТЬ БЛОК ≡ Расчет итогов ∙ 30867469[144966421] ←
 11010093[144441546]       Комментарий • ---------- Вывод данных ---------- ←
 30867470[655295580]       IF ←
  1638463[655295862]         Условие ←
      404[655303945]           Результат ≡ По возрастанию : Если по группе продукта ∙ 117[48432273] ←
 30867472[655295573]         THEN ←
  11010104[58392592]           Очистить локальную таблицу ≡ Строки ∙ 30867458[655294652] ←
  1507360[655294595]           Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
  1507635[655294482]             Быстрый показ первых записей ←
  1507447[165478920]             Выражения ←
 48431290[165478449]               Группа выражений • Суммы по детям ←
  1507449[165480177]                 Выражение • Кол-во реализации (предыдущие 7 дней) (дети) ≡ Количество ∙ 107[15] ←
 12124205[165479425]                   Запрос ←
  1507447[165478921]                     Выражения ←
  1507449[165480178]                       Выражение • Кол-во реализации (предыдущие 7 дней) (по магазину) ≡ Количество ∙ 107[15] ←
  1507608[165484141]                         Результат (Ноль (0.0), если NULL) ≡ Строки магазина ∙ 12124204[165479649] ←
  1507494[165486139]                           Уточняющий параметр ≡ Количество палет [док] ∙ 359[2818049] ←
  1507449[165480180]                       Выражение • Кол-во реализации (предыдущие 7 дней) ≡ Количество ∙ 107[15] ←
  1507455[165484142]                         Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[165478909]                           Значения параметров ←
  1507477[165479113]                             Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[165479113]                               Выражение ≡ Кол-во реализации (предыдущие 7 дней) (по магазину) ∙ 1507449[165480178] ←
 12124213[165479548]                     Параметры ←
  1507335[165481369]                       Параметр • Кол-во реализации (предыдущие 7 дней) ≡ Кол-во реализации (предыдущие 7 дней) ∙ 1507449[165480180] ←
 12124200[165479452]                     From         (Таблицы) ←
 12124204[165479649]                       Таблица • Строки магазина ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[165479568]                     Where      (Ограничения на отбор данных) ←
  1507376[165482795]                       Выражение ←
  1507455[165484139]                         Результат ≡ Строки магазина ∙ 12124204[165479649] ←
  1507494[165486137]                           Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[165482559]                         Равно ←
  1507455[165484140]                         Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165486138]                           Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507449[165480181]                 Выражение • Кол-во реализованного (дети) ≡ Количество ∙ 107[15] ←
 12124205[165479426]                   Запрос ←
  1507447[165478922]                     Выражения ←
  1507449[165480182]                       Выражение • Кол-во реализованного (по магазину) ≡ Количество ∙ 107[15] ←
  1507608[165484143]                         Результат (Ноль (0.0), если NULL) ≡ Строки магазина ∙ 12124204[165479650] ←
  1507494[165486141]                           Уточняющий параметр ≡ Количество последней поставки ∙ 359[15204356] ←
  1507449[165480183]                       Выражение • Кол-во реализованного ≡ Количество ∙ 107[15] ←
  1507455[165484144]                         Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[165478910]                           Значения параметров ←
  1507477[165479114]                             Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[165479114]                               Выражение ≡ Кол-во реализованного (по магазину) ∙ 1507449[165480182] ←
 12124213[165479549]                     Параметры ←
  1507335[165481370]                       Параметр • Кол-во реализованного ≡ Кол-во реализованного ∙ 1507449[165480183] ←
 12124200[165479453]                     From         (Таблицы) ←
 12124204[165479650]                       Таблица • Строки магазина ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[165479578]                     Where      (Ограничения на отбор данных) ←
  1507376[165482806]                       Выражение ←
  1507455[165484187]                         Результат ≡ Строки магазина ∙ 12124204[165479650] ←
  1507494[165486176]                           Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[165482570]                         Равно ←
  1507455[165484188]                         Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165486177]                           Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507449[165480184]                 Выражение • СП (дети) ≡ Количество ∙ 107[15] ←
 12124205[165479427]                   Запрос ←
  1507447[165478923]                     Выражения ←
  1507449[165480185]                       Выражение • СП (по магазину) ≡ Количество ∙ 107[15] ←
  1507608[165484147]                         Результат (Ноль (0.0), если NULL) ≡ Строки магазина ∙ 12124204[165479651] ←
  1507494[165486144]                           Уточняющий параметр ≡ Скорость реализации ∙ 359[15204355] ←
  1507449[165480186]                       Выражение • СП ≡ Количество ∙ 107[15] ←
  1507455[165484148]                         Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[165478911]                           Значения параметров ←
  1507477[165479115]                             Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[165479115]                               Выражение ≡ СП (по магазину) ∙ 1507449[165480185] ←
 12124213[165479550]                     Параметры ←
  1507335[165481371]                       Параметр • СП ≡ СП ∙ 1507449[165480186] ←
 12124200[165479454]                     From         (Таблицы) ←
 12124204[165479651]                       Таблица • Строки магазина ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[165479579]                     Where      (Ограничения на отбор данных) ←
  1507376[165482808]                       Выражение ←
  1507455[165484191]                         Результат ≡ Строки магазина ∙ 12124204[165479651] ←
  1507494[165486180]                           Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[165482572]                         Равно ←
  1507455[165484192]                         Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165486181]                           Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
 48431290[165478450]               Группа выражений • Суммы по детям, если нет, то из строки ←
  1507449[165480214]                 Выражение • Кол-во реализации (предыдущие 7 дней) ≡ Количество ∙ 107[15] ←
  1507455[165484225]                   Результат ≡ NVL ∙ 1507471[48431117] ←
  1507476[165478926]                     Значения параметров ←
  1507477[165479136]                       Параметр ≡ Значение ∙ 1507473[48431126] ←
  1507478[165479136]                         Выражение ≡ Кол-во реализации (предыдущие 7 дней) (дети) ∙ 1507449[165480177] ←
  1507477[165479137]                       Параметр ≡ Значение если NULL ∙ 1507473[48431127] ←
  1507478[165479137]                         Выражение ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165486214]                           Уточняющий параметр ≡ Количество палет [док] ∙ 359[2818049] ←
  1507449[165480217]                 Выражение • Кол-во реализованного ≡ Количество ∙ 107[15] ←
  1507455[165484226]                   Результат ≡ NVL ∙ 1507471[48431117] ←
  1507476[165478927]                     Значения параметров ←
  1507477[165479138]                       Параметр ≡ Значение ∙ 1507473[48431126] ←
  1507478[165479138]                         Выражение ≡ Кол-во реализованного (дети) ∙ 1507449[165480181] ←
  1507477[165479139]                       Параметр ≡ Значение если NULL ∙ 1507473[48431127] ←
  1507478[165479139]                         Выражение ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165486215]                           Уточняющий параметр ≡ Количество последней поставки ∙ 359[15204356] ←
  1507449[165480218]                 Выражение • СП ≡ Количество ∙ 107[15] ←
  1507455[165484227]                   Результат ≡ NVL ∙ 1507471[48431117] ←
  1507476[165478928]                     Значения параметров ←
  1507477[165479140]                       Параметр ≡ Значение ∙ 1507473[48431126] ←
  1507478[165479140]                         Выражение ≡ СП (дети) ∙ 1507449[165480184] ←
  1507477[165479141]                       Параметр ≡ Значение если NULL ∙ 1507473[48431127] ←
  1507478[165479141]                         Выражение ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165486216]                           Уточняющий параметр ≡ Скорость реализации ∙ 359[15204355] ←
 12124213[165479551]             Параметры ←
  1507380[165478429]               <Наследуемые пункты> ←
  1507335[165481372]               Параметр • Кол-во реализации (предыдущие 7 дней) ≡ Кол-во реализации (предыдущие 7 дней) ∙ 1507449[165480214] ←
  1507335[165481373]               Параметр • Кол-во реализованного ≡ Кол-во реализованного ∙ 1507449[165480217] ←
  1507335[165481374]               Параметр • СП ≡ СП ∙ 1507449[165480218] ←
 32505862[655295520]             Значения формальных параметров при вызове ←
 32505860[655296761]               Значение параметра при вызове процедуры/функции ≡ Требуется сортировка по полям продукта ∙ 65545[1510319] ←
   327700[655297079]                 Выражение ≡ Требуется сортировка по полям продукта ∙ 117[1507986] ←
 32505860[655296762]               Значение параметра при вызове процедуры/функции ≡ Требуется сортировка по наименованию продукта ∙ 65545[1518029] ←
   327700[655297080]                 Выражение ≡ Требуется сортировка по наименованию продукта ∙ 117[1510089] ←
 32505860[655296763]               Значение параметра при вызове процедуры/функции ≡ Требуется сортировка по коду продукта ∙ 65545[1518030] ←
   327700[655298526]                 Выражение ≡ Требуется сортировка по коду продукта ∙ 117[1510090] ←
 32505860[655296764]               Значение параметра при вызове процедуры/функции ≡ Требуется сортировка по артикулу продукта ∙ 65545[48431341] ←
   327700[655298527]                 Выражение ≡ Требуется сортировка по артикулу продукта ∙ 117[48431137] ←
 32505860[655296765]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Строки ∙ 65545[1510098] ←
   327700[655298528]                 Выражение ≡ Фильтр.Список UID-ов ∙ 65545[1510139] ←
 32505860[164835207]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510266] ←
   327700[164840904]                 Выражение ≡ Фильтр.Родитель ∙ 65545[1510252] ←
 32505860[655300130]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Классы ∙ 65545[1510099] ←
   327700[655303424]                 Выражение ≡ Фильтр.Список классов ∙ 65545[1510121] ←
 32505860[655300131]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[1510100] ←
   327700[655303425]                 Выражение ≡ ~Тип строки ∙ 65545[144447287] ←
 32505860[655300138]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата начальная ∙ 65545[1510103] ←
   327700[655303432]                 Выражение ≡ Фильтр.  Дата начальная ∙ 65545[1510147] ←
 32505860[655300139]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата конечная ∙ 65545[1510104] ←
   327700[655303433]                 Выражение ≡ Фильтр.  Дата конечная ∙ 65545[1510148] ←
 32505860[655300140]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[655303434]                 Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[655300141]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Документ.Список классов ∙ 65545[1510109] ←
   327700[655303435]                 Выражение ≡ Фильтр.Документ.Список классов ∙ 65545[1510143] ←
 32505860[655300142]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Документ.Список типов ∙ 65545[1510110] ←
   327700[655303436]                 Выражение ≡ Фильтр.Документ.Список типов ∙ 65545[1510144] ←
 32505860[655300143]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Подразделение документа ∙ 65545[1510101] ←
   327700[655303437]                 Выражение ≡ Фильтр.  Подразделение документа ∙ 65545[1510145] ←
 32505860[655300144]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Контрагент документа ∙ 65545[1510102] ←
   327700[655303438]                 Выражение ≡ Фильтр.  Контрагент документа ∙ 65545[1510146] ←
 32505860[655300147]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Документ.Дата начальная ∙ 65545[48432261] ←
   327700[655303441]                 Выражение ≡ Фильтр.Документ. Дата начальная ∙ 65545[48432263] ←
 32505860[655300148]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Документ.Дата конечная ∙ 65545[48432262] ←
   327700[655303442]                 Выражение ≡ Фильтр.Документ. Дата конечная ∙ 65545[48432264] ←
 32505860[655300149]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт ∙ 65545[1510111] ←
   327700[655303443]                 Выражение ≡ Фильтр.UID продукта ∙ 65545[1510152] ←
 32505860[655301534]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Список классов ∙ 65545[1510112] ←
   327700[655305323]                 Выражение ≡ Фильтр.Продукт.Список классов ∙ 65545[1510153] ←
 32505860[655301535]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Список типов ∙ 65545[1510113] ←
   327700[655305324]                 Выражение ≡ Фильтр.Продукт.Список типов ∙ 65545[1510154] ←
 32505860[655301536]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Список групп/категорий ∙ 65545[1510117] ←
   327700[655305325]                 Выражение ≡ Фильтр.Список групп/категорий продукта ∙ 65545[1510158] ←
 32505860[655301537]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Подгруппа ∙ 65545[1510118] ←
   327700[655305326]                 Выражение ≡ Фильтр.Подгруппа продукта ∙ 65545[1510159] ←
 32505860[655301538]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Изготовитель ∙ 65545[48432573] ←
   327700[655305327]                 Выражение ≡ Фильтр.Изготовитель продукта ∙ 65545[48432571] ←
 32505860[655301539]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Поставщик базового продукта ∙ 65545[48432653] ←
   327700[655305328]                 Выражение ≡ Фильтр.Поставщик базового продукта ∙ 65545[48432652] ←
 32505860[655301540]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Наименование (вхождение) ∙ 65545[1515475] ←
   327700[655305329]                 Выражение ≡ Фильтр.Продукт.Наименование (вхождение) ∙ 65545[1515477] ←
 32505860[655301541]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Код (вхождение) ∙ 65545[1515476] ←
   327700[655305330]                 Выражение ≡ Фильтр.Продукт.Код (вхождение) ∙ 65545[1515478] ←
 32505860[655301542]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Артикул (вхождение) ∙ 65545[48432109] ←
   327700[655305331]                 Выражение ≡ Фильтр.Продукт.Артикул (вхождение) ∙ 65545[48432110] ←
 32505860[655301543]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Только акцептованные строки {Нет} ∙ 65545[1510169] ←
   327700[655305332]                 Выражение ≡ Фильтр.Только акцептованные ∙ 65545[1510168] ←
 30867466[655295126]             Выполнить после получения записи ←
 30867469[165480179]               БЛОК • Получить данные по магазинам ←
 11010080[165488029]                 = ≡ ЛТ.Кол-во реализации (предыдущие 7 дней) ∙ 65545[165482875] ←
      404[165502741]                   Результат ≡ Кол-во реализации (предыдущие 7 дней) ∙ 1507335[165481372] ←
 11010080[165488030]                 = ≡ ЛТ.Кол-во реализованного ∙ 65545[165482876] ←
      404[165502742]                   Результат ≡ Кол-во реализованного ∙ 1507335[165481373] ←
 11010080[165488031]                 = ≡ ЛТ.СП ∙ 65545[165482877] ←
      404[165502743]                   Результат ≡ СП ∙ 1507335[165481374] ←
 11010080[655298630]               = ≡ <<Строка>> ∙ 367[6] ←
      404[655303946]                 Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 11010080[655298633]               = ≡ <<Продукт>> ∙ 367[3] ←
      404[655303947]                 Результат ≡ Строка.Продукт ∙ 1507335[1508517] ←
 30867470[656084789]               IF ←
  1638463[656085949]                 Условие ←
      404[656128056]                   Результат ≡ ~Фильтровать по менеджеру группы ∙ 65545[656090094] ←
      413[656081482]                   И ←
      404[656087393]                   Результат ≡ Список групп менеджера ∙ 65545[656082061] ←
 30867472[656084777]                 THEN • проверяем относится ли товар к группе текущего менеджера ←
 11010099[656080984]                   CONTINUE ←
      116[656086050]                     Выражение ←
  1638460[656081404]                       НЕ ←
      404[656087394]                       Результат ≡ Множество.СодержитЭлемент ∙ 249[1507635] ←
 32505862[656081886]                         Значения формальных параметров при вызове ←
 32505860[656083414]                           Значение параметра при вызове процедуры/функции ≡ Множество ∙ 65545[1517723] ←
   327700[656089117]                             Выражение ≡ Список групп менеджера ∙ 65545[656082061] ←
 32505860[656083415]                           Значение параметра при вызове процедуры/функции ≡ Элемент ∙ 65545[1517724] ←
   327700[656089118]                             Выражение ≡ <<Продукт>> ∙ 367[3] ←
      411[656087167]                               Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[656087168]                                 Уточняющий параметр ≡ Родитель ∙ 296[2] ←
  1507728[656080920]                   Начало многострочного комментария • ----  29.07.2016 ←
 30867470[656084349]                   IF ←
  1638463[656085336]                     Условие ←
      116[656084966]                       Выражение ←
      404[656116591]                         Результат ≡ <<Документ>> ∙ 367[5] ←
      411[656093426]                           Уточняющий параметр ≡ UID типа ∙ 249[2621444] ←
  1638473[656085967]                         Равно ←
      404[656119186]                         Результат ≡ Заказ товаров поставщику [магазин] ∙ 332[28836002] ←
      413[656084415]                       И ←
      116[656084967]                       Выражение ←
      404[656119187]                         Результат ≡ <<Документ>> ∙ 367[5] ←
      411[656093427]                           Уточняющий параметр ≡ Родитель ∙ 331[2] ←
      411[656093428]                             Уточняющий параметр ≡ UID типа ∙ 249[2621444] ←
  1638473[656085968]                         Равно ←
      404[656119188]                         Результат ≡ Сводный заказ товаров поставщику (ТТ) ∙ 332[656080908] ←
 30867472[656084338]                     THEN • если это заказ ребёнок сводного заказа ←
 11010099[656081524]                       CONTINUE ←
      116[656085638]                         Выражение ←
      404[656128057]                           Результат ≡ <<Пользователь>> ∙ 367[1] ←
      411[656093901]                             Уточняющий параметр ≡ Сотрудник ∙ 370[15859713] ←
  1638479[656082184]                           Не равно ←
      404[656128058]                           Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[656093898]                             Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[656093899]                               Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[656093900]                                 Уточняющий параметр ≡ Подразделение для продажи ∙ 296[15073281] ←
 30867470[656084358]                   IF ←
  1638463[656085337]                     Условие ←
      116[656084968]                       Выражение ←
      404[656119189]                         Результат ≡ <<Документ>> ∙ 367[5] ←
      411[656093429]                           Уточняющий параметр ≡ UID типа ∙ 249[2621444] ←
  1638479[656081953]                         Не равно ←
      404[656119943]                         Результат ≡ Заказ товаров поставщику [магазин] ∙ 332[28836002] ←
 30867472[656084347]                     THEN • любой другой заказ, не заказ тт поставщику ←
 11010099[656081389]                       CONTINUE ←
      116[656084970]                         Выражение ←
      404[656120001]                           Результат ≡ <<Пользователь>> ∙ 367[1] ←
      411[656093432]                             Уточняющий параметр ≡ Сотрудник ∙ 370[15859713] ←
  1638479[656081950]                           Не равно ←
      404[656120002]                           Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[656093433]                             Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[656093434]                               Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[656093435]                                 Уточняющий параметр ≡ Подразделение для продажи ∙ 296[15073281] ←
  1507729[656080920]                   Конец многострочного комментария ←
 30867470[655295004]               IF ←
  1638463[655295139]                 Условие ←
      404[655299891]                   Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655295874]                     Уточняющий параметр ≡ Требует обработки ∙ 359[2818057] ←
  1638473[655296966]                   Равно ←
      404[655307498]                   Результат ≡ Нет ∙ 131203075[131203073] ←
 30867472[655294996]                 THEN ←
 11010080[655302928]                   = ≡ Требует обработки ∙ 65545[655297757] ←
      404[655299972]                     Результат ≡ false ∙ 117[30867469] ←
 30867473[655294617]                 ELSE ←
 11010080[655302929]                   = ≡ Требует обработки ∙ 65545[655297757] ←
      404[655299973]                     Результат ≡ true ∙ 117[30867468] ←
 11010080[655303047]               = ≡ Наименование ∙ 65545[144447106] ←
      404[655308660]                 Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[655306734]                   Уточняющий параметр ≡ Наименование ∙ 305[6] ←
 11010080[655298634]               = ≡ Группа имя ∙ 65545[655296833] ←
      404[655308522]                 Результат ≡ <<Продукт>> ∙ 367[3] ←
      411[655306670]                   Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[655306713]                     Уточняющий параметр ≡ Родитель ∙ 296[2] ←
      411[655306732]                       Уточняющий параметр ≡ Наименование ∙ 296[6] ←
 11010092[655294783]               Добавить в локальную таблицу ≡ Строки ∙ 30867458[655294652] ←
 30867477[655294685]           Отбор данных из локальной таблицы ≡ Строки ∙ 30867458[655294652] ←
 30867484[655294506]             Выполнить перед обработкой блока ≡ Требует обработки ∙ 30867481[655294642] ←
 11010080[655296629]               = ≡ Цвет ∙ 65545[144447117] ←
      404[655299885]                 Результат ≡ Красный ∙ 30[917510] ←
  1507410[655295390]               ВЫПОЛНИТЬ БЛОК ≡ Обнулить переменные ∙ 30867469[655294754] ←
 30867470[655295010]               IF ←
  1638463[655295137]                 Условие ←
      404[655299890]                   Результат ≡ Требует обработки ∙ 65545[655297757] ←
 30867472[655295002]                 THEN ←
 11010080[655296628]                   = ≡ Наименование ∙ 65545[144447106] ←
      404[655299883]                     Результат ⁼ ТРЕБУЕТ ОБРАБОТКИ ←
 30867473[655296054]                 ELSE ←
 11010080[655296634]                   = ≡ Наименование ∙ 65545[144447106] ←
      404[655299974]                     Результат ⁼ НЕ ТРЕБУЕТ ОБРАБОТКИ ←
 11010088[655295178]               ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
  1507624[655294487]               ОТЛОЖИТЬ ВЫПОЛНЕНИЕ ←
 11010080[655296666]               = ≡ <<Строка>> ∙ 367[6] ←
      404[655299889]                 Результат ≡ Строка Ид темп ∙ 65545[164303217] ←
 30867484[655294619]             Выполнить перед обработкой блока ≡ Группа ∙ 30867481[655294622] ←
 11010080[655298635]               = ≡ Цвет ∙ 65545[144447117] ←
      404[655308636]                 Результат ≡ Черный ∙ 30[917505] ←
 11010080[655303014]               = ≡ Наименование ∙ 65545[144447106] ←
      404[655308637]                 Результат ≡ Группа имя ∙ 65545[655296833] ←
  1507410[655295391]               ВЫПОЛНИТЬ БЛОК ≡ Обнулить переменные ∙ 30867469[655294754] ←
 11010088[655296221]               ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
  1507728[164299442]               Начало многострочного комментария ←
  1507624[655294490]               ОТЛОЖИТЬ ВЫПОЛНЕНИЕ ←
  1507729[164299442]               Конец многострочного комментария ←
 11010080[655296630]               = ≡ <<Строка>> ∙ 367[6] ←
      404[655299886]                 Результат ≡ Строка Ид темп ∙ 65545[164303217] ←
 30867466[655295131]             Выполнить после получения записи ←
 30867469[165480178]               БЛОК • Получить данные по магазинам ←
 11010080[165488033]                 = ≡ Кол-во реал (предыдущие 7 дней) ∙ 65545[40375080] ←
      404[165502744]                   Результат ≡ ЛТ.Кол-во реализации (предыдущие 7 дней) ∙ 65545[165482875] ←
 11010080[165488034]                 = ≡ Кол-во реализованного ∙ 65545[144447107] ←
      404[165502745]                   Результат ≡ ЛТ.Кол-во реализованного ∙ 65545[165482876] ←
 11010080[165488035]                 = ≡ СП ∙ 65545[144447114] ←
      404[165502746]                   Результат ≡ ЛТ.СП ∙ 65545[165482877] ←
  1507410[655295220]               ВЫПОЛНИТЬ БЛОК ≡ ОТБОР ДАННЫХ : Расчет переменных ∙ 30867469[1508852] ←
  1507410[655295221]               ВЫПОЛНИТЬ БЛОК ≡ ОБЩИЙ : Расчет переменных ∙ 30867469[1508791] ←
 11010088[655295737]               ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
  1507728[164299410]               Начало многострочного комментария ←
  1507624[655294488]               ОТЛОЖИТЬ ВЫПОЛНЕНИЕ ←
  1507729[164299410]               Конец многострочного комментария ←
 30867473[655294776]         ELSE ←
 30867470[655295574]           IF ←
  1638463[655296558]             Условие ←
      116[655296003]               Выражение ←
      404[655308097]                 Результат ≡ Сортировка ∙ 65545[1510125] ←
  1638473[655297239]                 Равно ←
      404[655308096]                 Результат ≡ По коду ТТ ∙ 1507640[655294494] ←
      412[655294782]               ИЛИ ←
      116[655296005]               Выражение ←
      404[655308955]                 Результат ≡ Сортировка ∙ 65545[1510125] ←
  1638473[655297241]                 Равно ←
      404[655308956]                 Результат ≡ По Имени ТТ ∙ 1507640[655294495] ←
 30867472[655295568]             THEN ←
  1507360[655295118]               Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
  1507635[655294477]                 Быстрый показ первых записей ←
  1507447[165478924]                 Выражения ←
 48431290[165478452]                   Группа выражений • Суммы по детям ←
  1507449[165480187]                     Выражение • Кол-во реализации (предыдущие 7 дней) (дети) ≡ Количество ∙ 107[15] ←
 12124205[165479428]                       Запрос ←
  1507447[165478925]                         Выражения ←
  1507449[165480188]                           Выражение • Кол-во реализации (предыдущие 7 дней) (по магазину) ≡ Количество ∙ 107[15] ←
  1507608[165484151]                             Результат (Ноль (0.0), если NULL) ≡ Строки магазина ∙ 12124204[165479652] ←
  1507494[165486147]                               Уточняющий параметр ≡ Количество палет [док] ∙ 359[2818049] ←
  1507449[165480189]                           Выражение • Кол-во реализации (предыдущие 7 дней) ≡ Количество ∙ 107[15] ←
  1507455[165484152]                             Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[165478912]                               Значения параметров ←
  1507477[165479116]                                 Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[165479116]                                   Выражение ≡ Кол-во реализации (предыдущие 7 дней) (по магазину) ∙ 1507449[165480188] ←
 12124213[165479552]                         Параметры ←
  1507335[165481375]                           Параметр • Кол-во реализации (предыдущие 7 дней) ≡ Кол-во реализации (предыдущие 7 дней) ∙ 1507449[165480189] ←
 12124200[165479455]                         From         (Таблицы) ←
 12124204[165479652]                           Таблица • Строки магазина ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[165479580]                         Where      (Ограничения на отбор данных) ←
  1507376[165482810]                           Выражение ←
  1507455[165484195]                             Результат ≡ Строки магазина ∙ 12124204[165479652] ←
  1507494[165486184]                               Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[165482574]                             Равно ←
  1507455[165484196]                             Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165486185]                               Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507449[165480190]                     Выражение • Кол-во реализованного (дети) ≡ Количество ∙ 107[15] ←
 12124205[165479429]                       Запрос ←
  1507447[165478926]                         Выражения ←
  1507449[165480191]                           Выражение • Кол-во реализованного (по магазину) ≡ Количество ∙ 107[15] ←
  1507608[165484155]                             Результат (Ноль (0.0), если NULL) ≡ Строки магазина ∙ 12124204[165479653] ←
  1507494[165486150]                               Уточняющий параметр ≡ Количество последней поставки ∙ 359[15204356] ←
  1507449[165480192]                           Выражение • Кол-во реализованного ≡ Количество ∙ 107[15] ←
  1507455[165484156]                             Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[165478913]                               Значения параметров ←
  1507477[165479117]                                 Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[165479117]                                   Выражение ≡ Кол-во реализованного (по магазину) ∙ 1507449[165480191] ←
 12124213[165479553]                         Параметры ←
  1507335[165481376]                           Параметр • Кол-во реализованного ≡ Кол-во реализованного ∙ 1507449[165480192] ←
 12124200[165479456]                         From         (Таблицы) ←
 12124204[165479653]                           Таблица • Строки магазина ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[165479581]                         Where      (Ограничения на отбор данных) ←
  1507376[165482812]                           Выражение ←
  1507455[165484199]                             Результат ≡ Строки магазина ∙ 12124204[165479653] ←
  1507494[165486188]                               Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[165482576]                             Равно ←
  1507455[165484200]                             Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165486189]                               Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507449[165480193]                     Выражение • СП (дети) ≡ Количество ∙ 107[15] ←
 12124205[165479430]                       Запрос ←
  1507447[165478927]                         Выражения ←
  1507449[165480194]                           Выражение • СП (по магазину) ≡ Количество ∙ 107[15] ←
  1507608[165484159]                             Результат (Ноль (0.0), если NULL) ≡ Строки магазина ∙ 12124204[165479654] ←
  1507494[165486153]                               Уточняющий параметр ≡ Скорость реализации ∙ 359[15204355] ←
  1507449[165480195]                           Выражение • СП ≡ Количество ∙ 107[15] ←
  1507455[165484160]                             Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[165478914]                               Значения параметров ←
  1507477[165479118]                                 Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[165479118]                                   Выражение ≡ СП (по магазину) ∙ 1507449[165480194] ←
 12124213[165479554]                         Параметры ←
  1507335[165481377]                           Параметр • СП ≡ СП ∙ 1507449[165480195] ←
 12124200[165479457]                         From         (Таблицы) ←
 12124204[165479654]                           Таблица • Строки магазина ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[165479582]                         Where      (Ограничения на отбор данных) ←
  1507376[165482814]                           Выражение ←
  1507455[165484203]                             Результат ≡ Строки магазина ∙ 12124204[165479654] ←
  1507494[165486192]                               Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[165482578]                             Равно ←
  1507455[165484204]                             Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165486193]                               Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
 48431290[165478451]                   Группа выражений • Суммы по детям, если нет, то из строки ←
  1507449[165480219]                     Выражение • Кол-во реализации (предыдущие 7 дней) ≡ Количество ∙ 107[15] ←
  1507455[165484228]                       Результат ≡ NVL ∙ 1507471[48431117] ←
  1507476[165478929]                         Значения параметров ←
  1507477[165479142]                           Параметр ≡ Значение ∙ 1507473[48431126] ←
  1507478[165479142]                             Выражение ≡ Кол-во реализации (предыдущие 7 дней) (дети) ∙ 1507449[165480187] ←
  1507477[165479143]                           Параметр ≡ Значение если NULL ∙ 1507473[48431127] ←
  1507478[165479143]                             Выражение ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165486217]                               Уточняющий параметр ≡ Количество палет [док] ∙ 359[2818049] ←
  1507449[165480220]                     Выражение • Кол-во реализованного ≡ Количество ∙ 107[15] ←
  1507455[165484229]                       Результат ≡ NVL ∙ 1507471[48431117] ←
  1507476[165478930]                         Значения параметров ←
  1507477[165479144]                           Параметр ≡ Значение ∙ 1507473[48431126] ←
  1507478[165479144]                             Выражение ≡ Кол-во реализованного (дети) ∙ 1507449[165480190] ←
  1507477[165479145]                           Параметр ≡ Значение если NULL ∙ 1507473[48431127] ←
  1507478[165479145]                             Выражение ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165486218]                               Уточняющий параметр ≡ Количество последней поставки ∙ 359[15204356] ←
  1507449[165480221]                     Выражение • СП ≡ Количество ∙ 107[15] ←
  1507455[165484230]                       Результат ≡ NVL ∙ 1507471[48431117] ←
  1507476[165478931]                         Значения параметров ←
  1507477[165479146]                           Параметр ≡ Значение ∙ 1507473[48431126] ←
  1507478[165479146]                             Выражение ≡ СП (дети) ∙ 1507449[165480193] ←
  1507477[165479147]                           Параметр ≡ Значение если NULL ∙ 1507473[48431127] ←
  1507478[165479147]                             Выражение ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165486219]                               Уточняющий параметр ≡ Скорость реализации ∙ 359[15204355] ←
 12124213[165479555]                 Параметры ←
  1507380[165478430]                   <Наследуемые пункты> ←
  1507335[165481378]                   Параметр • Кол-во реализации (предыдущие 7 дней) ≡ Кол-во реализации (предыдущие 7 дней) ∙ 1507449[165480219] ←
  1507335[165481379]                   Параметр • Кол-во реализованного ≡ Кол-во реализованного ∙ 1507449[165480220] ←
  1507335[165481380]                   Параметр • СП ≡ СП ∙ 1507449[165480221] ←
 32505862[655296150]                 Значения формальных параметров при вызове ←
 32505860[655296217]                   Значение параметра при вызове процедуры/функции ≡ Требуется сортировка по полям продукта ∙ 65545[1510319] ←
   327700[655297501]                     Выражение ≡ Требуется сортировка по полям продукта ∙ 117[1507986] ←
 32505860[655296218]                   Значение параметра при вызове процедуры/функции ≡ Требуется сортировка по наименованию продукта ∙ 65545[1518029] ←
   327700[655297502]                     Выражение ≡ Требуется сортировка по наименованию продукта ∙ 117[1510089] ←
 32505860[655296219]                   Значение параметра при вызове процедуры/функции ≡ Требуется сортировка по коду продукта ∙ 65545[1518030] ←
   327700[655297503]                     Выражение ≡ Требуется сортировка по коду продукта ∙ 117[1510090] ←
 32505860[655296220]                   Значение параметра при вызове процедуры/функции ≡ Требуется сортировка по артикулу продукта ∙ 65545[48431341] ←
   327700[655297504]                     Выражение ≡ Требуется сортировка по артикулу продукта ∙ 117[48431137] ←
 32505860[655296221]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Строки ∙ 65545[1510098] ←
   327700[655297505]                     Выражение ≡ Фильтр.Список UID-ов ∙ 65545[1510139] ←
 32505860[164835222]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510266] ←
   327700[164840919]                     Выражение ≡ Фильтр.Родитель ∙ 65545[1510252] ←
 32505860[655296223]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Классы ∙ 65545[1510099] ←
   327700[655297507]                     Выражение ≡ Фильтр.Список классов ∙ 65545[1510121] ←
 32505860[655296224]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[1510100] ←
   327700[655297509]                     Выражение ≡ ~Тип строки ∙ 65545[144447287] ←
 32505860[655296225]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата начальная ∙ 65545[1510103] ←
   327700[655297787]                     Выражение ≡ Фильтр.  Дата начальная ∙ 65545[1510147] ←
 32505860[655296226]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата конечная ∙ 65545[1510104] ←
   327700[655297788]                     Выражение ≡ Фильтр.  Дата конечная ∙ 65545[1510148] ←
 32505860[655296578]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[655298133]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[655296579]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документ.Список классов ∙ 65545[1510109] ←
   327700[655298243]                     Выражение ≡ Фильтр.Документ.Список классов ∙ 65545[1510143] ←
 32505860[655296580]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документ.Список типов ∙ 65545[1510110] ←
   327700[655298244]                     Выражение ≡ Фильтр.Документ.Список типов ∙ 65545[1510144] ←
 12124200[655294747]                 From         (Таблицы) ←
  1507377[655294487]                   <Наследуемые пункты> ←
 12124204[655294834]                   Таблица • ТТ ≡ Партнер ∙ 108[4] ←
 12124222[655294553]                 Order By   (Сортировка) ←
  1507464[656081017]                   Сортировать по возрастанию ≡ ТТ ∙ 12124204[655294834] ←
  1507494[656086782]                     Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
  1507506[656082468]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[656082552]                       Если истинно выражение ≡ По возрастанию : Если по коду ТТ ∙ 117[656082394] ←
  1507532[656081043]                   Сортировать по убыванию ≡ ТТ ∙ 12124204[655294834] ←
  1507494[656086783]                     Уточняющий параметр ≡ Внешний код ∙ 283[15073296] ←
  1507506[656082472]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[656082556]                       Если истинно выражение ≡ По убыванию : Если по коду ТТ ∙ 117[656082395] ←
  1507464[655294565]                   Сортировать по возрастанию ≡ ТТ ∙ 12124204[655294834] ←
  1507506[655294927]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[655295047]                       Если истинно выражение ≡ Сортировать по имени ТТ ∙ 117[655294770] ←
  1507494[655296833]                     Уточняющий параметр ≡ Наименование ∙ 283[5] ←
 12124215[655295011]                 Where      (Ограничения на отбор данных) ←
  1507381[655294697]                   <Наследуемые ограничения> ←
  1507376[655296175]                   Выражение ←
  1507455[655296289]                     Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[655296784]                       Уточняющий параметр ≡ Партнер ∙ 359[9] ←
  1638473[655297240]                     Равно ←
  1507455[655296494]                     Результат ≡ ТТ ∙ 12124204[655294834] ←
  1507494[655296785]                       Уточняющий параметр ≡ Партнер ∙ 283[1] ←
 30867466[655294960]                 Выполнить после получения записи ←
 11010080[655298715]                   = ≡ <<Строка>> ∙ 367[6] ←
      404[655308661]                     Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 11010080[655298888]                   = ≡ <<Продукт>> ∙ 367[3] ←
      404[655308945]                     Результат ≡ Строка.Продукт ∙ 1507335[1508517] ←
 30867469[165480180]                   БЛОК • Получить данные по магазинам ←
 11010080[165488036]                     = ≡ Кол-во реал (предыдущие 7 дней) ∙ 65545[40375080] ←
      404[165502747]                       Результат ≡ Кол-во реализации (предыдущие 7 дней) ∙ 1507335[165481378] ←
 11010080[165488037]                     = ≡ Кол-во реализованного ∙ 65545[144447107] ←
      404[165502748]                       Результат ≡ Кол-во реализованного ∙ 1507335[165481379] ←
 11010080[165488038]                     = ≡ СП ∙ 65545[144447114] ←
      404[165502749]                       Результат ≡ СП ∙ 1507335[165481380] ←
  1507410[655294930]                   ВЫПОЛНИТЬ БЛОК ≡ ОТБОР ДАННЫХ : Расчет переменных ∙ 30867469[1508852] ←
  1507410[655295012]                   ВЫПОЛНИТЬ БЛОК ≡ ОБЩИЙ : Расчет переменных ∙ 30867469[1508791] ←
 11010088[655296673]                   ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
  1507728[655294556]                   Начало многострочного комментария ←
  1507624[655294475]                   ОТЛОЖИТЬ ВЫПОЛНЕНИЕ ←
  1507729[655294557]                   Конец многострочного комментария ←
 30867473[655294775]             ELSE ←
  1507360[655295003]               Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
  1507635[655294470]                 Быстрый показ первых записей ←
 32505862[655295844]                 Значения формальных параметров при вызове ←
 32505860[655297541]                   Значение параметра при вызове процедуры/функции ≡ Требуется сортировка по полям продукта ∙ 65545[1510319] ←
   327700[655299526]                     Выражение ≡ Требуется сортировка по полям продукта ∙ 117[1507986] ←
 32505860[655297542]                   Значение параметра при вызове процедуры/функции ≡ Требуется сортировка по наименованию продукта ∙ 65545[1518029] ←
   327700[655299527]                     Выражение ≡ Требуется сортировка по наименованию продукта ∙ 117[1510089] ←
 32505860[655297543]                   Значение параметра при вызове процедуры/функции ≡ Требуется сортировка по коду продукта ∙ 65545[1518030] ←
   327700[655299528]                     Выражение ≡ Требуется сортировка по коду продукта ∙ 117[1510090] ←
 32505860[655297544]                   Значение параметра при вызове процедуры/функции ≡ Требуется сортировка по артикулу продукта ∙ 65545[48431341] ←
   327700[655299529]                     Выражение ≡ Требуется сортировка по артикулу продукта ∙ 117[48431137] ←
 32505860[655297545]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Строки ∙ 65545[1510098] ←
   327700[655299530]                     Выражение ≡ Фильтр.Список UID-ов ∙ 65545[1510139] ←
 32505860[164835224]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510266] ←
   327700[164840921]                     Выражение ≡ Фильтр.Родитель ∙ 65545[1510252] ←
 32505860[655297547]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Классы ∙ 65545[1510099] ←
   327700[655299532]                     Выражение ≡ Фильтр.Список классов ∙ 65545[1510121] ←
 32505860[655297548]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[1510100] ←
   327700[655299533]                     Выражение ≡ ~Тип строки ∙ 65545[144447287] ←
 32505860[655297549]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата начальная ∙ 65545[1510103] ←
   327700[655299534]                     Выражение ≡ Фильтр.  Дата начальная ∙ 65545[1510147] ←
 32505860[655297550]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Дата конечная ∙ 65545[1510104] ←
   327700[655299535]                     Выражение ≡ Фильтр.  Дата конечная ∙ 65545[1510148] ←
 32505860[655297551]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[655299536]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[655297552]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документ.Список классов ∙ 65545[1510109] ←
   327700[655299537]                     Выражение ≡ Фильтр.Документ.Список классов ∙ 65545[1510143] ←
 32505860[655297553]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документ.Список типов ∙ 65545[1510110] ←
   327700[655299538]                     Выражение ≡ Фильтр.Документ.Список типов ∙ 65545[1510144] ←
 32505860[655297554]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Подразделение документа ∙ 65545[1510101] ←
   327700[655299539]                     Выражение ≡ Фильтр.  Подразделение документа ∙ 65545[1510145] ←
 32505860[655297555]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Контрагент документа ∙ 65545[1510102] ←
   327700[655299540]                     Выражение ≡ Фильтр.  Контрагент документа ∙ 65545[1510146] ←
 32505860[655297556]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документ.Дата начальная ∙ 65545[48432261] ←
   327700[655299541]                     Выражение ≡ Фильтр.Документ. Дата начальная ∙ 65545[48432263] ←
 32505860[655297557]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Документ.Дата конечная ∙ 65545[48432262] ←
   327700[655299542]                     Выражение ≡ Фильтр.Документ. Дата конечная ∙ 65545[48432264] ←
 32505860[655297558]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт ∙ 65545[1510111] ←
   327700[655299543]                     Выражение ≡ Фильтр.UID продукта ∙ 65545[1510152] ←
 32505860[655297559]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Список классов ∙ 65545[1510112] ←
   327700[655299544]                     Выражение ≡ Фильтр.Продукт.Список классов ∙ 65545[1510153] ←
 32505860[655297560]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Список типов ∙ 65545[1510113] ←
   327700[655299545]                     Выражение ≡ Фильтр.Продукт.Список типов ∙ 65545[1510154] ←
 32505860[655297561]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Список групп/категорий ∙ 65545[1510117] ←
   327700[655299546]                     Выражение ≡ Фильтр.Список групп/категорий продукта ∙ 65545[1510158] ←
 32505860[655297562]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Подгруппа ∙ 65545[1510118] ←
   327700[655299547]                     Выражение ≡ Фильтр.Подгруппа продукта ∙ 65545[1510159] ←
 32505860[655297563]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Изготовитель ∙ 65545[48432573] ←
   327700[655299548]                     Выражение ≡ Фильтр.Изготовитель продукта ∙ 65545[48432571] ←
 32505860[655297564]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Поставщик базового продукта ∙ 65545[48432653] ←
   327700[655299549]                     Выражение ≡ Фильтр.Поставщик базового продукта ∙ 65545[48432652] ←
 32505860[655297565]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Наименование (вхождение) ∙ 65545[1515475] ←
   327700[655299550]                     Выражение ≡ Фильтр.Продукт.Наименование (вхождение) ∙ 65545[1515477] ←
 32505860[655297566]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Код (вхождение) ∙ 65545[1515476] ←
   327700[655299551]                     Выражение ≡ Фильтр.Продукт.Код (вхождение) ∙ 65545[1515478] ←
 32505860[655297567]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Продукт.Артикул (вхождение) ∙ 65545[48432109] ←
   327700[655299552]                     Выражение ≡ Фильтр.Продукт.Артикул (вхождение) ∙ 65545[48432110] ←
 32505860[655297568]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Только акцептованные строки {Нет} ∙ 65545[1510169] ←
   327700[655299553]                     Выражение ≡ Фильтр.Только акцептованные ∙ 65545[1510168] ←
  1507447[165478928]                 Выражения ←
 48431290[165478454]                   Группа выражений • Суммы по детям ←
  1507449[165480196]                     Выражение • Кол-во реализации (предыдущие 7 дней) (дети) ≡ Количество ∙ 107[15] ←
 12124205[165479431]                       Запрос ←
  1507447[165478929]                         Выражения ←
  1507449[165480197]                           Выражение • Кол-во реализации (предыдущие 7 дней) (по магазину) ≡ Количество ∙ 107[15] ←
  1507608[165484163]                             Результат (Ноль (0.0), если NULL) ≡ Строки магазина ∙ 12124204[165479655] ←
  1507494[165486156]                               Уточняющий параметр ≡ Количество палет [док] ∙ 359[2818049] ←
  1507449[165480198]                           Выражение • Кол-во реализации (предыдущие 7 дней) ≡ Количество ∙ 107[15] ←
  1507455[165484164]                             Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[165478915]                               Значения параметров ←
  1507477[165479119]                                 Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[165479119]                                   Выражение ≡ Кол-во реализации (предыдущие 7 дней) (по магазину) ∙ 1507449[165480197] ←
 12124213[165479556]                         Параметры ←
  1507335[165481381]                           Параметр • Кол-во реализации (предыдущие 7 дней) ≡ Кол-во реализации (предыдущие 7 дней) ∙ 1507449[165480198] ←
 12124200[165479458]                         From         (Таблицы) ←
 12124204[165479655]                           Таблица • Строки магазина ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[165479583]                         Where      (Ограничения на отбор данных) ←
  1507376[165482816]                           Выражение ←
  1507455[165484207]                             Результат ≡ Строки магазина ∙ 12124204[165479655] ←
  1507494[165486196]                               Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[165482580]                             Равно ←
  1507455[165484208]                             Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165486197]                               Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507449[165480199]                     Выражение • Кол-во реализованного (дети) ≡ Количество ∙ 107[15] ←
 12124205[165479432]                       Запрос ←
  1507447[165478930]                         Выражения ←
  1507449[165480200]                           Выражение • Кол-во реализованного (по магазину) ≡ Количество ∙ 107[15] ←
  1507608[165484167]                             Результат (Ноль (0.0), если NULL) ≡ Строки магазина ∙ 12124204[165479656] ←
  1507494[165486159]                               Уточняющий параметр ≡ Количество последней поставки ∙ 359[15204356] ←
  1507449[165480201]                           Выражение • Кол-во реализованного ≡ Количество ∙ 107[15] ←
  1507455[165484168]                             Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[165478916]                               Значения параметров ←
  1507477[165479120]                                 Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[165479120]                                   Выражение ≡ Кол-во реализованного (по магазину) ∙ 1507449[165480200] ←
 12124213[165479557]                         Параметры ←
  1507335[165481382]                           Параметр • Кол-во реализованного ≡ Кол-во реализованного ∙ 1507449[165480201] ←
 12124200[165479459]                         From         (Таблицы) ←
 12124204[165479656]                           Таблица • Строки магазина ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[165479584]                         Where      (Ограничения на отбор данных) ←
  1507376[165482818]                           Выражение ←
  1507455[165484211]                             Результат ≡ Строки магазина ∙ 12124204[165479656] ←
  1507494[165486200]                               Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[165482582]                             Равно ←
  1507455[165484212]                             Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165486201]                               Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507449[165480202]                     Выражение • СП (дети) ≡ Количество ∙ 107[15] ←
 12124205[165479433]                       Запрос ←
  1507447[165478931]                         Выражения ←
  1507449[165480203]                           Выражение • СП (по магазину) ≡ Количество ∙ 107[15] ←
  1507608[165484171]                             Результат (Ноль (0.0), если NULL) ≡ Строки магазина ∙ 12124204[165479657] ←
  1507494[165486162]                               Уточняющий параметр ≡ Скорость реализации ∙ 359[15204355] ←
  1507449[165480204]                           Выражение • СП ≡ Количество ∙ 107[15] ←
  1507455[165484172]                             Результат ≡ SUM ∙ 1507471[1507329] ←
  1507476[165478917]                               Значения параметров ←
  1507477[165479121]                                 Параметр ≡ Выражение ∙ 1507473[1507329] ←
  1507478[165479121]                                   Выражение ≡ СП (по магазину) ∙ 1507449[165480203] ←
 12124213[165479558]                         Параметры ←
  1507335[165481383]                           Параметр • СП ≡ СП ∙ 1507449[165480204] ←
 12124200[165479460]                         From         (Таблицы) ←
 12124204[165479657]                           Таблица • Строки магазина ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[165479585]                         Where      (Ограничения на отбор данных) ←
  1507376[165482820]                           Выражение ←
  1507455[165484215]                             Результат ≡ Строки магазина ∙ 12124204[165479657] ←
  1507494[165486204]                               Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[165482584]                             Равно ←
  1507455[165484216]                             Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165486205]                               Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
 48431290[165478453]                   Группа выражений • Суммы по детям, если нет, то из строки ←
  1507449[165480222]                     Выражение • Кол-во реализации (предыдущие 7 дней) ≡ Количество ∙ 107[15] ←
  1507455[165484231]                       Результат ≡ NVL ∙ 1507471[48431117] ←
  1507476[165478932]                         Значения параметров ←
  1507477[165479148]                           Параметр ≡ Значение ∙ 1507473[48431126] ←
  1507478[165479148]                             Выражение ≡ Кол-во реализации (предыдущие 7 дней) (дети) ∙ 1507449[165480196] ←
  1507477[165479149]                           Параметр ≡ Значение если NULL ∙ 1507473[48431127] ←
  1507478[165479149]                             Выражение ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165486221]                               Уточняющий параметр ≡ Количество палет [док] ∙ 359[2818049] ←
  1507449[165480223]                     Выражение • Кол-во реализованного ≡ Количество ∙ 107[15] ←
  1507455[165484232]                       Результат ≡ NVL ∙ 1507471[48431117] ←
  1507476[165478933]                         Значения параметров ←
  1507477[165479150]                           Параметр ≡ Значение ∙ 1507473[48431126] ←
  1507478[165479150]                             Выражение ≡ Кол-во реализованного (дети) ∙ 1507449[165480199] ←
  1507477[165479151]                           Параметр ≡ Значение если NULL ∙ 1507473[48431127] ←
  1507478[165479151]                             Выражение ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165486222]                               Уточняющий параметр ≡ Количество последней поставки ∙ 359[15204356] ←
  1507449[165480224]                     Выражение • СП ≡ Количество ∙ 107[15] ←
  1507455[165484233]                       Результат ≡ NVL ∙ 1507471[48431117] ←
  1507476[165478934]                         Значения параметров ←
  1507477[165479152]                           Параметр ≡ Значение ∙ 1507473[48431126] ←
  1507478[165479152]                             Выражение ≡ СП (дети) ∙ 1507449[165480202] ←
  1507477[165479153]                           Параметр ≡ Значение если NULL ∙ 1507473[48431127] ←
  1507478[165479153]                             Выражение ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[165486223]                               Уточняющий параметр ≡ Скорость реализации ∙ 359[15204355] ←
 12124213[165479559]                 Параметры ←
  1507380[165478431]                   <Наследуемые пункты> ←
  1507335[165481384]                   Параметр • Кол-во реализации (предыдущие 7 дней) ≡ Кол-во реализации (предыдущие 7 дней) ∙ 1507449[165480222] ←
  1507335[165481385]                   Параметр • Кол-во реализованного ≡ Кол-во реализованного ∙ 1507449[165480223] ←
  1507335[165481386]                   Параметр • СП ≡ СП ∙ 1507449[165480224] ←
 12124200[656081470]                 From         (Таблицы) ←
  1507377[656080934]                   <Наследуемые пункты> ←
 12124204[656081767]                   Таблица ≡ Партнер ∙ 108[4] ←
  1507506[656082469]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[656082553]                       Если истинно выражение ≡ Сортировать по коду ТТ ∙ 117[655294557] ←
 12124215[656081933]                 Where      (Ограничения на отбор данных) ←
  1507381[656081372]                   <Наследуемые ограничения> ←
  1507376[656085026]                   Выражение ←
  1507506[656082471]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[656082555]                       Если истинно выражение ≡ Сортировать по коду ТТ ∙ 117[655294557] ←
  1507376[656085027]                     Выражение ←
  1507455[656085404]                       Результат ∙ 12124204[656081767] ←
  1507494[656086780]                         Уточняющий параметр ≡ Партнер ∙ 283[1] ←
  1638473[656086576]                       Равно ←
  1507455[656085405]                       Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[656086781]                         Уточняющий параметр ≡ Партнер ∙ 359[9] ←
 12124222[655294482]                 Order By   (Сортировка) ←
  1507464[655294465]                   Сортировать по возрастанию ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[655297283]                     Уточняющий параметр ≡ Дата строки ∙ 359[6] ←
  1507506[655294782]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[655294879]                       Если истинно выражение ≡ По возрастанию : Если по дате ∙ 117[1507897] ←
  1507464[655294478]                   Сортировать по возрастанию ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[655297284]                     Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507506[655294783]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[655294880]                       Если истинно выражение ≡ По возрастанию : Если по UID ∙ 117[1510051] ←
  1507464[655294479]                   Сортировать по возрастанию ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[655297285]                     Уточняющий параметр ≡ Номер чека ∙ 359[15073301] ←
  1507506[655294784]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[655294881]                       Если истинно выражение ≡ По возрастанию : Если по номеру строки в накладной поставщика ∙ 117[48432246] ←
  1507464[655294481]                   Сортировать по возрастанию ≡ ПРОДУКТЫ ∙ 12124204[1507787] ←
  1507494[655297287]                     Уточняющий параметр ≡ Линейка ∙ 305[55508997] ←
  1507506[655294788]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[655294885]                       Если истинно выражение ≡ По возрастанию : Если по линейке продукта ∙ 117[48432274] ←
  1507464[655294482]                   Сортировать по возрастанию ≡ ПРОДУКТЫ ∙ 12124204[1507787] ←
  1507494[655297288]                     Уточняющий параметр ≡ Наименование ∙ 305[6] ←
  1507506[655294789]                     Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[11599877] ←
  1507508[655294886]                       Если истинно выражение ≡ По возрастанию : Если по наименованию продукта ∙ 117[1507987] ←
  1507508[655294887]                       Если истинно выражение ≡ По возрастанию : Если по группе продукта ∙ 117[48432273] ←
  1507508[655294888]                       Если истинно выражение ≡ По возрастанию : Если по линейке продукта ∙ 117[48432274] ←
  1507464[655294483]                   Сортировать по возрастанию ≡ ПРОДУКТЫ ∙ 12124204[1507787] ←
  1507494[655297289]                     Уточняющий параметр ≡ Код ∙ 305[5] ←
  1507506[655294790]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[655294889]                       Если истинно выражение ≡ По возрастанию : Если по коду продукта ∙ 117[1510086] ←
  1507464[655294484]                   Сортировать по возрастанию ≡ ПРОДУКТЫ ∙ 12124204[1507787] ←
  1507494[655297290]                     Уточняющий параметр ≡ Артикул ∙ 305[7] ←
  1507506[655294791]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[655294890]                       Если истинно выражение ≡ По возрастанию : Если по артикулу продукта ∙ 117[48431138] ←
  1507464[655294485]                   Сортировать по возрастанию ≡ ПРОДУКТЫ ∙ 12124204[1507787] ←
  1507494[655297291]                     Уточняющий параметр ≡ Изготовитель ∙ 305[12] ←
  1507506[655294792]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[655294891]                       Если истинно выражение ≡ По возрастанию : Если по изготовителю продукта ∙ 117[48431601] ←
  1507464[655294486]                   Сортировать по возрастанию ≡ ПРОДУКТЫ ∙ 12124204[1507787] ←
  1507494[655297292]                     Уточняющий параметр ≡ Торговая марка ∙ 305[2818049] ←
  1507506[655294793]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[655294892]                       Если истинно выражение ≡ По возрастанию : Если по торговой марке продукта ∙ 117[48431602] ←
  1507464[656081016]                   Сортировать по возрастанию ∙ 12124204[656081767] ←
  1507494[656086778]                     Уточняющий параметр ≡ Код ∙ 283[6] ←
  1507506[656082466]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[656082550]                       Если истинно выражение ≡ По возрастанию : Если по коду ТТ ∙ 117[656082394] ←
  1507532[655294473]                   Сортировать по убыванию ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[655297293]                     Уточняющий параметр ≡ Дата строки ∙ 359[6] ←
  1507506[655294794]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[655294893]                       Если истинно выражение ≡ По убыванию : Если по дате ∙ 117[1507903] ←
  1507532[655294474]                   Сортировать по убыванию ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[655297294]                     Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507506[655294795]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[655294894]                       Если истинно выражение ≡ По убыванию : Если по UID ∙ 117[1510052] ←
  1507532[655294475]                   Сортировать по убыванию ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[655297295]                     Уточняющий параметр ≡ Номер чека ∙ 359[15073301] ←
  1507506[655294796]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[655294895]                       Если истинно выражение ≡ По убыванию : Если по номеру строки в накладной поставщика ∙ 117[48432247] ←
  1507532[655294477]                   Сортировать по убыванию ≡ ПРОДУКТЫ ∙ 12124204[1507787] ←
  1507494[655297297]                     Уточняющий параметр ≡ Линейка ∙ 305[55508997] ←
  1507506[655294798]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[655294897]                       Если истинно выражение ≡ По убыванию : Если по линейке продукта ∙ 117[48432276] ←
  1507532[655294478]                   Сортировать по убыванию ≡ ПРОДУКТЫ ∙ 12124204[1507787] ←
  1507494[655297298]                     Уточняющий параметр ≡ Наименование ∙ 305[6] ←
  1507506[655294799]                     Использование (в режиме выполнения) ≡ Да, если какое-либо условие соблюдено ∙ 534[11599877] ←
  1507508[655294898]                       Если истинно выражение ≡ По убыванию : Если по наименованию продукта ∙ 117[1507988] ←
  1507508[655294899]                       Если истинно выражение ≡ По убыванию : Если по группе продукта ∙ 117[48432275] ←
  1507508[655294900]                       Если истинно выражение ≡ По убыванию : Если по линейке продукта ∙ 117[48432276] ←
  1507532[655294479]                   Сортировать по убыванию ≡ ПРОДУКТЫ ∙ 12124204[1507787] ←
  1507494[655297299]                     Уточняющий параметр ≡ Код ∙ 305[5] ←
  1507506[655294800]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[655294901]                       Если истинно выражение ≡ По убыванию : Если по коду продукта ∙ 117[1510087] ←
  1507532[655294480]                   Сортировать по убыванию ≡ ПРОДУКТЫ ∙ 12124204[1507787] ←
  1507494[655297300]                     Уточняющий параметр ≡ Артикул ∙ 305[7] ←
  1507506[655294801]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[655294902]                       Если истинно выражение ≡ По убыванию : Если по артикулу продукта ∙ 117[48431139] ←
  1507532[655294481]                   Сортировать по убыванию ≡ ПРОДУКТЫ ∙ 12124204[1507787] ←
  1507494[655297301]                     Уточняющий параметр ≡ Изготовитель ∙ 305[12] ←
  1507506[655294802]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[655294903]                       Если истинно выражение ≡ По убыванию : Если по изготовителю продукта ∙ 117[48431603] ←
  1507532[655294482]                   Сортировать по убыванию ≡ ПРОДУКТЫ ∙ 12124204[1507787] ←
  1507494[655297302]                     Уточняющий параметр ≡ Торговая марка ∙ 305[2818049] ←
  1507506[655294803]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[655294904]                       Если истинно выражение ≡ По убыванию : Если по торговой марке продукта ∙ 117[48431604] ←
  1507532[656081042]                   Сортировать по убыванию ∙ 12124204[656081767] ←
  1507494[656086779]                     Уточняющий параметр ≡ Код ∙ 283[6] ←
  1507506[656082467]                     Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[11599876] ←
  1507508[656082551]                       Если истинно выражение ≡ По убыванию : Если по коду ТТ ∙ 117[656082395] ←
 30867466[655295198]                 Выполнить после получения записи ←
 11010080[655299225]                   = ≡ <<Строка>> ∙ 367[6] ←
      404[655308853]                     Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 11010080[655299227]                   = ≡ <<Продукт>> ∙ 367[3] ←
      404[655308855]                     Результат ≡ Строка.Продукт ∙ 1507335[1508517] ←
 30867469[165480181]                   БЛОК • Получить данные по магазинам ←
 11010080[165488039]                     = ≡ Кол-во реал (предыдущие 7 дней) ∙ 65545[40375080] ←
      404[165502750]                       Результат ≡ Кол-во реализации (предыдущие 7 дней) ∙ 1507335[165481384] ←
 11010080[165488040]                     = ≡ Кол-во реализованного ∙ 65545[144447107] ←
      404[165502751]                       Результат ≡ Кол-во реализованного ∙ 1507335[165481385] ←
 11010080[165488041]                     = ≡ СП ∙ 65545[144447114] ←
      404[165502752]                       Результат ≡ СП ∙ 1507335[165481386] ←
  1507410[655294943]                   ВЫПОЛНИТЬ БЛОК ≡ ОТБОР ДАННЫХ : Расчет переменных ∙ 30867469[1508852] ←
  1507410[655294944]                   ВЫПОЛНИТЬ БЛОК ≡ ОБЩИЙ : Расчет переменных ∙ 30867469[1508791] ←
 11010088[655296262]                   ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
  1507728[164299441]                   Начало многострочного комментария ←
  1507624[655294468]                   ОТЛОЖИТЬ ВЫПОЛНЕНИЕ ←
  1507729[164299441]                   Конец многострочного комментария ←
  1507714[164298753]     Список не сохраняемых переменных ←
  1507716[164298753]       Переменная ≡ Общий вес ∙ 65545[164299533] ←
  1507716[164364402]       Переменная ≡ Общее количество паллет ∙ 65545[164372408] ←
  1507618[144441351]     Обработка команд ←
 11010079[144441411]       CASE ←
  1572877[144441551]         Условие ←
      404[144465803]           Результат ≡ Список данных.Команда ∙ 387[1507439] ←
 11010081[655294680]         OF ≡ Ввод в ячейку ∙ 102[53308] ←
 30867470[655296189]           IF ←
  1638463[655296636]             Условие ←
      404[655308859]               Результат ≡ Права на редактирование строки (true - только для просмотра) ∙ 117[655294728] ←
  1638473[655297223]               Равно ←
      404[655308860]               Результат ⁼ 1 ←
 30867472[655296180]             THEN ←
 39780366[655295217]               RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ТЕКУЩЕЙ СТРОКИ СПИСКА ∙ 102[53262] ←
 11010099[655294578]               CONTINUE ←
 11010093[164888715]           Комментарий • Для корректного округления дочерних строк сводного закза инициализируем переменную ←
 30867470[164889877]           IF ←
  1638463[164890323]             Условие ←
  1638460[164889494]               НЕ ←
      404[164903005]               Результат ≡ ЦО ∙ 65545[58392759] ←
 30867472[164889872]             THEN • берем из строки или документа ←
 11010080[164892586]               = ≡ ЦО ∙ 65545[58392759] ←
      404[164903001]                 Результат ≡ Вернуть ЦО по ТТ, ТЗ, текущему узлу ∙ 249[164364421] ←
 32505862[164890246]                   Значения формальных параметров при вызове ←
 32505860[164892053]                     Значение параметра при вызове процедуры/функции ≡ ~Подразделение ∙ 65545[164370944] ←
   327700[164893419]                       Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164889018]                         Выполнить действия ←
 39780366[164889276]                           RETURN ←
  1638461[164888943]                             Условный оператор (IF) ←
  1638463[164890322]                               Условие ←
      404[164903002]                                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164892896]                                   Уточняющий параметр ≡ Партнер ∙ 359[9] ←
      105[164888945]                               То ←
      404[164903003]                                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164892897]                                   Уточняющий параметр ≡ Партнер ∙ 359[9] ←
      424[164888816]                               Иначе ←
      404[164903004]                                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164892898]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164892899]                                     Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
 30867470[655296190]           IF ←
  1638463[655296637]             Условие ←
      404[655308861]               Результат ≡ <<Строка>> ∙ 367[6] ←
       413[58523678]               И ←
       116[58523806]               Выражение ←
       404[58524809]                 Результат ≡ ПРАВА ОБЪЕКТА (объект - параметр функции) ∙ 387[2359297] ←
   2359325[58523656]                   Роль ≡ Разрешено корректировать заказ ∙ 233[655294487] ←
       412[58523683]                 ИЛИ ←
       116[58523694]                 Выражение ←
       404[58524052]                   Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58523832]                     Уточняющий параметр ≡ Состояние строки ∙ 359[11] ←
   1638473[58523706]                   Равно ←
       404[58524053]                   Результат ⁼ 0 ←
 30867472[655296181]             THEN ←
 11010080[655299231]               = ≡ <<Продукт>> ∙ 367[3] ←
      404[655308873]                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655300237]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 30867470[164825339]               IF ←
  1638463[164825838]                 Условие ←
      404[164850085]                   Результат ≡ Номер машины ∙ 65545[164372611] ←
  1638478[164823248]                   Больше ←
      404[164850095]                   Результат ⁼ 0 ←
 30867472[164825301]                 THEN ←
 11010088[164825280]                   ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[164823124]                     Объект ≡ <<Строка>> ∙ 367[6] ←
      377[164823159]                     Начальные значения полей объекта ←
   131095[164823417]                       Начальное значение поля ≡ Наценка ∙ 359[15138829] ←
   327700[164825110]                         Выражение ≡ Номер машины ∙ 65545[164372611] ←
 30867470[164825344]               IF ←
  1638463[164825839]                 Условие ←
      404[164850094]                   Результат ≡ Номер машины ∙ 65545[164372611] ←
  1638473[164827370]                   Равно ←
      404[164850098]                   Результат ⁼ 0 ←
 30867472[164825306]                 THEN ←
 11010080[164824972]                   = ≡ Номер машины ∙ 65545[164372611] ←
      404[164850100]                     Результат ≡ NULL ∙ 117[30670850] ←
 11010088[164825281]                   ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[164823125]                     Объект ≡ <<Строка>> ∙ 367[6] ←
      377[164823160]                     Начальные значения полей объекта ←
   131095[164823418]                       Начальное значение поля ≡ Наценка ∙ 359[15138829] ←
   327700[164830482]                         Выражение ≡ Номер машины ∙ 65545[164372611] ←
  30867470[58392707]               IF ←
   1638463[58392738]                 Условие ←
      116[655296950]                   Выражение ←
   1638460[58523680]                     НЕ ←
       404[58523958]                     Результат ≡ Подсвечивать ∙ 65545[655299269] ←
      412[655294664]                   ИЛИ ←
      404[655314852]                   Результат ≡ ПРАВА ОБЪЕКТА (объект - параметр функции) ∙ 387[2359297] ←
  2359325[655294508]                     Роль ≡ Разрешено корректировать заказ ∙ 233[655294487] ←
       412[58392611]                   ИЛИ ←
      404[656124035]                   Результат ≡ Для ПЦ ∙ 65545[656090036] ←
  30867472[58392707]                 THEN • исправлять кол-во ←
  11010093[58392807]                   Комментарий • ----  проверка блокировки редактирования количества заказа ←
 11010080[164891408]                   = ≡ Минимальный заказ по документу ограничения ∙ 65545[164889938] ←
      404[164896104]                     Результат ≡ NULL ∙ 117[30670850] ←
 30867470[164889487]                   IF ←
  1638463[164889772]                     Условие ←
  1638460[164889199]                       НЕ ←
      404[656124034]                       Результат ≡ Для ПЦ ∙ 65545[656090036] ←
 30867472[164889483]                     THEN • не ПЦ, проверяем ←
  11010080[58393745]                       = ≡ Ограничение редактирования заказа ∙ 65545[58393133] ←
   1638464[58398356]                         Ноль (0.0), если NULL ≡ <<Продукт>> ∙ 367[3] ←
       411[58394745]                           Уточняющий параметр ≡ Блокировка редактирования количества заказа по товару ∙ 249[58392617] ←
  32505862[58393230]                             Значения формальных параметров при вызове ←
  32505860[58393994]                               Значение параметра при вызове процедуры/функции ≡ Заказ ∙ 65545[58393128] ←
    327700[58394785]                                 Выражение ≡ <<Документ>> ∙ 367[5] ←
  32505860[58393995]                               Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[58393121] ←
    327700[58394786]                                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
  32505860[58393996]                               Значение параметра при вызове процедуры/функции ≡ ЦО ∙ 65545[58393122] ←
    327700[58394787]                                 Выражение ≡ ЦО ∙ 65545[58392759] ←
  32505860[58394010]                               Значение параметра при вызове процедуры/функции ≡ Ограничение ∙ 65545[58393130] ←
    327700[58394799]                                 Выражение ≡ Ограничение редактирования заказа ∙ 65545[58393133] ←
  32505860[58394012]                               Значение параметра при вызове процедуры/функции ≡ Менеджер ∙ 65545[58393140] ←
    327700[58394803]                                 Выражение ≡ Менеджер блокировки ∙ 65545[58393141] ←
 32505860[164890454]                               Значение параметра при вызове процедуры/функции ≡ Минимальный заказ (вовзрат) ∙ 65545[164889937] ←
   327700[164891193]                                 Выражение ≡ Минимальный заказ по документу ограничения ∙ 65545[164889938] ←
  11010079[58392608]                       CASE ←
   1572877[58392631]                         Условие ←
       404[58398357]                           Результат ≡ Ограничение редактирования заказа ∙ 65545[58393133] ←
  11010081[58392680]                         OF • ограничение вверх и вниз ⁼ 1 ←
  30867470[58393070]                           IF ←
   1638463[58393354]                             Условие ←
       404[58398368]                               Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
   1638479[58392765]                               Не равно ←
       404[58398381]                               Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58394751]                                 Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
  30867472[58393066]                             THEN • введено больше чем автозаказ - запретить ←
  11010088[58393325]                               ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
  11010095[58392983]                                 Выражение ←
       404[58398358]                                   Результат ⁼ 'Существует блокировка редактирования количества заказа! (в обе стороны) Менеджер: ' ←
       404[58398398]                                   Результат ≡ Менеджер блокировки ∙ 65545[58393141] ←
       411[58394772]                                     Уточняющий параметр ≡  Фамилия И.О. ∙ 117[42401825] ←
  11010080[58393750]                               = ≡ Кол-во заказа ∙ 65545[144447112] ←
       404[58398382]                                 Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58394762]                                   Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
  11010081[58392681]                         OF • ограничение вверх ⁼ 2 ←
  30867470[58393063]                           IF ←
   1638463[58393346]                             Условие ←
       404[58398359]                               Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
   1638478[58392612]                               Больше ←
       404[58398360]                               Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58394747]                                 Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
  30867472[58393059]                             THEN • введено больше чем автозаказ - запретить ←
  11010088[58393326]                               ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
  11010095[58392984]                                 Выражение ←
       404[58398383]                                   Результат ⁼ 'Существует блокировка редактирования количества заказа! (на увеличение) Менеджер: ' ←
       404[58398399]                                   Результат ≡ Менеджер блокировки ∙ 65545[58393141] ←
       411[58394773]                                     Уточняющий параметр ≡  Фамилия И.О. ∙ 117[42401825] ←
  11010080[58393747]                               = ≡ Кол-во заказа ∙ 65545[144447112] ←
       404[58398361]                                 Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58394748]                                   Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
  11010081[58392682]                         OF • ограничение вниз ⁼ 3 ←
  30867470[58393064]                           IF ←
   1638463[58393348]                             Условие ←
       404[58398362]                               Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
   1638476[58392595]                               Меньше ←
       404[58398363]                               Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58394749]                                 Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
  30867472[58393060]                             THEN • введено меньше чем автозаказ - запретить ←
  11010088[58393327]                               ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
  11010095[58392985]                                 Выражение ←
       404[58398384]                                   Результат ⁼ 'Существует блокировка редактирования количества заказа! (на уменьшение) Менеджер: ' ←
       404[58398400]                                   Результат ≡ Менеджер блокировки ∙ 65545[58393141] ←
       411[58394774]                                     Уточняющий параметр ≡  Фамилия И.О. ∙ 117[42401825] ←
  11010080[58393748]                               = ≡ Кол-во заказа ∙ 65545[144447112] ←
       404[58398364]                                 Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58394750]                                   Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
 30867470[164889481]                       IF ←
  1638463[164889763]                         Условие ←
      404[164896080]                           Результат ≡ Минимальный заказ по документу ограничения ∙ 65545[164889938] ←
 30867472[164889477]                         THEN • проверим это значение ←
 30867470[164889482]                           IF ←
  1638463[164889764]                             Условие ←
      404[164896081]                               Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
  1638476[164888640]                               Меньше ←
      404[164896082]                               Результат ≡ Минимальный заказ по документу ограничения ∙ 65545[164889938] ←
 30867472[164889478]                             THEN • введено меньше минимально возможного ←
 11010088[164889291]                               ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
 11010095[164888951]                                 Выражение ←
      404[164896083]                                   Результат ⁼ 'Существует блокировка редактирования количества заказа! Менеджер: ' ←
      404[164896084]                                   Результат ≡ Менеджер блокировки ∙ 65545[58393141] ←
      411[164891855]                                     Уточняющий параметр ≡  Фамилия И.О. ∙ 117[42401825] ←
      404[164896088]                                   Результат ≡ CR+LF ∙ 117[1508547] ←
      404[164896086]                                   Результат ⁼ 'Нельзя заказать меньше ' ←
      404[164896087]                                   Результат ≡ Минимальный заказ по документу ограничения ∙ 65545[164889938] ←
 11010080[164891405]                               = ≡ Кол-во заказа ∙ 65545[144447112] ←
      404[164896085]                                 Результат ≡ Минимальный заказ по документу ограничения ∙ 65545[164889938] ←
 11010093[655294696]                   Комментарий • ----  ограничение из документа промо NEW ←
 30867469[655295818]                   БЛОК • Ограничение из строк ПРОМО документов ←
 39780361[656082466]                     ЗАВЕРШИТЬ БЛОК ←
      116[656086680]                       Выражение ←
      404[656129034]                         Результат ≡ Для ПЦ ∙ 65545[656090036] ←
 30867470[655294935]                     IF ←
  1638463[655295043]                       Условие ←
      404[655299185]                         Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655295879]                           Уточняющий параметр ≡ Алгоритм расчета шифра начислений ∙ 359[33619998] ←
      413[655295443]                         И ←
      116[655298338]                         Выражение ←
      404[655299226]                           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655309572]                             Уточняющий параметр ≡ Алгоритм расчета шифра начислений ∙ 359[33619998] ←
  1638479[655294711]                           Не равно ←
      404[655299228]                           Результат ≡ 100% ∙ 655294517[655294475] ←
      413[655295461]                         И ←
      116[655298340]                         Выражение ←
  1638460[655295070]                           НЕ ←
      404[655299235]                           Результат ≡ ПРАВА ОБЪЕКТА (объект - параметр функции) ∙ 387[2359297] ←
  2359325[655294470]                             Роль ≡ Разрешено корректировать заказ ∙ 233[655294487] ←
 30867472[655294927]                       THEN • если при формировании заказа был ПРОМО со значением процента корректировки, то в строке будет заполнено поле, делаем проверку ←
 30867470[655297925]                         IF ←
  1638463[655296429]                           Условие ←
      116[655296556]                             Выражение ←
      404[655299217]                               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655301945]                                 Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
      406[655295321]                               Вычесть ←
      404[655299218]                               Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
  1638478[655294473]                             Больше ←
      116[655297731]                             Выражение ←
      404[655299214]                               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655297738]                                 Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
      403[655295365]                               Умножить ←
      116[655298333]                               Выражение ←
      404[655299215]                                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655297739]                                   Уточняющий параметр ≡ Алгоритм расчета шифра начислений ∙ 359[33619998] ←
      411[655301943]                                     Уточняющий параметр ≡ Значение ∙ 249[262147] ←
      402[655295016]                                 Делить ←
      404[655299216]                                 Результат ⁼ 100 ←
 30867472[655297915]                           THEN ←
 11010088[655296685]                             ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
 11010095[655295449]                               Выражение ←
      404[655299221]                                 Результат ⁼ 'Ограничение на редактирование кол-ва вниз на больше чем ' ←
      404[655299222]                                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655309549]                                   Уточняющий параметр ≡ Алгоритм расчета шифра начислений ∙ 359[33619998] ←
      411[655309564]                                     Уточняющий параметр ≡ Имя ∙ 249[262146] ←
      404[655299232]                                 Результат ⁼ '%' ←
 11010080[655296389]                             = ≡ Кол-во заказа ∙ 65545[144447112] ←
      404[655299219]                               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655301944]                                 Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
 30867470[655297926]                     IF ←
  1638463[655299369]                       Условие ←
      404[655299188]                         Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655295880]                           Уточняющий параметр ≡ Алгоритм расчета шифра удержаний ∙ 359[33619999] ←
      413[655295460]                         И ←
      116[655298339]                         Выражение ←
      404[655299229]                           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655309573]                             Уточняющий параметр ≡ Алгоритм расчета шифра удержаний ∙ 359[33619999] ←
  1638479[655294839]                           Не равно ←
      404[655299230]                           Результат ≡ 100% ∙ 655294517[655294475] ←
      413[655295462]                         И ←
      116[655298341]                         Выражение ←
  1638460[655295071]                           НЕ ←
      404[655305046]                           Результат ≡ ПРАВА ОБЪЕКТА (объект - параметр функции) ∙ 387[2359297] ←
  2359325[655294496]                             Роль ≡ Разрешено корректировать заказ ∙ 233[655294487] ←
 30867472[655297916]                       THEN ←
 30867470[655297927]                         IF ←
  1638463[655299370]                           Условие ←
      116[655296179]                             Выражение ←
      404[655299210]                               Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
      406[655295320]                               Вычесть ←
      404[655299209]                               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655297099]                                 Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
  1638478[655294727]                             Больше ←
      116[655296315]                             Выражение ←
      404[655299211]                               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655297735]                                 Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
      403[655295361]                               Умножить ←
      116[655297804]                               Выражение ←
      404[655299212]                                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655297736]                                   Уточняющий параметр ≡ Алгоритм расчета шифра удержаний ∙ 359[33619999] ←
      411[655302236]                                     Уточняющий параметр ≡ Значение ∙ 249[262147] ←
      402[655295015]                                 Делить ←
      404[655299213]                                 Результат ⁼ 100 ←
 30867472[655297917]                           THEN ←
 11010088[655296684]                             ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
 11010095[655295439]                               Выражение ←
      404[655299220]                                 Результат ⁼ 'Ограничение на редактирование кол-ва вверх на больше чем ' ←
      404[655299223]                                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655302237]                                   Уточняющий параметр ≡ Алгоритм расчета шифра удержаний ∙ 359[33619999] ←
      411[655302238]                                     Уточняющий параметр ≡ Имя ∙ 249[262146] ←
      404[655299231]                                 Результат ⁼ '%' ←
 11010080[655296391]                             = ≡ Кол-во заказа ∙ 65545[144447112] ←
      404[655299224]                               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655309571]                                 Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
  11010093[58392674]                   Комментарий • ----  проверка количество промо при старте промо ←
  11010080[58393069]                   = ≡ Количество из промо-документов ∙ 65545[58392806] ←
   1638402[58392641]                     NULL ←
  30867470[58393074]                   IF ←
   1638463[58393358]                     Условие ←
       404[58398407]                       Результат ≡ Ограничение редактирования заказа ∙ 65545[58393133] ←
   1638473[58393473]                       Равно ←
       404[58398408]                       Результат ⁼ 0 ←
  30867472[58393070]                     THEN • проверка ограничений ПРОМО (ДМП) ←
  11010079[58392590]                       CASE ←
   1572877[58392595]                         Условие ≡ <<Строка>> ∙ 367[6] ←
       411[58393485]                           Уточняющий параметр ≡ UID типа ∙ 249[2621446] ←
  11010081[58392623]                         OF ≡ Партионные строки Заказа товара поставщику ∙ 360[28835872] ←
  11010088[58392942]                           ВЫПОЛНИТЬ ≡ Найти ПРОМО-акции по товару (через сальдо и проводки) ∙ 249[656080905] ←
  32505862[58392856]                             Значения формальных параметров при вызове ←
  32505860[58393199]                               Значение параметра при вызове процедуры/функции ≡ ~Товар (обяз) ∙ 65545[656084892] ←
    327700[58393584]                                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
  32505860[58393214]                               Значение параметра при вызове процедуры/функции ≡ ~Магазин ∙ 65545[656084893] ←
    327700[58393593]                                 Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58393486]                                   Уточняющий параметр ≡ Партнер ∙ 359[9] ←
  32505860[58393215]                               Значение параметра при вызове процедуры/функции ≡ ~Дата начальная ∙ 65545[656084894] ←
    327700[58393594]                                 Выражение ≡ Дата, начало дня ∙ 249[30867471] ←
  32505862[58392859]                                   Значения формальных параметров при вызове ←
  32505860[58393216]                                     Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867497] ←
    327700[58393595]                                       Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58393495]                                         Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58393496]                                           Уточняющий параметр ≡ Дата счета-фактуры ∙ 331[14286861] ←
  32505860[58393217]                               Значение параметра при вызове процедуры/функции ≡ ~Дата конечная ∙ 65545[656084895] ←
    327700[58393602]                                 Выражение ≡ Дата, конец дня ∙ 249[30867475] ←
  32505862[58392860]                                   Значения формальных параметров при вызове ←
  32505860[58393218]                                     Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
    327700[58393603]                                       Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58393497]                                         Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58393498]                                           Уточняющий параметр ≡ Дата окончания резерва товара ∙ 331[15990785] ←
  32505860[58393219]                               Значение параметра при вызове процедуры/функции ≡ ~Типы акций ∙ 65545[656084896] ←
    327700[58393604]                                 Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
   1507665[58392599]                                   Список элементов ←
    327700[58393605]                                     Выражение ≡ Дополнительные места продаж ∙ 117[164888731] ←
    327700[58393606]                                     Выражение ≡ ~dead~ Паллеты ∙ 655294473[655294469] ←
  32505860[58393220]                               Значение параметра при вызове процедуры/функции ≡ Кол. ПРОМО~ ∙ 65545[656086459] ←
    327700[58393607]                                 Выражение ≡ Количество из промо-документов ∙ 65545[58392806] ←
  32505860[58393221]                               Значение параметра при вызове процедуры/функции ≡ ~Укажите действие ∙ 65545[656084899] ←
    327700[58393608]                                 Выражение ⁼ 2 ←
  30867473[58392683]                         ELSE • все остальные типы строк ←
  11010088[58392936]                           ВЫПОЛНИТЬ ≡ Найти ПРОМО-акции по товару (через сальдо и проводки) ∙ 249[656080905] ←
  32505862[58392823]                             Значения формальных параметров при вызове ←
  32505860[58393129]                               Значение параметра при вызове процедуры/функции ≡ ~Товар (обяз) ∙ 65545[656084892] ←
    327700[58393501]                                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
  32505860[58393130]                               Значение параметра при вызове процедуры/функции ≡ ~Магазин ∙ 65545[656084893] ←
    327700[58393502]                                 Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58393412]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58393416]                                     Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  32505860[58393131]                               Значение параметра при вызове процедуры/функции ≡ ~Дата начальная ∙ 65545[656084894] ←
    327700[58393503]                                 Выражение ≡ Дата, начало дня ∙ 249[30867471] ←
  32505862[58392824]                                   Значения формальных параметров при вызове ←
  32505860[58393132]                                     Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867497] ←
    327700[58393504]                                       Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58393417]                                         Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58393418]                                           Уточняющий параметр ≡ Дата счета-фактуры ∙ 331[14286861] ←
  32505860[58393133]                               Значение параметра при вызове процедуры/функции ≡ ~Дата конечная ∙ 65545[656084895] ←
    327700[58393505]                                 Выражение ≡ Дата, конец дня ∙ 249[30867475] ←
  32505862[58392825]                                   Значения формальных параметров при вызове ←
  32505860[58393134]                                     Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867789] ←
    327700[58393506]                                       Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58393419]                                         Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58393420]                                           Уточняющий параметр ≡ Дата окончания резерва товара ∙ 331[15990785] ←
  32505860[58393136]                               Значение параметра при вызове процедуры/функции ≡ ~Типы акций ∙ 65545[656084896] ←
    327700[58393508]                                 Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
   1507665[58392594]                                   Список элементов ←
    327700[58393510]                                     Выражение ≡ Дополнительные места продаж ∙ 117[164888731] ←
    327700[58393511]                                     Выражение ≡ ~dead~ Паллеты ∙ 655294473[655294469] ←
  32505860[58393135]                               Значение параметра при вызове процедуры/функции ≡ Кол. ПРОМО~ ∙ 65545[656086459] ←
    327700[58393507]                                 Выражение ≡ Количество из промо-документов ∙ 65545[58392806] ←
  32505860[58393137]                               Значение параметра при вызове процедуры/функции ≡ ~Укажите действие ∙ 65545[656084899] ←
    327700[58393509]                                 Выражение ⁼ 2 ←
  30867470[58392813]                   IF ←
   1638463[58392897]                     Условие ←
       116[58392884]                       Выражение ←
       404[58395085]                         Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
   1638476[58392584]                         Меньше ←
       116[58392879]                         Выражение ←
   1638464[58395089]                           Ноль (0.0), если NULL ≡ Количество из промо-документов ∙ 65545[58392806] ←
       406[58392656]                           Вычесть ←
   1638464[58392773]                           Ноль (0.0), если NULL ≡ <<Строка>> ∙ 367[6] ←
       411[58393421]                             Уточняющий параметр ≡ Сколько сейчас уже заказано покупателем (ТТ, Магазин, Филиал) ∙ 359[40566786] ←
       413[58392842]                       И ←
       116[58392883]                       Выражение ←
       404[58395096]                         Результат ≡ Количество из промо-документов ∙ 65545[58392806] ←
   1638479[58392632]                         Не равно ←
   1638402[58392642]                         NULL ←
  30867472[58392809]                     THEN • количество меньше (ПОРМО - Остаток фьючерсный) ←
  30867470[58392768]                       IF ←
   1638463[58392820]                         Условие ←
       404[58394634]                           Результат ≡ ПРАВА ОБЪЕКТА (объект - параметр функции) ∙ 387[2359297] ←
   2359325[58392586]                             Роль ≡ Администратор организации (магазина) ∙ 233[2818070] ←
       412[58392764]                           ИЛИ ←
       404[58400226]                           Результат ≡ ПРАВА ОБЪЕКТА (объект - параметр функции) ∙ 387[2359297] ←
   2359325[58392616]                             Роль ≡ Разрешено корректировать заказ ∙ 233[655294487] ←
  30867472[58392768]                         THEN • для администратора ←
  11010088[58392937]                           ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
  11010095[58392773]                             Выражение ←
       404[58395089]                               Результат ⁼ 'В период данной поставки стартует акция, количество заказа не должно быть меньше количества акции (ДМП)! ' ←
       404[58395095]                               Результат ≡ Количество из промо-документов ∙ 65545[58392806] ←
  30867473[58392703]                         ELSE • для всех остальных ←
  11010088[58392825]                           ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
  11010095[58392843]                             Выражение ←
       404[58394635]                               Результат ⁼ 'В период данной поставки стартует акция, количество заказа не должно быть меньше количества акции (ДМП)! ' ←
       404[58394636]                               Результат ≡ Количество из промо-документов ∙ 65545[58392806] ←
  11010080[58393068]                           = ≡ Кол-во заказа ∙ 65545[144447112] ←
       116[58392880]                             Выражение ←
   1638464[58392774]                               Ноль (0.0), если NULL ≡ Количество из промо-документов ∙ 65545[58392806] ←
       406[58392657]                               Вычесть ←
   1638464[58392776]                               Ноль (0.0), если NULL ≡ <<Строка>> ∙ 367[6] ←
       411[58393422]                                 Уточняющий параметр ≡ Сколько сейчас уже заказано покупателем (ТТ, Магазин, Филиал) ∙ 359[40566786] ←
 11010093[656084503]                   Комментарий • ----  проверка количества, при остатке ноль, количество не может быть ноль ←
  1507728[656081156]                   Начало многострочного комментария • ----  закомментировано по просьбе Сусловой Галины, до очистки матриц ←
 30867470[656084674]                   IF ←
  1638463[656085835]                     Условие ←
      116[656085554]                       Выражение ←
  1638464[656130157]                         Ноль (0.0), если NULL ≡ Кол-во заказа ∙ 65545[144447112] ←
  1638475[656081307]                         Меньше или равно ←
      404[656130166]                         Результат ⁼ 0 ←
      413[656084910]                       И ←
      116[656085556]                       Выражение ←
  1638464[656130159]                         Ноль (0.0), если NULL ≡ <<Строка>> ∙ 367[6] ←
      411[656094538]                           Уточняющий параметр ≡ Сколько сейчас есть у покупателя (ТТ, Магазина, Филиала) в наличии ∙ 359[40566787] ←
  1638475[656081306]                         Меньше или равно ←
      404[656130157]                         Результат ⁼ 0 ←
      413[656084917]                       И ←
      116[656082864]                       Выражение ←
  1638460[656082061]                         НЕ ←
      404[656106484]                         Результат ≡ Для ПЦ ∙ 65545[656090036] ←
      413[656084907]                       И ←
      116[656082883]                       Выражение ←
  1638460[656082051]                         НЕ ←
      404[656106388]                         Результат ≡ ПРАВА ОБЪЕКТА (объект - параметр функции) ∙ 387[2359297] ←
  2359325[656080944]                           Роль ≡ Разрешено корректировать заказ ∙ 233[655294487] ←
 30867472[656084662]                     THEN • количество не может быть ноль, когда остаток ноль ←
 11010088[656086325]                       ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
 11010095[656083597]                         Выражение ←
      404[656130159]                           Результат ⁼ 'Остаток товара равен нулю, при этом количество заказа не может быть равно ноль!' ←
 11010080[656097309]                       = ≡ Кол-во заказа ∙ 65545[144447112] ←
  1638464[656084029]                         Ноль (0.0), если NULL ≡ <<Строка>> ∙ 367[6] ←
      411[656094539]                           Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  1507729[656081156]                   Конец многострочного комментария ←
  11010093[58392622]                   Комментарий • ----  редактируем количество ←
 30867470[656084675]                   IF ←
  1638463[656085836]                     Условие ←
  1638464[656084026]                       Ноль (0.0), если NULL ≡ Кол-во заказа ∙ 65545[144447112] ←
  1638479[656082141]                       Не равно ←
  1638464[656084027]                       Ноль (0.0), если NULL ≡ <<Строка>> ∙ 367[6] ←
      411[656094540]                         Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
 30867472[656084663]                     THEN • количество изменилось, меняем в строке в БД ←
 11010088[655296268]                       ВЫПОЛНИТЬ ≡ Объект.Редактирование (метод) ∙ 220[39780354] ←
 30867474[655294612]                         Объект ≡ <<Строка>> ∙ 367[6] ←
      377[655294637]                         Начальные значения полей объекта ←
   131095[655295140]                           Начальное значение поля ≡ Количество ∙ 359[14286852] ←
   327700[655299562]                             Выражение ≡ Кол-во заказа ∙ 65545[144447112] ←
 11010093[655294568]                   Комментарий • ----  проверка на кратность упаковкам ←
  11010079[58392589]                   CASE ←
   1572877[58392594]                     Условие ≡ <<Строка>> ∙ 367[6] ←
       411[58393481]                       Уточняющий параметр ≡ UID типа ∙ 249[2621446] ←
  11010081[58392622]                     OF ≡ Заказ товара поставщику ∙ 360[14352385] ←
  11010080[58393082]                       = ≡ Кратно упаковке ∙ 65545[655297162] ←
   1638464[58392782]                         Ноль (0.0), если NULL ≡ <<Продукт>> ∙ 367[3] ←
       411[58393483]                           Уточняющий параметр ≡ Округление до паллетов ∙ 249[656080936] ←
  32505862[58392852]                             Значения формальных параметров при вызове ←
  32505860[58393200]                               Значение параметра при вызове процедуры/функции ≡ Товар(функция) ∙ 65545[656086359] ←
    327700[58393585]                                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
  32505860[58393201]                               Значение параметра при вызове процедуры/функции ≡ Количество автозаказа (вход) ∙ 65545[656086361] ←
    327700[58393586]                                 Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58393484]                                   Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  32505860[58393202]                               Значение параметра при вызове процедуры/функции ≡ Количество автозаказа (выход) ∙ 65545[656086403] ←
    327700[58393587]                                 Выражение ≡ Количество рекомендуемое ∙ 65545[655297163] ←
  30867473[58392682]                     ELSE • все остальные типы строк ←
 30867470[656084434]                       IF ←
  1638463[656085659]                         Условие ←
      404[656130110]                           Результат ≡ Товар-исключение? ∙ 249[656081018] ←
 32505862[656086306]                             Значения формальных параметров при вызове ←
 32505860[656092933]                               Значение параметра при вызове процедуры/функции ≡ ~Товар ∙ 65545[656087117] ←
   327700[656098735]                                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[656092934]                               Значение параметра при вызове процедуры/функции ≡ ~ТТ ∙ 65545[656087197] ←
   327700[656098736]                                 Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[656081752]                                   Выполнить действия ←
 39780366[656081653]                                     RETURN ←
  1638461[656081703]                                       Условный оператор (IF) ←
  1638463[656086163]                                         Условие ←
      404[656130111]                                           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656093260]                                             Уточняющий параметр ≡ Партнер ∙ 359[9] ←
      105[656081719]                                         То ←
      404[656130112]                                           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656093261]                                             Уточняющий параметр ≡ Партнер ∙ 359[9] ←
      424[656081704]                                         Иначе ←
      404[656130113]                                           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656093262]                                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[656093263]                                               Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
 32505860[656092935]                               Значение параметра при вызове процедуры/функции ≡ Строка~ ∙ 65545[656087231] ←
   327700[656098737]                                 Выражение ≡ Строка товар-исключение ∙ 65545[656088448] ←
 30867472[656084423]                         THEN • если товар исключение, округляем по другим правилам ←
 11010088[656086875]                           ВЫПОЛНИТЬ ≡ Округление количества товаров исключений ∙ 249[656081019] ←
 32505862[656086311]                             Значения формальных параметров при вызове ←
 32505860[656092936]                               Значение параметра при вызове процедуры/функции ≡ ~Товар ∙ 65545[656087247] ←
   327700[656098738]                                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[656092937]                               Значение параметра при вызове процедуры/функции ≡ ~Тип округления ∙ 65545[656087250] ←
   327700[656098739]                                 Выражение ≡ Строка товар-исключение ∙ 65545[656088448] ←
      411[656093258]                                   Уточняющий параметр ≡ ЕИ ∙ 359[14745603] ←
 32505860[656092938]                               Значение параметра при вызове процедуры/функции ≡ ~Коэффициент ∙ 65545[656087251] ←
   327700[656098740]                                 Выражение ≡ Строка товар-исключение ∙ 65545[656088448] ←
      411[656093259]                                   Уточняющий параметр ≡ Коэффициент промо ∙ 359[28835875] ←
 32505860[656092939]                               Значение параметра при вызове процедуры/функции ≡ ~Количество вход ∙ 65545[656087248] ←
   327700[656098741]                                 Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[656093264]                                   Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
 32505860[656092940]                               Значение параметра при вызове процедуры/функции ≡ Количество выход~ ∙ 65545[656087249] ←
   327700[656098743]                                 Выражение ≡ Количество рекомендуемое ∙ 65545[655297163] ←
 11010080[656095556]                           = ≡ Кратно упаковке ∙ 65545[655297162] ←
  1638461[656081791]                             Условный оператор (IF) ←
  1638463[656086172]                               Условие ←
      404[656130114]                                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656093265]                                   Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  1638479[656081689]                                 Не равно ←
      404[656130115]                                 Результат ≡ Количество рекомендуемое ∙ 65545[655297163] ←
      105[656081807]                               То ←
      404[656130116]                                 Результат ⁼ 0 ←
      424[656081705]                               Иначе ←
      404[656130117]                                 Результат ⁼ 1 ←
 30867473[656081897]                         ELSE • стандартное округление ←
 11010080[164828751]                           = ≡ Кратно упаковке ∙ 65545[655297162] ←
      404[164838518]                             Результат ≡ Округление количества заказа ∙ 249[164495366] ←
 32505862[164824544]                               Значения формальных параметров при вызове ←
 32505860[164826241]                                 Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164498355] ←
   327700[164827280]                                   Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170461143]                                 Значение параметра при вызове процедуры/функции ≡ Заказ ∙ 65545[656087058] ←
   327700[170462704]                                   Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164892043]                                 Значение параметра при вызове процедуры/функции ≡ Подразделение ∙ 65545[164891384] ←
   327700[164891148]                                   Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164889027]                                     Выполнить действия ←
 39780366[164889286]                                       RETURN ←
  1638461[164888953]                                         Условный оператор (IF) ←
  1638463[164890336]                                           Условие ←
      404[164897068]                                             Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164892941]                                               Уточняющий параметр ≡ Партнер ∙ 359[9] ←
      105[164888955]                                           То ←
      404[164897069]                                             Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164892942]                                               Уточняющий параметр ≡ Партнер ∙ 359[9] ←
      424[164888907]                                           Иначе ←
      404[164897070]                                             Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164892943]                                               Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164892944]                                                 Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
 32505860[164826242]                                 Значение параметра при вызове процедуры/функции ≡ Кол-во заказа (КЗ) ∙ 65545[164498356] ←
   327700[164827281]                                   Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164826941]                                     Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
 32505860[164826244]                                 Значение параметра при вызове процедуры/функции ≡ До упаковки ∙ 65545[164498357] ←
   327700[164827283]                                   Выражение ≡ true ∙ 117[30867468] ←
 32505860[164826245]                                 Значение параметра при вызове процедуры/функции ≡ Остаток ∙ 65545[164498362] ←
   327700[164827284]                                   Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164826942]                                     Уточняющий параметр ≡ Сколько сейчас есть у покупателя (ТТ, Магазина, Филиала) в наличии ∙ 359[40566787] ←
 32505860[164826246]                                 Значение параметра при вызове процедуры/функции ≡ Печать лога ∙ 65545[164825628] ←
   327700[164827285]                                   Выражение ≡ false ∙ 117[30867469] ←
 32505860[164826243]                                 Значение параметра при вызове процедуры/функции ≡ Рекомендуемое количество~ ∙ 65545[164498359] ←
   327700[164827282]                                   Выражение ≡ Количество рекомендуемое ∙ 65545[655297163] ←
 32505860[164367428]                                 Значение параметра при вызове процедуры/функции ≡ Тип сети ∙ 65545[164890711] ←
   327700[164368709]                                   Выражение ≡ Тип_сети_заказа ∙ 65545[656088414] ←
 30867470[655296193]                   IF ←
  1638463[655296640]                     Условие ←
      116[655296798]                       Выражение ←
      404[655308874]                         Результат ≡ Кратно упаковке ∙ 65545[655297162] ←
  1638473[655297226]                         Равно ←
      404[655308875]                         Результат ⁼ 0 ←
      413[655296446]                       И ←
      116[655296801]                       Выражение ←
      404[655308880]                         Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655303937]                           Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  1638479[655294887]                         Не равно ←
      404[655315651]                         Результат ⁼ 0 ←
 30867472[655296184]                     THEN • кол-во не кратно ←
 11010088[655296269]                       ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
 11010095[655294932]                         Выражение ←
      404[655308868]                           Результат ⁼ 'Количество заказа не кратно количеству в упаковке/минимально дробимому. ' ←
      404[655308869]                           Результат ⁼ 'Рекомендованное количество: ' ←
      404[655308876]                           Результат ≡ Количество рекомендуемое ∙ 65545[655297163] ←
 11010080[655299233]                       = ≡ Кол-во заказа ∙ 65545[144447112] ←
      404[655308881]                         Результат ≡ Количество рекомендуемое ∙ 65545[655297163] ←
 11010088[655296270]                       ВЫПОЛНИТЬ ≡ Объект.Редактирование (метод) ∙ 220[39780354] ←
 30867474[655294613]                         Объект ≡ <<Строка>> ∙ 367[6] ←
      377[655294638]                         Начальные значения полей объекта ←
   131095[655295141]                           Начальное значение поля ≡ Количество ∙ 359[14286852] ←
   327700[655299567]                             Выражение ≡ Кол-во заказа ∙ 65545[144447112] ←
  11010093[58392673]                   Комментарий • ----  причина изменения ←
   1507728[58392617]                   Начало многострочного комментария • этот иф заставляет вводить причину изменения количества заказа, периодически его включают для сбора статистики ←
 30867470[655295961]                   IF ←
  1638463[655298285]                     Условие ←
      116[655295678]                       Выражение ←
      404[655320135]                         Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655305999]                           Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  1638479[655294980]                         Не равно ←
      404[655320136]                         Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655306000]                           Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
       413[58393302]                       И ←
       116[58393605]                       Выражение ←
       116[58393606]                         Выражение ←
       404[58400108]                           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395355]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58395357]                               Уточняющий параметр ≡ UID типа ∙ 249[2621444] ←
   1638473[58393767]                           Равно ←
       404[58400109]                           Результат ≡ Заказ товаров поставщику [магазин] ∙ 332[28836002] ←
       412[58392747]                         ИЛИ ←
       116[58393607]                         Выражение ←
       404[58400110]                           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395358]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58395359]                               Уточняющий параметр ≡ UID типа ∙ 249[2621444] ←
   1638473[58393768]                           Равно ←
       404[58400111]                           Результат ≡ Заказ на склад (РЦ) с торговой точки (ТТ) ∙ 332[28835998] ←
      413[656084084]                       И ←
      116[656086512]                       Выражение ←
      404[656113508]                         Результат ≡ <<Документ>> ∙ 367[5] ←
      411[656090216]                           Уточняющий параметр ≡ Менеджер ∙ 331[14352403] ←
  1638473[656084430]                         Равно ←
      404[656113510]                         Результат ⁼ '4:0:0:1055922' ←
      413[656084090]                       И ←
      116[656086513]                       Выражение ←
      404[656113511]                         Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656090217]                           Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[656090218]                             Уточняющий параметр ≡ Товарная подгруппа ∙ 305[10] ←
      411[656090219]                               Уточняющий параметр ≡ Родитель ∙ 296[2] ←
  1638473[656084433]                         Равно ←
      404[656134679]                         Результат ≡ 206 Мясо охлажденное ∙ 117[656082600] ←
      413[656084091]                       И ←
      116[656086514]                       Выражение ←
  1638460[656081617]                         НЕ ←
      404[656124036]                         Результат ≡ Для ПЦ ∙ 65545[656090036] ←
 30867472[655295952]                     THEN • ввод причины корректировки заказа ←
 30867470[655297528]                       IF ←
  1638463[655298575]                         Условие ←
      404[655318555]                           Результат ≡ ПРАВА ОБЪЕКТА (объект - параметр функции) ∙ 387[2359297] ←
  2359325[655294502]                             Роль ≡ Разрешено не заполнять поле "Причина в заказе" ∙ 233[655294479] ←
 30867472[655297513]                         THEN ←
 30867470[655297530]                           IF ←
  1638463[655298577]                             Условие ←
      116[655295681]                               Выражение ←
      404[655322064]                                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655306916]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[655306917]                                     Уточняющий параметр ≡ Контрагент ∙ 331[7] ←
      411[655306947]                                       Уточняющий параметр ≡ Начислять пени ∙ 283[33620503] ←
  1638473[655298675]                                 Равно ←
      404[655322065]                                 Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[655297515]                             THEN ←
 12124190[655294766]                               Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
   262166[655294536]                                 Заголовок ⁼ 'Выберите причину изменения количества' ←
      245[655294871]                                 Список полей формы ←
      598[655296644]                                   Поле (колонка) для ввода данных ≡ Причина исправления ∙ 65545[655299057] ←
      209[655295222]                                     Выбор из списка ≡ Причины исправления кол-ва АЗ ∙ 371[655294695] ←
   262164[655294501]                                       Выбор одного объекта из списка ≡ Да ∙ 534[40566785] ←
      323[655295133]                                     Обязательное для ввода поле ←
      212[655294571]                                 Сценарий ←
      103[655295258]                                   Команда ≡ < -- > ∙ 102[57342] ←
      103[655295259]                                   Команда • Выполнить ≡ Вперед ∙ 102[57088] ←
      275[655294482]                                     Выбран(а) по умолчанию ←
       12[655294925]                                     Иконка ≡ Yes ∙ 90[79] ←
   131079[655294505]                                 Список горячих клавиш ←
   131082[655294545]                                   Назначение клавиши ≡ ESC ∙ 131080[27] ←
      103[655295253]                                     Команда ≡ ------------ ∙ 102[57343] ←
 30867565[655294468]                                 Обработка команд интерфейса ←
 30867566[655294467]                                   Обработчик команды интерфейса ≡ Закрыть окно ∙ 102[57663] ←
      127[655295495]                                     Процедура ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[655295442]                                       Выполнить действия ←
 30867470[655297339]                                         IF ←
  1638463[655298306]                                           Условие ←
      404[655320294]                                             Результат ≡ Причина исправления ∙ 65545[655299057] ←
  1638473[655298453]                                             Равно ←
  1638402[655295093]                                             NULL ←
 30867472[655297326]                                           THEN ←
 11010088[655297366]                                             ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
 11010095[655295359]                                               Выражение ←
      404[655320295]                                                 Результат ⁼ Необходимо указывать причину исправления! ←
 30867473[655294958]                                           ELSE ←
 39780366[655294980]                                             RETURN ≡ Закрыть окно ∙ 102[57663] ←
 30867473[655295810]                         ELSE ←
 30867470[655297341]                           IF ←
  1638463[655298308]                             Условие ←
      116[655297446]                               Выражение ←
      404[655320192]                                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655306010]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[655306011]                                     Уточняющий параметр ≡ Контрагент ∙ 331[7] ←
      411[655306014]                                       Уточняющий параметр ≡ Начислять пени ∙ 283[33620503] ←
  1638479[655295074]                                 Не равно ←
      404[655320193]                                 Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[655297328]                             THEN ←
 11010080[655302810]                               = ≡ Причина исправления ∙ 65545[655299057] ←
      404[655320303]                                 Результат ≡ Рекомендовано поставщиком ∙ 655294495[655294472] ←
 30867473[655294959]                             ELSE ←
 12124190[655294791]                               Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
   262166[655294543]                                 Заголовок ⁼ 'Выберите причину изменения количества' ←
      245[655294906]                                 Список полей формы ←
      598[655296899]                                   Поле (колонка) для ввода данных ≡ Причина исправления ∙ 65545[655299057] ←
      209[655295327]                                     Выбор из списка ≡ Причины исправления кол-ва АЗ ∙ 371[655294695] ←
   262164[655294502]                                       Выбор одного объекта из списка ≡ Да ∙ 534[40566785] ←
      323[655295230]                                     Обязательное для ввода поле ←
      212[655294580]                                 Сценарий ←
      103[655295317]                                   Команда ≡ < -- > ∙ 102[57342] ←
      103[655295318]                                   Команда • Выполнить ≡ Вперед ∙ 102[57088] ←
      275[655294485]                                     Выбран(а) по умолчанию ←
       12[655294970]                                     Иконка ≡ Yes ∙ 90[79] ←
   131079[655294508]                                 Список горячих клавиш ←
   131082[655294548]                                   Назначение клавиши ≡ ESC ∙ 131080[27] ←
      103[655295319]                                     Команда ≡ ------------ ∙ 102[57343] ←
 30867565[655294467]                                 Обработка команд интерфейса ←
 30867566[655294468]                                   Обработчик команды интерфейса ≡ Закрыть окно ∙ 102[57663] ←
      127[655295572]                                     Процедура ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[655295519]                                       Выполнить действия ←
 30867470[655297529]                                         IF ←
  1638463[655298576]                                           Условие ←
      404[655322081]                                             Результат ≡ Причина исправления ∙ 65545[655299057] ←
  1638473[655298677]                                             Равно ←
  1638402[655295188]                                             NULL ←
 30867472[655297514]                                           THEN ←
 11010088[655297539]                                             ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
 11010095[655295428]                                               Выражение ←
      404[655322082]                                                 Результат ⁼ Необходимо указывать причину исправления! ←
 30867473[655295811]                                           ELSE ←
 39780366[655295996]                                             RETURN ≡ Закрыть окно ∙ 102[57663] ←
  12124190[58392604]                       Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
    262166[58392596]                         Заголовок ⁼ 'Выберите причину изменения количества' ←
       245[58392610]                         Список полей формы ←
       598[58392883]                           Поле (колонка) для ввода данных ≡ Причина исправления ∙ 65545[655299057] ←
       209[58392680]                             Выбор из списка ≡ Причины исправления кол-ва АЗ ∙ 371[655294695] ←
    262164[58392593]                               Выбор одного объекта из списка ≡ Да ∙ 534[40566785] ←
       323[58392637]                             Обязательное для ввода поле ←
       212[58392592]                         Сценарий ←
       103[58392688]                           Команда ≡ < -- > ∙ 102[57342] ←
       103[58392768]                           Команда • Выполнить ≡ Вперед ∙ 102[57088] ←
       275[58392581]                             Выбран(а) по умолчанию ←
        12[58392735]                             Иконка ≡ Yes ∙ 90[79] ←
    131079[58392591]                         Список горячих клавиш ←
    131082[58392612]                           Назначение клавиши ≡ ESC ∙ 131080[27] ←
       103[58392769]                             Команда ≡ ------------ ∙ 102[57343] ←
  30867565[58392577]                         Обработка команд интерфейса ←
  30867566[58392577]                           Обработчик команды интерфейса ≡ Закрыть окно ∙ 102[57663] ←
       127[58392810]                             Процедура ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
  30867463[58392729]                               Выполнить действия ←
  30867470[58393212]                                 IF ←
   1638463[58393561]                                   Условие ←
       404[58400046]                                     Результат ≡ Причина исправления ∙ 65545[655299057] ←
   1638473[58393758]                                     Равно ←
   1638402[58392959]                                     NULL ←
  30867472[58393208]                                   THEN ←
  11010088[58393513]                                     ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
  11010095[58393056]                                       Выражение ←
       404[58400049]                                         Результат ⁼ Необходимо указывать причину исправления! ←
  30867473[58392822]                                   ELSE ←
  39780366[58392781]                                     RETURN ≡ Закрыть окно ∙ 102[57663] ←
 11010088[655297306]                       ВЫПОЛНИТЬ ≡ Объект.Редактирование (метод) ∙ 220[39780354] ←
 30867474[655294694]                         Объект ≡ <<Строка>> ∙ 367[6] ←
      377[655294800]                         Начальные значения полей объекта ←
   131095[655295920]                           Начальное значение поля ≡ Способ оплаты ∙ 359[6684673] ←
   327700[655298556]                             Выражение ≡ Причина исправления ∙ 65545[655299057] ←
   131095[164823486]                           Начальное значение поля ≡ Аналитика ∙ 359[14876674] ←
   327700[164831855]                             Выражение ≡ <<Пользователь>> ∙ 367[1] ←
   1507729[58392617]                   Конец многострочного комментария ←
 30867470[655295963]                   IF ←
  1638463[655298287]                     Условие ←
      116[655297206]                       Выражение ←
      404[655318556]                         Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655306005]                           Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  1638473[655298445]                         Равно ←
      404[655320140]                         Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655306006]                           Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
       413[58393303]                       И ←
       116[58393608]                       Выражение ←
       116[58393609]                         Выражение ←
       404[58400112]                           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395360]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58395361]                               Уточняющий параметр ≡ UID типа ∙ 249[2621444] ←
   1638473[58393769]                           Равно ←
       404[58400113]                           Результат ≡ Заказ товаров поставщику [магазин] ∙ 332[28836002] ←
       412[58392748]                         ИЛИ ←
       116[58393610]                         Выражение ←
       404[58400114]                           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395362]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58395363]                               Уточняющий параметр ≡ UID типа ∙ 249[2621444] ←
   1638473[58393770]                           Равно ←
       404[58400115]                           Результат ≡ Заказ на склад (РЦ) с торговой точки (ТТ) ∙ 332[28835998] ←
      413[656084140]                       И ←
      116[656086385]                       Выражение ←
      404[656110651]                         Результат ≡ <<Строка>> ∙ 367[6] ←
      411[656091510]                           Уточняющий параметр ≡ Способ оплаты ∙ 359[6684673] ←
  1638479[656082441]                         Не равно ←
  1638402[656083937]                         NULL ←
 30867472[655295954]                     THEN • если количество авто и ручное равны - обнулим причину изменения количества ←
 11010080[655302811]                       = ≡ Причина исправления ∙ 65545[655299057] ←
  1638402[655295095]                         NULL ←
 11010088[655297358]                       ВЫПОЛНИТЬ ≡ Объект.Редактирование (метод) ∙ 220[39780354] ←
 30867474[655294781]                         Объект ≡ <<Строка>> ∙ 367[6] ←
      377[655294804]                         Начальные значения полей объекта ←
   131095[655295928]                           Начальное значение поля ≡ Способ оплаты ∙ 359[6684673] ←
   327700[655304409]                             Выражение ≡ NULL ∙ 117[30670850] ←
 11010093[656084843]                   Комментарий • ----  дельта до упаковки и дельта до паллета ←
  1507410[656083174]                   ВЫПОЛНИТЬ БЛОК ≡ Расчёт Дельта упаковки и Дельта паллет ∙ 30867469[656083311] ←
  1507410[656082422]                   ВЫПОЛНИТЬ БЛОК ≡ Расчёт количества упаковок и количества паллет ∙ 30867469[656084389] ←
  30867473[58392630]                 ELSE • блокировка промо - никогда не выполняется, т.к. Подсвечивать всегда false ←
  30867470[58392875]                   IF ←
   1638463[58393017]                     Условие ←
       404[58396265]                       Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
   1638476[58392589]                       Меньше ←
       404[58396266]                       Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58393808]                         Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
  30867472[58392871]                     THEN • нельзя заказать меньше количества авто ←
  11010088[58392762]                       ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
  11010095[58392689]                         Выражение ←
       404[58394081]                           Результат ⁼ 'Блокировка редактирования количества по документу ПРОМО' ←
  11010080[58392835]                       = ≡ Кол-во заказа ∙ 65545[144447112] ←
       404[58394074]                         Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58392948]                           Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  30867470[58392881]                   IF ←
   1638463[58393023]                     Условие ←
       404[58396267]                       Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
   1638478[58392596]                       Больше ←
       404[58396288]                       Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58393809]                         Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  30867472[58392877]                     THEN • сообщение, что это ПРОМО ←
  11010088[58392735]                       ВЫПОЛНИТЬ ≡ ShowOkMsg ∙ 127[39780363] ←
  11010095[58392880]                         Выражение ←
       404[58396289]                           Результат ⁼ 'КАТАЛОГ! НА ОСОБОМ КОНТРОЛЕ! ЭКСПЕРИМЕНТНЫЕ ПОЗИЦИИ С КОЛИЧЕСТВОМ ИЛИ КОЭФФИЦИЕНТОМ ПРОМО' ←
 30867470[655294939]                   IF ←
  1638463[655295051]                     Условие ←
      116[655296304]                       Выражение ←
  1638464[655322990]                         Ноль (0.0), если NULL ≡ <<Строка>> ∙ 367[6] ←
      411[655309663]                           Уточняющий параметр ≡ Кол-во единиц во фьючерсном приходе ∙ 359[28835874] ←
  1638473[655296253]                         Равно ←
      404[655322990]                         Результат ⁼ 0 ←
      413[655295463]                       И ←
      116[655297806]                       Выражение ←
  1638464[655323003]                         Ноль (0.0), если NULL ≡ <<Строка>> ∙ 367[6] ←
      411[655309664]                           Уточняющий параметр ≡ Сколько сейчас есть у покупателя (ТТ, Магазина, Филиала) в наличии ∙ 359[40566787] ←
  1638475[655294649]                         Меньше или равно ←
      404[655323003]                         Результат ⁼ 0 ←
      413[655295464]                       И ←
      116[655298249]                       Выражение ←
  1638464[655323004]                         Ноль (0.0), если NULL ≡ Кол-во заказа ∙ 65545[144447112] ←
  1638473[655296254]                         Равно ←
      404[655323533]                         Результат ⁼ 0 ←
 30867472[655294931]                     THEN ←
 11010088[655295721]                       ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
 11010095[655294617]                         Выражение ←
      404[655323004]                           Результат ⁼ Нельзя обнулить кол-во, если остаток = 0 ! ←
 11010100[655294504]                       BREAK ←
  11010093[58392887]                   Комментарий • ----  редактируем количество ←
  11010088[58392760]                   ВЫПОЛНИТЬ ≡ Объект.Редактирование (метод) ∙ 220[39780354] ←
  30867474[58392597]                     Объект ≡ <<Строка>> ∙ 367[6] ←
       377[58392595]                     Начальные значения полей объекта ←
    131095[58392616]                       Начальное значение поля ≡ Количество ∙ 359[14286852] ←
    327700[58392959]                         Выражение ≡ Кол-во заказа ∙ 65545[144447112] ←
  11010093[58392888]                   Комментарий • ----  проверка на кратность упаковкам ←
  11010079[58392618]                   CASE ←
   1572877[58392653]                     Условие ≡ <<Строка>> ∙ 367[6] ←
       411[58395315]                       Уточняющий параметр ≡ UID типа ∙ 249[2621446] ←
  11010081[58392718]                     OF ≡ Заказ товара поставщику ∙ 360[14352385] ←
  11010080[58394215]                       = ≡ Кратно упаковке ∙ 65545[655297162] ←
   1638464[58392975]                         Ноль (0.0), если NULL ≡ <<Продукт>> ∙ 367[3] ←
       411[58395320]                           Уточняющий параметр ≡ Округление до паллетов ∙ 249[656080936] ←
  32505862[58393438]                             Значения формальных параметров при вызове ←
  32505860[58394431]                               Значение параметра при вызове процедуры/функции ≡ Товар(функция) ∙ 65545[656086359] ←
    327700[58395408]                                 Выражение ≡ <<Продукт>> ∙ 367[3] ←
  32505860[58394432]                               Значение параметра при вызове процедуры/функции ≡ Количество автозаказа (вход) ∙ 65545[656086361] ←
    327700[58395409]                                 Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58395321]                                   Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  32505860[58394433]                               Значение параметра при вызове процедуры/функции ≡ Количество автозаказа (выход) ∙ 65545[656086403] ←
    327700[58395412]                                 Выражение ≡ Количество рекомендуемое ∙ 65545[655297163] ←
  30867473[58392823]                     ELSE • все остальные типы строк ←
 11010080[164828718]                       = ≡ Кратно упаковке ∙ 65545[655297162] ←
      404[164838440]                         Результат ≡ Округление количества заказа ∙ 249[164495366] ←
 32505862[164824520]                           Значения формальных параметров при вызове ←
 32505860[164826137]                             Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164498355] ←
   327700[164827168]                               Выражение ≡ <<Продукт>> ∙ 367[3] ←
 32505860[170461142]                             Значение параметра при вызове процедуры/функции ≡ Заказ ∙ 65545[656087058] ←
   327700[170462703]                               Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164892045]                             Значение параметра при вызове процедуры/функции ≡ Подразделение ∙ 65545[164891384] ←
   327700[164891147]                               Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164889026]                                 Выполнить действия ←
 39780366[164889285]                                   RETURN ←
  1638461[164888952]                                     Условный оператор (IF) ←
  1638463[164890335]                                       Условие ←
      404[164897065]                                         Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164892937]                                           Уточняющий параметр ≡ Партнер ∙ 359[9] ←
      105[164888954]                                       То ←
      404[164897066]                                         Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164892938]                                           Уточняющий параметр ≡ Партнер ∙ 359[9] ←
      424[164888906]                                       Иначе ←
      404[164897067]                                         Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164892939]                                           Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164892940]                                             Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
 32505860[164826138]                             Значение параметра при вызове процедуры/функции ≡ Кол-во заказа (КЗ) ∙ 65545[164498356] ←
   327700[164827169]                               Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164826898]                                 Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
 32505860[164826140]                             Значение параметра при вызове процедуры/функции ≡ До упаковки ∙ 65545[164498357] ←
   327700[164827171]                               Выражение ≡ true ∙ 117[30867468] ←
 32505860[164826141]                             Значение параметра при вызове процедуры/функции ≡ Остаток ∙ 65545[164498362] ←
   327700[164827172]                               Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164826899]                                 Уточняющий параметр ≡ Сколько сейчас есть у покупателя (ТТ, Магазина, Филиала) в наличии ∙ 359[40566787] ←
 32505860[164826175]                             Значение параметра при вызове процедуры/функции ≡ Печать лога ∙ 65545[164825628] ←
   327700[164827214]                               Выражение ≡ false ∙ 117[30867469] ←
 32505860[164826139]                             Значение параметра при вызове процедуры/функции ≡ Рекомендуемое количество~ ∙ 65545[164498359] ←
   327700[164827170]                               Выражение ≡ Количество рекомендуемое ∙ 65545[655297163] ←
 32505860[164367430]                             Значение параметра при вызове процедуры/функции ≡ Тип сети ∙ 65545[164890711] ←
   327700[164368716]                               Выражение ≡ Тип_сети_заказа ∙ 65545[656088414] ←
  30867470[58393213]                   IF ←
   1638463[58393565]                     Условие ←
       116[58393599]                       Выражение ←
       404[58400064]                         Результат ≡ Кратно упаковке ∙ 65545[655297162] ←
   1638473[58393761]                         Равно ←
       404[58400065]                         Результат ⁼ 0 ←
       413[58393296]                       И ←
       116[58393600]                       Выражение ←
       404[58400066]                         Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395324]                           Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
   1638479[58392831]                         Не равно ←
       404[58400067]                         Результат ⁼ 0 ←
  30867472[58393209]                     THEN • кол-во не кратно ←
  11010088[58393516]                       ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
  11010095[58393059]                         Выражение ←
       404[58400068]                           Результат ⁼ 'Количество заказа не кратно количеству в упаковке/минимально дробимому. ' ←
       404[58400069]                           Результат ⁼ 'Рекомендованное количество: ' ←
       404[58400070]                           Результат ≡ Количество рекомендуемое ∙ 65545[655297163] ←
  11010080[58394217]                       = ≡ Кол-во заказа ∙ 65545[144447112] ←
       404[58400071]                         Результат ≡ Количество рекомендуемое ∙ 65545[655297163] ←
  11010088[58393517]                       ВЫПОЛНИТЬ ≡ Объект.Редактирование (метод) ∙ 220[39780354] ←
  30867474[58392726]                         Объект ≡ <<Строка>> ∙ 367[6] ←
       377[58392700]                         Начальные значения полей объекта ←
    131095[58393110]                           Начальное значение поля ≡ Количество ∙ 359[14286852] ←
    327700[58395416]                             Выражение ≡ Кол-во заказа ∙ 65545[144447112] ←
  11010093[58392889]                   Комментарий • ----  причина изменения ←
   1507728[58523658]                   Начало многострочного комментария • этот иф заставляет вводить причину изменения количества заказа, периодически его включают для сбора статистики ←
  30867470[58393214]                   IF ←
   1638463[58393566]                     Условие ←
       116[58393601]                       Выражение ←
       404[58400072]                         Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395325]                           Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
   1638479[58392832]                         Не равно ←
       404[58400073]                         Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395326]                           Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
       413[58393304]                       И ←
       116[58393611]                       Выражение ←
       116[58393612]                         Выражение ←
       404[58400116]                           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395364]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58395365]                               Уточняющий параметр ≡ UID типа ∙ 249[2621444] ←
   1638473[58393771]                           Равно ←
       404[58400117]                           Результат ≡ Заказ товаров поставщику [магазин] ∙ 332[28836002] ←
       412[58392749]                         ИЛИ ←
       116[58393613]                         Выражение ←
       404[58400118]                           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395366]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58395367]                               Уточняющий параметр ≡ UID типа ∙ 249[2621444] ←
   1638473[58393772]                           Равно ←
       404[58400119]                           Результат ≡ Заказ на склад (РЦ) с торговой точки (ТТ) ∙ 332[28835998] ←
  30867472[58393210]                     THEN ←
  30867470[58393215]                       IF ←
   1638463[58393567]                         Условие ←
       404[58400074]                           Результат ≡ ПРАВА ОБЪЕКТА (объект - параметр функции) ∙ 387[2359297] ←
   2359325[58392608]                             Роль ≡ Разрешено не заполнять поле "Причина в заказе" ∙ 233[655294479] ←
  30867472[58393211]                         THEN ←
  30867470[58393216]                           IF ←
   1638463[58393568]                             Условие ←
       116[58393602]                               Выражение ←
       404[58400075]                                 Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395327]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58395328]                                     Уточняющий параметр ≡ Контрагент ∙ 331[7] ←
       411[58395329]                                       Уточняющий параметр ≡ Начислять пени ∙ 283[33620503] ←
   1638473[58393762]                                 Равно ←
       404[58400076]                                 Результат ≡ Да ∙ 131203075[131203074] ←
  30867472[58393212]                             THEN ←
  12124190[58392605]                               Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
    262166[58392597]                                 Заголовок ⁼ 'Выберите причину изменения количества' ←
       245[58392612]                                 Список полей формы ←
       598[58392885]                                   Поле (колонка) для ввода данных ≡ Причина исправления ∙ 65545[655299057] ←
       209[58392684]                                     Выбор из списка ≡ Причины исправления кол-ва АЗ ∙ 371[655294695] ←
    262164[58392594]                                       Выбор одного объекта из списка ≡ Да ∙ 534[40566785] ←
       323[58392639]                                     Обязательное для ввода поле ←
       212[58392593]                                 Сценарий ←
       103[58392770]                                   Команда ≡ < -- > ∙ 102[57342] ←
       103[58392771]                                   Команда • Выполнить ≡ Вперед ∙ 102[57088] ←
       275[58392582]                                     Выбран(а) по умолчанию ←
        12[58392736]                                     Иконка ≡ Yes ∙ 90[79] ←
    131079[58392592]                                 Список горячих клавиш ←
    131082[58392613]                                   Назначение клавиши ≡ ESC ∙ 131080[27] ←
       103[58392772]                                     Команда ≡ ------------ ∙ 102[57343] ←
  30867565[58392578]                                 Обработка команд интерфейса ←
  30867566[58392578]                                   Обработчик команды интерфейса ≡ Закрыть окно ∙ 102[57663] ←
       127[58392811]                                     Процедура ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
  30867463[58392730]                                       Выполнить действия ←
  30867470[58393217]                                         IF ←
   1638463[58393569]                                           Условие ←
       404[58400077]                                             Результат ≡ Причина исправления ∙ 65545[655299057] ←
   1638473[58393763]                                             Равно ←
   1638402[58392962]                                             NULL ←
  30867472[58393213]                                           THEN ←
  11010088[58393518]                                             ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
  11010095[58393060]                                               Выражение ←
       404[58400078]                                                 Результат ⁼ Необходимо указывать причину исправления! ←
  30867473[58392824]                                           ELSE ←
  39780366[58392782]                                             RETURN ≡ Закрыть окно ∙ 102[57663] ←
  30867473[58392825]                         ELSE ←
  30867470[58393218]                           IF ←
   1638463[58393570]                             Условие ←
       116[58393603]                               Выражение ←
       404[58400079]                                 Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395330]                                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58395331]                                     Уточняющий параметр ≡ Контрагент ∙ 331[7] ←
       411[58395332]                                       Уточняющий параметр ≡ Начислять пени ∙ 283[33620503] ←
   1638479[58392833]                                 Не равно ←
       404[58400080]                                 Результат ≡ Да ∙ 131203075[131203074] ←
  30867472[58393214]                             THEN ←
  11010080[58394218]                               = ≡ Причина исправления ∙ 65545[655299057] ←
       404[58400081]                                 Результат ≡ Рекомендовано поставщиком ∙ 655294495[655294472] ←
  30867473[58392826]                             ELSE ←
  12124190[58392606]                               Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
    262166[58392598]                                 Заголовок ⁼ 'Выберите причину изменения количества' ←
       245[58392613]                                 Список полей формы ←
       598[58392886]                                   Поле (колонка) для ввода данных ≡ Причина исправления ∙ 65545[655299057] ←
       209[58392685]                                     Выбор из списка ≡ Причины исправления кол-ва АЗ ∙ 371[655294695] ←
    262164[58392595]                                       Выбор одного объекта из списка ≡ Да ∙ 534[40566785] ←
       323[58392647]                                     Обязательное для ввода поле ←
       212[58392594]                                 Сценарий ←
       103[58392773]                                   Команда ≡ < -- > ∙ 102[57342] ←
       103[58392774]                                   Команда • Выполнить ≡ Вперед ∙ 102[57088] ←
       275[58392583]                                     Выбран(а) по умолчанию ←
        12[58392737]                                     Иконка ≡ Yes ∙ 90[79] ←
    131079[58392593]                                 Список горячих клавиш ←
    131082[58392614]                                   Назначение клавиши ≡ ESC ∙ 131080[27] ←
       103[58392775]                                     Команда ≡ ------------ ∙ 102[57343] ←
  30867565[58392579]                                 Обработка команд интерфейса ←
  30867566[58392579]                                   Обработчик команды интерфейса ≡ Закрыть окно ∙ 102[57663] ←
       127[58392812]                                     Процедура ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
  30867463[58392731]                                       Выполнить действия ←
  30867470[58393219]                                         IF ←
   1638463[58393571]                                           Условие ←
       404[58400082]                                             Результат ≡ Причина исправления ∙ 65545[655299057] ←
   1638473[58393764]                                             Равно ←
   1638402[58392963]                                             NULL ←
  30867472[58393215]                                           THEN ←
  11010088[58393519]                                             ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
  11010095[58393061]                                               Выражение ←
       404[58400083]                                                 Результат ⁼ Необходимо указывать причину исправления! ←
  30867473[58392827]                                           ELSE ←
  39780366[58392783]                                             RETURN ≡ Закрыть окно ∙ 102[57663] ←
  11010088[58393521]                       ВЫПОЛНИТЬ ≡ Объект.Редактирование (метод) ∙ 220[39780354] ←
  30867474[58392727]                         Объект ≡ <<Строка>> ∙ 367[6] ←
       377[58392701]                         Начальные значения полей объекта ←
    131095[58393111]                           Начальное значение поля ≡ Способ оплаты ∙ 359[6684673] ←
    327700[58395417]                             Выражение ≡ Причина исправления ∙ 65545[655299057] ←
   1507729[58392618]                   Конец многострочного комментария ←
  30867470[58393221]                   IF ←
   1638463[58393573]                     Условие ←
       116[58393604]                       Выражение ←
       404[58400086]                         Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395333]                           Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
   1638473[58393766]                         Равно ←
       404[58400087]                         Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395334]                           Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
       413[58393305]                       И ←
       116[58393614]                       Выражение ←
       116[58393615]                         Выражение ←
       404[58400120]                           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395368]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58395369]                               Уточняющий параметр ≡ UID типа ∙ 249[2621444] ←
   1638473[58393773]                           Равно ←
       404[58400121]                           Результат ≡ Заказ товаров поставщику [магазин] ∙ 332[28836002] ←
       412[58392750]                         ИЛИ ←
       116[58393616]                         Выражение ←
       404[58400122]                           Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58395370]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58395371]                               Уточняющий параметр ≡ UID типа ∙ 249[2621444] ←
   1638473[58393774]                           Равно ←
       404[58400123]                           Результат ≡ Заказ на склад (РЦ) с торговой точки (ТТ) ∙ 332[28835998] ←
  30867472[58393217]                     THEN ←
  11010080[58394219]                       = ≡ Причина исправления ∙ 65545[655299057] ←
   1638402[58392965]                         NULL ←
  11010088[58393522]                       ВЫПОЛНИТЬ ≡ Объект.Редактирование (метод) ∙ 220[39780354] ←
  30867474[58392728]                         Объект ≡ <<Строка>> ∙ 367[6] ←
       377[58392702]                         Начальные значения полей объекта ←
    131095[58393112]                           Начальное значение поля ≡ Способ оплаты ∙ 359[6684673] ←
    327700[58395418]                             Выражение ≡ NULL ∙ 117[30670850] ←
 11010088[164824225]                   ВЫПОЛНИТЬ ≡ Округление количества заказа ∙ 249[164495366] ←
 32505862[164824519]                     Значения формальных параметров при вызове ←
 32505860[164826132]                       Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164498355] ←
   327700[164827163]                         Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164826894]                           Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[170461145]                       Значение параметра при вызове процедуры/функции ≡ Заказ ∙ 65545[656087058] ←
   327700[170462706]                         Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164892044]                       Значение параметра при вызове процедуры/функции ≡ Подразделение ∙ 65545[164891384] ←
   327700[164891146]                         Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164889025]                           Выполнить действия ←
 39780366[164889284]                             RETURN ←
  1638461[164888951]                               Условный оператор (IF) ←
  1638463[164890334]                                 Условие ←
      404[164897062]                                   Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164892933]                                     Уточняющий параметр ≡ Партнер ∙ 359[9] ←
      105[164888953]                                 То ←
      404[164897063]                                   Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164892934]                                     Уточняющий параметр ≡ Партнер ∙ 359[9] ←
      424[164888905]                                 Иначе ←
      404[164897064]                                   Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164892935]                                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164892936]                                       Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
 32505860[164826133]                       Значение параметра при вызове процедуры/функции ≡ Кол-во заказа (КЗ) ∙ 65545[164498356] ←
   327700[164827164]                         Выражение ≡ Кол-во заказа ∙ 65545[144447112] ←
 32505860[164826135]                       Значение параметра при вызове процедуры/функции ≡ До упаковки ∙ 65545[164498357] ←
   327700[164827166]                         Выражение ≡ true ∙ 117[30867468] ←
 32505860[164826136]                       Значение параметра при вызове процедуры/функции ≡ Остаток ∙ 65545[164498362] ←
   327700[164827167]                         Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164826895]                           Уточняющий параметр ≡ Сколько сейчас есть у покупателя (ТТ, Магазина, Филиала) в наличии ∙ 359[40566787] ←
 32505860[164826176]                       Значение параметра при вызове процедуры/функции ≡ Печать лога ∙ 65545[164825628] ←
   327700[164827215]                         Выражение ≡ false ∙ 117[30867469] ←
 32505860[164826134]                       Значение параметра при вызове процедуры/функции ≡ Рекомендуемое количество~ ∙ 65545[164498359] ←
   327700[164827165]                         Выражение ≡ Кол-во заказа ∙ 65545[144447112] ←
 11010088[164497275]                   ВЫПОЛНИТЬ ≡ Объект.Редактирование (метод) ∙ 220[39780354] ←
 30867474[164495463]                     Объект ≡ <<Строка>> ∙ 367[6] ←
      377[164495449]                     Начальные значения полей объекта ←
   131095[164495567]                       Начальное значение поля ≡ Количество ∙ 359[14286852] ←
   327700[164500733]                         Выражение ≡ Кол-во заказа ∙ 65545[144447112] ←
  1507410[655294948]               ВЫПОЛНИТЬ БЛОК ≡ Расчет итогов ∙ 30867469[144966421] ←
 11010088[655296271]               ВЫПОЛНИТЬ ≡ Список данных.Изменить запись ∙ 387[1507451] ←
 39780366[655295218]               RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ТЕКУЩЕЙ СТРОКИ СПИСКА ∙ 102[53262] ←
 11010081[144441593]         OF ≡ Создать новую запись ∙ 102[57090] ←
 30867470[655297572]           IF ←
  1638463[655298643]             Условие ←
      116[655295994]               Выражение ←
      404[655297281]                 Результат ≡ <<Документ>> ∙ 367[5] ←
      411[655298043]                   Уточняющий параметр ≡ Тип ∙ 331[4] ←
  1638473[655297244]                 Равно ←
      404[655306062]                 Результат ≡ ПроектныйЭлемент.Индекс ∙ 249[42467331] ←
 11010064[655294615]                   Выражение ≡ Заказ товаров поставщику [РЦ] ∙ 332[14352385] ←
 30867472[655297558]             THEN ←
  11010099[58392582]               CONTINUE ←
 30867470[655296126]           IF ←
  1638463[655296543]             Условие ←
      404[655308044]               Результат ≡ Права на редактирование строки (true - только для просмотра) ∙ 117[655294728] ←
  1638473[655297077]               Равно ←
      404[655308049]               Результат ⁼ 1 ←
 30867472[655296117]             THEN ←
 39780366[655295155]               RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ТЕКУЩЕЙ СТРОКИ СПИСКА ∙ 102[53262] ←
 11010099[655294613]               CONTINUE ←
 11010080[144452364]           = ≡ Созданная строка ∙ 65545[144447126] ←
      404[144465858]             Результат ≡ Объект.Диалог создания ∙ 249[1507426] ←
   262178[144441430]               Тип объекта ≡ ~Тип строки ∙ 65545[144447287] ←
 11010080[144452365]           = ≡ <<Строка>> ∙ 367[6] ←
      404[144465860]             Результат ≡ Созданная строка ∙ 65545[144447126] ←
  1507410[144442077]           ВЫПОЛНИТЬ БЛОК ≡ Перечитать строку ∙ 30867469[144442492] ←
 11010088[144443959]           ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
  1507646[144441364]             Требуется позиционирование ←
 39780366[144441476]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ТЕКУЩЕЙ СТРАНИЦЫ СПИСКА ∙ 102[53260] ←
 11010081[144441592]         OF ≡ Изменить ∙ 102[57093] ←
 30867470[655296125]           IF ←
  1638463[655296541]             Условие ←
      404[655308048]               Результат ≡ Права на редактирование строки (true - только для просмотра) ∙ 117[655294728] ←
  1638473[655297076]               Равно ←
      404[655308050]               Результат ⁼ 1 ←
 30867472[655296116]             THEN ←
 39780366[655295154]               RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ТЕКУЩЕЙ СТРОКИ СПИСКА ∙ 102[53262] ←
 11010099[655294614]               CONTINUE ←
 30867470[144443787]           IF ←
  1638463[144444682]             Условие ←
      404[144465846]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[144445952]                 Уточняющий параметр ≡ Объект.Диалог редактирования ∙ 249[1507427] ←
 30867472[144443778]             THEN ←
  1507410[655294947]               ВЫПОЛНИТЬ БЛОК ≡ Перечитать строку ∙ 30867469[144442492] ←
 11010088[144443955]               ВЫПОЛНИТЬ ≡ Список данных.Изменить запись ∙ 387[1507451] ←
 39780366[144441471]               RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ТЕКУЩЕЙ СТРОКИ СПИСКА ∙ 102[53262] ←
 30867473[144441864]             ELSE ←
 39780366[144441489]               RETURN ←
 11010081[144441595]         OF ≡ Удалить ∙ 102[57094] ←
 39780366[655295408]           RETURN ≡ ------------ ∙ 102[57343] ←
 30867470[655296128]           IF ←
  1638463[655296545]             Условие ←
      404[655308051]               Результат ≡ Права на редактирование строки (true - только для просмотра) ∙ 117[655294728] ←
  1638473[655297079]               Равно ←
      404[655308052]               Результат ⁼ 1 ←
 30867472[655296119]             THEN ←
 39780366[655295158]               RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ТЕКУЩЕЙ СТРОКИ СПИСКА ∙ 102[53262] ←
 11010099[655294615]               CONTINUE ←
 11010100[144441394]           BREAK ←
      116[144443462]             Выражение ←
  1638460[144441805]               НЕ ←
      404[144465864]               Результат ≡ ShowYesNoMessage ∙ 249[39780368] ←
 11010095[144441626]                 Выражение ←
      404[144465865]                   Результат ⁼ Запись будет удалена без возможности восстановления! Продолжить? ←
 30867470[144443796]           IF ←
  1638463[144444691]             Условие ←
      404[144465866]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[144445957]                 Уточняющий параметр ≡ Объект.Удаление ∙ 249[1507432] ←
 30867472[144443787]             THEN • Пересвечиваем ←
 11010088[144443961]               ВЫПОЛНИТЬ ≡ Список данных.Удалить запись ∙ 387[1507452] ←
  1507646[144441365]                 Требуется позиционирование ←
 39780366[144441478]               RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ТЕКУЩЕЙ СТРАНИЦЫ СПИСКА ∙ 102[53260] ←
 30867473[144441856]             ELSE ←
 11010088[144443962]               ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
 11010095[144441627]                 Выражение ←
      404[144465867]                   Результат ⁼ Не удалось удалить объект - ←
 11010081[655294686]         OF • Выбрать/Отм. выбор ≡ USER 1 ∙ 102[57201] ←
  1507410[655294961]           ВЫПОЛНИТЬ БЛОК ≡ Выбор строки ∙ 30867469[655295162] ←
 11010081[655294689]         OF • Выбрать все ≡ USER 2 ∙ 102[57202] ←
  1507410[655294963]           ВЫПОЛНИТЬ БЛОК ≡ Выбор всех строк ∙ 30867469[655295163] ←
 11010081[655294690]         OF • Отменить выбор ≡ USER 3 ∙ 102[57203] ←
  1507410[655294964]           ВЫПОЛНИТЬ БЛОК ≡ Отмена выбора всех строк ∙ 30867469[655295165] ←
 11010081[144441590]         OF • Просмотр поставщиков данного товара ≡ USER 4 ∙ 102[57204] ←
 12124191[144441369]           Вид просмотра ≡ Все поставщики данного товара ∙ 371[144441680] ←
 32505862[144442243]             Значения формальных параметров при вызове ←
 32505860[144443235]               Значение параметра при вызове процедуры/функции ≡ ~Продукт ∙ 65545[144447121] ←
   327700[144446040]                 Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[144445933]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 11010081[655294681]         OF • Просмотр ПРОМО акций по товару ≡ USER 5 ∙ 102[57205] ←
  11010079[58392588]           CASE ←
   1572877[58392590]             Условие ←
       404[58395107]               Результат ≡ <<Строка>> ∙ 367[6] ←
       411[58393448]                 Уточняющий параметр ≡ UID типа ∙ 249[2621446] ←
  11010081[58392621]             OF ≡ Партионные строки Заказа товара поставщику ∙ 360[28835872] ←
 12124191[655294489]               Вид просмотра ≡ Документы ПРОМО акций по товару ∙ 371[655294560] ←
 32505862[655295875]                 Значения формальных параметров при вызове ←
  32505860[58523831]                   Значение параметра при вызове процедуры/функции ≡ UIDs ПРОМО ∙ 65545[58523768] ←
    327700[58524042]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58523734]                       Уточняющий параметр ≡ Флаги "действительность компонент" ∙ 359[3342343] ←
 32505860[655297624]                   Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[655294527] ←
   327700[655295117]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[655294518]                       Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[655297625]                   Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[655294732] ←
   327700[655295118]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[655294554]                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[655294705]                         Уточняющий параметр ≡ Дата поставки ∙ 331[14352402] ←
 32505860[655297626]                   Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[655294855] ←
   327700[655295119]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[655294712]                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[655294713]                         Уточняющий параметр ≡ Дата окончания резерва товара ∙ 331[15990785] ←
 32505860[655297620]                   Значение параметра при вызове процедуры/функции ≡ Подразделения ∙ 65545[655294857] ←
   327700[655294969]                     Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
  1507665[655294588]                       Список элементов ←
   327700[655295120]                         Выражение ≡ Коммерческое подразделение для всех подразделений (Договора) ∙ 117[655294743] ←
    327700[58392864]                         Выражение ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
  32505862[58392662]                           Значения формальных параметров при вызове ←
  32505860[58392793]                             Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
    327700[58392865]                               Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58393456]                                 Уточняющий параметр ≡ Партнер ∙ 359[9] ←
   327700[655299654]                         Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[655294725]                           Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[655294726]                             Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  11010081[58523659]             OF ≡ Строка сводного заказа товаров поставщику ТТ [магазин] ∙ 360[656080910] ←
  12124191[58523650]               Вид просмотра ≡ Документы ПРОМО акций по товару ∙ 371[655294560] ←
  32505862[58523749]                 Значения формальных параметров при вызове ←
  32505860[58523843]                   Значение параметра при вызове процедуры/функции ≡ UIDs ПРОМО ∙ 65545[58523768] ←
    327700[58524053]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58523736]                       Уточняющий параметр ≡ Флаги "действительность компонент" ∙ 359[3342343] ←
  32505860[58523844]                   Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[655294527] ←
    327700[58524054]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58523737]                       Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  32505860[58523845]                   Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[655294732] ←
    327700[58524055]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58523752]                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58523753]                         Уточняющий параметр ≡ Дата поставки ∙ 331[14352402] ←
  32505860[58523846]                   Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[655294855] ←
    327700[58524056]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58523754]                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58523755]                         Уточняющий параметр ≡ Дата окончания резерва товара ∙ 331[15990785] ←
  32505860[58523847]                   Значение параметра при вызове процедуры/функции ≡ Подразделения ∙ 65545[655294857] ←
    327700[58524057]                     Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
   1507665[58523669]                       Список элементов ←
    327700[58524058]                         Выражение ≡ Коммерческое подразделение для всех подразделений (Договора) ∙ 117[655294743] ←
    327700[58524059]                         Выражение ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
  32505862[58523750]                           Значения формальных параметров при вызове ←
  32505860[58523848]                             Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
    327700[58524060]                               Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58524167]                                 Уточняющий параметр ≡ Партнер ∙ 359[9] ←
    327700[58524061]                         Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58524169]                           Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58524170]                             Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
  30867473[58392680]             ELSE • по умолчанию ←
  12124191[58392581]               Вид просмотра ≡ Документы ПРОМО акций по товару ∙ 371[655294560] ←
  32505862[58392837]                 Значения формальных параметров при вызове ←
  32505860[58523833]                   Значение параметра при вызове процедуры/функции ≡ UIDs ПРОМО ∙ 65545[58523768] ←
    327700[58524043]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58523735]                       Уточняющий параметр ≡ Флаги "действительность компонент" ∙ 359[3342343] ←
  32505860[58393166]                   Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[655294527] ←
    327700[58393544]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58393449]                       Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  32505860[58393360]                   Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[655294732] ←
    327700[58393800]                     Выражение ≡ Дата, начало дня ∙ 249[30867471] ←
  32505862[58392928]                       Значения формальных параметров при вызове ←
  32505860[58393361]                         Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[30867497] ←
    327700[58393801]                           Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58393680]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58393681]                               Уточняющий параметр ≡ Дата поставки ∙ 331[14352402] ←
  32505860[58393169]                   Значение параметра при вызове процедуры/функции ≡ Подразделения ∙ 65545[655294857] ←
    327700[58393547]                     Выражение ≡ Множество.Скомпоновать ∙ 387[1507479] ←
   1507665[58392597]                       Список элементов ←
    327700[58393548]                         Выражение ≡ Коммерческое подразделение для всех подразделений (Договора) ∙ 117[655294743] ←
    327700[58393549]                         Выражение ≡ Первая ТТ/РЦ/ПЦ для данного ЦО/Узла сети (действующая) ∙ 249[655294495] ←
  32505862[58392838]                           Значения формальных параметров при вызове ←
  32505860[58393170]                             Значение параметра при вызове процедуры/функции ≡ ~ЦО ∙ 65545[58392654] ←
    327700[58393550]                               Выражение ≡ ЦО ∙ 65545[58392759] ←
    327700[58393551]                         Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58393454]                           Уточняющий параметр ≡ Документ ∙ 359[5] ←
       411[58393455]                             Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
 11010081[655295052]         OF • Причина изменения ≡ USER 6 ∙ 102[57206] ←
 30867470[655295960]           IF ←
  1638463[655298284]             Условие ←
      116[655297444]               Выражение ←
      404[655320133]                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655305997]                   Уточняющий параметр ≡ Количество ∙ 359[14286852] ←
  1638479[655294951]                 Не равно ←
      404[655320134]                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655305998]                   Уточняющий параметр ≡ Количество по накладной поставщика ∙ 359[14286860] ←
 30867472[655295951]             THEN ←
 12124190[655294765]               Форма ввода ≡ БАЗОВАЯ ФОРМА ЗАПРОСА ∙ 299[65538] ←
      212[655294570]                 Сценарий ←
      103[655295256]                   Команда ≡ < -- > ∙ 102[57342] ←
      103[655295257]                   Команда • Выполнить ≡ Вперед ∙ 102[57088] ←
      275[655294481]                     Выбран(а) по умолчанию ←
       12[655294924]                     Иконка ≡ Yes ∙ 90[79] ←
   262166[655294537]                 Заголовок ⁼ 'Выберите причину изменения количества' ←
 30867565[655294466]                 Обработка команд интерфейса ←
 30867566[655294465]                   Обработчик команды интерфейса ≡ Закрыть окно ∙ 102[57663] ←
      127[655295492]                     Процедура ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[655295439]                       Выполнить действия ←
 30867470[655297338]                         IF ←
  1638463[655298305]                           Условие ←
      404[655320291]                             Результат ≡ Причина исправления ∙ 65545[655299057] ←
  1638473[655298454]                             Равно ←
  1638402[655295094]                             NULL ←
 30867472[655297325]                           THEN ←
 11010088[655297364]                             ВЫПОЛНИТЬ ≡ ShowErrMsg ∙ 127[39780362] ←
 11010095[655295335]                               Выражение ←
      404[655320292]                                 Результат ⁼ Необходимо указывать причину исправления! ←
 30867473[655294957]                           ELSE ←
 39780366[655294978]                             RETURN ≡ Закрыть окно ∙ 102[57663] ←
      245[655294870]                 Список полей формы ←
      598[655296636]                   Поле (колонка) для ввода данных ≡ Причина исправления ∙ 65545[655299057] ←
      209[655295219]                     Выбор из списка ≡ Причины исправления кол-ва АЗ ∙ 371[655294695] ←
 11010088[655297297]               ВЫПОЛНИТЬ ≡ Объект.Редактирование (метод) ∙ 220[39780354] ←
 30867474[655294633]                 Объект ≡ <<Строка>> ∙ 367[6] ←
      377[655294799]                 Начальные значения полей объекта ←
   131095[655295792]                   Начальное значение поля ≡ Способ оплаты ∙ 359[6684673] ←
   327700[655298548]                     Выражение ≡ Причина исправления ∙ 65545[655299057] ←
 11010088[655297303]               ВЫПОЛНИТЬ ≡ Список данных.Изменить запись ∙ 387[1507451] ←
 39780366[655294966]               RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ТЕКУЩЕЙ СТРОКИ СПИСКА ∙ 102[53262] ←
 30867473[655294955]             ELSE ←
 11010088[655297308]               ВЫПОЛНИТЬ ≡ Объект.Редактирование (метод) ∙ 220[39780354] ←
 30867474[655294777]                 Объект ≡ <<Строка>> ∙ 367[6] ←
      377[655294802]                 Начальные значения полей объекта ←
   131095[655295926]                   Начальное значение поля ≡ Способ оплаты ∙ 359[6684673] ←
   327700[655298558]                     Выражение ≡ NULL ∙ 117[30670850] ←
 39780366[655294973]               RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ТЕКУЩЕЙ СТРОКИ СПИСКА ∙ 102[53262] ←
  11010081[58392620]         OF • просмотр строк распределения по магазинам ≡ USER 13 ∙ 102[57213] ←
 11010099[656081255]           CONTINUE ←
      116[656086250]             Выражение ←
  1638460[656082150]               НЕ ←
      404[656095387]               Результат ≡ <<Строка>> ∙ 367[6] ←
  12124191[58392580]           Вид просмотра ≡ Строки заказа РЦ Поставщику: потребности магазинов ∙ 371[58392579] ←
  32505862[58392836]             Значения формальных параметров при вызове ←
  32505860[58393163]               Значение параметра при вызове процедуры/функции ≡ ~Документ ∙ 65545[144447116] ←
    327700[58393541]                 Выражение ≡ <<Документ>> ∙ 367[5] ←
  32505860[58393164]               Значение параметра при вызове процедуры/функции ≡ ~Тип строки ∙ 65545[144447287] ←
    327700[58393542]                 Выражение ≡ Партионные строки Заказа товара поставщику ∙ 360[28835872] ←
 32505860[164835208]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510252] ←
   327700[164840905]                 Выражение ≡ <<Строка>> ∙ 367[6] ←
   1507410[58392663]           ВЫПОЛНИТЬ БЛОК ≡ РЕДАКТИРОВАНИЕ : Расчет переменных ∙ 30867469[1508826] ←
  1507410[164823799]           ВЫПОЛНИТЬ БЛОК ≡ Расчет итогов ∙ 30867469[144966421] ←
  39780366[58392652]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ТЕКУЩЕЙ СТРОКИ СПИСКА ∙ 102[53262] ←
  11010081[58392676]         OF • просмотр строк сводного заказа по магазинам ≡ USER 14 ∙ 102[57214] ←
 11010099[656081242]           CONTINUE ←
      116[656086249]             Выражение ←
  1638460[656082149]               НЕ ←
      404[656095386]               Результат ≡ <<Строка>> ∙ 367[6] ←
 30867470[164889424]           IF ←
  1638463[164889701]             Условие ←
      404[164898479]               Результат ≡ <<Документ>> ∙ 367[5] ←
      411[164891558]                 Уточняющий параметр ≡ Бартер ∙ 331[40566787] ←
  1638473[164889586]               Равно ←
      404[164898480]               Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[164889420]             THEN • ДУБ ←
 12124191[164888597]               Вид просмотра ≡ ДУБ-Строки сводного заказа поставщику: потребности магазинов через РЦ ∙ 371[164888691] ←
 32505862[164889612]                 Значения формальных параметров при вызове ←
 32505860[164890656]                   Значение параметра при вызове процедуры/функции ≡ ~Документ ∙ 65545[144447116] ←
   327700[164891529]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164890657]                   Значение параметра при вызове процедуры/функции ≡ ~Тип строки ∙ 65545[144447287] ←
   327700[164891533]                     Выражение ≡ Строка сводного заказа товаров поставщику через РЦ [магазин] ∙ 360[656080905] ←
 32505860[164890791]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510252] ←
   327700[164891711]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
 32505860[164890794]                   Значение параметра при вызове процедуры/функции ≡ Сортировка ∙ 65545[1510125] ←
   327700[164891714]                     Выражение ≡ По коду ТТ ∙ 1507640[655294494] ←
 30867473[164888940]             ELSE • Обычный ←
  12124191[58392585]               Вид просмотра ≡ Строки сводного заказа поставщику: потребности магазинов через РЦ ∙ 371[58392622] ←
  32505862[58393141]                 Значения формальных параметров при вызове ←
  32505860[58393799]                   Значение параметра при вызове процедуры/функции ≡ ~Документ ∙ 65545[144447116] ←
    327700[58394451]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
  32505860[58393800]                   Значение параметра при вызове процедуры/функции ≡ ~Тип строки ∙ 65545[144447287] ←
    327700[58394453]                     Выражение ≡ Строка сводного заказа товаров поставщику через РЦ [магазин] ∙ 360[656080905] ←
 32505860[656091420]                   Значение параметра при вызове процедуры/функции ≡ Сортировка ∙ 65545[1510125] ←
   327700[656096547]                     Выражение ≡ По коду ТТ ∙ 1507640[655294494] ←
 32505860[164835209]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510252] ←
   327700[164840906]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
   1507410[58392707]           ВЫПОЛНИТЬ БЛОК ≡ РЕДАКТИРОВАНИЕ : Расчет переменных ∙ 30867469[1508826] ←
  1507410[164823965]           ВЫПОЛНИТЬ БЛОК ≡ Расчет итогов ∙ 30867469[144966421] ←
  39780366[58392716]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ТЕКУЩЕЙ СТРОКИ СПИСКА ∙ 102[53262] ←
  11010081[58392706]         OF • просмотр строк сводного заказа от ТТ по магазинам ≡ USER 15 ∙ 102[57215] ←
 11010099[164364596]           CONTINUE ←
      116[164366557]             Выражение ←
  1638460[164365485]               НЕ ←
      404[164372803]               Результат ≡ <<Строка>> ∙ 367[6] ←
 30867470[164889095]           IF ←
  1638463[164889195]             Условие ←
      404[164895251]               Результат ≡ <<Документ>> ∙ 367[5] ←
      411[164890170]                 Уточняющий параметр ≡ Бартер ∙ 331[40566787] ←
  1638473[164889132]               Равно ←
      404[164895252]               Результат ≡ Да ∙ 131203075[131203074] ←
 30867472[164889093]             THEN • ДУБ ←
 12124191[164888590]               Вид просмотра ≡ ДУБ-Строки сводного заказа поставщику: потребности магазинов [ТТ] ∙ 371[164888633] ←
 32505862[164889254]                 Значения формальных параметров при вызове ←
 32505860[164889950]                   Значение параметра при вызове процедуры/функции ≡ ~Документ ∙ 65545[144447116] ←
   327700[164890559]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164889951]                   Значение параметра при вызове процедуры/функции ≡ ~Тип строки ∙ 65545[144447287] ←
   327700[164890564]                     Выражение ≡ Строка сводного заказа товаров поставщику ТТ [магазин] ∙ 360[656080910] ←
 32505860[164889952]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510252] ←
   327700[164890565]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
 30867473[164888776]             ELSE • Обычный ←
 12124191[164888589]               Вид просмотра ≡ Строки сводного заказа поставщику: потребности магазинов [ТТ] ∙ 371[58392648] ←
 32505862[164889251]                 Значения формальных параметров при вызове ←
 32505860[164889947]                   Значение параметра при вызове процедуры/функции ≡ ~Документ ∙ 65545[144447116] ←
   327700[164890556]                     Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164889948]                   Значение параметра при вызове процедуры/функции ≡ ~Тип строки ∙ 65545[144447287] ←
   327700[164890557]                     Выражение ≡ Строка сводного заказа товаров поставщику ТТ [магазин] ∙ 360[656080910] ←
 32505860[164835210]                   Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510252] ←
   327700[164840907]                     Выражение ≡ <<Строка>> ∙ 367[6] ←
   1507410[58392775]           ВЫПОЛНИТЬ БЛОК ≡ РЕДАКТИРОВАНИЕ : Расчет переменных ∙ 30867469[1508826] ←
  1507410[656080946]           ВЫПОЛНИТЬ БЛОК ≡ Расчет итогов ∙ 30867469[144966421] ←
  39780366[58392671]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ТЕКУЩЕЙ СТРОКИ СПИСКА ∙ 102[53262] ←
  11010081[58392716]         OF • просмотр строк сводного заказа на склад от торговых точек ≡ USER 16 ∙ 102[57216] ←
 11010099[656081256]           CONTINUE ←
      116[656086251]             Выражение ←
  1638460[656082151]               НЕ ←
      404[656095388]               Результат ≡ <<Строка>> ∙ 367[6] ←
  12124191[58392591]           Вид просмотра ≡ Строки сводного заказа на склад (РЦ) с торговых точек (потребности магазинов) ∙ 371[58392660] ←
  32505862[58393421]             Значения формальных параметров при вызове ←
  32505860[58394390]               Значение параметра при вызове процедуры/функции ≡ ~Документ ∙ 65545[144447116] ←
    327700[58395353]                 Выражение ≡ <<Документ>> ∙ 367[5] ←
  32505860[58394391]               Значение параметра при вызове процедуры/функции ≡ ~Тип строки ∙ 65545[144447287] ←
    327700[58395354]                 Выражение ≡ Сводный заказ товара на распределительный центр (по торговым точкам) ∙ 360[43122752] ←
  32505860[58394392]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Родитель ∙ 65545[1510252] ←
    327700[58395355]                 Выражение ≡ <<Строка>> ∙ 367[6] ←
 32505860[656091432]               Значение параметра при вызове процедуры/функции ≡ Сортировка ∙ 65545[1510125] ←
   327700[656096562]                 Выражение ≡ По коду ТТ ∙ 1507640[655294494] ←
   1507410[58392792]           ВЫПОЛНИТЬ БЛОК ≡ РЕДАКТИРОВАНИЕ : Расчет переменных ∙ 30867469[1508826] ←
  1507410[164823966]           ВЫПОЛНИТЬ БЛОК ≡ Расчет итогов ∙ 30867469[144966421] ←
  39780366[58392776]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ТЕКУЩЕЙ СТРОКИ СПИСКА ∙ 102[53262] ←
      247[144441410]     Список полей просмотра ←
      590[144442373]       Поле (колонка), являющееся параметром объекта ≡ * ∙ 65545[144447103] ←
      326[144441521]         Минимально возможная ширина ⁼ 2 ←
      351[144441372]         Максимально возможная ширина ⁼ 2 ←
      605[144441482]         Выравнивание ≡ По центру ∙ 607[4] ←
      590[655295804]       Поле (колонка), являющееся параметром объекта ≡ Признак ∙ 65545[655299589] ←
      326[655294975]         Минимально возможная ширина ⁼ 4 ←
      590[144442374]       Поле (колонка), являющееся параметром объекта ≡ Код ∙ 65545[144447105] ←
       326[40370436]         Минимально возможная ширина ⁼ 10 ←
      605[144441483]         Выравнивание ≡ По левой границе ∙ 607[1] ←
      590[144442375]       Поле (колонка), являющееся параметром объекта ≡ Наименование ∙ 65545[144447106] ←
       326[40370435]         Минимально возможная ширина ⁼ 40 ←
      605[144441484]         Выравнивание ≡ По левой границе ∙ 607[1] ←
      590[656081052]       Поле (колонка), являющееся параметром объекта ≡ БЕ ∙ 65545[144447109] ←
      605[656081072]         Выравнивание ≡ По центру ∙ 607[4] ←
      326[656081171]         Минимально возможная ширина ⁼ 5 ←
      590[144442377]       Поле (колонка), являющееся параметром объекта • Цена зак ≡ Цена закупочная ∙ 65545[144447108] ←
       326[40370434]         Минимально возможная ширина ⁼ 10 ←
      605[144441486]         Выравнивание ≡ По правой границе ∙ 607[2] ←
      604[144441618]         Точность для числовых данных ⁼ 2 ←
      590[144442380]       Поле (колонка), являющееся параметром объекта • Кол-во авто ≡ Кол-во автозаказа ∙ 65545[144447111] ←
       326[40370433]         Минимально возможная ширина ⁼ 10 ←
      605[144441489]         Выравнивание ≡ По правой границе ∙ 607[2] ←
       598[58392741]       Поле (колонка) для ввода данных ≡ Кол-во заказа ∙ 65545[144447112] ←
   1507710[58392580]         Цвет фона ≡ Цвет фона (ввод в ячейку значения) ∙ 249[40042791] ←
  32505862[58393135]           Значения формальных параметров при вызове ←
   1507727[58392596]             <Наследуемые значения> ←
  32505860[58393789]             Значение параметра при вызове процедуры/функции ≡ Проверять состояние документа ∙ 65545[40053778] ←
    327700[58394521]               Выражение ⁼ 1 ←
 32505860[655301328]             Значение параметра при вызове процедуры/функции ≡ Дополнительное условие для проверки ∙ 65545[40054414] ←
   327700[655299788]               Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[655294913]                 Выполнить действия ←
 30867470[655295012]                   IF ←
  1638463[655295141]                     Условие ←
      404[655299975]                       Результат ≡ <<Строка>> ∙ 367[6] ←
 30867472[655295004]                     THEN ←
 39780366[655295076]                       RETURN ≡ <<Строка>> ∙ 367[6] ←
      411[655295875]                         Уточняющий параметр ≡ Состояние строки ∙ 359[11] ←
 30867473[655296055]                     ELSE ←
 39780366[655295183]                       RETURN ⁼ 1 ←
       326[58392709]         Минимально возможная ширина ⁼ 10 ←
       605[58392691]         Выравнивание ≡ По правой границе ∙ 607[2] ←
   2621482[58392598]         Только для просмотра (недопустимо для изменения), если: ≡ Права на редактирование строки (true - только для просмотра) ∙ 117[655294728] ←
   2359354[58392602]         Набор условий (ОБЯЗАТЕЛЬНЫХ) для проверки введенного значения на корректность ←
   1638472[58392622]           Условие (ОБЯЗАТЕЛЬНОЕ) для проверки введенного значения на корректность ≡ Проверка факт значения для штучного ∙ 249[164298818] ←
  32505862[58393136]             Значения формальных параметров при вызове ←
  32505860[58393790]               Значение параметра при вызове процедуры/функции ≡ ~Колво ∙ 65545[164301074] ←
    327700[58394522]                 Выражение ∙ 598[58392741] ←
  32505860[58393791]               Значение параметра при вызове процедуры/функции ≡ ~Продукт ∙ 65545[164301075] ←
    327700[58394523]                 Выражение ≡ <<Строка>> ∙ 367[6] ←
       411[58394556]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      590[655295492]       Поле (колонка), являющееся параметром объекта • Причина исправ. ≡ Причина исправления ∙ 65545[655299057] ←
      411[655306001]         Уточняющий параметр ≡ Имя ∙ 249[262146] ←
  2621481[655294779]         Доступно (видимо), если: ≡ false ∙ 117[30867469] ←
      326[655294855]         Минимально возможная ширина ⁼ 10 ←
      605[655294767]         Выравнивание ≡ По левой границе ∙ 607[1] ←
      590[144442382]       Поле (колонка), являющееся параметром объекта • Сумма зак ≡ Сумма закупочная ∙ 65545[144447113] ←
  2621481[655294778]         Доступно (видимо), если: ≡ false ∙ 117[30867469] ←
       326[40370431]         Минимально возможная ширина ⁼ 10 ←
      605[144441491]         Выравнивание ≡ По правой границе ∙ 607[2] ←
       590[40371620]       Поле (колонка), являющееся параметром объекта ≡ Срок годности ∙ 65545[40375153] ←
       605[40370391]         Выравнивание ≡ По правой границе ∙ 607[2] ←
    131097[40370857]         Формат ≡ Дата без времени ∙ 131096[131073] ←
       590[40370699]       Поле (колонка), являющееся параметром объекта • Остаток ≡ Остаток ТТ ∙ 65545[40372010] ←
       326[40370428]         Минимально возможная ширина ⁼ 10 ←
       605[40370251]         Выравнивание ≡ По правой границе ∙ 607[2] ←
   131097[164889029]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
      590[656082618]       Поле (колонка), являющееся параметром объекта ≡ Остаток он-лайн ∙ 65545[656081707] ←
      326[656081284]         Минимально возможная ширина ⁼ 10 ←
      605[656081158]         Выравнивание ≡ По правой границе ∙ 607[2] ←
   131097[164889030]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
      590[164495382]       Поле (колонка), являющееся параметром объекта • Остаток ингредиента ≡ Остаток ингредиента ∙ 65545[164499394] ←
      326[164495361]         Минимально возможная ширина ⁼ 10 ←
      605[164495361]         Выравнивание ≡ По правой границе ∙ 607[2] ←
      590[656082617]       Поле (колонка), являющееся параметром объекта • Разность док.остатка и он-лайн остатка ≡ Реализация он-лайн ∙ 65545[656081614] ←
      326[656081275]         Минимально возможная ширина ⁼ 10 ←
      605[656081159]         Выравнивание ≡ По правой границе ∙ 607[2] ←
      590[655294495]       Поле (колонка), являющееся параметром объекта • Остаток РЦ ≡ Остаток РЦ ∙ 65545[655298414] ←
  2621481[655294622]         Доступно (видимо), если: ≡ Текущий узел является консолидированной базой ∙ 249[1507768] ←
      326[655294732]         Минимально возможная ширина ⁼ 10 ←
      605[655294625]         Выравнивание ≡ По правой границе ∙ 607[2] ←
      590[144442376]       Поле (колонка), являющееся параметром объекта ≡ Кол-во реализованного ∙ 65545[144447107] ←
       326[40370426]         Минимально возможная ширина ⁼ 12 ←
      605[144441485]         Выравнивание ≡ По правой границе ∙ 607[2] ←
       590[40371310]       Поле (колонка), являющееся параметром объекта • Предыдущие 7 дней ≡ Кол-во реал (предыдущие 7 дней) ∙ 65545[40375080] ←
       326[40370425]         Минимально возможная ширина ⁼ 12 ←
       605[40370331]         Выравнивание ≡ По правой границе ∙ 607[2] ←
   131097[164889033]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
       590[40371438]       Поле (колонка), являющееся параметром объекта ≡ Мин.кол-во ∙ 65545[40374485] ←
       326[40370427]         Минимально возможная ширина ⁼ 7 ←
       605[40370365]         Выравнивание ≡ По правой границе ∙ 607[2] ←
      590[655294879]       Поле (колонка), являющееся параметром объекта ≡ Кол-во мин.дробимое ∙ 65545[655296834] ←
      326[655294620]         Минимально возможная ширина ⁼ 10 ←
      605[655294592]         Выравнивание ≡ По правой границе ∙ 607[2] ←
      590[656082807]       Поле (колонка), являющееся параметром объекта ≡ Кол-во в блоке ∙ 65545[656086944] ←
      326[656081406]         Минимально возможная ширина ⁼ 10 ←
      605[656081188]         Выравнивание ≡ По правой границе ∙ 607[2] ←
       590[40371687]       Поле (колонка), являющееся параметром объекта ≡ Кол-во в упак ∙ 65545[655296835] ←
       326[40370452]         Минимально возможная ширина ⁼ 10 ←
       605[40370397]         Выравнивание ≡ По правой границе ∙ 607[2] ←
      590[656082299]       Поле (колонка), являющееся параметром объекта ≡ Кол-во в паллете ∙ 65545[58392813] ←
      326[656081172]         Минимально возможная ширина ⁼ 10 ←
      605[656081073]         Выравнивание ≡ По правой границе ∙ 607[2] ←
      590[656082889]       Поле (колонка), являющееся параметром объекта ≡ Кол-во упаковок ∙ 65545[656088441] ←
      326[656081468]         Минимально возможная ширина ⁼ 10 ←
      605[656081222]         Выравнивание ≡ По правой границе ∙ 607[2] ←
      590[656082891]       Поле (колонка), являющееся параметром объекта ≡ Кол-во паллет ∙ 65545[656088442] ←
      326[656081470]         Минимально возможная ширина ⁼ 10 ←
      605[656081224]         Выравнивание ≡ По правой границе ∙ 607[2] ←
       590[58392904]       Поле (колонка), являющееся параметром объекта ≡ Срок хранения ∙ 65545[58393146] ←
       326[58392764]         Минимально возможная ширина ⁼ 5 ←
       605[58392737]         Выравнивание ≡ По правой границе ∙ 607[2] ←
       590[58393075]       Поле (колонка), являющееся параметром объекта ≡ Дробится менее 1 кг ∙ 65545[58393364] ←
       326[58392896]         Минимально возможная ширина ⁼ 5 ←
       605[58392861]         Выравнивание ≡ По центру ∙ 607[4] ←
      590[144442383]       Поле (колонка), являющееся параметром объекта • Скорость продаж ≡ СП ∙ 65545[144447114] ←
       326[40370430]         Минимально возможная ширина ⁼ 10 ←
      605[144441492]         Выравнивание ≡ По правой границе ∙ 607[2] ←
   131097[164889031]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
      590[655295389]       Поле (колонка), являющееся параметром объекта • СП2 ≡ Скорость продаж (СП2) ∙ 65545[655298753] ←
      326[655294820]         Минимально возможная ширина ⁼ 5 ←
      605[655294735]         Выравнивание ≡ По правой границе ∙ 607[2] ←
   131097[164889032]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
       590[58392837]       Поле (колонка), являющееся параметром объекта ≡ Количество дней наличия ∙ 65545[58393086] ←
  2621481[655294772]         Доступно (видимо), если: ≡ false ∙ 117[30867469] ←
       326[58392742]         Минимально возможная ширина ⁼ 5 ←
       605[58392721]         Выравнивание ≡ По правой границе ∙ 607[2] ←
    131097[58392658]         Формат ≡ Целое N2.0 ∙ 131096[33161222] ←
      590[655295390]       Поле (колонка), являющееся параметром объекта • Коэф.месяца ≡ Коэф. месяца ∙ 65545[655298754] ←
  2621481[655294773]         Доступно (видимо), если: ≡ false ∙ 117[30867469] ←
      326[655294821]         Минимально возможная ширина ⁼ 5 ←
      605[655294736]         Выравнивание ≡ По правой границе ∙ 607[2] ←
       590[58392886]       Поле (колонка), являющееся параметром объекта • Коэф.дат ≡ Коэф. дат ∙ 65545[58393144] ←
  2621481[655294774]         Доступно (видимо), если: ≡ false ∙ 117[30867469] ←
       326[58392759]         Минимально возможная ширина ⁼ 5 ←
       605[58392735]         Выравнивание ≡ По правой границе ∙ 607[2] ←
       590[58392890]       Поле (колонка), являющееся параметром объекта • Коэф.дней ≡ Коэф. дней ∙ 65545[58393145] ←
  2621481[655294775]         Доступно (видимо), если: ≡ false ∙ 117[30867469] ←
       326[58392760]         Минимально возможная ширина ⁼ 5 ←
       605[58392736]         Выравнивание ≡ По правой границе ∙ 607[2] ←
       590[58392838]       Поле (колонка), являющееся параметром объекта • СП1 промо ≡ ПРОМО СП1 ∙ 65545[58393087] ←
  2621481[655294776]         Доступно (видимо), если: ≡ false ∙ 117[30867469] ←
       326[58392743]         Минимально возможная ширина ⁼ 5 ←
       605[58392722]         Выравнивание ≡ По центру ∙ 607[4] ←
       590[58392839]       Поле (колонка), являющееся параметром объекта • СП2 промо ≡ ПРОМО СП2 ∙ 65545[58393088] ←
  2621481[655294777]         Доступно (видимо), если: ≡ false ∙ 117[30867469] ←
       326[58392744]         Минимально возможная ширина ⁼ 5 ←
       605[58392723]         Выравнивание ≡ По центру ∙ 607[4] ←
      590[655295439]       Поле (колонка), являющееся параметром объекта ≡ Ф.Приход ∙ 65545[655296836] ←
      326[655294830]         Минимально возможная ширина ⁼ 5 ←
      605[655294743]         Выравнивание ≡ По правой границе ∙ 607[2] ←
      590[655295140]       Поле (колонка), являющееся параметром объекта ≡ ДатаН ∙ 65545[655296839] ←
   131097[655294710]         Формат ≡ Дата без времени ∙ 131096[131073] ←
      590[655295141]       Поле (колонка), являющееся параметром объекта ≡ ДатаК ∙ 65545[655296840] ←
   131097[655294711]         Формат ≡ Дата без времени ∙ 131096[131073] ←
      590[655295209]       Поле (колонка), являющееся параметром объекта ≡ Список ШК ∙ 65545[655296837] ←
      590[655294506]       Поле (колонка), являющееся параметром объекта • Кол-во просрочки ≡ { ... скрипт ... } ∙ 249[39780357] ←
      326[655294734]         Минимально возможная ширина ⁼ 6 ←
 32505863[655294886]         Локальные переменные ←
    65545[655298578]           Локальная переменная • Кол-во просроченного товара ≡ Количество ∙ 107[15] ←
 30867463[655295312]         Выполнить действия ←
 30867470[655297008]           IF ←
  1638463[655297828]             Условие ←
      404[655317605]               Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
      413[655295828]               И ←
      116[655297643]               Выражение ←
      404[655308644]                 Результат ≡ Код ∙ 65545[144447105] ←
  1638479[655295057]                 Не равно ←
  1638402[655295119]                 NULL ←
 30867472[655296999]             THEN ←
 11010080[655302124]               = ≡ Кол-во просроченного товара ∙ 65545[655298578] ←
      116[655297125]                 Выражение ←
      116[655297143]                   Выражение ←
      116[655297142]                     Выражение ←
      404[655317593]                       Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
      380[655296279]                       Сложить ←
      404[655317598]                       Результат ≡ Остаток ТТ ∙ 65545[40372010] ←
      402[655294747]                     Делить ←
      404[655317599]                     Результат ≡ СП ∙ 65545[144447114] ←
      406[655295058]                   Вычесть ←
      116[655297146]                   Выражение ←
      116[655297144]                     Выражение ←
      116[655297145]                       Выражение ←
      404[655317521]                         Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655304800]                           Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[655304801]                             Уточняющий параметр ≡ Дата поставки ∙ 331[14352402] ←
      380[655296278]                         Сложить ←
      116[655297126]                         Выражение ←
      116[655297127]                           Выражение ←
      404[655317520]                             Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655304795]                               Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[655304797]                                 Уточняющий параметр ≡ Срок реализации, дней ∙ 305[28835888] ←
      403[655295167]                             Умножить ←
      404[655317592]                             Результат ≡ <<Строка>> ∙ 367[6] ←
      411[655304796]                               Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[655304798]                                 Уточняющий параметр ≡ Контрагент ∙ 331[7] ←
      411[655304799]                                   Уточняющий параметр ≡ Объем ∙ 283[15073297] ←
      403[655295172]                           Умножить ←
      404[655317597]                           Результат ⁼ 86400 ←
      406[655295002]                       Вычесть ←
      404[655317600]                       Результат ≡ Текущие дата-время ∙ 249[42467332] ←
      402[655294823]                     Делить ←
      404[655317601]                     Результат ≡ Сутки ∙ 117[16843851] ←
 30867470[655297007]               IF ←
  1638463[655297827]                 Условие ←
      404[655317602]                   Результат ≡ Кол-во просроченного товара ∙ 65545[655298578] ←
  1638478[655294667]                   Больше ←
      404[655317603]                   Результат ⁼ 0 ←
 30867472[655296998]                 THEN ←
 30867470[655297009]                   IF ←
  1638463[655297829]                     Условие ←
      404[655317606]                       Результат ≡ Кол-во просроченного товара ∙ 65545[655298578] ←
  1638478[655294669]                       Больше ←
      116[655297148]                       Выражение ←
      404[655317607]                         Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
      380[655296280]                         Сложить ←
      404[655317608]                         Результат ≡ Остаток ТТ ∙ 65545[40372010] ←
 30867472[655297000]                     THEN ←
 39780366[655295582]                       RETURN ←
      116[655297147]                         Выражение ←
      404[655317609]                           Результат ≡ Кол-во заказа ∙ 65545[144447112] ←
      380[655296281]                           Сложить ←
      404[655317610]                           Результат ≡ Остаток ТТ ∙ 65545[40372010] ←
 30867473[655295544]                     ELSE ←
 39780366[655295581]                       RETURN ←
      404[655317604]                         Результат ≡ Кол-во просроченного товара ∙ 65545[655298578] ←
      590[655295482]       Поле (колонка), являющееся параметром объекта ≡ Предыдущий прогноз ∙ 65545[655296838] ←
       590[58393060]       Поле (колонка), являющееся параметром объекта • Цена в акцию ≡ Цена ПРОМО новая ∙ 65545[58393341] ←
       590[58393061]       Поле (колонка), являющееся параметром объекта • Скидка для покупателя ≡ Скидка по ПРОМО ∙ 65545[58393342] ←
      117[655295237]       Выражение • Видимость Коэф.месяца ≡ bool ∙ 107[1507344] ←
  1638461[655295298]         Условный оператор (IF) ←
  1638463[655298594]           Условие ←
      404[655310946]             Результат ≡ <<Документ>> ∙ 367[5] ←
      411[655299881]               Уточняющий параметр ≡ Связанный документ ∙ 331[15073282] ←
      411[655299882]                 Уточняющий параметр ≡ Способ оплаты ∙ 331[15073281] ←
  1638473[655298716]             Равно ←
      404[655310947]             Результат ≡ По месяцам ∙ 262182[262147] ←
      105[655295307]           То ←
      404[655310948]             Результат ≡ true ∙ 117[30867468] ←
      424[655295292]           Иначе ←
      404[655315284]             Результат ≡ false ∙ 117[30867469] ←
      590[655295763]       Поле (колонка), являющееся параметром объекта • Вес ≡ Вес БЕ ∙ 65545[144447110] ←
      117[656082249]       Выражение • Тов.запас. ТТ ≡ Число ∙ 107[4] ←
      116[656085469]         Выражение ←
  1638464[656084323]           Ноль (0.0), если NULL ≡ Остаток ТТ ∙ 65545[40372010] ←
      402[656081047]           Делить ←
      404[656132806]           Результат ≡ СП ∙ 65545[144447114] ←
      590[164889197]       Поле (колонка), являющееся параметром объекта • Значение АВС ≡ ABC ∙ 65545[164891023] ←
      326[164889038]         Минимально возможная ширина ⁼ 6 ←
  1507710[164888598]         Цвет фона ≡ Фон АВС ∙ 117[164888908] ←
      590[656082498]       Поле (колонка), являющееся параметром объекта ≡ Тов.запас. ТТ ∙ 117[656082249] ←
      326[656081212]         Минимально возможная ширина ⁼ 10 ←
      605[656081091]         Выравнивание ≡ По правой границе ∙ 607[2] ←
   131097[164889034]         Формат ≡ Число N19.1 ∙ 131096[144965634] ←
      590[164889270]       Поле (колонка), являющееся параметром объекта • Тов. запас с учетом заказа ≡ Тов.запас с учетом заказа ∙ 117[164888947] ←
  1507709[164888580]         Шрифт ≡ Шрифт поля "тов запас" ∙ 117[164888948] ←
      326[164889087]         Минимально возможная ширина ⁼ 10 ←
      605[164888671]         Выравнивание ≡ По правой границе ∙ 607[2] ←
   131097[164889035]         Формат ≡ Число N19.1 ∙ 131096[144965634] ←
      117[164888947]       Выражение • Тов.запас с учетом заказа ≡ Число ∙ 107[4] ←
      116[164890074]         Выражение ←
      116[164890075]           Выражение ←
  1638464[164888939]             Ноль (0.0), если NULL ≡ Ф.Остаток ∙ 65545[58392768] ←
      380[164888664]             Сложить ←
  1638464[164889448]             Ноль (0.0), если NULL ≡ Кол-во заказа ∙ 65545[144447112] ←
      402[164888711]           Делить ←
      404[164903071]           Результат ≡ СП ∙ 65545[144447114] ←
      590[164365533]       Поле (колонка), являющееся параметром объекта ≡ Кол-во ПРОМО ∙ 65545[655296752] ←
      326[164364728]         Минимально возможная ширина ⁼ 10 ←
      590[164365534]       Поле (колонка), являющееся параметром объекта ≡ Ф.Остаток ∙ 65545[58392768] ←
      326[164364729]         Минимально возможная ширина ⁼ 10 ←
   131097[164889028]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
      590[164888940]       Поле (колонка), являющееся параметром объекта ≡ Претензии КРО ∙ 65545[164890172] ←
      326[164888829]         Минимально возможная ширина ⁼ 12 ←
      590[164823136]       Поле (колонка), являющееся параметром объекта • Старая розничная цена ≡ { ... скрипт ... } ∙ 249[39780357] ←
      605[164823055]         Выравнивание ≡ По правой границе ∙ 607[2] ←
      326[164823089]         Минимально возможная ширина ⁼ 8 ←
   131097[164823483]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
 30867463[164823178]         Выполнить действия ←
 39780361[164823290]           ЗАВЕРШИТЬ БЛОК ←
      116[164824400]             Выражение ←
      404[164838673]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164826989]                 Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[164824831]               Равно ←
  1638402[164823516]               NULL ←
 39780366[164823166]           RETURN ←
      404[164838654]             Результат ≡ Предыдущая цена из реестра цен за N дней по партнеру (через параметр) ∙ 249[164823056] ←
 32505862[164824572]               Значения формальных параметров при вызове ←
 32505860[164826271]                 Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[164825681] ←
   327700[164827356]                   Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164826974]                     Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164826273]                 Значение параметра при вызове процедуры/функции ≡ N дней ∙ 65545[164825655] ←
   327700[164827358]                   Выражение ⁼ 14 ←
 32505860[164826274]                 Значение параметра при вызове процедуры/функции ≡ Партнер ∙ 65545[164825682] ←
   327700[164827359]                   Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164823180]                     Выполнить действия ←
 11010079[164823151]                       CASE ←
  1572877[164823164]                         Условие ←
      404[164838655]                           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164826975]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164826976]                               Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[164826977]                                 Уточняющий параметр ≡ UID типа ∙ 249[1507737] ←
 11010081[164823538]                         OF ≡ Центр ответственности ∙ 284[40370180] ←
 39780366[164823168]                           RETURN ←
      404[164838656]                             Результат ≡ Первое коммерческое подразделение для назначения цен для данного узла сети (действ. магазины, не алкоголь) ∙ 249[655294474] ←
 32505862[164824573]                               Значения формальных параметров при вызове ←
 32505860[164826275]                                 Значение параметра при вызове процедуры/функции ≡ ~Узел сети (текущий) _func ∙ 65545[655294498] ←
   327700[164827360]                                   Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164826978]                                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164826979]                                       Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[164826983]                                         Уточняющий параметр ≡ Узел распределенной сети ∙ 283[42401811] ←
 11010081[164823539]                         OF ≡ Торговая точка (Магазин) ∙ 284[40566786] ←
 39780366[164823169]                           RETURN ←
      404[164838657]                             Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164826984]                               Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164826999]                                 Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[164827000]                                   Уточняющий параметр ≡ Подразделение для назначения цен ∙ 283[42401850] ←
 32505860[164826276]                 Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164825683] ←
   327700[164827361]                   Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
      590[164823135]       Поле (колонка), являющееся параметром объекта • Новая розничная цена ≡ { ... скрипт ... } ∙ 249[39780357] ←
      605[164823054]         Выравнивание ≡ По правой границе ∙ 607[2] ←
      326[164823088]         Минимально возможная ширина ⁼ 8 ←
   131097[164823482]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
 30867463[164823177]         Выполнить действия ←
 39780361[164823289]           ЗАВЕРШИТЬ БЛОК ←
      116[164824399]             Выражение ←
      404[164838672]               Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164826988]                 Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[164824830]               Равно ←
  1638402[164823515]               NULL ←
 39780366[164823165]           RETURN ←
      404[164838653]             Результат ≡ Цена из реестра цен на дату по партнеру (через параметр) ∙ 249[40370272] ←
 32505862[164824571]               Значения формальных параметров при вызове ←
 32505860[164826269]                 Значение параметра при вызове процедуры/функции ≡ фп Продукт ∙ 65545[40375122] ←
   327700[164827354]                   Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164826971]                     Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[164826270]                 Значение параметра при вызове процедуры/функции ≡ фп Партнер (Коммерческий отдел) ∙ 65545[40375123] ←
   327700[164827355]                   Выражение ≡ { ... скрипт ... } ∙ 249[39780357] ←
 30867463[164823182]                     Выполнить действия ←
 11010079[164823153]                       CASE ←
  1572877[164823166]                         Условие ←
      404[164838687]                           Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164826972]                             Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164826973]                               Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[164826982]                                 Уточняющий параметр ≡ UID типа ∙ 249[1507737] ←
 11010081[164823542]                         OF ≡ Центр ответственности ∙ 284[40370180] ←
 39780366[164823172]                           RETURN ←
      404[164838688]                             Результат ≡ Первое коммерческое подразделение для назначения цен для данного узла сети (действ. магазины, не алкоголь) ∙ 249[655294474] ←
 32505862[164824577]                               Значения формальных параметров при вызове ←
 32505860[164826280]                                 Значение параметра при вызове процедуры/функции ≡ ~Узел сети (текущий) _func ∙ 65545[655294498] ←
   327700[164827365]                                   Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164827005]                                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164827006]                                       Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[164827007]                                         Уточняющий параметр ≡ Узел распределенной сети ∙ 283[42401811] ←
 11010081[164823543]                         OF ≡ Торговая точка (Магазин) ∙ 284[40566786] ←
 39780366[164823173]                           RETURN ←
      404[164838690]                             Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164827008]                               Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164827009]                                 Уточняющий параметр ≡ Подразделение ∙ 331[5] ←
      411[164827010]                                   Уточняющий параметр ≡ Подразделение для назначения цен ∙ 283[42401850] ←
 32505860[164826272]                 Значение параметра при вызове процедуры/функции ≡ фп Дата ∙ 65545[40375125] ←
   327700[164827357]                   Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
      590[164823137]       Поле (колонка), являющееся параметром объекта • Цена по карте премия ≡ { ... скрипт ... } ∙ 249[39780357] ←
      605[164823056]         Выравнивание ≡ По правой границе ∙ 607[2] ←
      326[164823090]         Минимально возможная ширина ⁼ 8 ←
   131097[164823484]         Формат ≡ Цена N19.2 ∙ 131096[30867459] ←
 32505863[164823187]         Локальные переменные ←
    65545[164825654]           Локальная переменная • Цена по карте Премия ≡ Число ∙ 107[4] ←
      355[164823804]             Начальное значение ⁼ 0 ←
 30867463[164823179]         Выполнить действия ←
 39780361[164823288]           ЗАВЕРШИТЬ БЛОК ←
      116[164824392]             Выражение ←
      116[164824398]               Выражение ←
      404[164838671]                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164826987]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[164824829]                 Равно ←
  1638402[164823514]                 NULL ←
      412[164823277]               ИЛИ ←
      116[164824393]               Выражение ←
      404[164835708]                 Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164826948]                   Уточняющий параметр ≡ Флаги "действительность компонент" ∙ 359[3342343] ←
  1638473[164824843]                 Равно ←
  1638402[164823523]                 NULL ←
  1507360[164823570]           Отбор данных (по запросу) • Ищем цену по карте премия ←
 12124200[164823199]             From         (Таблицы) ←
 12124204[164823328]               Таблица ≡ Строка (объект БД) ∙ 108[6] ←
  1507673[164823151]             Ключи оптимизации ←
  1507675[164823190]               Использовать индекс ∙ 12124204[164823328] ←
  1507676[164823191]                 Уточняющий параметр ≡ По документу ∙ 1507445[1507407] ←
  1507675[164823191]               Использовать индекс ∙ 12124204[164823328] ←
  1507676[164823192]                 Уточняющий параметр ≡ По продуктам ∙ 1507445[1507408] ←
 12124215[164823313]             Where      (Ограничения на отбор данных) ←
  1507376[164824320]               Выражение ←
  1507455[164824508]                 Результат ∙ 12124204[164823328] ←
  1507494[164825032]                   Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638473[164824849]                 Равно ←
  1507452[164823984]                 Константа ≡ <<Строка>> ∙ 367[6] ←
      411[164826949]                   Уточняющий параметр ≡ Флаги "действительность компонент" ∙ 359[3342343] ←
      413[164824289]               И ←
  1507376[164824321]               Выражение ←
  1507455[164824509]                 Результат ∙ 12124204[164823328] ←
  1507494[164825033]                   Уточняющий параметр ≡ Тип ∙ 359[4] ←
  1638473[164824850]                 Равно ←
  1507488[164823208]                 Константа (Ограничение по классу, типу, плану счетов) ≡ Строка перечня товаров для акции ∙ 360[3342408] ←
      413[164824295]               И ←
  1507376[164824323]               Выражение ←
  1507455[164824510]                 Результат ∙ 12124204[164823328] ←
  1507494[164825034]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
  1638473[164824852]                 Равно ←
  1507452[164823985]                 Константа ≡ <<Строка>> ∙ 367[6] ←
      411[164826953]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 12124213[164823249]             Параметры ←
  1507335[164823496]               Параметр • Новая цена ∙ 12124204[164823328] ←
  1507494[164825042]                 Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 30867466[164823658]             Выполнить после получения записи ←
 39780366[164823167]               RETURN ←
      404[164838670]                 Результат ≡ Новая цена ∙ 1507335[164823496] ←
      590[164366059]       Поле (колонка), являющееся параметром объекта ≡ Реализация по ПРОМО ∙ 65545[164372410] ←
      326[164364642]         Минимально возможная ширина ⁼ 10 ←
 48431110[655294465]     Список интерфейсных зон ←
 48431111[655294465]       Зона ≡ Штриховые коды (окно в виде просмотра товаров) ∙ 371[40044469] ←
      432[655294736]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[655295022]           Если истинно выражение ≡ Включить доп окно ∙ 65545[655298359] ←
      247[655294533]         Список полей просмотра ←
      590[655295210]           Поле (колонка), являющееся параметром объекта ≡ ШтрихКод ∙ 65545[40057374] ←
      326[655294713]             Минимально возможная ширина ⁼ 14 ←
   262166[655294521]         Заголовок ⁼ 'Штриховые коды' ←
      310[144441353]     Итоги (Totals) ←
      590[144442387]       Поле (колонка), являющееся параметром объекта ≡ Всего строк ∙ 65545[144447118] ←
      590[144442388]       Поле (колонка), являющееся параметром объекта ≡ Общее количество ∙ 65545[144447119] ←
      590[144442389]       Поле (колонка), являющееся параметром объекта ≡ Общая сумма ∙ 65545[144447120] ←
      590[656081627]       Поле (колонка), являющееся параметром объекта • Минимальная Сумма ≡ МинСум ∙ 65545[656085178] ←
      590[656082896]       Поле (колонка), являющееся параметром объекта • Максимальная Сумма ≡ МаксСум ∙ 65545[656088725] ←
      590[164298789]       Поле (колонка), являющееся параметром объекта ≡ Общий вес ∙ 65545[164299533] ←
      590[656082671]       Поле (колонка), являющееся параметром объекта ≡ Общее количество упаковок ∙ 65545[656081834] ←
      590[656082670]       Поле (колонка), являющееся параметром объекта • Минимальное количество упаковок ≡ МинКолУпкв ∙ 65545[656081833] ←
      590[164366007]       Поле (колонка), являющееся параметром объекта ≡ Общее количество паллет ∙ 65545[164372408] ←
      590[656082897]       Поле (колонка), являющееся параметром объекта • Минимальное количество паллет ≡ МинКолПаллет ∙ 65545[656088726] ←
    65627[144441352]     Размещение окна ≡ Большой просмотр (внизу) ∙ 65625[65547] ←
      212[144441410]     Сценарий ←
      103[144441772]       Команда • Назад ≡ Назад ∙ 102[57089] ←
      103[144441773]       Команда ≡ ------------ ∙ 102[57343] ←
      127[655294760]       Процедура • Сортировка ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
       12[655294576]         Иконка ≡ Сортировка по возрастанию ∙ 90[1507375] ←
 32505863[655294609]         Локальные переменные ←
    65545[655296300]           Локальная переменная • Элемент ≡ Объект ∙ 107[19] ←
 30867463[655294708]         Выполнить действия ←
 11010080[655297639]           = ≡ Элемент ∙ 65545[655296300] ←
      404[655303662]             Результат ≡ Список данных.Выбор сортировки ∙ 249[1507677] ←
 32505862[655295130]               Значения формальных параметров при вызове ←
 32505860[655295856]                 Значение параметра при вызове процедуры/функции ≡ Проектный раздел с сортировками ∙ 65545[1518022] ←
   327700[655296978]                   Выражение ≡ Поддерживаемые сортировки ∙ 1507639[1507346] ←
 11010100[655294470]           BREAK ←
      116[655295337]             Выражение ←
  1638460[655294671]               НЕ ←
      404[655303664]               Результат ≡ Элемент ∙ 65545[655296300] ←
 11010080[655297640]           = ≡ Сортировка ∙ 65545[1510125] ←
      404[655303665]             Результат ≡ Элемент ∙ 65545[655296300] ←
 11010088[655295703]           ВЫПОЛНИТЬ ≡ Сохранить значения переменных в профиль ∙ 249[1507537] ←
  1507716[655294465]             Переменная ≡ Сортировка ∙ 65545[1510125] ←
 39780366[655294750]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
      127[655295083]       Процедура • По коду ТТ ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
       12[655294977]         Иконка ≡ Сортировка по убыванию ∙ 90[1507374] ←
 30867463[655295429]         Выполнить действия ←
 11010080[655298605]           = ≡ Сортировка ∙ 65545[1510125] ←
      404[655306063]             Результат ≡ По коду ТТ ∙ 1507640[655294494] ←
 39780366[655296002]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
      127[655295755]       Процедура • По имени ТТ ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
       12[655295114]         Иконка ≡ Сортировка по убыванию ∙ 90[1507374] ←
 30867463[655295478]         Выполнить действия ←
 11010080[655298890]           = ≡ Сортировка ∙ 65545[1510125] ←
      404[655308954]             Результат ≡ По Имени ТТ ∙ 1507640[655294495] ←
 39780366[655296003]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
      103[655294641]       Команда ≡ ------------ ∙ 102[57343] ←
      127[655295337]       Процедура • Штрих-код F4 ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
       12[655294806]         Иконка ≡ ШТРИХКОД-2 ∙ 90[33] ←
 30867498[655294474]         Горячая клавиша ≡ F4 ∙ 131080[31522817] ←
 30867463[655295161]         Выполнить действия ←
 12124190[655294724]           Форма ввода ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[655294803]             Список полей формы ←
      598[655296200]               Поле (колонка) для ввода данных ≡ Штрих-код ∙ 65545[655298358] ←
  1507410[655295076]           ВЫПОЛНИТЬ БЛОК ≡ Отмена фильтров ∙ 30867469[40044141] ←
 11010080[655301533]           = ≡ Фильтр.UID продукта ∙ 65545[1510152] ←
      404[655305802]             Результат ≡ Поиск по продажному, весовому штрих-коду (весовой штрих-код с весом (13 символов)) ∙ 249[40042518] ←
 32505862[655295408]               Значения формальных параметров при вызове ←
 32505860[655299420]                 Значение параметра при вызове процедуры/функции ≡ Штриховой код ∙ 65545[40044747] ←
   327700[655302514]                   Выражение ≡ Штрих-код ∙ 65545[655298358] ←
 39780366[655295400]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
      127[655295338]       Процедура • On/Off Список ШК ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
       12[655294808]         Иконка ≡ ШТРИХКОД-1 ∙ 90[32] ←
 30867463[655295206]         Выполнить действия ←
 30867470[655296727]           IF ←
  1638463[655297411]             Условие ←
      404[655308594]               Результат ≡ Включить доп окно ∙ 65545[655298359] ←
 30867472[655296719]             THEN ←
 11010080[655301534]               = ≡ Включить доп окно ∙ 65545[655298359] ←
      404[655315271]                 Результат ≡ false ∙ 117[30867469] ←
 30867473[655295454]             ELSE ←
 11010080[655301535]               = ≡ Включить доп окно ∙ 65545[655298359] ←
      404[655308595]                 Результат ≡ true ∙ 117[30867468] ←
 39780366[655295469]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
      103[655295029]       Команда ≡ ------------ ∙ 102[57343] ←
      127[144442227]       Процедура • Фильтр F7 ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867498[144441380]         Горячая клавиша ≡ F7 ∙ 131080[11534358] ←
       12[144442006]         Иконка ≡ Фильтр ∙ 90[31522818] ←
 30867463[144441499]         Выполнить действия ←
 12124190[144441519]           Форма ввода • Задайте условия фильтра ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[144441576]             Список полей формы ←
      598[144442917]               Поле (колонка) для ввода данных • Код ≡ Фильтр.Продукт.Код (вхождение) ∙ 65545[1515478] ←
      598[144442918]               Поле (колонка) для ввода данных • Наименование ≡ Фильтр.Продукт.Наименование (вхождение) ∙ 65545[1515477] ←
 39780366[144441480]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
      127[144442228]       Процедура • Отменить F9 ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867498[144441379]         Горячая клавиша ≡ F9 ∙ 131080[11534360] ←
       12[144442007]         Иконка ≡ Отменить фильтр ∙ 90[31522819] ←
 30867463[144441500]         Выполнить действия ←
  1507410[655295077]           ВЫПОЛНИТЬ БЛОК ≡ Отмена фильтров ∙ 30867469[40044141] ←
 39780366[144441481]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
      127[656082338]       Процедура • Отменить Фильтр по менеджеру ОЦЗ ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
       12[656081260]         Иконка ≡ Отменить фильтр ∙ 90[31522819] ←
 30867463[656081595]         Выполнить действия ←
 11010080[656097540]           = ≡ ~Фильтровать по менеджеру группы ∙ 65545[656090094] ←
      404[656128055]             Результат ≡ false ∙ 117[30867469] ←
 39780366[656081452]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
      103[655295030]       Команда ≡ ------------ ∙ 102[57343] ←
      113[655294564]       Сценарий (Меню) • Действия ←
       12[655294807]         Иконка ≡ Сценарий ∙ 90[3] ←
      103[655294884]         Команда • Выделить все ≡ USER 2 ∙ 102[57202] ←
      103[655294885]         Команда • Отменить выделение ≡ USER 3 ∙ 102[57203] ←
       127[58523653]         Процедура ≡ Импорт из файла CSV  (v.23.05.11) ∙ 127[656081274] ←
  32505862[58523699]           Значения формальных параметров при вызове ←
  32505860[58523743]             Значение параметра при вызове процедуры/функции ≡ Задайте индекс поля "Код карточки" ∙ 65545[656084074] ←
    327700[58523878]               Выражение ⁼ 1 ←
  32505860[58523745]             Значение параметра при вызове процедуры/функции ≡ Задайте индекс поля "Количество ПРОМО" ∙ 65545[656084076] ←
    327700[58523889]               Выражение ⁼ 2 ←
  32505860[58523750]             Значение параметра при вызове процедуры/функции ≡ Задайте тип создаваемой строки ∙ 65545[656084084] ←
    327700[58523894]               Выражение ≡ Заказ товара на распределительный центр ∙ 360[42402019] ←
      127[165937181]         Процедура • Внести заданное кол-во ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 32505863[165937168]           Локальные переменные ←
      246[165937153]             <Наследуемые поля, колонки> ←
    65545[165937522]             Локальная переменная • Строка для поиска ≡ Объект ∙ 107[19] ←
    65545[165937604]             Локальная переменная • Строка из коллекции ≡ Строка (объект БД) ∙ 107[10] ←
      117[165937196]             Выражение • MSGBOX ←
      116[165937172]               Выражение ←
  1638461[165937176]                 Условный оператор (IF) ←
  1638463[165937350]                   Условие ←
      404[165938634]                     Результат ≡ Внести Количество ∙ 65545[165937523] ←
  1638473[165937372]                     Равно ←
      404[165938636]                     Результат ⁼ 0 ←
      105[165937176]                   То ←
      404[165938637]                     Результат ⁼ 'Вы хотите убрать всё количество ' ←
      404[165938642]                     Результат ⁼ 'в дочерние строки заказа "' ←
      404[165938643]                     Результат ≡ <<Строка>> ∙ 367[6] ←
      411[165937621]                       Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[165937623]                         Уточняющий параметр ≡ Имя ∙ 249[262146] ←
      404[165938645]                     Результат ⁼ '"?' ←
      424[165937171]                   Иначе ←
      404[165938638]                     Результат ⁼ 'Вы хотите поставить количество ' ←
      404[165938639]                     Результат ≡ Внести Количество ∙ 65545[165937523] ←
      404[165938640]                     Результат ⁼ ' в дочерние строки заказа "' ←
      404[165938649]                     Результат ≡ <<Строка>> ∙ 367[6] ←
      411[165937624]                       Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[165937625]                         Уточняющий параметр ≡ Имя ∙ 249[262146] ←
      404[165938644]                     Результат ⁼ '"?' ←
    65545[165937523]             Локальная переменная • Внести Количество ≡ Целое без знака ∙ 107[262146] ←
 30867463[165937161]           Выполнить действия ←
 12124190[165937154]             Форма ввода • Количество ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[165937154]               Список полей формы ←
      598[165937158]                 Поле (колонка) для ввода данных • Количество ≡ Внести Количество ∙ 65545[165937523] ←
      328[165937153]                   Обязательно неотрицательное значение (для числовых полей только) ≡ Да ∙ 534[40566785] ←
      323[165937153]                   Обязательное для ввода поле ≡ Да ∙ 534[40566785] ←
 11010088[165937303]             ВЫПОЛНИТЬ ≡ Сохранить значения переменных в профиль ∙ 249[1507537] ←
  1507716[165937165]               Переменная ≡ Внести Количество ∙ 65545[165937523] ←
 11010093[165937202]             Комментарий • Не работает "выделение" строк через пробел в этом и есть ошибка ←
  1507360[165937247]             Отбор данных (по запросу) ≡ Выбранные строки ∙ 12124205[40043107] ←
 30867466[165937277]               Выполнить после получения записи ←
 11010080[165937999]                 = ≡ Строка из коллекции ∙ 65545[165937604] ←
      404[165939190]                   Результат ≡ СТРОКА ∙ 1507335[40045956] ←
 11010088[165937418]                 ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[165937202]                   Выражение ←
      404[165939169]                     Результат ⁼ 'Изменить количество: ' ←
      404[165939170]                     Результат ≡ Внести Количество ∙ 65545[165937523] ←
      404[165939171]                     Результат ⁼ ' во всех дочерних строках: ' ←
      404[165939172]                     Результат ≡ Строка из коллекции ∙ 65545[165937604] ←
      411[165937848]                       Уточняющий параметр ≡ Наименование + UID ∙ 117[165478701] ←
  1507360[165937248]                 Отбор данных (по запросу) • Из строки получить ТТ ←
  1507673[165937184]                   Ключи оптимизации ←
  1507675[165937188]                     Использовать индекс ∙ 12124204[165937222] ←
  1507676[165937187]                       Уточняющий параметр ≡ По родителю ∙ 1507445[1507403] ←
 12124213[165937210]                   Параметры ←
  1507335[165937258]                     Параметр • Строка ТТ для поиска детей ∙ 12124204[165937222] ←
  1507494[165937583]                       Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
 12124200[165937205]                   From         (Таблицы) ←
 12124204[165937222]                     Таблица ≡ Строка (объект БД) ∙ 108[6] ←
 12124215[165937224]                   Where      (Ограничения на отбор данных) ←
  1507376[165937425]                     Выражение ←
  1507455[165937491]                       Результат ∙ 12124204[165937222] ←
  1507494[165937584]                         Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[165937454]                       Равно ←
  1507452[165937302]                       Константа ≡ Строка из коллекции ∙ 65545[165937604] ←
      411[165937849]                         Уточняющий параметр ≡ Строка (объект БД) ∙ 359[1] ←
  1507376[165937426]                     Выражение ←
  1507455[165937492]                       Результат ∙ 12124204[165937222] ←
  1507494[165937585]                         Уточняющий параметр ≡ Тип ∙ 359[4] ←
  1638473[165937455]                       Равно ←
  1507488[165937219]                       Константа (Ограничение по классу, типу, плану счетов) ≡ Строка сводного заказа товаров поставщику ТТ [магазин] ∙ 360[656080910] ←
  1507376[165937428]                     Выражение ←
  1507455[165937494]                       Результат ∙ 12124204[165937222] ←
  1507494[165937587]                         Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638473[165937457]                       Равно ←
  1507452[165937303]                       Константа ≡ Строка из коллекции ∙ 65545[165937604] ←
      411[165937844]                         Уточняющий параметр ≡ Документ ∙ 359[5] ←
 30867466[165937278]                   Выполнить после получения записи ←
 11010080[165937996]                     = ≡ Строка для поиска ∙ 65545[165937522] ←
      404[165939164]                       Результат ≡ Строка ТТ для поиска детей ∙ 1507335[165937258] ←
 11010105[165937180]                     Индикатор ⁼ Отбор данных... ←
      404[165939165]                       Результат ≡ Строка для поиска ∙ 65545[165937522] ←
      411[165937845]                         Уточняющий параметр ≡ Партнер ∙ 359[9] ←
      411[165937846]                           Уточняющий параметр ≡ Имя ∙ 249[262146] ←
 11010088[165937417]                     ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[165937201]                       Выражение ←
      404[165939166]                         Результат ⁼ ... ←
      404[165939167]                         Результат ≡ Строка для поиска ∙ 65545[165937522] ←
      411[165937847]                           Уточняющий параметр ≡ Наименование + UID ∙ 117[165478701] ←
  1507728[165937172]                     Начало многострочного комментария ←
 11010088[165937416]                     ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[165937170]                       Объект ≡ Строка для поиска ∙ 65545[165937522] ←
      377[165937169]                       Начальные значения полей объекта ←
   131095[165937194]                         Начальное значение поля ≡ Количество ∙ 359[14286852] ←
   327700[165937683]                           Выражение ≡ Внести Количество ∙ 65545[165937523] ←
  1507729[165937172]                     Конец многострочного комментария ←
  1507412[165937169]                     Закрыть индикатор ←
 39780366[165937186]             RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
 30867470[165937371]             IF ←
  1638463[165937410]               Условие ←
      404[165939188]                 Результат ≡ ShowYesNoMsg ∙ 387[59375693] ←
 32505862[165937386]                   Значения формальных параметров при вызове ←
 32505860[165937597]                     Значение параметра при вызове процедуры/функции ≡ Текст сообщения ∙ 65545[59378864] ←
   327700[165937686]                       Выражение ≡ MSGBOX ∙ 117[165937196] ←
 32505860[165937598]                     Значение параметра при вызове процедуры/функции ≡ Заголовок ∙ 65545[59378866] ←
   327700[165937687]                       Выражение ⁼ Вы хотите изменить количество? ←
 32505860[165937599]                     Значение параметра при вызове процедуры/функции ≡ По умолчанию выбрать (1 - Yes/Да, 0 - No/Нет) ∙ 65545[63111518] ←
   327700[165937688]                       Выражение ⁼ 0 ←
 30867473[165937233]               ELSE • отмена ←
 11010100[165937167]                 BREAK ←
      103[165937155]         Команда ≡ ------------ ∙ 102[57343] ←
       127[58392620]         Процедура • Округлить выбранные до упаковки вверх ≡ Округлить выбранные до упаковки или паллет вверх ∙ 127[58392619] ←
       127[58392621]         Процедура • Округлить выбранные до паллет вверх ≡ Округлить выбранные до упаковки или паллет вверх ∙ 127[58392619] ←
  32505862[58392841]           Значения формальных параметров при вызове ←
  32505860[58393174]             Значение параметра при вызове процедуры/функции ≡ До упаковок - 0, до паллет - 1 ∙ 65545[58392817] ←
    327700[58393557]               Выражение ⁼ 1 ←
      127[656082403]         Процедура • Тест минимального кванта отгрузки ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
 30867463[656081795]           Выполнить действия ←
 11010088[170459924]             ВЫПОЛНИТЬ ≡ ShowOkMsg ∙ 127[39780363] ←
 11010095[170459614]               Выражение ←
      404[170466877]                 Результат ≡ Минимальный квант отгрузки ∙ 249[170459148] ←
 32505862[170459947]                   Значения формальных параметров при вызове ←
 32505860[170460683]                     Значение параметра при вызове процедуры/функции ≡ фп обяз Товар ∙ 65545[170460321] ←
   327700[170461978]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[170460573]                         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 32505860[170460684]                     Значение параметра при вызове процедуры/функции ≡ фп опц Заказ ∙ 65545[170460325] ←
   327700[170461979]                       Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[170460574]                         Уточняющий параметр ≡ Документ ∙ 359[5] ←
      127[165544020]       Процедура • Создание строки для ФЦ ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
      432[165543951]         Использование (в режиме выполнения) ≡ Да, только если все условия соблюдены ∙ 534[1] ←
  1507508[165544221]           Если истинно выражение ≡ Фасовочный цех? ∙ 65545[165544754] ←
       12[165543943]         Иконка ≡ Insert record ∙ 90[72] ←
 30867463[165543973]         Выполнить действия ←
 39780366[165543961]           RETURN ≡ Создать новую запись ∙ 102[57090] ←
   131079[144441390]     Список горячих клавиш ←
   131082[655294515]       Назначение клавиши ≡ SPACE ∙ 131080[1507329] ←
      103[655294882]         Команда ≡ USER 1 ∙ 102[57201] ←
   131082[144441465]       Назначение клавиши ≡ GMINUS ∙ 131080[262145] ←
      103[144441779]         Команда ≡ USER 4 ∙ 102[57204] ←
    131082[40370262]       Назначение клавиши ≡ END ∙ 131080[13] ←
       103[40370787]         Команда ≡ ПОМЕТИТЬ ТЕКУЩУЮ СТРОКУ СПИСКА ∙ 102[53276] ←
   131082[655294516]       Назначение клавиши ≡ GPLUS ∙ 131080[107] ←
      103[655294887]         Команда ≡ USER 5 ∙ 102[57205] ←
   131082[655294544]       Назначение клавиши ∙ 131080[144179202] ←
      103[655295250]         Команда ≡ USER 6 ∙ 102[57206] ←
   131082[164888631]       Назначение клавиши ≡ INSERT ∙ 131080[45] ←
      103[164888592]         Команда ≡ ------------ ∙ 102[57343] ←
 32505857[655294471]       Наследуемые назначения клавиш ←
  1507708[144441352]     Цвет шрифта ≡ Цвет ∙ 65545[144447117] ←
   1507709[40370178]     Шрифт ≡ Шрифт ∙ 117[40371377] ←
  1507710[655294487]     Цвет фона ≡ Фон ∙ 117[655294602] ←
