ETK\Admin

      371[164364503]   Вид просмотра • Строки документа распродажи остатков после акции ≡ СТРОКИ (ТОРГОВАЯ СЕТЬ) ∙ 371[40044060] ←
 32505862[164367791]     Значения формальных параметров при вызове ←
 32505860[164371522]       Значение параметра при вызове процедуры/функции ≡ Фильтр.  UID документа(ов) ∙ 65545[1510142] ←
   327700[164374447]         Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164371523]       Значение параметра при вызове процедуры/функции ≡ Список типов создаваемых объектов ∙ 65545[1510123] ←
   327700[164374448]         Выражение ≡ Строка документа распродажи остатков после акции ∙ 360[164364323] ←
 32505860[164371525]       Значение параметра при вызове процедуры/функции ≡ Фильтр.Список типов ∙ 65545[1510122] ←
   327700[164374449]         Выражение ≡ Строка документа распродажи остатков после акции ∙ 360[164364323] ←
 32505863[164364696]     Локальные переменные ←
    65545[164369287]       Локальная переменная • КЯ (для сортировки) ≡ Короткая строка (12 символов) ∙ 107[2293761] ←
    65545[164369288]       Локальная переменная • Наименование товара (для сортировки) ≡ Наименование объекта (80) ∙ 107[262147] ←
    65545[164369289]       Локальная переменная • Товар ≡ Продукт ∙ 107[7] ←
    65545[164369291]       Локальная переменная • Строка ПРОМО ≡ Строка (объект БД) ∙ 107[10] ←
    65545[164369294]       Локальная переменная • Оборачиваемость ≡ Число ∙ 107[4] ←
    65545[164369296]       Локальная переменная • Закупочная цена в акцию ≡ Число ∙ 107[4] ←
    65545[164369297]       Локальная переменная • Наценка в акцию ≡ Число ∙ 107[4] ←
    65545[164369301]       Локальная переменная • Регулярная наценка ≡ Число ∙ 107[4] ←
    65545[164369677]       Локальная переменная • ТТ ≡ Партнер ∙ 107[5] ←
    65545[164369676]       Локальная переменная • ТЗ ≡ Партнер ∙ 107[5] ←
 30867495[164364446]       Группа локальных переменных • Расчетные параметры ←
    65545[164369675]         Локальная переменная • Продажи в акцию ≡ Число ∙ 107[4] ←
      355[164365380]           Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164369678]         Локальная переменная • Остаток ≡ Число ∙ 107[4] ←
      355[164365381]           Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164369679]         Локальная переменная • Средненедельные продажи без акции ≡ Число ∙ 107[4] ←
      355[164365382]           Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164369680]         Локальная переменная • Ближайший срок годности партии ≡ Дата ∙ 107[3] ←
      355[164365383]           Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164369681]         Локальная переменная • Розничная цена в акцию ≡ Число ∙ 107[4] ←
      355[164365384]           Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164369682]         Локальная переменная • Регулярная закупочная цена ≡ Число ∙ 107[4] ←
      355[164365385]           Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164369683]         Локальная переменная • Регулярная розничная цена ≡ Число ∙ 107[4] ←
      355[164365386]           Начальное значение ≡ NULL ∙ 117[30670850] ←
    65545[164369686]       Локальная переменная • Цвет шрифта ≡ Объект ∙ 107[19] ←
    65545[164369687]       Локальная переменная • Цвет фона ≡ Объект ∙ 107[19] ←
  1507710[164364391]     Цвет фона ≡ Цвет фона ∙ 65545[164369687] ←
      247[164364412]     Список полей просмотра ←
      590[164365408]       Поле (колонка), являющееся параметром объекта • КЯ ≡ КЯ (для сортировки) ∙ 65545[164369287] ←
      326[164364704]         Минимально возможная ширина ⁼ 10 ←
      590[164365410]       Поле (колонка), являющееся параметром объекта • Наименование ≡ Наименование товара (для сортировки) ∙ 65545[164369288] ←
      326[164364705]         Минимально возможная ширина ⁼ 10 ←
      590[164365409]       Поле (колонка), являющееся параметром объекта • Код ≡ <<Строка>> ∙ 367[6] ←
      326[164364706]         Минимально возможная ширина ⁼ 10 ←
      411[164373569]         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[164373618]           Уточняющий параметр ≡ Код ∙ 305[5] ←
      590[164365426]       Поле (колонка), являющееся параметром объекта • ШК ≡ <<Строка>> ∙ 367[6] ←
      326[164364707]         Минимально возможная ширина ⁼ 10 ←
      411[164373590]         Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[164373704]           Уточняющий параметр ≡ Штрих-код по товару (по дата создания) ∙ 249[164233219] ←
 32505862[164367813]             Значения формальных параметров при вызове ←
 32505860[164371590]               Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[164233600] ←
   327700[164374529]                 Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164373705]                   Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      590[164365362]       Поле (колонка), являющееся параметром объекта • Продажи в акцию ≡ Продажи в акцию ∙ 65545[164369675] ←
      326[164364708]         Минимально возможная ширина ⁼ 10 ←
      590[164365428]       Поле (колонка), являющееся параметром объекта • Остаток ≡ Остаток ∙ 65545[164369678] ←
      326[164364709]         Минимально возможная ширина ⁼ 10 ←
      590[164365364]       Поле (колонка), являющееся параметром объекта • Средненедельные продажи без акции ≡ Средненедельные продажи без акции ∙ 65545[164369679] ←
      326[164364710]         Минимально возможная ширина ⁼ 10 ←
      590[164365363]       Поле (колонка), являющееся параметром объекта • Оборачиваемость ≡ Оборачиваемость ∙ 65545[164369294] ←
      326[164364711]         Минимально возможная ширина ⁼ 10 ←
      590[164365427]       Поле (колонка), являющееся параметром объекта • Ближайший срок годности партии ≡ Ближайший срок годности партии ∙ 65545[164369680] ←
      326[164364712]         Минимально возможная ширина ⁼ 10 ←
      590[164364880]       Поле (колонка), являющееся параметром объекта • Закупочная цена в акцию ≡ Закупочная цена в акцию ∙ 65545[164369296] ←
      326[164364713]         Минимально возможная ширина ⁼ 10 ←
      590[164365286]       Поле (колонка), являющееся параметром объекта • Розничная цена в акцию ≡ Розничная цена в акцию ∙ 65545[164369681] ←
      326[164364714]         Минимально возможная ширина ⁼ 10 ←
      590[164365431]       Поле (колонка), являющееся параметром объекта • Наценка в акцию ≡ Наценка в акцию ∙ 65545[164369297] ←
      326[164364715]         Минимально возможная ширина ⁼ 10 ←
      590[164365338]       Поле (колонка), являющееся параметром объекта • Регулярная закупочная цена ≡ Регулярная закупочная цена ∙ 65545[164369682] ←
      326[164364716]         Минимально возможная ширина ⁼ 10 ←
      590[164365411]       Поле (колонка), являющееся параметром объекта • Регулярная розничная цена ≡ Регулярная розничная цена ∙ 65545[164369683] ←
      326[164364717]         Минимально возможная ширина ⁼ 10 ←
      590[164365432]       Поле (колонка), являющееся параметром объекта • Регулярная наценка ≡ Регулярная наценка ∙ 65545[164369301] ←
      326[164364718]         Минимально возможная ширина ⁼ 10 ←
      590[164365483]       Поле (колонка), являющееся параметром объекта • Цена уценки ≡ Цена розничная ∙ 359[15007746] ←
      326[164364719]         Минимально возможная ширина ⁼ 10 ←
      590[164365501]       Поле (колонка), являющееся параметром объекта • Создать уценку ≡ Требует обработки ∙ 359[2818057] ←
      326[164364723]         Минимально возможная ширина ⁼ 10 ←
      411[164374329]         Уточняющий параметр ≡ Имя ∙ 249[262146] ←
      590[164365499]       Поле (колонка), являющееся параметром объекта ≡ Дата начала ∙ 359[14745601] ←
      326[164364721]         Минимально возможная ширина ⁼ 10 ←
   131097[164364822]         Формат ≡ Дата без времени ∙ 131096[131073] ←
      590[164365500]       Поле (колонка), являющееся параметром объекта ≡ Дата окончания ∙ 359[14745602] ←
      326[164364722]         Минимально возможная ширина ⁼ 10 ←
   131097[164364823]         Формат ≡ Дата без времени ∙ 131096[131073] ←
  1507413[164364337]     Блоки действий ←
 30867469[164365385]       БЛОК • Выбор всех строк ←
  1507417[164364289]         Удалить из таблицы ≡ ВЫБРАННЫЕ СТРОКИ ∙ 1507433[40042581] ←
  1507360[164365706]         Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[164368094]           Значения формальных параметров при вызове ←
 32505860[164372202]             Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164375542]               Выражение ≡ <<Документ>> ∙ 367[5] ←
 12124215[164364943]           Where      (Ограничения на отбор данных) ←
  1507381[164364843]             <Наследуемые ограничения> ←
      413[164366148]             И ←
  1507376[164365803]             Выражение ←
  1507455[164365766]               Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164366585]                 Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[164366601]               Равно ←
  1638402[164365463]               NULL ←
 30867466[164365965]           Выполнить после получения записи ←
 11010105[164364557]             Индикатор ←
      116[164367900]               Выражение ←
      404[164394630]                 Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
  1507418[164364303]             Добавить в таблицу ≡ ВЫБРАННЫЕ СТРОКИ ∙ 1507433[40042581] ←
  1507571[164364311]               Начальные значения полей объекта ←
  1507573[164364326]                 Начальное значение поля ≡ СТРОКА ∙ 1507443[40042995] ←
   327700[164375543]                   Выражение ≡ Строка.Строка ∙ 1507335[1508504] ←
  1507412[164364382]         Закрыть индикатор ←
 11010080[164374322]         = ≡ Есть выбранные строки ∙ 65545[40054728] ←
      404[164394631]           Результат ⁼ 1 ←
 39780366[164365142]         RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
 30867469[164365386]       БЛОК • Отмена выбора всех строк ←
  1507360[164365707]         Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[164368095]           Значения формальных параметров при вызове ←
 32505860[164372203]             Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164375544]               Выражение ≡ <<Документ>> ∙ 367[5] ←
 12124215[164364944]           Where      (Ограничения на отбор данных) ←
  1507381[164364844]             <Наследуемые ограничения> ←
      413[164366149]             И ←
  1507376[164365804]             Выражение ←
  1507455[164365767]               Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164366586]                 Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[164366602]               Равно ←
  1638402[164365464]               NULL ←
 30867466[164365966]           Выполнить после получения записи ←
 11010105[164364558]             Индикатор ←
      116[164367901]               Выражение ←
      404[164394632]                 Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 11010080[164374323]             = ≡ Созданная строка ∙ 381[12189697] ←
      404[164394633]               Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
  1507417[164364291]             Удалить из таблицы ≡ ВЫБРАННЫЕ СТРОКИ ∙ 1507433[40042581] ←
 12124215[164364945]               Where      (Ограничения на отбор данных) ←
  1507376[164365805]                 Выражение ←
  1507455[164365768]                   Результат ≡ ВЫБРАННЫЕ СТРОКИ ∙ 1507433[40042581] ←
  1507494[164366587]                     Уточняющий параметр ≡ СТРОКА ∙ 1507443[40042995] ←
  1638473[164366603]                   Равно ←
  1507452[164365412]                   Константа ≡ Созданная строка ∙ 381[12189697] ←
 11010080[164374324]         = ≡ Есть выбранные строки ∙ 65545[40054728] ←
  1638402[164365465]           NULL ←
 39780366[164365143]         RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
 30867483[164364408]     Локальные таблицы ←
 30867458[164364492]       Локальная таблица • Строки ←
 11010090[164364490]         Структура (Поля, сортировка, генерируемые события) ←
 30867475[164365431]           Параметр ≡ Наименование товара (для сортировки) ∙ 65545[164369288] ←
 30867476[164364722]             Сортировать по возрастанию ←
 30867475[164365430]           Параметр ≡ КЯ (для сортировки) ∙ 65545[164369287] ←
 30867476[164364721]             Сортировать по возрастанию ←
 30867475[164365429]           Параметр ≡ <<Строка>> ∙ 367[6] ←
 30867476[164364723]             Сортировать по возрастанию ←
 30867475[164365432]           Параметр ≡ Строка ПРОМО ∙ 65545[164369291] ←
 30867476[164364724]             Сортировать по возрастанию ←
 30867458[164364507]       Локальная таблица • КЯ ←
 11010103[164364382]         Исключать дублирующиеся записи ←
 11010090[164364505]         Структура (Поля, сортировка, генерируемые события) ←
 30867475[164365506]           Параметр ≡ КЯ (для сортировки) ∙ 65545[164369287] ←
 30867476[164364753]             Сортировать по возрастанию ←
 30867475[164365509]           Параметр ≡ ТТ ∙ 65545[164369677] ←
 30867475[164365508]           Параметр ≡ ТЗ ∙ 65545[164369676] ←
  1507614[164364374]     Отбор данных ←
 11010104[164364372]       Очистить локальную таблицу ≡ Строки ∙ 30867458[164364492] ←
  1507360[164365597]       Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[164367800]         Значения формальных параметров при вызове ←
 32505860[164371548]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164374472]             Выражение ≡ <<Документ>> ∙ 367[5] ←
 32505860[164371549]           Значение параметра при вызове процедуры/функции ≡ Фильтр.Типы ∙ 65545[1510100] ←
   327700[164374473]             Выражение ≡ Строка документа распродажи остатков после акции ∙ 360[164364323] ←
 12124215[164364895]         Where      (Ограничения на отбор данных) ←
  1507381[164364799]           <Наследуемые ограничения> ←
      413[164365966]           И ←
  1507376[164365667]           Выражение ←
  1507455[164365636]             Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164366379]               Уточняющий параметр ≡ Родитель ∙ 359[2] ←
  1638473[164366346]             Равно ←
  1638402[164365310]             NULL ←
 30867466[164365830]         Выполнить после получения записи ←
 11010080[164373651]           = ≡ <<Строка>> ∙ 367[6] ←
      404[164392242]             Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 11010080[164373754]           = ≡ Строка ПРОМО ∙ 65545[164369291] ←
      404[164392805]             Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[164373729]               Уточняющий параметр ≡ Дополнительная строка ∙ 359[11534337] ←
 11010080[164373751]           = ≡ КЯ (для сортировки) ∙ 65545[164369287] ←
      404[164392796]             Результат ⁼ 'КЯ' ←
      404[164394600]             Результат ≡ Дополнить символами слева ∙ 387[1507468] ←
 32505862[164368084]               Значения формальных параметров при вызове ←
 32505860[164372179]                 Значение параметра при вызове процедуры/функции ≡ Выражение ∙ 65545[1511658] ←
   327700[164375515]                   Выражение ≡ <<Строка>> ∙ 367[6] ←
      411[164373723]                     Уточняющий параметр ≡ Партнер ∙ 359[9] ←
      411[164373724]                       Уточняющий параметр ≡ Код региона ∙ 283[14745627] ←
 32505860[164372194]                 Значение параметра при вызове процедуры/функции ≡ Дополнить до длины ∙ 65545[1511659] ←
   327700[164375530]                   Выражение ⁼ 2 ←
 32505860[164372195]                 Значение параметра при вызове процедуры/функции ≡ Cимвол-заполнитель ∙ 65545[1511660] ←
   327700[164375531]                   Выражение ⁼ '0' ←
 11010080[164374314]           = ≡ ТТ ∙ 65545[164369677] ←
      404[164394599]             Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164374311]               Уточняющий параметр ≡ Партнер ∙ 359[9] ←
 11010080[164373752]           = ≡ Наименование товара (для сортировки) ∙ 65545[164369288] ←
      404[164392797]             Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164373725]               Уточняющий параметр ≡ Продукт ∙ 359[8] ←
      411[164373726]                 Уточняющий параметр ≡ Наименование ∙ 305[6] ←
 11010092[164364572]           Добавить в локальную таблицу ≡ Строки ∙ 30867458[164364492] ←
 11010092[164364594]           Добавить в локальную таблицу ≡ КЯ ∙ 30867458[164364507] ←
 30867477[164364545]       Отбор данных из локальной таблицы ≡ КЯ ∙ 30867458[164364507] ←
 30867466[164365961]         Выполнить после получения записи ←
 11010080[164374315]           = ≡ ТЗ ∙ 65545[164369676] ←
      404[164394598]             Результат ≡ Первый ТЗ/ПЦ для ЦО/ТТ/Узла (действ. магазины) ∙ 249[655294491] ←
 32505862[164368090]               Значения формальных параметров при вызове ←
 32505860[164372193]                 Значение параметра при вызове процедуры/функции ≡ ~ТТ ∙ 65545[58392606] ←
   327700[164375529]                   Выражение ≡ ТТ ∙ 65545[164369677] ←
  1507625[164364294]           Изменить локальную таблицу ≡ КЯ ∙ 30867458[164364507] ←
 30867477[164364529]       Отбор данных из локальной таблицы ≡ Строки ∙ 30867458[164364492] ←
 30867466[164365863]         Выполнить после получения записи ←
 11010105[164364545]           Индикатор ←
      116[164367568]             Выражение ←
      404[164392733]               Результат ≡ КЯ (для сортировки) ∙ 65545[164369287] ←
      404[164392734]               Результат ⁼ ; ←
      404[164392775]               Результат ≡ Наименование товара (для сортировки) ∙ 65545[164369288] ←
 11010080[164373753]           = ≡ Товар ∙ 65545[164369289] ←
      404[164392806]             Результат ≡ <<Строка>> ∙ 367[6] ←
      411[164373728]               Уточняющий параметр ≡ Продукт ∙ 359[8] ←
 11010091[164364290]           Получить из локальной таблицы ≡ КЯ ∙ 30867458[164364507] ←
 30867469[164365384]           БЛОК • Расчет ←
 11010080[164374306]             = ≡ Продажи в акцию ∙ 65545[164369675] ←
      404[164394590]               Результат ≡ Реализация (ШТ) (по Списку подразделений) БАЗОВЫЙ ∙ 249[40370265] ←
 32505862[164368082]                 Значения формальных параметров при вызове ←
 32505860[164372170]                   Значение параметра при вызове процедуры/функции ≡ Список подразделений ∙ 65545[40374818] ←
   327700[164375506]                     Выражение ≡ ТЗ ∙ 65545[164369676] ←
 32505860[164372171]                   Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[40374815] ←
   327700[164375507]                     Выражение ≡ Товар ∙ 65545[164369289] ←
 32505860[164372172]                   Значение параметра при вызове процедуры/функции ≡ Дата начальная ∙ 65545[40374816] ←
   327700[164375508]                     Выражение ≡ Строка ПРОМО ∙ 65545[164369291] ←
      411[164374300]                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164374301]                         Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
 32505860[164372173]                   Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[40374817] ←
   327700[164375509]                     Выражение ≡ Строка ПРОМО ∙ 65545[164369291] ←
      411[164374302]                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164374303]                         Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 11010080[164374310]             = ≡ Остаток ∙ 65545[164369678] ←
      404[164394594]               Результат ≡ Остатки баз. товара (ШТ)                   [по Списку подразделений] ∙ 249[40370223] ←
 32505862[164368086]                 Значения формальных параметров при вызове ←
 32505860[164372182]                   Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[40373218] ←
   327700[164375518]                     Выражение ≡ Товар ∙ 65545[164369289] ←
 32505860[164372183]                   Значение параметра при вызове процедуры/функции ≡ Список подразделений ∙ 65545[40373216] ←
   327700[164375519]                     Выражение ≡ ТЗ ∙ 65545[164369676] ←
 11010080[164374316]             = ≡ Средненедельные продажи без акции ∙ 65545[164369679] ←
      404[164394601]               Результат ≡ Средненедельная реализация ∙ 249[164364380] ←
 32505862[164368083]                 Значения формальных параметров при вызове ←
 32505860[164372175]                   Значение параметра при вызове процедуры/функции ≡ ТЗ ∙ 65545[164369275] ←
   327700[164375511]                     Выражение ≡ ТЗ ∙ 65545[164369676] ←
 32505860[164372176]                   Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164369279] ←
   327700[164375512]                     Выражение ≡ Товар ∙ 65545[164369289] ←
 32505860[164372177]                   Значение параметра при вызове процедуры/функции ≡ Дата конечная ∙ 65545[164369278] ←
   327700[164375513]                     Выражение ≡ Строка ПРОМО ∙ 65545[164369291] ←
      411[164373807]                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164374304]                         Уточняющий параметр ≡ Дата начальная ∙ 331[14745601] ←
 32505860[164372178]                   Значение параметра при вызове процедуры/функции ≡ Количество недель ∙ 65545[164369276] ←
   327700[164375514]                     Выражение ⁼ 8 ←
  1507728[164364710]             Начало многострочного комментария ←
 11010080[164374309]             = ≡ Ближайший срок годности партии ∙ 65545[164369680] ←
      404[656106342]               Результат ≡ Срок годности (минимальный) по оборотам ∙ 249[164429871] ←
 32505862[656083321]                 Значения формальных параметров при вызове ←
 32505860[656085950]                   Значение параметра при вызове процедуры/функции ≡ Товар ∙ 65545[164431718] ←
   327700[656088375]                     Выражение ≡ Товар ∙ 65545[164369289] ←
 32505860[656085951]                   Значение параметра при вызове процедуры/функции ≡ Подразделения ∙ 65545[164431719] ←
   327700[656088392]                     Выражение ≡ ТЗ ∙ 65545[164369676] ←
  1507729[164364710]             Конец многострочного комментария ←
 11010080[164374311]             = ≡ Розничная цена в акцию ∙ 65545[164369681] ←
      404[164394595]               Результат ≡ Цена из реестра цен на дату по партнеру (через параметр) ∙ 249[40370272] ←
 32505862[164368087]                 Значения формальных параметров при вызове ←
 32505860[164372184]                   Значение параметра при вызове процедуры/функции ≡ фп Продукт ∙ 65545[40375122] ←
   327700[164375520]                     Выражение ≡ Товар ∙ 65545[164369289] ←
 32505860[164372185]                   Значение параметра при вызове процедуры/функции ≡ фп Партнер (Коммерческий отдел) ∙ 65545[40375123] ←
   327700[164375521]                     Выражение ≡ ТТ ∙ 65545[164369677] ←
      411[164373565]                       Уточняющий параметр ≡ Подразделение для назначения цен ∙ 283[42401850] ←
 32505860[164372186]                   Значение параметра при вызове процедуры/функции ≡ фп Дата ∙ 65545[40375125] ←
   327700[164375522]                     Выражение ≡ Строка ПРОМО ∙ 65545[164369291] ←
      411[164374306]                       Уточняющий параметр ≡ Документ ∙ 359[5] ←
      411[164374307]                         Уточняющий параметр ≡ Дата конечная ∙ 331[14745602] ←
 11010080[164374313]             = ≡ Регулярная розничная цена ∙ 65545[164369683] ←
      404[164394597]               Результат ≡ Цена из ДУЦ на дату ∙ 249[164364356] ←
 32505862[164368089]                 Значения формальных параметров при вызове ←
 32505860[164372190]                   Значение параметра при вызове процедуры/функции ≡ Товар из реестра ∙ 65545[164368290] ←
   327700[164375526]                     Выражение ≡ Товар ∙ 65545[164369289] ←
 32505860[164372191]                   Значение параметра при вызове процедуры/функции ≡ ЦО ∙ 65545[164368297] ←
   327700[164375527]                     Выражение ≡ ТТ ∙ 65545[164369677] ←
      411[164374310]                       Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
 32505860[164372192]                   Значение параметра при вызове процедуры/функции ≡ Дата ∙ 65545[164368296] ←
   327700[164375528]                     Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
 32505860[164372174]                   Значение параметра при вызове процедуры/функции ≡ Розничная цена ∙ 65545[164369684] ←
   327700[164375510]                     Выражение ≡ Регулярная закупочная цена ∙ 65545[164369682] ←
  1507728[164364711]             Начало многострочного комментария ←
 11010080[164374312]             = ≡ Регулярная закупочная цена ∙ 65545[164369299] ←
      404[164394596]               Результат ≡ Цена из прайслиста на дату по партнеру, подразделению (через параметр) - возвращает прайс ∙ 249[656080897] ←
 32505862[164368088]                 Значения формальных параметров при вызове ←
 32505860[164372187]                   Значение параметра при вызове процедуры/функции ≡ Продукт ∙ 65545[656081957] ←
   327700[164375523]                     Выражение ≡ Товар ∙ 65545[164369289] ←
 32505860[164372188]                   Значение параметра при вызове процедуры/функции ≡ Подразделения ∙ 65545[656081959] ←
   327700[164375524]                     Выражение ≡ ТТ ∙ 65545[164369677] ←
      411[164374308]                       Уточняющий параметр ≡ Распределительный центр, с которого будут поставки ∙ 283[28835882] ←
 32505860[164372189]                   Значение параметра при вызове процедуры/функции ≡ Поставщики ∙ 65545[656081958] ←
   327700[164375525]                     Выражение ≡ Товар ∙ 65545[164369289] ←
      411[164374309]                       Уточняющий параметр ≡ Поставщик ∙ 305[11] ←
  1507729[164364711]             Конец многострочного комментария ←
 11010080[164373758]           = ≡ Оборачиваемость ∙ 65545[164369294] ←
      404[164392810]             Результат ≡ Остаток ∙ 65545[164369678] ←
      402[164364493]             Делить ←
      404[164392811]             Результат ≡ Средненедельные продажи без акции ∙ 65545[164369679] ←
 11010080[164373760]           = ≡ Закупочная цена в акцию ∙ 65545[164369296] ←
      404[164392813]             Результат ≡ Строка ПРОМО ∙ 65545[164369291] ←
      411[164373739]               Уточняющий параметр ≡ Цена закупочная ∙ 359[15007745] ←
 11010080[164373762]           = ≡ Наценка в акцию ∙ 65545[164369297] ←
      116[164367579]             Выражение ←
      116[164367578]               Выражение ←
      404[164392815]                 Результат ≡ Розничная цена в акцию ∙ 65545[164369681] ←
      402[164364494]                 Делить ←
      404[164392816]                 Результат ≡ Закупочная цена в акцию ∙ 65545[164369296] ←
      406[164364948]               Вычесть ←
      404[164392817]               Результат ⁼ 1 ←
      403[164364684]             Умножить ←
      404[164392818]             Результат ⁼ 100 ←
 11010080[164373766]           = ≡ Регулярная наценка ∙ 65545[164369301] ←
      116[164367580]             Выражение ←
      116[164367581]               Выражение ←
      404[164392821]                 Результат ≡ Регулярная розничная цена ∙ 65545[164369683] ←
      402[164364495]                 Делить ←
      404[164392822]                 Результат ≡ Регулярная закупочная цена ∙ 65545[164369682] ←
      406[164364949]               Вычесть ←
      404[164392823]               Результат ⁼ 1 ←
      403[164364685]             Умножить ←
      404[164392824]             Результат ⁼ 100 ←
 11010088[164366893]           ВЫПОЛНИТЬ ≡ Список данных.Добавить запись ∙ 387[1507440] ←
  1507412[164364376]       Закрыть индикатор ←
  1507618[164364309]     Обработка команд ←
  1507410[164365139]       ВЫПОЛНИТЬ БЛОК ≡ Дополнительный обработчик команд ∙ 30867469[40045431] ←
 11010079[164364582]       CASE ←
  1572877[164364618]         Условие ←
      404[164394622]           Результат ≡ Список данных.Команда ∙ 387[1507439] ←
 11010081[164365456]         OF • Выбрать/Отм. выбор ≡ USER 1 ∙ 102[57201] ←
  1507410[164365140]           ВЫПОЛНИТЬ БЛОК ≡ Выбор строки ∙ 30867469[40045635] ←
 11010081[164365457]         OF • Выбрать все ≡ USER 2 ∙ 102[57202] ←
  1507410[164365141]           ВЫПОЛНИТЬ БЛОК ≡ Выбор всех строк ∙ 30867469[164365210] ←
 11010081[164365458]         OF • Отменить выбор ≡ USER 3 ∙ 102[57203] ←
  1507410[164365142]           ВЫПОЛНИТЬ БЛОК ≡ Отмена выбора всех строк ∙ 30867469[164365244] ←
 11010081[164365459]         OF • Отмена фильтров ≡ USER 10 ∙ 102[57210] ←
  1507410[164365143]           ВЫПОЛНИТЬ БЛОК ≡ Отмена фильтров ∙ 30867469[40044141] ←
  1507410[164365144]           ВЫПОЛНИТЬ БЛОК ≡ Отмена фильтров (Дополнительно 1) ∙ 30867469[40045227] ←
 39780366[164365140]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
  1507410[164365145]       ВЫПОЛНИТЬ БЛОК ≡ Стандартный обработчик команд ∙ 30867469[1510294] ←
      212[164364368]     Сценарий ←
      104[164364345]       <Наследуемые пункты> ←
      103[164364644]       Команда • Выделить все ≡ USER 2 ∙ 102[57202] ←
       12[164364518]         Иконка ≡ Выбрать все ∙ 90[21] ←
      103[164364645]       Команда • Отменить выделение ≡ USER 3 ∙ 102[57203] ←
       12[164364519]         Иконка ≡ Отменить все ∙ 90[786433] ←
      127[164364983]       Процедура • Проставить цену ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
       12[164364508]         Иконка ≡ Запрос ∙ 90[12189697] ←
 32505863[164364713]         Локальные переменные ←
    65545[164369688]           Локальная переменная • Строка текущего документа ≡ Строка (объект БД) ∙ 107[10] ←
    65545[164369689]           Локальная переменная • Новая цена ≡ Число ∙ 107[4] ←
    65545[164369690]           Локальная переменная • Дата начала уценки ≡ Дата ∙ 107[3] ←
    65545[164369691]           Локальная переменная • Дата окончания уценки ≡ Дата ∙ 107[3] ←
    65545[164369692]           Локальная переменная • Период уведомления об окончании уценки (дней) ≡ Целое ∙ 107[2] ←
      355[164365387]             Начальное значение ⁼ 7 ←
 30867463[164364965]         Выполнить действия ←
 12124190[164364446]           Форма ввода • Новая цена ≡ ФОРМА ОТЧЕТА ∙ 299[65537] ←
      245[164364538]             Список полей формы ←
      598[164365708]               Поле (колонка) для ввода данных • Новая цена ≡ Новая цена ∙ 65545[164369689] ←
      598[164365709]               Поле (колонка) для ввода данных ≡ Дата начала уценки ∙ 65545[164369690] ←
      598[164365710]               Поле (колонка) для ввода данных ≡ Дата окончания уценки ∙ 65545[164369691] ←
      598[164365711]               Поле (колонка) для ввода данных ≡ Период уведомления об окончании уценки (дней) ∙ 65545[164369692] ←
  1507360[164365708]           Отбор данных (по запросу) ≡ Выбранные строки ∙ 12124205[40043107] ←
 30867466[164365967]             Выполнить после получения записи ←
 11010080[164374320]               = ≡ Строка текущего документа ∙ 65545[164369688] ←
      404[164394623]                 Результат ≡ СТРОКА ∙ 1507335[40045956] ←
 11010099[164364844]               CONTINUE ←
      116[164367898]                 Выражение ←
      404[164394624]                   Результат ≡ Строка текущего документа ∙ 65545[164369688] ←
      411[164374324]                     Уточняющий параметр ≡ Документ ∙ 359[5] ←
  1638479[164364973]                   Не равно ←
      404[164394625]                   Результат ≡ <<Документ>> ∙ 367[5] ←
 30867470[164366795]               IF ←
  1638463[164367565]                 Условие ←
      404[164394626]                   Результат ≡ Строка текущего документа ∙ 65545[164369688] ←
      411[164374325]                     Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
  1638479[164364974]                   Не равно ←
      404[164394627]                   Результат ≡ Новая цена ∙ 65545[164369689] ←
 30867472[164366784]                 THEN • Редактируем строку ←
 11010088[164367163]                   ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[164364666]                     Объект ≡ Строка текущего документа ∙ 65545[164369688] ←
      377[164364748]                     Начальные значения полей объекта ←
   131095[164365017]                       Начальное значение поля ≡ Цена розничная ∙ 359[15007746] ←
   327700[164373252]                         Выражение ≡ Новая цена ∙ 65545[164369689] ←
   131095[164365971]                       Начальное значение поля ≡ Требует обработки ∙ 359[2818057] ←
   327700[164375557]                         Выражение ≡ Да ∙ 131203075[131203074] ←
   131095[164365955]                       Начальное значение поля ≡ Дата счета-фактуры ∙ 359[42401811] ←
   327700[164375536]                         Выражение ≡ Текущие дата-время ∙ 249[42467332] ←
   131095[164365956]                       Начальное значение поля ≡ Комментарий ∙ 359[42401830] ←
   327700[164375537]                         Выражение ⁼ Установка уценки ←
   131095[164365957]                       Начальное значение поля ≡ Дата начала ∙ 359[14745601] ←
   327700[164375538]                         Выражение ≡ Дата начала уценки ∙ 65545[164369690] ←
   131095[164365958]                       Начальное значение поля ≡ Дата окончания ∙ 359[14745602] ←
   327700[164375539]                         Выражение ≡ Дата окончания уценки ∙ 65545[164369691] ←
   131095[164365959]                       Начальное значение поля ≡ Окончание ∙ 359[6684675] ←
   327700[164375540]                         Выражение ≡ Период уведомления об окончании уценки (дней) ∙ 65545[164369692] ←
  1507417[164364293]                   Удалить из таблицы ≡ ВЫБРАННЫЕ СТРОКИ ∙ 1507433[40042581] ←
 12124215[164364946]                     Where      (Ограничения на отбор данных) ←
  1507376[164365806]                       Выражение ←
  1507455[164365769]                         Результат ≡ ВЫБРАННЫЕ СТРОКИ ∙ 1507433[40042581] ←
  1507494[164366588]                           Уточняющий параметр ≡ СТРОКА ∙ 1507443[40042995] ←
  1638473[164366600]                         Равно ←
  1507452[164365413]                         Константа ≡ Строка текущего документа ∙ 65545[164369688] ←
 39780366[164365141]           RETURN ≡ ОБНОВИТЬ СОДЕРЖИМОЕ ВСЕГО ЭКРАНА ∙ 102[53263] ←
      127[164364984]       Процедура • Создать документ уценки ≡ { ... скрипт-процедура ... } ∙ 127[39780353] ←
       12[164364520]         Иконка ≡ Add ∙ 90[1507353] ←
 32505863[164364714]         Локальные переменные ←
    65545[164369693]           Локальная переменная • КЯ ≡ Партнер ∙ 107[5] ←
    65545[164369694]           Локальная переменная • Дата начальная периода уценки ≡ Дата ∙ 107[3] ←
    65545[164369695]           Локальная переменная • Дата конечная периода уценки ≡ Дата ∙ 107[3] ←
    65545[164369696]           Локальная переменная • Товар ≡ Продукт ∙ 107[7] ←
    65545[164369697]           Локальная переменная • Цена уценки ≡ Число ∙ 107[4] ←
    65545[164369698]           Локальная переменная • Созданный приказ ≡ Документ ∙ 107[8] ←
    65545[164369699]           Локальная переменная • Созданная строка приказа ≡ Строка (объект БД) ∙ 107[10] ←
    65545[164369700]           Локальная переменная • Текущая строка ≡ Строка (объект БД) ∙ 107[10] ←
 30867483[164364418]         Локальные таблицы ←
 30867458[164364509]           Локальная таблица • Строки для создания уценки ←
 11010090[164364507]             Структура (Поля, сортировка, генерируемые события) ←
 30867481[164364487]               Блок (при отборе данных будет генерироваться это событие) • Период и КЯ ←
 30867475[164365512]                 Параметр ≡ КЯ ∙ 65545[164369693] ←
 30867476[164364755]                   Сортировать по возрастанию ←
 30867475[164365513]                 Параметр ≡ Дата начальная периода уценки ∙ 65545[164369694] ←
 30867476[164364756]                   Сортировать по возрастанию ←
 30867475[164365514]                 Параметр ≡ Дата конечная периода уценки ∙ 65545[164369695] ←
 30867476[164364757]                   Сортировать по возрастанию ←
 30867475[164365515]               Параметр ≡ Товар ∙ 65545[164369696] ←
 30867476[164364758]                 Сортировать по возрастанию ←
 30867475[164365516]               Параметр ≡ Цена уценки ∙ 65545[164369697] ←
 30867475[164365517]               Параметр ≡ Текущая строка ∙ 65545[164369700] ←
 30867463[164364966]         Выполнить действия ←
  1507360[164365705]           Отбор данных (по запросу) ≡ СТРОКИ ∙ 12124205[1507639] ←
 32505862[164367683]             Значения формальных параметров при вызове ←
 32505860[164371283]               Значение параметра при вызове процедуры/функции ≡ Фильтр.Документы ∙ 65545[1510108] ←
   327700[164374088]                 Выражение ≡ <<Документ>> ∙ 367[5] ←
 12124215[164364947]             Where      (Ограничения на отбор данных) ←
  1507381[164364845]               <Наследуемые ограничения> ←
      413[164366150]               И ←
  1507376[164365808]               Выражение ←
  1507455[164365771]                 Результат ≡ СТРОКИ ∙ 12124204[1507792] ←
  1507494[164366590]                   Уточняющий параметр ≡ Требует обработки ∙ 359[2818057] ←
  1638473[164366604]                 Равно ←
  1507452[164365415]                 Константа ≡ Да ∙ 131203075[131203074] ←
 30867466[164365963]             Выполнить после получения записи ←
 11010080[164374332]               = ≡ Текущая строка ∙ 65545[164369700] ←
      404[164394634]                 Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
 11010080[164374325]               = ≡ КЯ ∙ 65545[164369693] ←
      404[164391742]                 Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[164373301]                   Уточняющий параметр ≡ Партнер ∙ 359[9] ←
      411[164373302]                     Уточняющий параметр ≡ Подразделение для назначения цен ∙ 283[42401850] ←
 11010080[164374326]               = ≡ Товар ∙ 65545[164369696] ←
      404[164392885]                 Результат ≡ Строка.Продукт ∙ 1507335[1508517] ←
 11010080[164374327]               = ≡ Дата начальная периода уценки ∙ 65545[164369694] ←
      404[164392886]                 Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[164373303]                   Уточняющий параметр ≡ Дата начала ∙ 359[14745601] ←
 11010080[164374328]               = ≡ Дата конечная периода уценки ∙ 65545[164369695] ←
      404[164394617]                 Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[164373335]                   Уточняющий параметр ≡ Дата окончания ∙ 359[14745602] ←
 11010080[164374329]               = ≡ Цена уценки ∙ 65545[164369697] ←
      404[164394618]                 Результат ≡ Строка.Строка ∙ 1507335[1508504] ←
      411[164373550]                   Уточняющий параметр ≡ Цена розничная ∙ 359[15007746] ←
 11010092[164364595]               Добавить в локальную таблицу ≡ Строки для создания уценки ∙ 30867458[164364509] ←
 30867477[164364546]           Отбор данных из локальной таблицы ≡ Строки для создания уценки ∙ 30867458[164364509] ←
 30867484[164364399]             Выполнить перед обработкой блока ≡ Период и КЯ ∙ 30867481[164364487] ←
 11010080[164374330]               = ≡ Созданный приказ ∙ 65545[164369698] ←
      404[164394619]                 Результат ≡ Объект.Создание ∙ 249[30670863] ←
  6422553[164364435]                   Таблица базы данных ≡ Документ ∙ 108[5] ←
   262178[164364363]                   Тип объекта ≡ Приказ на выделение товаров с постоянной ценой ∙ 332[28835915] ←
      377[164364484]                   Начальные значения полей объекта ←
   131095[164364779]                     Начальное значение поля ≡ Подразделение ∙ 331[5] ←
   327700[164374089]                       Выражение ≡ КЯ ∙ 65545[164369693] ←
   131095[164364989]                     Начальное значение поля ≡ Родитель ∙ 331[2] ←
   327700[164374090]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
   131095[164365016]                     Начальное значение поля ≡ Дата начальная ∙ 331[14745601] ←
   327700[164374091]                       Выражение ≡ Дата начальная периода уценки ∙ 65545[164369694] ←
   131095[164365600]                     Начальное значение поля ≡ Дата конечная ∙ 331[14745602] ←
   327700[164374096]                       Выражение ≡ Дата конечная периода уценки ∙ 65545[164369695] ←
   131095[164365709]                     Начальное значение поля ≡ Состояние заказа поставщика ∙ 331[15204354] ←
   327700[164374097]                       Выражение ≡ Уценка ∙ 655294499[655294465] ←
   131095[164365710]                     Начальное значение поля ≡ Комментарий ∙ 331[11] ←
   327700[164374120]                       Выражение ⁼ ТЕСТ, НЕ ТРОГАТЬ ←
   131095[164365711]                     Начальное значение поля ≡ Сотрудник ∙ 331[14745620] ←
   327700[164374121]                       Выражение ≡ <<Документ>> ∙ 367[5] ←
      411[164373552]                         Уточняющий параметр ≡ Контрагент ∙ 331[7] ←
 11010099[164364845]               CONTINUE ←
      116[164367899]                 Выражение ←
  1638460[164365260]                   НЕ ←
      404[164394620]                   Результат ≡ Созданный приказ ∙ 65545[164369698] ←
 30867466[164365964]             Выполнить после получения записи ←
 11010080[164374331]               = ≡ Созданная строка приказа ∙ 65545[164369699] ←
      404[164394628]                 Результат ≡ Объект.Создание ∙ 249[30670863] ←
  6422553[164364361]                   Таблица базы данных ≡ Строка (объект БД) ∙ 108[6] ←
   262178[164364462]                   Тип объекта ≡ Строка приказа для товаров с постоянной ценой ∙ 360[28835896] ←
      377[164364750]                   Начальные значения полей объекта ←
   131095[164365712]                     Начальное значение поля ≡ Документ ∙ 359[5] ←
   327700[164375534]                       Выражение ≡ Созданный приказ ∙ 65545[164369698] ←
   131095[164365713]                     Начальное значение поля ≡ Подразделение документа ∙ 359[7] ←
   327700[164375554]                       Выражение ≡ КЯ ∙ 65545[164369693] ←
   131095[164365714]                     Начальное значение поля ≡ Продукт ∙ 359[8] ←
   327700[164375555]                       Выражение ≡ Товар ∙ 65545[164369696] ←
   131095[164365972]                     Начальное значение поля ≡ Цена розничная ∙ 359[15007746] ←
   327700[164375558]                       Выражение ≡ Цена уценки ∙ 65545[164369697] ←
 11010088[164367161]               ВЫПОЛНИТЬ ≡ Объект.Редактирование ∙ 249[1507431] ←
 30867474[164364671]                 Объект ≡ Текущая строка ∙ 65545[164369700] ←
      377[164364751]                 Начальные значения полей объекта ←
   131095[164365970]                   Начальное значение поля ≡ Требует обработки ∙ 359[2818057] ←
   327700[164375556]                     Выражение ≡ Нет ∙ 131203075[131203073] ←
 11010107[164364384]             Выполнить после обработки блока ≡ Период и КЯ ∙ 30867481[164364487] ←
 11010088[164367160]               ВЫПОЛНИТЬ ≡ WriteMessageToLog ∙ 127[39780364] ←
 11010095[164365412]                 Выражение ←
      404[164394629]                   Результат ≡ Созданный приказ ∙ 65545[164369698] ←
   131079[164364317]     Список горячих клавиш ←
   131082[164364322]       Назначение клавиши ≡ SPACE ∙ 131080[1507329] ←
      103[164364646]         Команда ≡ USER 1 ∙ 102[57201] ←
 32505857[164364307]       Наследуемые назначения клавиш ←
